{
  "metadata": {
    "filename": "2dd32606_20250814_084714_381.pdf",
    "document_type": "research_paper",
    "title": "Two Molecular Models of Initial Left-Right Asymmetry Generation",
    "authors": [],
    "journal": null,
    "publication_year": null,
    "doi": null,
    "abstract": null,
    "extraction_confidence": "low",
    "extraction_timestamp": "2025-08-14T08:47:21.619826",
    "extraction_method": "basic_fallback",
    "pages_analyzed": 2
  },
  "chunks": [
    {
      "text": "Harvard Medical School, located at 200 Longwood Ave. in Boston, MA 02115, is the primary affiliation of the author.  Contact information includes phone number (617) 599-3231, fax (617) 432-7758, and email mlevin@husc.harvard.edu.  The listed keywords for this work are embryo, morphogenesis, axis, left-right, asymmetry, connexin-43, dynein, and laterality.",
      "section": "Harvard Medical School",
      "primary_topic": "Author Affiliation",
      "secondary_topics": [
        "contact information",
        "keywords",
        "address",
        "morphogenesis",
        "embryo",
        "asymmetry",
        "left-right axis",
        "connexin-43",
        "dynein"
      ],
      "chunk_summary": "This section provides the author's affiliation, contact information, and relevant keywords for the research.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Left-Right (LR) asymmetry is a fascinating problem in embryonic morphogenesis. Recently, a pathway of genes has been identified which is involved in LR patterning in vertebrates (1,2). Although this work characterizes the interactions of several asymmetrically-expressed genes, it remains unclear how such asymmetric expression is initially established.",
      "section": "[PAGE 2] Summary",
      "primary_topic": "LR Asymmetry",
      "secondary_topics": [
        "embryonic morphogenesis",
        "gene expression",
        "LR patterning",
        "vertebrates"
      ],
      "chunk_summary": "While genes involved in vertebrate LR patterning have been identified, the initial establishment of asymmetric gene expression remains unknown.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2"
    },
    {
      "text": "Two promising molecular candidates, dynein and connexin-43 (Cx43), may play a role in establishing LR asymmetry.  We present two models, supported by previous findings, hypothesizing that: (1) dynein asymmetrically localizes LR determinants in individual cells to establish cell-autonomous LR biasing, and (2) asymmetric activity of Cx43 gap junctions within key cells sets up electric potentials in multi-cellular fields, thus establishing large-scale LR asymmetry.",
      "section": "[PAGE 2] Summary",
      "primary_topic": "LR Asymmetry Mechanisms",
      "secondary_topics": [
        "dynein",
        "connexin-43",
        "gap junctions",
        "bioelectric potentials",
        "cell-autonomous asymmetry",
        "multi-cellular fields"
      ],
      "chunk_summary": "Two models propose that dynein and Cx43 contribute to LR asymmetry: dynein through cell-autonomous localization of LR determinants, and Cx43 through establishing bioelectric potentials across multi-cellular fields.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "2"
    },
    {
      "text": "Animal body plans exhibit diverse symmetries, including spherical, radial, chiral, bilateral, and pseudo-bilateral. While most vertebrates appear bilaterally symmetrical, internal organ placement often breaks this symmetry.  Symmetries are frequently broken during development, as seen in the chick blastoderm's transition from radial to bilateral symmetry, followed by pseudo-symmetry due to heart looping.  Conversely, sea urchins transition from bilateral/pseudo-bilateral larval symmetry to radial adult symmetry.  Axial patterning, the establishment of these symmetries, is crucial as it sets the stage for subsequent morphogenetic events.",
      "section": "[PAGE 3] Introduction",
      "primary_topic": "Symmetry in Morphogenesis",
      "secondary_topics": [
        "body plan",
        "bilateral symmetry",
        "radial symmetry",
        "embryogenesis",
        "axial patterning",
        "chick embryo",
        "sea urchin"
      ],
      "chunk_summary": "Animal body plans exhibit a variety of symmetries, which are often broken during development, with axial patterning being a fundamental process in embryogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "3"
    },
    {
      "text": "Left-right (LR) asymmetry, defined as a consistent difference between an animal's left and right sides, differs from other asymmetries.  Unlike dorso-ventral and antero-posterior axes, which can be defined by external factors like gravity and direction of motion, there's no external reference for LR asymmetry.  Intriguingly, all normal individuals of a species exhibit the same LR asymmetry, even though mirror-reversed individuals can be phenotypically normal.  This raises the question of why a consistent directionality exists, as generating asymmetry seems easier than biasing it.  The LR axis is thus unique and particularly interesting.",
      "section": "[PAGE 3] Introduction",
      "primary_topic": "Left-Right Asymmetry",
      "secondary_topics": [
        "situs inversus",
        "laterality",
        "axis formation",
        "developmental biology",
        "evolutionary biology"
      ],
      "chunk_summary": "Left-right asymmetry is unique because it lacks an external reference and yet is consistently directional within a species, raising questions about its developmental and evolutionary origins.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "3-4"
    },
    {
      "text": "Various situs anomalies, including dextrocardia, situs inversus, heterotaxia, and right/left isomerism, are documented in human teratology, often associated with syndromes like Kartagener's and Ivemark's.  Only situs inversus, a complete mirror-image reversal, is typically not associated with physiological problems.  Other anomalies, especially heterotaxia, can cause serious health issues.  Laterality defects are sometimes linked to twinning.  Mouse mutants like iv and inv mirror these human syndromes, exhibiting situs inversus phenotypes.  While the molecular mechanisms behind antero-posterior and dorso-ventral asymmetry are well-studied, the basis for LR asymmetry remains less understood.",
      "section": "[PAGE 3] Introduction",
      "primary_topic": "Situs Anomalies",
      "secondary_topics": [
        "dextrocardia",
        "heterotaxia",
        "isomerism",
        "Kartagener's syndrome",
        "Ivemark's syndrome",
        "mouse mutants",
        "genetics"
      ],
      "chunk_summary": "Human situs anomalies, including dextrocardia, heterotaxia, and isomerism, often lead to health problems, while situs inversus is generally benign; these conditions are mirrored in mouse mutants, and the molecular basis of LR asymmetry is less understood than other axes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4"
    },
    {
      "text": "Neville's work surveys various asymmetries, from well-known organ asymmetries to examples like flatfish eye migration and parasitic arthropods with side-specific habitation. However, the mechanisms determining the sidedness of these asymmetries remain largely unknown.  Previous research on LR asymmetry focused on snail chirality genetics, drugs affecting LR patterning, and mammalian mutants with LR asymmetry phenotypes.  Recent studies have identified a pathway of asymmetrically expressed genes in chick embryos that control heart and other organ situs. Despite this progress, the initial steps of LR determination are still unclear.",
      "section": "[PAGE 3] Introduction",
      "primary_topic": "Molecular Basis of LR Asymmetry",
      "secondary_topics": [
        "chirality",
        "drug effects",
        "mammalian mutants",
        "chick embryo",
        "gene expression",
        "heart development"
      ],
      "chunk_summary": "While previous research has explored various aspects of LR asymmetry, including snail chirality, drug effects, and mammalian mutants, the underlying mechanisms, particularly the initial steps, remain poorly understood, despite recent progress in identifying asymmetrically expressed genes in chick embryos.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "LR patterning can be conceptually divided into three phases: (1) cell(s) in the very early embryo must ascertain their own right vs. left sides, presumably by a model like that involving a tethered chiral molecule (13), and (through lineage relationships, migration, and cell-cell inductive interactions) this cell-autonomous",
      "section": "LR",
      "primary_topic": "LR Patterning",
      "secondary_topics": [
        "embryogenesis",
        "chirality",
        "cell polarity",
        "left-right asymmetry",
        "developmental biology",
        "cell signaling",
        "inductive interactions"
      ],
      "chunk_summary": "LR patterning in the early embryo involves establishing left-right asymmetry at the cellular level, potentially through mechanisms involving chiral molecules and cell-cell interactions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "LR information is converted into asymmetrical multi-cellular domains of expression; these asymmetrically-expressed genes regulate each other in sequential (and perhaps branched) pathways to establish and maintain asymmetric gene expression domains; and finally, the various organ primordia read this information and determine their situs. With the identification of a cascade of asymmetrically expressed genes which regulate each others' expression, a significant part of phase 2 has been uncovered. Likewise, it has become clear that this pathway controls the LR patterning of many aspects of laterality, and experiments are currently under-way to determine the mechanisms by which organs such as the heart respond to this information. Thus, significant progress is on the horizon for phase 3. However, what is conspicuously missing are clues to the most interesting part of this problem: how the LR axis is oriented with respect to the AP and DV axes in the first place, and how this orientation at the single-cell level is converted into asymmetry on the scale of the whole embryonic field.",
      "section": "LR",
      "primary_topic": "LR Patterning",
      "secondary_topics": [
        "asymmetric gene expression",
        "organ primordia",
        "situs",
        "laterality",
        "embryonic development"
      ],
      "chunk_summary": "This chunk describes the cascade of asymmetrically expressed genes that regulate each other to establish LR asymmetry and highlights the open question of how this asymmetry is initially oriented with respect to other body axes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The existence of isomerisms (where the body is symmetrical, consisting of either two normally-left sides or conversely, two right sides) and randomized asymmetry (i.e., 50% incidence of complete situs inversus) as two distinct genetic conditions suggests that normal LR asymmetry is accomplished in two dissociable steps: a random asymmetry is generated, which is then biased in the correct direction with respect to the other two axes. The pathway identified by Levin et al. most likely directs the second step, since right-sided misexpression of left-determining genes such as Shh or nodal results in heterotaxia, not true isomerism. Thus, there is still no molecular data on how (random) asymmetry is generated in the first place.",
      "section": "LR",
      "primary_topic": "Isomerisms",
      "secondary_topics": [
        "situs inversus",
        "heterotaxia",
        "Shh",
        "nodal",
        "random asymmetry",
        "genetic conditions"
      ],
      "chunk_summary": "This chunk discusses the existence of isomerisms and randomized asymmetry as distinct genetic conditions, suggesting a two-step process for establishing LR asymmetry and highlighting the lack of molecular data on the initial generation of asymmetry.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "We would like to sketch out some ideas regarding two of the only promising molecular candidates for the primary steps in LR patterning, dynein and connexin-43. While the models described in this paper are quite speculative, they illustrate the types of mechanisms which are very likely to play a role in these early events. The dynein model is designed to show how a chiral molecule could differentiate L from R within a single cell. The Cx43 model shows how, once a cell becomes LR asymmetric, this information could become transduced into multi-cellular domains of asymmetric gene expression. It should be noted that the two models are independent of each other and describe complementary phases in",
      "section": "LR",
      "primary_topic": "Molecular Candidates",
      "secondary_topics": [
        "dynein",
        "connexin-43",
        "chiral molecule",
        "cell communication",
        "LR asymmetry",
        "multi-cellular domains"
      ],
      "chunk_summary": "This chunk introduces dynein and connexin-43 as promising molecular candidates for the primary steps in LR patterning and outlines speculative models for their roles in establishing and transducing LR asymmetry.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "LR patterning.",
      "section": "LR",
      "primary_topic": "LR Patterning",
      "secondary_topics": [
        "left-right asymmetry",
        "embryogenesis",
        "developmental biology",
        "body plan",
        "laterality"
      ],
      "chunk_summary": "This section mentions LR patterning, a fundamental process in embryonic development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "The first model, based on the ideas of Brown and Wolpert (13), hypothesizes a cytoskeletal component, such as a centriole, which is chiral. It is oriented with respect to the AP and DV axes of the egg by means of other cytoskeletal filaments, and serves as a nucleation center for filaments or microtubules which run along the LR axis. Consistent with this model, tubulin was identified as one of the proteins modified in iv homozygotes relative to w.t. mice (14). The head-tail attractive feature of microtubule assembly (15) ensures that the chiral nature of the nucleating center is passed on as a directionality of the LR tracks. Interestingly, the mouse egg has no centriole (one forms anew after several cell divisions), so that defects in the origin of chirality would show up as zygotic (as in the mouse LR mutants, such as iv); in contrast, the maternal mode of inheritance of chirality in snails (16) may be explained by the fact that the snail egg's cytoskeletal components are formed by the mother.",
      "section": "[PAGE 5] A Specific chiral molecule model",
      "primary_topic": "Cytoskeletal Chirality",
      "secondary_topics": [
        "microtubules",
        "centriole",
        "chirality",
        "LR axis",
        "tubulin",
        "zygotic",
        "maternal inheritance"
      ],
      "chunk_summary": "A chiral cytoskeletal component, potentially a centriole, nucleates microtubules along the LR axis, passing on chirality; differences in centriole presence explain zygotic vs. maternal inheritance of chirality in mice and snails.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "The next step results in a microtubule motor, such as dynein, riding the LR tracks carrying mRNA or protein determinants, which become transported to one side of the cell. These determinants could become localized with cell division (which is possible in molluscs or even frogs), or this process could happen anew in each cell during various phases (which is most likely in the chick and mouse) followed by the kind of process discussed below for generating domains of LR gene expression.",
      "section": "[PAGE 5] A Specific chiral molecule model",
      "primary_topic": "Microtubule Transport",
      "secondary_topics": [
        "dynein",
        "mRNA",
        "protein determinants",
        "LR asymmetry",
        "cell division",
        "gene expression",
        "molluscs",
        "frogs",
        "chick",
        "mouse"
      ],
      "chunk_summary": "Microtubule motors transport determinants along the LR tracks, establishing asymmetry either during cell division or repeatedly in each cell, leading to LR gene expression domains.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "An excellent candidate for such a mechanism is dynein (17), a motor protein which serves to actively translocate sub-cellular cargo (18-20). There appear to be at least 13 axonemal (used in cilia and flagella), and 2 cytoplasmic (presumably involved in axonal transport, mitosis, etc.) dynein genes (reviewed in (21)). Despite the involvement of dynein proteins in many disparate events (such as ciliary function, vesicle transport in axons, mitosis, etc.), it is clear that certain dynein genes have very specific expression.",
      "section": "[PAGE 6] Evidence for a Dynein model",
      "primary_topic": "Dynein",
      "secondary_topics": [
        "motor protein",
        "axonal transport",
        "cilia",
        "flagella",
        "mitosis",
        "gene expression",
        "sub-cellular cargo"
      ],
      "chunk_summary": "Dynein, a motor protein involved in sub-cellular transport, is proposed as a candidate mechanism, with various dynein genes showing specific expression patterns despite the protein's involvement in diverse cellular processes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "6"
    },
    {
      "text": "For example, Dhc64c is expressed only in ovaries, testes, and very early embryos in Drosophila; furthermore Dhc64c is asymmetrically (though not LR) localized in the Drosophila oocyte (22-23). Thus, it may be expected that specific lesions in one of the many dynein genes can affect LR patterning without lethal effects on mitosis or organelle transport. There is compelling evidence that early AP and DV embryonic patterning is controlled in part by the cytoskeleton (24-25), and most importantly, disruption of the microtubule array in Xenopus by UV light causes 25% situs inversus (26).",
      "section": "[PAGE 6] Evidence for a Dynein model",
      "primary_topic": "Dynein and LR Patterning",
      "secondary_topics": [
        "Dhc64c",
        "Drosophila",
        "LR asymmetry",
        "mitosis",
        "organelle transport",
        "cytoskeleton",
        "microtubules",
        "situs inversus",
        "Xenopus"
      ],
      "chunk_summary": "Specific dynein gene lesions may impact left-right (LR) patterning without affecting other crucial processes like mitosis, and cytoskeletal disruption, particularly of microtubules, is linked to situs inversus.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "6"
    },
    {
      "text": "Under this model, the heterotaxia phenotype could result from a broken dynein motor which is unable to perform localization of determinants. This would allow the factor to homogeneously accumulate in both halves of a cell, resulting in double-R or double-L (depending on the nature of the determinant) compartments. As shown by Levin et al. (12), this leads to independent randomization of organ situs. Interestingly, human patients with heterotaxia as part of Kartagener's syndrome do show defects in dynein (27-29).",
      "section": "[PAGE 7] Predictions of this model",
      "primary_topic": "Heterotaxia",
      "secondary_topics": [
        "dynein",
        "organ situs",
        "Kartagener's syndrome",
        "determinant localization",
        "cell polarity"
      ],
      "chunk_summary": "Heterotaxia phenotypes may arise from dynein motor defects, leading to mislocalization of determinants and randomized organ situs, as observed in Kartagener's syndrome.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7"
    },
    {
      "text": "The inv mutant could result from a nucleation center that is either the opposite enantiomer of one with the proper chirality, or simply becomes oriented incorrectly. The former possibility is much less likely (since the complete reversal of such a complex structure would require several coordinated mutations); it is most likely that whatever binding site is used to tether it with respect to the DV and AP axes is altered. This would result in embryos which are normal except for the consistently incorrect situs (as is observed in inv mice, where nodal is expressed always on the incorrect side only (2)).",
      "section": "[PAGE 7] Predictions of this model",
      "primary_topic": "Inv mutant",
      "secondary_topics": [
        "nucleation center",
        "chirality",
        "DV axis",
        "AP axis",
        "nodal expression",
        "situs inversus"
      ],
      "chunk_summary": "The inv mutant likely results from incorrect orientation of the nucleation center, affecting the binding site along the DV and AP axes, leading to consistently incorrect situs.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7"
    },
    {
      "text": "The iv mutant may represent a nucleation structure that was not tethered at all. Thus, it would face in different directions (randomly) in different cells. Depending on stochastic events, this would result in a mosaic of domains of cells which were oriented properly, adjacent to cells which were not. This would be magnified by cell proliferation and lineage relationships and could thus easily account for the full spectrum of nodal expression patterns observed in the mutant mice (2), corresponding to normal situs, reversed situs, or double L or R sides.",
      "section": "[PAGE 7] Predictions of this model",
      "primary_topic": "Iv mutant",
      "secondary_topics": [
        "nucleation structure",
        "random orientation",
        "cell mosaicism",
        "nodal expression",
        "situs",
        "cell proliferation"
      ],
      "chunk_summary": "The iv mutant may have an untethered nucleation structure, leading to random cell orientation and a mosaic of normal and reversed situs, explaining the observed range of nodal expression patterns.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7"
    },
    {
      "text": "An alternative explanation for why dynein defects are associated with laterality disturbances has been proposed: that cilia directly influence the situs of the gut (27-30). This is unlikely because it has been shown that several kinds of asymmetries are present long before gut looping (1), and because some patients with heterotaxia do have normal cilia function (31-32).",
      "section": "[PAGE 8] An alternative explanation for why dynein defects are associated with laterality",
      "primary_topic": "Laterality defects",
      "secondary_topics": [
        "dynein",
        "cilia",
        "gut situs",
        "heterotaxia",
        "asymmetry"
      ],
      "chunk_summary": "The direct influence of cilia on gut situs as an explanation for dynein-related laterality defects is challenged due to pre-existing asymmetries before gut looping and the presence of normal cilia function in some heterotaxia patients.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "8"
    },
    {
      "text": "This may be a consequence of the fact that only cytoplasmic, not ciliary, dynein is important for this process.",
      "section": "[PAGE 8] An alternative explanation for why dynein defects are associated with laterality",
      "primary_topic": "Cytoplasmic dynein",
      "secondary_topics": [
        "dynein",
        "cilia",
        "laterality",
        "cytoplasm"
      ],
      "chunk_summary": "Cytoplasmic dynein, rather than ciliary dynein, is likely crucial for the process of laterality development.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": "8"
    },
    {
      "text": "Several approaches can be taken to test the dynein model. Determining the expression of the various dynein genes in early embryos is crucial, to guide misexpression experiments and to begin to address the question of how a defect in a basic cell function protein can have such a subtle phenotype. The question of whether cytoplasmic dynein or ciliary function is important for LR patterning can be addressed by specifically disabling cilia motion, by mechanisms such as Ni++ (33), halothane (34), or vanadate (35), which inhibits cilia but not organelle motion.",
      "section": "[PAGE 8] Future directions",
      "primary_topic": "Dynein model testing",
      "secondary_topics": [
        "dynein genes",
        "embryo development",
        "cilia function",
        "LR patterning",
        "misexpression experiments",
        "chemical inhibitors"
      ],
      "chunk_summary": "This chunk outlines approaches to test the dynein model, focusing on gene expression analysis, cilia function manipulation, and the role of dynein in left-right patterning.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "8"
    },
    {
      "text": "Finally, a direct test of the model can be made by overexpressing in Xenopus dominant negative versions of the appropriate dynein, consisting of the endogenous dynein cargo binding-domain alone, or fused to a kinesin motor domain (which moves in a direction opposite to that of dynein (36)). The resulting animals may be expected to exhibit LR phenotypes as the dominant negative dynein mis-localizes LR determinants.",
      "section": "[PAGE 8] Future directions",
      "primary_topic": "Dynein manipulation",
      "secondary_topics": [
        "Xenopus",
        "dominant negative dynein",
        "kinesin motor domain",
        "LR phenotypes",
        "LR determinants",
        "overexpression"
      ],
      "chunk_summary": "This chunk proposes a direct test of the dynein model by overexpressing dominant-negative dynein in Xenopus to observe potential left-right patterning phenotypes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "8"
    },
    {
      "text": "How cell-autonomous LR (left-right) information is transduced into cell fields remains a key question in developmental biology.  Understanding how individual cells' left-right identity influences the larger-scale organization of tissues and organs is crucial for comprehending developmental processes. This brief section title highlights a critical gap in our understanding of how localized information scales up to drive morphogenesis.",
      "section": "[PAGE 8] How cell-autonomous LR information is transduced into cell fields",
      "primary_topic": "LR asymmetry",
      "secondary_topics": [
        "cell autonomy",
        "cell fields",
        "morphogenesis",
        "left-right asymmetry",
        "developmental biology",
        "tissue organization"
      ],
      "chunk_summary": "The transduction of cell-autonomous left-right information into cell fields is a crucial but poorly understood aspect of developmental biology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "8"
    },
    {
      "text": "A condition known as isomerism is occasionally observed in human patients (5). This condition, sometimes called Ivemark syndrome, where the organism is bilaterally symmetric (polysplenia when two left sides are present, or asplenia when both are right sides (37)) is especially interesting because the known LR pathway provides no obvious clues as to how this might happen. For example, as shown by the Shh misexpression studies (12), producing bilateral nodal expression does not result in two morphologically identical left sides, but rather causes a heterotaxic phenotype where each organ decides its situs randomly. Isomerism is likely to shed clues on a mechanism quite different from that in which the genes and mutants discussed above are involved: the generation of LR asymmetry, as opposed to its biasing in an appropriate direction.",
      "section": "A",
      "primary_topic": "Isomerism",
      "secondary_topics": [
        "Ivemark syndrome",
        "LR asymmetry",
        "heterotaxy",
        "situs",
        "Shh",
        "nodal expression",
        "bilateral symmetry"
      ],
      "chunk_summary": "Human isomerism cases, unlike Shh misexpression-induced heterotaxy, suggest a distinct mechanism for generating LR asymmetry rather than simply biasing it.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The relevance of Cx43 Connexin-43 (Cx43) is a member of a family of at least 12 distinct genes, whose proteins make up the intercellular channels of gap junctions (reviewed in (38)). These channels are composed of hexamers of connexins and provide conduits for the transfer of ions and other small molecules (such as 2nd messengers) between cells. Gap junctions have been implicated in normal embryonic development (39-40) as well as in tumor growth (41-42), since reduced communication between cells stimulates tumor promotion.",
      "section": "A",
      "primary_topic": "Connexin-43",
      "secondary_topics": [
        "gap junctions",
        "intercellular communication",
        "ion channels",
        "second messengers",
        "embryonic development",
        "tumor growth"
      ],
      "chunk_summary": "Connexin-43 forms gap junctions, which facilitate intercellular communication via ion and small molecule transfer, and are implicated in development and tumor growth.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Most interestingly, it was found that human patients with isomerisms exhibit mutations in Cx43 (43). This suggests the exciting possibility that gap junctions also play a role in LR patterning. This is also suggested by the observation that",
      "section": "A",
      "primary_topic": "Cx43 and Isomerism",
      "secondary_topics": [
        "gap junctions",
        "LR patterning",
        "mutations",
        "human patients"
      ],
      "chunk_summary": "The discovery of Cx43 mutations in isomerism patients suggests a potential role for gap junctions in LR patterning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "LR asymmetric transfer of dye takes place between blastomeres in the early embryo, consistent with gap junctions providing an asymmetric partitioning of LR determinants. Transgenic mice that overproduce Cx43 have situs anomalies.  Expression of cx43.4 is missing in zebrafish ntl mutant embryos. Ntl embryos lack an organized notochord and have randomized heart situs. Although this has been attributed to an active role of notochord in LR compartmentalization, it is equally possible that cx43.4 is needed earlier for LR patterning. Gap junctions could potentially be involved in LR asymmetry by either providing an asymmetric path for the localization or distribution of a LR morphogen, or by generating an electric field which produces asymmetrical localization of charged molecules by electrophoresis.",
      "section": "LR",
      "primary_topic": "Gap Junctions",
      "secondary_topics": [
        "LR asymmetry",
        "dye transfer",
        "Cx43",
        "ntl mutant",
        "notochord",
        "morphogen",
        "electrophoresis"
      ],
      "chunk_summary": "Evidence suggests that gap junctions, particularly Cx43, play a role in establishing left-right asymmetry, potentially through morphogen transport or electrophoresis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The idea that endogenous electric fields specify large-scale embryonic pattern is quite old; this has been suggested to involve galvanotaxic control of cell migration, electrophoresis of morphogens, electromagnetic cell-cell signaling, etc. The distribution of communication channels suggests a model for LR asymmetry generation by gap junctions: that certain cells act as a battery, generating a potential difference due to asymmetric placement of ion pumps. Since the other cells appear to be connected by gap junctions, they represent an open circuit. Thus, charged LR determinant molecules would experience a net electromotive force and electrophorese to different halves of the embryo. A similar electrophoretic mechanism has been characterized in egg-ovary systems; likewise, endogenous electric fields have been involved in symmetry breaking in the Fucus embryo. The finding that applied electric fields can reverse LR asymmetry in amphibian embryos is consistent with this model, which represents one possibility by which cellular asymmetry becomes transformed into asymmetric fields of gene expression.",
      "section": "LR",
      "primary_topic": "Bioelectric Fields",
      "secondary_topics": [
        "LR asymmetry",
        "gap junctions",
        "ion pumps",
        "electrophoresis",
        "cell migration",
        "embryonic pattern",
        "Fucus embryo"
      ],
      "chunk_summary": "Endogenous electric fields, potentially generated by asymmetrically placed ion pumps and mediated by gap junctions, may drive LR asymmetry by electrophoresis of charged molecules.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The Cx43 knock-out mouse does not exactly recapitulate the human phenotype associated with Cx43 mutations: while a heart defect is observed, it is not a true situs abnormality but a problem with heart morphogenesis. This suggests that instead of simply a lack of Cx43 gap junctions, a more subtle mutation in Cx43 is responsible for isomerism, and that wild-type asymmetry may be based on a specific pattern of cell communication restrictions rather than simply open channels.  Research finds that 5 out of 6 unrelated patients had Ser364 mutated to a Pro, and suggest that this may interfere with serine phosphorylation which is known to affect Cx43 function.",
      "section": "LR",
      "primary_topic": "Cx43 Mutations",
      "secondary_topics": [
        "heart defects",
        "situs abnormality",
        "isomerism",
        "Ser364",
        "phosphorylation",
        "cell communication",
        "mouse model"
      ],
      "chunk_summary": "Cx43 knockout mice do not fully replicate human Cx43-related isomerism, suggesting that specific mutations, such as Ser364Pro, and their impact on phosphorylation and cell communication, are crucial for LR asymmetry.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Several directions need to be followed to elucidate the role of Cx43 in LR asymmetry. First, detailed expression patterns of various connexins (not just 43) in frogs and mice need to be ascertained. Second, mutants such as the Cx43-/- transgenic (57) and the Cx43 overexpression transgenic (mentioned in (43) as having randomized turning and heart looping) need to be examined for nodal expression (59). Third, whether or not the Ser364Pro mutation found in the human isomerism patients is directly responsible for their phenotype should be tested by producing a knock-in transgenic mouse (replacing the mouse's endogenous Cx43 sequence with the Ser364Pro mutant); besides answering that question, the resulting mice may turn out to be a good medical model for human laterality defects and their treatment.",
      "section": "[PAGE 11] Future Experiments",
      "primary_topic": "Connexin Function",
      "secondary_topics": [
        "Cx43",
        "transgenic mice",
        "LR asymmetry",
        "gene expression",
        "mutations",
        "nodal expression",
        "animal models"
      ],
      "chunk_summary": "This chunk outlines several experiments to investigate the role of Cx43 and other connexins in left-right asymmetry, including examining expression patterns, mutant phenotypes, and creating a knock-in mouse model.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "11"
    },
    {
      "text": "Fourth, since it is unclear whether LR asymmetry may arise from the restriction of some morphogens due to closed gap junction channels between particular cells, or conversely, from specific cell-cell signaling resulting from open gap junctions, the exact nature of communication needed for correct asymmetry needs to be determined by functional studies. Finally, our model of electrophoretically-based asymmetry can be directly tested by short-circuiting this proposed current, as recently done by Hotary and Robinson (60). We are currently pursuing several of these approaches.",
      "section": "[PAGE 11] Future Experiments",
      "primary_topic": "Bioelectric Asymmetry",
      "secondary_topics": [
        "gap junctions",
        "morphogens",
        "cell signaling",
        "LR asymmetry",
        "functional studies",
        "electrophoresis",
        "short-circuit"
      ],
      "chunk_summary": "This chunk proposes investigating the role of gap junctions and bioelectric currents in LR asymmetry through functional studies and short-circuiting experiments.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "11"
    },
    {
      "text": "An understanding of these processes would have important implications for research in embryonic development, both in terms of basic questions of LR asymmetry, as well as a better appreciation of the role of endogenous electric fields (51,61-64) and the cytoskeleton in embryonic morphogenesis. The models described here represent specific, testable hypotheses which can serve to guide experiments directed toward that end.",
      "section": "[PAGE 11] Conclusion",
      "primary_topic": "Embryonic Development",
      "secondary_topics": [
        "LR asymmetry",
        "endogenous electric fields",
        "cytoskeleton",
        "morphogenesis",
        "testable hypotheses",
        "embryonic development"
      ],
      "chunk_summary": "Understanding the role of bioelectric fields and the cytoskeleton in embryonic development, particularly LR asymmetry, has significant implications for future research, and the presented models offer testable hypotheses to guide these investigations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "11"
    },
    {
      "text": "Levin M, Johnson R, Stern C, Kuehn M, Tabin C. A molecular pathway determining left-right asymmetry in chick embryogenesis. Cell 1995; 82: 1-20",
      "section": "1. Levin M, Johnson R, Stern C, Kuehn M, Tabin C. A molecular pathway deter-",
      "primary_topic": "Left-Right Asymmetry",
      "secondary_topics": [
        "chick embryogenesis",
        "molecular pathway",
        "asymmetry",
        "development",
        "embryo",
        "cell"
      ],
      "chunk_summary": "This citation refers to a study that identified a molecular pathway involved in establishing left-right asymmetry during chick embryo development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Lowe L, Supp DM, Sampath K, Yokoyama T, Wright CVE, Potter and SS, Overbeek P, Kuehn MR. Conserved left-right asymmetry of nodal expression and alterations in murine situs inversus. Nature 1996; 381: 158-161",
      "section": "2. Lowe L, Supp DM, Sampath K, Yokoyama T, Wright CVE, Potter and SS,",
      "primary_topic": "Situs inversus",
      "secondary_topics": [
        "left-right asymmetry",
        "nodal expression",
        "murine",
        "genetics",
        "development",
        "embryogenesis",
        "laterality"
      ],
      "chunk_summary": "This citation describes research on the conserved left-right asymmetry of nodal expression and its alterations in murine situs inversus.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "158-161"
    },
    {
      "text": "Eyal-Giladi H, Kochav S. From cleavage to primitive streak formation, Dev Biol 1976; 49: 321-337",
      "section": "3. Eyal-Giladi H, Kochav S. From cleavage to primitive streak formation, Dev",
      "primary_topic": "Primitive Streak",
      "secondary_topics": [
        "cleavage",
        "gastrulation",
        "embryogenesis",
        "developmental biology",
        "chick embryo",
        "primitive streak formation"
      ],
      "chunk_summary": "This citation refers to a study by Eyal-Giladi and Kochav on primitive streak formation in chick embryos.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Burn J. Disturbance of morphological laterality in humans. Ciba Foundation Symposium 1991; 162: 282-96",
      "section": "4. Burn J. Disturbance of morphological laterality in humans. Ciba Foundation",
      "primary_topic": "Morphological Laterality",
      "secondary_topics": [
        "laterality",
        "human morphology",
        "developmental biology",
        "asymmetry",
        "Ciba Foundation Symposium"
      ],
      "chunk_summary": "This citation refers to Burn J.'s work on disturbances in morphological laterality in humans, presented at the Ciba Foundation Symposium.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Winer-Muram HT. Adult presentation of heterotaxic syndromes and related complexes. J Thoracic Imaging 1995; 10: 43-57",
      "section": "5. Winer-Muram HT. Adult presentation of heterotaxic syndromes and related",
      "primary_topic": "Heterotaxic Syndromes",
      "secondary_topics": [
        "heterotaxy",
        "adult presentation",
        "thoracic imaging",
        "syndromes",
        "complexes"
      ],
      "chunk_summary": "This citation refers to Winer-Muram's work on the presentation of heterotaxic syndromes in adults.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Levin M, Pagan S, Roberts DJ, Holmes LB, Kuehn M, Tabin C. Left/Right-Determining Signals and Symmetry Reversal in Twins. Nature 1996, in press",
      "section": "6. Levin M, Pagan S, Roberts DJ, Holmes LB, Kuehn M, Tabin C. Left/Right-",
      "primary_topic": "Symmetry Reversal",
      "secondary_topics": [
        "left-right asymmetry",
        "twins",
        "developmental biology",
        "embryogenesis",
        "chirality",
        "symmetry breaking"
      ],
      "chunk_summary": "This citation refers to a study on the signals determining left-right asymmetry and symmetry reversal in twins.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Nascone and Mercola (1996, in press) demonstrated that Spemann's organizer plays a role in establishing left-right asymmetry.",
      "section": "7. Nascone N, Mercola M. Spemann's organizer can specify left-right asymmetry.",
      "primary_topic": "Left-right asymmetry",
      "secondary_topics": [
        "Spemann's organizer",
        "embryogenesis",
        "developmental biology",
        "asymmetry",
        "body plan"
      ],
      "chunk_summary": "Spemann's organizer influences the development of left-right asymmetry in the embryo.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Hummel KP, Chapman DB. Visceral inversion and associated anomalies in the mouse. J Heredity 1959; 50: 9-23",
      "section": "8. Hummel KP, Chapman DB. Visceral inversion and associated anomalies in the",
      "primary_topic": "Visceral Inversion",
      "secondary_topics": [
        "mouse model",
        "anomalies",
        "genetics",
        "development",
        "left-right asymmetry",
        "organogenesis",
        "situs inversus"
      ],
      "chunk_summary": "This citation refers to a study by Hummel and Chapman on visceral inversion and associated anomalies in mice.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Yokoyama T, Copeland NG, Jenkins NA, Montgomery CA, Elder FF, and Overbeek PA. Reversal of left-right asymmetry: a situs inversus mutation. Science 1993; 260: 679-682",
      "section": "9. Yokoyama T, Copeland NG, Jenkins NA, Montgomery CA, Elder FF, and",
      "primary_topic": "Situs Inversus",
      "secondary_topics": [
        "left-right asymmetry",
        "mutation",
        "genetics",
        "developmental biology",
        "embryogenesis",
        "organ placement"
      ],
      "chunk_summary": "This citation references a study by Yokoyama et al. that identified a mutation causing situs inversus, a reversal of left-right organ asymmetry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Hunt and Krumlauf (1992) reviewed the role of Hox genes in positional specification during vertebrate embryonic development.  Their work in the Annual Review of Cell Biology discusses how combinations of Hox genes, termed \"Hox codes,\" contribute to the unique identities of different regions along the embryonic axes.",
      "section": "10. Hunt P, Krumlauf R. Hox codes and positional specification in vertebrate em-",
      "primary_topic": "Hox genes",
      "secondary_topics": [
        "positional information",
        "embryonic development",
        "vertebrate",
        "Hox code",
        "gene expression",
        "axial patterning",
        "developmental biology"
      ],
      "chunk_summary": "This paper reviews the function of Hox genes and their combinatorial codes in determining positional identity during vertebrate embryonic development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Neville AC. Animal asymmetry. London: Edward Arnold, 1976.",
      "section": "11. Neville AC. Animal asymmetry. London: Edward Arnold, 1976",
      "primary_topic": "Animal Asymmetry",
      "secondary_topics": [
        "asymmetry",
        "animal development",
        "morphology",
        "body plan",
        "left-right asymmetry",
        "evolutionary biology"
      ],
      "chunk_summary": "This citation refers to Neville's 1976 book on animal asymmetry, published by Edward Arnold in London.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Levin M, Roberts DJ, Holmes LB, Tabin C. Activin and Nodal determine the situs of asymmetric organs independently. Development 1996; submitted",
      "section": "12. Levin M, Roberts DJ, Holmes LB, Tabin C. Activin and Nodal determine the",
      "primary_topic": "Organ Asymmetry",
      "secondary_topics": [
        "Activin",
        "Nodal",
        "situs",
        "asymmetric organs",
        "development",
        "embryogenesis",
        "left-right asymmetry"
      ],
      "chunk_summary": "This citation refers to a study by Levin et al. (1996, submitted) investigating the role of Activin and Nodal in determining the left-right asymmetry of organs during development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Brown N., Wolpert L. The development of handedness in left/right asymmetry. Development 1990; 109: 1-9",
      "section": "13. Brown N., Wolpert L. The development of handedness in left/right asymme-",
      "primary_topic": "Handedness Development",
      "secondary_topics": [
        "left/right asymmetry",
        "development",
        "handedness",
        "embryogenesis",
        "chirality"
      ],
      "chunk_summary": "This reference cites a study by Brown and Wolpert on the development of handedness in left/right asymmetry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    }
  ],
  "processed_at": "2025-08-14T09:12:55.046698",
  "chunk_count": 46,
  "processing_method": "document_splitting"
}