{
  "metadata": {
    "document_type": "research_paper",
    "title": "Multi-scale Chimerism: An experimental window on the algorithms of anatomical control",
    "authors": [
      "Vasilios Nanos",
      "Michael Levin"
    ],
    "journal": "Cells & Development",
    "publication_year": 2021,
    "doi": "10.1016/j.cdev.2021.205764",
    "abstract": "Despite the immense progress in genetics and cell biology, major knowledge gaps remain with respect to precise control and understanding of the morphogenetic algorithms that build multicellular organisms. Genomes dictate the building blocks but not the final form; thus, understanding how specific architectures arise requires a focus on standard models systems that will reveal invariant, species-specific anatomical knowledge and form control. This review analyzes the experimental evidence from the field of regenerative biology, with a focus on the study of the globally exhibited robust emergent properties of cells in multicellular systems. The existing data and future advances in this field will impact not only the understanding of organismal development but also regeneration, disease, and aging, as well as the design of strategies for tissue regeneration and other important phenomena; multi-scale chimera experiments using conceptual and experimental tools with which to analyze the emergent properties of cells in the context of the body plan. This approach is generating new insights into the geometry and functioning of body data from a powerful underlying DNA cell, cell cooperation, organ to organ communication, and the bioelectric properties of cells. We suggest that a deeper understanding of the evolutionary mechanisms that shaped the design of strategies for system-level outcomes in regenerative medicine and also the design of strategies for system-level outcomes in regenerative biology",
    "extraction_confidence": "high",
    "filename": "cd4a7476_20250814_131547_821.pdf",
    "extraction_timestamp": "2025-08-14T13:15:58.780251",
    "extraction_method": "gemini_1.5_flash",
    "pages_analyzed": 2,
    "affiliations": [
      "Department of Biology",
      "Allen Discovery Center at Tufts University",
      "Tufts University",
      "organisms often show collective\nbehaviors resulting in synchronized movement and migration patterns\nas observed in fish school",
      "Center at Tufts University"
    ],
    "page_range": "28-30",
    "text_enriched": true,
    "enrichment_method": "text_analysis",
    "enrichment_timestamp": "2025-08-14T13:26:58.263311"
  },
  "chunks": [
    {
      "text": "Multi-scale Chimerism: An experimental window on the algorithms of anatomical control. This brief section title introduces the concept of multi-scale chimerism as a research approach to understanding the algorithms governing anatomical development and control.  It suggests that by studying chimeras, organisms composed of cells from different individuals or species, researchers can gain insights into how anatomical structures are formed and regulated.",
      "section": "[PAGE 1] Multi-scale Chimerism",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "anatomical control",
        "developmental biology",
        "experimental approach",
        "multi-scale",
        "algorithms"
      ],
      "chunk_summary": "Multi-scale chimerism is presented as an experimental approach to investigate the algorithms of anatomical control.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "1"
    },
    {
      "text": "Vasilios Nanos and Michael Levin are listed as authors.  This likely indicates a collaborative work where both individuals contributed to the research presented in the paper.",
      "section": "Vasilios Nanos",
      "primary_topic": "Authorship",
      "secondary_topics": [
        "collaboration",
        "authors",
        "contribution",
        "research"
      ],
      "chunk_summary": "Vasilios Nanos and Michael Levin are listed as authors, suggesting a collaborative research effort.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "The Allen Discovery Center at Tufts University, located in Medford, MA, USA, serves as the primary research hub for this work.",
      "section": "Allen Discovery Center at Tufts University",
      "primary_topic": "Research Hub",
      "secondary_topics": [
        "Allen Discovery Center",
        "Tufts University",
        "Medford",
        "Massachusetts",
        "research location"
      ],
      "chunk_summary": "The Allen Discovery Center at Tufts University in Medford, MA, USA, is the main research site for this study.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Department of Biology, Tufts University, Medford, MA, USA",
      "section": "Department of Biology",
      "primary_topic": "Affiliation",
      "secondary_topics": [
        "Tufts University",
        "Medford",
        "Massachusetts",
        "USA",
        "Department of Biology",
        "Institution",
        "Location"
      ],
      "chunk_summary": "This section states the author's affiliation with the Department of Biology at Tufts University in Medford, Massachusetts, USA.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Please process this section and return the semantic chunks as specified above.",
      "section": "[PAGE 1] ABSTRACT",
      "primary_topic": "Instructions",
      "secondary_topics": [
        "semantic chunks",
        "JSON",
        "processing"
      ],
      "chunk_summary": "This abstract contains instructions for processing the text into semantic chunks.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "1"
    },
    {
      "text": "Despite the immense progress in genetics and cell biology, major knowledge gaps remain with respect to prediction and control of the global morphologies that will result from the cooperation of cells with known genomes. The understanding of cooperativity, competition, and synergy across diverse biological scales has been obscured by a focus on standard model systems that exhibit invariant species-specific anatomies. Morphogenesis of chimeric biological material is an especially instructive window on the control of biological growth and form because it emphasizes the need for prediction without reliance on familiar, standard outcomes.",
      "section": "Despite the immense progress in genetics and cell biology",
      "primary_topic": "Morphogenesis",
      "secondary_topics": [
        "chimerism",
        "model systems",
        "biological scales",
        "growth and form",
        "prediction"
      ],
      "chunk_summary": "Current understanding of morphogenesis is limited by a focus on standard model systems, while chimeric systems offer a valuable opportunity to study growth and form without relying on predefined outcomes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "1"
    },
    {
      "text": "Here, we review an important and fascinating body of data from experiments utilizing DNA transfer, cell transplantation, organ grafting, and parabiosis. We suggest that these are all instances (at different levels of organization) of one general phenomenon: chimerism. Multi-scale chimeras are a powerful conceptual and experimental tool with which to probe the mapping between properties of components and large-scale anatomy: the laws of morphogenesis.",
      "section": "Despite the immense progress in genetics and cell biology",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "DNA transfer",
        "cell transplantation",
        "organ grafting",
        "parabiosis",
        "multi-scale",
        "morphogenesis"
      ],
      "chunk_summary": "Chimerism, encompassing various experimental approaches like DNA transfer and organ grafting, provides a powerful tool for investigating the relationship between component properties and large-scale anatomy.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "1"
    },
    {
      "text": "The existing data and future advances in this field will impact not only the understanding of cooperation and the evolution of body forms, but also the design of strategies for system-level outcomes in regenerative medicine and swarm robotics.",
      "section": "Despite the immense progress in genetics and cell biology",
      "primary_topic": "Future Applications",
      "secondary_topics": [
        "regenerative medicine",
        "swarm robotics",
        "cooperation",
        "evolution",
        "body forms"
      ],
      "chunk_summary": "Research on chimerism will contribute to understanding cooperation, evolution, and the development of strategies for regenerative medicine and swarm robotics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "1"
    },
    {
      "text": "The need to predict and control large-scale structure of various complex systems given knowledge of their sub-components is a central problem spanning numerous disciplines (Anderson, 1972). Developmental biology is a paradigmatic example, since complex anatomy emerges from the parallel activity of numerous complex subunits which have distinct form and function at many scales and levels of organization (Furusawa and Kaneko, 1998; Varenne et al., 2015).",
      "section": "The need to predict and control large",
      "primary_topic": "Complex Systems",
      "secondary_topics": [
        "predictive modeling",
        "control theory",
        "emergent properties",
        "multi-scale modeling",
        "developmental biology",
        "systems biology"
      ],
      "chunk_summary": "Predicting and controlling the large-scale structure of complex systems from their sub-components is a crucial interdisciplinary problem, exemplified by developmental biology where complex anatomy arises from the interaction of numerous subunits.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Modular decomposition and recombination is a key strategy in engineering; here, we review a body of experimental data that are invaluable fodder for the search for the meso-scale laws of morphogenesis.",
      "section": "The need to predict and control large",
      "primary_topic": "Morphogenesis",
      "secondary_topics": [
        "modular design",
        "biological design principles",
        "meso-scale",
        "experimental data",
        "developmental biology",
        "tissue engineering"
      ],
      "chunk_summary": "Modular design principles from engineering, combined with experimental data, can inform the search for meso-scale laws governing morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Genomics has made great strides in identifying information encoding the cellular hardware of cells, but it is still not possible to say much about the overall shape of an organism or of its organs from knowing its genomic sequence or the properties of its cells (other than by comparison with molecular data from an organism whose anatomy we already know). Thus, an exciting frontier of research involves understanding the mapping between the properties of subunits to body-scale anatomy in a way that enables prediction and control of system-level outcomes. This is important not only for evolutionary developmental biology, but also for solving the inverse problem: how to set or re-set the properties of low-level subunits (e.g., by editing genomic sequence in cells) to achieve a desired system-level outcome (e.g., by inducing growth of a correct human limb or produce a bespoke synthetic living machine with any specific morphology (Kamm et al., 2018; Lobo et al., 2014)).",
      "section": "Genomics has made great strides in identifying information encoding the cellular hardware of cells",
      "primary_topic": "Predictive Morphogenesis",
      "secondary_topics": [
        "genomics",
        "anatomy",
        "system-level outcomes",
        "evolutionary developmental biology",
        "synthetic bioengineering",
        "regenerative medicine"
      ],
      "chunk_summary": "While genomics has advanced, predicting organismal shape from genetic information remains challenging, driving research into mapping subunit properties to body-scale anatomy for prediction and control of system-level outcomes, crucial for both evolutionary biology and bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Transformative progress in regenerative medicine and synthetic bioengineering depends on being able to determine what cell- and molecular-level stimuli would induce desired large-scale changes in organ or whole body structure. The major opportunity to improve fundamental understanding and bioengineering capabilities is the discovery of rules determining large-scale structure and function given knowledge of the components and their microenvironmental boundary conditions. Understanding the reliable emergence of specific forms from competent subunits such as cells will require frameworks describing what will happen in systems consisting of components that on their own lead to distinct emergent outcomes.",
      "section": "Genomics has made great strides in identifying information encoding the cellular hardware of cells",
      "primary_topic": "Bioengineering and Morphogenesis",
      "secondary_topics": [
        "regenerative medicine",
        "synthetic bioengineering",
        "cell-level stimuli",
        "large-scale structure",
        "microenvironmental boundary conditions",
        "emergent outcomes"
      ],
      "chunk_summary": "Advancements in regenerative medicine and synthetic bioengineering rely on understanding how cell-level stimuli induce large-scale structural changes, requiring the discovery of rules governing structure and function based on component properties and microenvironmental conditions to understand emergent outcomes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Most work in molecular development takes place in standard model systems in their normal environment and configuration, such as zebrafish or mouse, in which a genome reliably gives rise to (and is widely thought to explain) a species-specific morphology. This can occur even despite drastic perturbations. For example, embryos can recover from removal of large amounts of body mass (Cooke, 1979, 1981), and tails transplanted onto flanks of salamanders remodel into limbs (Farinella-Ferruzza, 1956a). Regenerative animals, such as axolotls, repair after amputation damage of limbs and eyes - the cells rapidly proliferate and migrate, stopping when the precisely correct structure of the target morphology is complete (Maden, 2008).",
      "section": "Most work in molecular development takes place in standard model systems in their normal environment and configuration",
      "primary_topic": "Developmental Robustness",
      "secondary_topics": [
        "model organisms",
        "morphology",
        "regeneration",
        "embryonic development",
        "perturbation",
        "axolotl",
        "salamander"
      ],
      "chunk_summary": "Standard model organisms exhibit robust development, capable of recovering from significant perturbations and regenerating lost tissues, highlighting the inherent stability of species-specific morphology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Tadpoles with abnormal faces rearrange their craniofacial tissues until a correct frog face is made (Vandenberg et al., 2012). Such observations suggest that default anatomical outcomes are extremely robust (reviewed in (Pezzulo and Levin, 2016)). However, robustness is only one side of the coin with respect to the deep questions of the emergence of large-scale anatomy from cellular components (Levin et al., 2018); the other important aspect is plasticity and ability to produce coherent outcomes in novel circumstances, which haven't been previously \"tested\" in the course of evolution.",
      "section": "Most work in molecular development takes place in standard model systems in their normal environment and configuration",
      "primary_topic": "Developmental Plasticity",
      "secondary_topics": [
        "craniofacial development",
        "robustness",
        "plasticity",
        "anatomical outcomes",
        "evolution",
        "cellular components"
      ],
      "chunk_summary": "While developmental robustness is crucial, developmental plasticity is equally important, enabling organisms to adapt and generate functional structures in novel environments not encountered during evolution.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Experiments in synthetic bioengineering of wild-type cells are beginning to reveal novel functional forms that can emerge from cellular activity without genomic editing (reviewed in (Ebrahimkhani and Levin, 2021; Kamm et al., 2018)). Moreover, techniques such as specific and brief perturbation of bioelectrical circuits (Durant et al., 2017) can create permanently altered morphologies such as lines of 2-headed flatworms that regenerate to the new body-plan in future rounds of amputation (without any further manipulation or transgenes).",
      "section": "[PAGE 2] Experiments in synthetic bioengineering of wild-type cells are beginning to reveal novel functional forms that can emerge from cellular activity without genomic editing (reviewed in (Ebrahimkhani and Levin, 2021; Kamm et al., 2018)). Moreover, techniques such as specific and brief perturbation of bioelectrical circuits (Durant et al., 2017) can create permanently altered morphologies such as lines of 2-headed flatworms that regenerate to the new body-plan in future rounds of amputation (without any further manipulation or transgenes). Such deviations from genomic-default outcomes underscore the need to understand how form and function are controlled in novel settings, when the starting state and microenvironmental signals are altered. Pushing outside the standard events of single-genome embryogenesis in its typical milieu offers the opportunity to understand the algorithms that guide the changes and stabilization of form (Couzin, 2009; Goldenfeld and Woese, 2011).",
      "primary_topic": "Synthetic Bioengineering",
      "secondary_topics": [
        "genomic editing",
        "bioelectrical circuits",
        "morphologies",
        "regeneration",
        "flatworms",
        "transgenes"
      ],
      "chunk_summary": "Synthetic bioengineering experiments, including bioelectrical circuit perturbation, reveal novel functional forms and altered morphologies without genomic editing.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2"
    },
    {
      "text": "Such deviations from genomic-default outcomes underscore the need to understand how form and function are controlled in novel settings, when the starting state and microenvironmental signals are altered. Pushing outside the standard events of single-genome embryogenesis in its typical milieu offers the opportunity to understand the algorithms that guide the changes and stabilization of form (Couzin, 2009; Goldenfeld and Woese, 2011).",
      "section": "[PAGE 2] Experiments in synthetic bioengineering of wild-type cells are beginning to reveal novel functional forms that can emerge from cellular activity without genomic editing (reviewed in (Ebrahimkhani and Levin, 2021; Kamm et al., 2018)). Moreover, techniques such as specific and brief perturbation of bioelectrical circuits (Durant et al., 2017) can create permanently altered morphologies such as lines of 2-headed flatworms that regenerate to the new body-plan in future rounds of amputation (without any further manipulation or transgenes). Such deviations from genomic-default outcomes underscore the need to understand how form and function are controlled in novel settings, when the starting state and microenvironmental signals are altered. Pushing outside the standard events of single-genome embryogenesis in its typical milieu offers the opportunity to understand the algorithms that guide the changes and stabilization of form (Couzin, 2009; Goldenfeld and Woese, 2011).",
      "primary_topic": "Morphological Control",
      "secondary_topics": [
        "form and function",
        "microenvironmental signals",
        "embryogenesis",
        "algorithms",
        "developmental plasticity",
        "morphogenesis"
      ],
      "chunk_summary": "Deviations from typical genomic outcomes highlight the need to understand how form and function are controlled in altered settings, prompting investigation into the algorithms guiding morphological change and stabilization.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2"
    },
    {
      "text": "How exactly do cellular collectives determine what shapes they will make, and when morphogenesis and active remodeling will stop? The considerable knowledge and capability gap between relying on a familiar anatomy vs. being able to understand the rules and predicting its emergence ab initio is clearly illustrated by the following thought experiment (Fig. 1). Normally, the fragments of round-headed planarian species regenerate flatworms with round heads and stop when they are complete, while fragments of triangle-headed planarian species likewise keep growing and remodeling until flatworms with the normal triangular heads result. What will happen if the neoblasts of one species are mixed into the body of the other – what head shape will result? Will one type be dominant? Will an intermediate shape stabilize? Or will remodeling never cease because neither set of neoblasts is satisfied with the head shape?",
      "section": "How exactly do cellular collectives determine what shapes they will make",
      "primary_topic": "Morphogenesis Regulation",
      "secondary_topics": [
        "planarian regeneration",
        "head shape",
        "neoblasts",
        "cell collectives",
        "target morphology",
        "anatomical homeostasis"
      ],
      "chunk_summary": "This chunk introduces the challenge of understanding how cellular collectives determine target morphology during regeneration, using planarian head shape as a model system.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Despite the numerous high-resolution studies of molecular pathways guiding stem cell differentiation, the field has no models that make a prediction about this scenario. This is because we still lack a formalism for quantitatively modeling the process by which cellular collectives recognize deviations from normal and make the \"stop\" decision when the error between current morphology and target morphology is small enough (Harris, 2018; Pezzulo and Levin, 2015). A critical aspect of this problem is that the remodeling and stop decisions are made based on large-scale anatomical criteria (length of limbs, distribution of craniofacial components, etc.) - at levels of organization higher than genomes or cells; thus, these are in effect actions of a swarm agent, consisting of numerous parts that work together toward a large-scale stable outcome.",
      "section": "How exactly do cellular collectives determine what shapes they will make",
      "primary_topic": "Quantitative Modeling",
      "secondary_topics": [
        "target morphology",
        "anatomical criteria",
        "swarm intelligence",
        "cell collectives",
        "computational modeling",
        "morphogenesis"
      ],
      "chunk_summary": "This chunk highlights the need for quantitative models to understand how cellular collectives make decisions about morphology based on large-scale anatomical criteria, emphasizing the concept of a 'swarm agent'.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In addition to understanding the emergence of shape and anatomical homeostasis toward specific anatomies, such recombination experiments highlight important commonalities between morphogenesis and parallel problems in swarm cognition and group decision-making (Couzin, 2007; Pezzulo and Levin, 2015; Sole et al., 2016).",
      "section": "How exactly do cellular collectives determine what shapes they will make",
      "primary_topic": "Swarm Cognition",
      "secondary_topics": [
        "morphogenesis",
        "anatomical homeostasis",
        "swarm intelligence",
        "group decision-making",
        "cell collectives"
      ],
      "chunk_summary": "This chunk connects morphogenesis to swarm cognition and group decision-making, suggesting parallels between these fields.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "The ubiquitous reliability of stereotypical, default embryogenesis emphasizes a view of hardwired species-specific information within genomes and suggests that predictive control of form and function should be within reach. It tends to obscure surprising, novel phenomena and the deep opportunities for improved rational control, which are only observed when biological systems are confronted with truly novel circumstances or configurations (Ebrahimkhani and Levin, 2021; Kriegman et al., 2021).",
      "section": "[PAGE 3] The ubiquitous reliability of stereotypical, default embryogenesis emphasizes a view of hardwired species-specific information within genomes and suggests that predictive control of form and function should be within reach. It tends to obscure surprising, novel phenomena and the deep opportunities for improved rational control, which are only observed when biological systems are confronted with truly novel circumstances or configurations (Ebrahimkhani and Levin, 2021; Kriegman et al., 2021). Here, we survey natural and experimental recombinations of living components (chimeras) at different levels of organization, as a powerful tool for driving a deeper understanding of interoperability, cooperativity, emergence, and control of collective behavior in morphogenesis. We review fascinating examples of transfer of material and information between diverse biological sources, highlighting the central concept of chimerism which can occur at the molecular, cellular, tissue, organ, and even organism and population scales (Box 1).",
      "primary_topic": "Embryogenesis limitations",
      "secondary_topics": [
        "predictive control",
        "novel phenomena",
        "genome",
        "biological systems",
        "development"
      ],
      "chunk_summary": "While stereotypical embryogenesis suggests predictable control of form and function, it overlooks novel phenomena observable under new circumstances.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "3"
    },
    {
      "text": "Here, we survey natural and experimental recombinations of living components (chimeras) at different levels of organization, as a powerful tool for driving a deeper understanding of interoperability, cooperativity, emergence, and control of collective behavior in morphogenesis. We review fascinating examples of transfer of material and information between diverse biological sources, highlighting the central concept of chimerism which can occur at the molecular, cellular, tissue, organ, and even organism and population scales (Box 1).",
      "section": "[PAGE 3] The ubiquitous reliability of stereotypical, default embryogenesis emphasizes a view of hardwired species-specific information within genomes and suggests that predictive control of form and function should be within reach. It tends to obscure surprising, novel phenomena and the deep opportunities for improved rational control, which are only observed when biological systems are confronted with truly novel circumstances or configurations (Ebrahimkhani and Levin, 2021; Kriegman et al., 2021). Here, we survey natural and experimental recombinations of living components (chimeras) at different levels of organization, as a powerful tool for driving a deeper understanding of interoperability, cooperativity, emergence, and control of collective behavior in morphogenesis. We review fascinating examples of transfer of material and information between diverse biological sources, highlighting the central concept of chimerism which can occur at the molecular, cellular, tissue, organ, and even organism and population scales (Box 1).",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "morphogenesis",
        "interoperability",
        "cooperativity",
        "emergence",
        "collective behavior",
        "material transfer",
        "information transfer",
        "biological sources"
      ],
      "chunk_summary": "Chimeras, formed by combining living components, are explored as a tool to understand interoperability, cooperativity, and emergence in morphogenesis across multiple scales.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "3"
    },
    {
      "text": "Many of these experiments were conducted at times when modern molecular biology, mathematical tools of emergence and complexity science, and computer modeling platforms, necessary for conclusive interpretations of the experimental outcomes, were still missing. Their value lies not in offering a complete answer but in showing what is possible; unconventional assays demonstrating interoperability and viability suggest new approaches for developmental biology and bioengineering and reveal new scenarios where our ability to predict outcomes is lacking. We hope to reinvigorate interest in chimerism so that modern approaches can be brought to bear to develop our understanding of the mapping of the properties of subunits toward large-scale outcomes.",
      "section": "Many of these experiments were conducted at times when modern molecular biology",
      "primary_topic": "Chimerism Experiments",
      "secondary_topics": [
        "molecular biology",
        "complexity science",
        "computer modeling",
        "developmental biology",
        "bioengineering",
        "interoperability",
        "viability"
      ],
      "chunk_summary": "Early chimerism experiments, while lacking modern tools, demonstrated the potential of unconventional approaches and highlighted the need for better predictive models in developmental biology and bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Furthermore, we discuss a number of chimeric systems that demonstrate functional rather than morphological chimerism. We propose a kind of symmetry that links many diverse biological phenomena, suggesting chimerism as an invariant that ties together a number of disparate approaches at different levels of organization that are not often discussed together in terms of their deep commonalities. This leads to new perspectives on classic problems such as cancer, aging, and genetic heterogeneity as instances of a more general phenomenon – chimerism.",
      "section": "Many of these experiments were conducted at times when modern molecular biology",
      "primary_topic": "Functional Chimerism",
      "secondary_topics": [
        "morphological chimerism",
        "cancer",
        "aging",
        "genetic heterogeneity",
        "biological phenomena",
        "symmetry"
      ],
      "chunk_summary": "Functional chimerism, distinct from morphological chimerism, offers a unifying perspective on diverse biological phenomena, including cancer, aging, and genetic heterogeneity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "Finally, we discuss examples of chimeric techniques as a bridge between biology and related concepts in robotics and cognitive science: taking chimerism as a fundamental linking concept allows interesting new bridges to be forged between open problems in biology and other fields. We conclude with the implications of these data for biology, medicine and engineering, and suggestions for future work in this emerging interdisciplinary field.",
      "section": "Many of these experiments were conducted at times when modern molecular biology",
      "primary_topic": "Chimerism Applications",
      "secondary_topics": [
        "robotics",
        "cognitive science",
        "interdisciplinary field",
        "biology",
        "medicine",
        "engineering",
        "chimeric techniques"
      ],
      "chunk_summary": "Chimeric techniques offer a bridge between biology and fields like robotics and cognitive science, opening new avenues for interdisciplinary research and addressing open problems in these areas.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "3"
    },
    {
      "text": "The ways in which system-level properties of living things are determined by the nature of their molecular constituents are illuminated by the results of recombination at the level of genetic material (Fig. 2A). The first experiments of this kind were natural ones: modern phylogenetic studies show that over billions of years of evolution, genetic material has been exchanged between unicellular prokaryotic organisms such as bacteria, archaea, and protozoa as well as multicellular eukaryotes (originated by the fusion of eubacteria and archaea) such as plants and animals.",
      "section": "The ways in which system",
      "primary_topic": "Genetic Recombination",
      "secondary_topics": [
        "Phylogenetic Studies",
        "Evolution",
        "Genetic Material",
        "Prokaryotes",
        "Eukaryotes",
        "Chimerism"
      ],
      "chunk_summary": "System-level properties of organisms are influenced by molecular recombination, as evidenced by phylogenetic studies showing genetic exchange between prokaryotes and eukaryotes throughout evolution.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Thus, all life on the molecular level is profoundly/fundamentally chimeric, causing the \"tree of life\" metaphor to be replaced by the more accurate \"web of life\" (Doolittle, 2008).",
      "section": "The ways in which system",
      "primary_topic": "Web of Life",
      "secondary_topics": [
        "Chimerism",
        "Tree of Life",
        "Evolution",
        "Horizontal Gene Transfer"
      ],
      "chunk_summary": "The chimeric nature of life at the molecular level, due to genetic exchange, supports the \"web of life\" concept over the traditional \"tree of life\" metaphor.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The process by which distantly related species exchange genetic material is referred to as horizontal gene transfer (HGT), and is mainly driven by conjugation between bacteria and across kingdoms from prokaryotes to eucaryotes (even between bacteria and mammalian cells) via a cellular bridge (McKay, 2002; Waters, 2001), viruses (viral infections), and events of endosymbiosis.",
      "section": "The process by which distantly related species exchange genetic material is referred to as horizontal gene transfer",
      "primary_topic": "Horizontal Gene Transfer",
      "secondary_topics": [
        "HGT",
        "conjugation",
        "viral infection",
        "endosymbiosis",
        "prokaryotes",
        "eukaryotes",
        "genetic exchange"
      ],
      "chunk_summary": "Horizontal gene transfer (HGT) occurs between distantly related species through mechanisms like conjugation, viral infection, and endosymbiosis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "For example, sequencing of the Vibrio cholerae genome, which consists of two circular chromosomes, indicates that the smaller chromosome carries a relatively high number of genes that do not seem to have originated in Vibrio itself. The smaller chromosome was likely taken up by Vibrio's ancestor via horizontal gene transfer, presumably providing Vibrio with an evolutionary advantage by carrying genes involved in energy metabolism and DNA repair; this thereby created a unicellular chimera carrying two chromosomes of distinct origin which together regulate the cell's biochemical processes (Heidelberg et al., 2000).",
      "section": "The process by which distantly related species exchange genetic material is referred to as horizontal gene transfer",
      "primary_topic": "Vibrio cholerae Example",
      "secondary_topics": [
        "HGT",
        "genome sequencing",
        "Vibrio cholerae",
        "chromosome",
        "evolutionary advantage",
        "energy metabolism",
        "DNA repair",
        "chimera"
      ],
      "chunk_summary": "The Vibrio cholerae genome exemplifies HGT, with its smaller chromosome likely acquired through HGT, providing advantages in energy metabolism and DNA repair.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "HGT, even between distantly related species, plays a critical role in evolving novel traits (Boto, 2014), and has been proposed to be a key driving force in speciation events. For instance, animals such as the ascidian Tunicates, which belong to the urochordates, are among the few metazoans that can produce cellulose via a cellulose synthase-like gene, most likely acquired via HGT from Actinobacteria. This enables Tunicates to synthesize cellulose and integrate it into an extracellular matrix external to the epidermis, serving as a protective layer (Hirose et al., 2011; Matthysse et al., 2004; Sasakura et al., 2016).",
      "section": "[PAGE 4] HGT, even between distantly related species, plays a critical role in evolving novel traits (Boto, 2014), and has been proposed to be a key driving force in speciation events. For instance, animals such as the ascidian Tunicates, which belong to the urochordates, are among the few metazoans that can produce cellulose via a cellulose synthase-like gene, most likely acquired via HGT from Actinobacteria. This enables Tunicates to synthesize cellulose and integrate it into an extracellular matrix external to the epidermis, serving as a protective layer (Hirose et al., 2011; Matthysse et al., 2004; Sasakura et al., 2016). Genes transferred between bacteria and animals provide especially interesting examples of molecular components that can be exploited in different ways by systems with radically different architectures (Dunning Hotopp, 2011).",
      "primary_topic": "Horizontal Gene Transfer",
      "secondary_topics": [
        "HGT",
        "speciation",
        "cellulose synthase",
        "extracellular matrix",
        "Tunicates",
        "Actinobacteria",
        "Urochordates",
        "evolution"
      ],
      "chunk_summary": "Horizontal gene transfer (HGT) plays a crucial role in the evolution of novel traits and speciation, exemplified by tunicates acquiring cellulose synthase from Actinobacteria, enabling them to produce a protective cellulose-based extracellular matrix.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4"
    },
    {
      "text": "Genes transferred between bacteria and animals provide especially interesting examples of molecular components that can be exploited in different ways by systems with radically different architectures (Dunning Hotopp, 2011).",
      "section": "[PAGE 4] HGT, even between distantly related species, plays a critical role in evolving novel traits (Boto, 2014), and has been proposed to be a key driving force in speciation events. For instance, animals such as the ascidian Tunicates, which belong to the urochordates, are among the few metazoans that can produce cellulose via a cellulose synthase-like gene, most likely acquired via HGT from Actinobacteria. This enables Tunicates to synthesize cellulose and integrate it into an extracellular matrix external to the epidermis, serving as a protective layer (Hirose et al., 2011; Matthysse et al., 2004; Sasakura et al., 2016). Genes transferred between bacteria and animals provide especially interesting examples of molecular components that can be exploited in different ways by systems with radically different architectures (Dunning Hotopp, 2011).",
      "primary_topic": "Gene Transfer & Architecture",
      "secondary_topics": [
        "HGT",
        "bacteria",
        "animals",
        "molecular components",
        "evolutionary adaptation",
        "systems biology"
      ],
      "chunk_summary": "Bacterial genes transferred to animals demonstrate how molecular components can be utilized differently in systems with distinct architectures.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4"
    },
    {
      "text": "The classic form of multicellular molecular chimeras results from combining gametes belonging to different species. Cross-breeding of animals and plants has been observed and performed by humans in agricultural practices for several millennia (e.g., mules). It is estimated that around 10% of animals and 25% of plants hybridize naturally with at least one other species; this process is believed to play an important role in speciation (Mallet, 2005, 2007). The increased fitness of some interspecies hybrids has led to the concept of hybrid vigor (Arnold and Hodges, 1995; Baranwal et al., 2012). It is hypothesized that hybrids are able to combine the main advantages of sexual reproduction (genetic diversity) and clonal reproduction (increased levels of regenerative capabilities) (Bullini, 1994).",
      "section": "The classic form of multicellular molecular chimeras results from combining gametes belonging to different species",
      "primary_topic": "Hybrid Vigor",
      "secondary_topics": [
        "hybridization",
        "speciation",
        "cross-breeding",
        "genetic diversity",
        "clonal reproduction",
        "regenerative capabilities",
        "fitness"
      ],
      "chunk_summary": "Interspecies hybridization, a key driver of speciation, can lead to hybrid vigor by combining the benefits of sexual and clonal reproduction, resulting in increased fitness and regenerative abilities.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Consistent with this, the unisexual Ambystoma indeed possess an elevated capacity to regenerate lost body parts in comparison to their diploid sexual relatives (Saccucci et al., 2016). Such assays emphasize our lack of fundamental knowledge via the difficulty of quantitatively predicting in advance the structural features of the hybrid (and deriving those predictions from anatomical properties of the parents).",
      "section": "The classic form of multicellular molecular chimeras results from combining gametes belonging to different species",
      "primary_topic": "Regeneration",
      "secondary_topics": [
        "Ambystoma",
        "unisexuality",
        "diploid",
        "hybrid",
        "structural prediction",
        "anatomical properties"
      ],
      "chunk_summary": "Unisexual Ambystoma demonstrate enhanced regenerative capacity compared to their sexual relatives, highlighting the challenge of predicting hybrid structural features from parental anatomy.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The unisexual all-female salamanders of the genus Ambystoma, believed to be the result of a natural hybridization event some 3.9 million years ago, reproduce via a process called kleptogenesis (Bogart et al., 2009). Despite their unisexual mode of reproduction, females need sperm to induce development of their oocytes and therefore have to \"steal\" the sperm from males of other bi-sexual salamander species. Individuals have been found with several levels of ploidy ranging from diploid to pentaploid integrating genomes from at least five distinct species due to their ability to switch sperm donor species, resulting in more than 20 different nuclear genomic combinations (Bogart et al., 2009). The morphology of the animals is determined by the number and origin of the inherited chromosome sets, resulting in differences in overall size and allometric proportions between body and appendages as well as color patterning.",
      "section": "The classic form of multicellular molecular chimeras results from combining gametes belonging to different species",
      "primary_topic": "Kleptogenesis",
      "secondary_topics": [
        "Ambystoma",
        "unisexuality",
        "ploidy",
        "genome integration",
        "morphology",
        "allometry",
        "color patterning"
      ],
      "chunk_summary": "Ambystoma salamanders, reproducing through kleptogenesis, exhibit varying ploidy levels due to integrating genomes from multiple species, leading to diverse morphologies influenced by the inherited chromosome sets.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Remarkably, while amphibians with different ploidies have very different sizes of certain cells, the animals' overall size remains normal and morphogenetic process adjusts to correctly sized kidney tubules (Fankhauser, 1945a, 1945b). This includes using cell:cell interactions between ~8 cells (normal ploidy and small cells) to make tubules, vs. using cytoskeletal control to force one cell to bend around itself leaving the correctly-sized lumen in the middle, when cells are made to be very large.",
      "section": "[PAGE 4] Remarkably, while amphibians with different ploidies have very different sizes of certain cells, the animals' overall size remains normal and morphogenetic process adjusts to correctly sized kidney tubules (Fankhauser, 1945a, 1945b). This includes using cell",
      "primary_topic": "Morphogenetic plasticity",
      "secondary_topics": [
        "ploidy",
        "cell size",
        "kidney tubules",
        "cell-cell interactions",
        "cytoskeleton",
        "morphogenesis"
      ],
      "chunk_summary": "Amphibians maintain normal organ size despite variations in cell size due to ploidy differences, utilizing different cellular mechanisms like cell-cell interactions or cytoskeletal control to achieve correct morphology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4"
    },
    {
      "text": "The ability of cell collectives to maintain the same large-scale target morphology despite radical changes in cell-level properties points to fascinating opportunities for future work to identify how diverse lower-level molecular mechanisms are activated in a context-sensitive manner to fulfill higher-level structural specifications. This degree of plasticity has not been achieved in robotics, where the structure and function of artificial machines is extremely sensitive to precise scale parameters of all of their parts.",
      "section": "[PAGE 4] Remarkably, while amphibians with different ploidies have very different sizes of certain cells, the animals' overall size remains normal and morphogenetic process adjusts to correctly sized kidney tubules (Fankhauser, 1945a, 1945b). This includes using cell",
      "primary_topic": "Biological plasticity",
      "secondary_topics": [
        "morphogenesis",
        "molecular mechanisms",
        "robotics",
        "scale parameters",
        "cell collectives",
        "target morphology"
      ],
      "chunk_summary": "Biological systems exhibit remarkable plasticity in achieving target morphology despite cell-level variations, unlike current robotics, highlighting opportunities for research into context-dependent molecular mechanisms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "4"
    },
    {
      "text": "It also raises interesting questions about aspects of evolution that select for plasticity and adaptability to new conditions (such as changes in cell size) vs. short-term optimization of mechanisms to work with a specific extant cell size.",
      "section": "[PAGE 4] Remarkably, while amphibians with different ploidies have very different sizes of certain cells, the animals' overall size remains normal and morphogenetic process adjusts to correctly sized kidney tubules (Fankhauser, 1945a, 1945b). This includes using cell",
      "primary_topic": "Evolutionary implications",
      "secondary_topics": [
        "evolution",
        "plasticity",
        "adaptability",
        "cell size",
        "optimization"
      ],
      "chunk_summary": "The observed plasticity raises evolutionary questions about the selective pressures favoring adaptability to varying cell sizes versus optimization for a specific cell size.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "4"
    },
    {
      "text": "Interestingly, even commonplace sexual reproduction can be seen as a form of chimerism, in which DNA from two different morphotypes of a given species (male and female anatomical forms, which can be quite different) co-exist in the same zygote and drive subsequent morphogenesis. Paternal and maternal imprinting of DNA from parents ensure that many kinds of zygotes are in fact significantly chimeric with respect to genetic information. This is clearly seen when contrasted with the baseline, more \"genetically pure\" case of parthenogenetic animals.",
      "section": "Interestingly",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "sexual reproduction",
        "morphotypes",
        "zygote",
        "morphogenesis",
        "genetic information",
        "parthenogenesis"
      ],
      "chunk_summary": "Sexual reproduction can be considered a form of chimerism due to the combination of distinct parental DNA in the zygote, influencing morphogenesis, in contrast to parthenogenetic reproduction.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "For example, invertebrates such as females of Daphnia (Decaestecker et al., 2009) and nematodes (Triantaphyllou and Hirschmann, 1964), as well as some vertebrates (e.g. fish (Chapman et al., 2008), amphibians and reptiles (Booth and Schuett, 2016) and others) can produce truly isogenic offspring in specific circumstances. In comparison, the introduction of a male, with a different genome, and the integration of sex chromosome signals in the embryo to give rise to one of two possible (male or female) body forms, is a kind of chimerism.",
      "section": "Interestingly",
      "primary_topic": "Isogenic Offspring",
      "secondary_topics": [
        "invertebrates",
        "vertebrates",
        "parthenogenesis",
        "Daphnia",
        "nematodes",
        "fish",
        "amphibians",
        "reptiles",
        "sex chromosomes"
      ],
      "chunk_summary": "Certain invertebrates and vertebrates can produce isogenic offspring through parthenogenesis, while sexual reproduction with a male introduces genetic diversity, representing another form of chimerism.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The difficulties in rationally predicting specific aspects of morphology from those of two parents (e.g., facial features for humans, or plant morphologies) represent a ubiquitous form of the inverse problem of emergent morphogenesis, which has been realized by farmers and animal breeders since long before formal biological science.",
      "section": "Interestingly",
      "primary_topic": "Predicting Morphology",
      "secondary_topics": [
        "morphology prediction",
        "inverse problem",
        "emergent morphogenesis",
        "parental traits"
      ],
      "chunk_summary": "Predicting offspring morphology from parental traits is a complex challenge, representing the inverse problem of emergent morphogenesis, recognized long before formal biological science.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "Horizontal gene transfer has been performed experimentally, creating a chimeric chromosome by combining two genomes in one cell. Using the newly developed megacloning technique, it was possible to clone and insert the entire 3.5-megabase genome of the bacterium Synechocystis into the 4.2-megabase Bacillus subtilis resulting in a chimeric 7.7-megabase genome. The chimera exhibited no obvious phenotypic differences compared to the host organism, but it is not known whether other important differences (e.g., in response to novel situations, evolvability, or robustness) may remain to be discovered (Itaya et al., 2005).",
      "section": "[PAGE 5] Horizontal gene transfer has been performed experimentally, creating a chimeric chromosome by combining two genomes in one cell. Using the newly developed megacloning technique, it was possible to clone and insert the entire 3.5-megabase genome of the bacterium Synechocystis into the 4.2-megabase Bacillus subtilis resulting in a chimeric 7.7-megabase genome. The chimera exhibited no obvious phenotypic differences compared to the host organism, but it is not known whether other important differences (e.g., in response to novel situations, evolvability, or robustness) may remain to be discovered (Itaya et al., 2005). It was shown, via a newly developed technique called genome transplantation, that it is possible to replace the entire Mycoplasma capricolum genome with the genome of Mycoplasma mycoides. The successful replacement of the genomes was confirmed via genotype (PCR) and phenotype analysis (proteomic) (Lartigue et al., 2007). In the laboratory setting, moving genes from one organism to another is a very common method used to probe the contributions of DNA information to form and function, although extensive study in novel environments will be necessary to determine what aspects are and are not converted by this procedure, given that important information also exists in cytoskeletal and other cellular components (Fields and Levin, 2017).",
      "primary_topic": "Horizontal Gene Transfer",
      "secondary_topics": [
        "megacloning",
        "Synechocystis",
        "Bacillus subtilis",
        "chimeric genome",
        "phenotype",
        "genotype",
        "evolvability",
        "robustness"
      ],
      "chunk_summary": "Megacloning enabled the creation of a chimeric genome by inserting the Synechocystis genome into Bacillus subtilis, with no apparent phenotypic changes observed, but potential differences in evolvability and robustness remain unexplored.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "It was shown, via a newly developed technique called genome transplantation, that it is possible to replace the entire Mycoplasma capricolum genome with the genome of Mycoplasma mycoides. The successful replacement of the genomes was confirmed via genotype (PCR) and phenotype analysis (proteomic) (Lartigue et al., 2007).",
      "section": "[PAGE 5] Horizontal gene transfer has been performed experimentally, creating a chimeric chromosome by combining two genomes in one cell. Using the newly developed megacloning technique, it was possible to clone and insert the entire 3.5-megabase genome of the bacterium Synechocystis into the 4.2-megabase Bacillus subtilis resulting in a chimeric 7.7-megabase genome. The chimera exhibited no obvious phenotypic differences compared to the host organism, but it is not known whether other important differences (e.g., in response to novel situations, evolvability, or robustness) may remain to be discovered (Itaya et al., 2005). It was shown, via a newly developed technique called genome transplantation, that it is possible to replace the entire Mycoplasma capricolum genome with the genome of Mycoplasma mycoides. The successful replacement of the genomes was confirmed via genotype (PCR) and phenotype analysis (proteomic) (Lartigue et al., 2007). In the laboratory setting, moving genes from one organism to another is a very common method used to probe the contributions of DNA information to form and function, although extensive study in novel environments will be necessary to determine what aspects are and are not converted by this procedure, given that important information also exists in cytoskeletal and other cellular components (Fields and Levin, 2017).",
      "primary_topic": "Genome Transplantation",
      "secondary_topics": [
        "Mycoplasma capricolum",
        "Mycoplasma mycoides",
        "PCR",
        "proteomic analysis",
        "genotype",
        "phenotype"
      ],
      "chunk_summary": "Genome transplantation successfully replaced the Mycoplasma capricolum genome with the Mycoplasma mycoides genome, confirmed by PCR and proteomic analysis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "In the laboratory setting, moving genes from one organism to another is a very common method used to probe the contributions of DNA information to form and function, although extensive study in novel environments will be necessary to determine what aspects are and are not converted by this procedure, given that important information also exists in cytoskeletal and other cellular components (Fields and Levin, 2017).",
      "section": "[PAGE 5] Horizontal gene transfer has been performed experimentally, creating a chimeric chromosome by combining two genomes in one cell. Using the newly developed megacloning technique, it was possible to clone and insert the entire 3.5-megabase genome of the bacterium Synechocystis into the 4.2-megabase Bacillus subtilis resulting in a chimeric 7.7-megabase genome. The chimera exhibited no obvious phenotypic differences compared to the host organism, but it is not known whether other important differences (e.g., in response to novel situations, evolvability, or robustness) may remain to be discovered (Itaya et al., 2005). It was shown, via a newly developed technique called genome transplantation, that it is possible to replace the entire Mycoplasma capricolum genome with the genome of Mycoplasma mycoides. The successful replacement of the genomes was confirmed via genotype (PCR) and phenotype analysis (proteomic) (Lartigue et al., 2007). In the laboratory setting, moving genes from one organism to another is a very common method used to probe the contributions of DNA information to form and function, although extensive study in novel environments will be necessary to determine what aspects are and are not converted by this procedure, given that important information also exists in cytoskeletal and other cellular components (Fields and Levin, 2017).",
      "primary_topic": "Gene Transfer Implications",
      "secondary_topics": [
        "DNA information",
        "form and function",
        "novel environments",
        "cytoskeleton",
        "cellular components",
        "gene transfer"
      ],
      "chunk_summary": "While gene transfer is commonly used to study the role of DNA in form and function, further research in diverse environments is needed to fully understand its effects, considering the contribution of cytoskeletal and other cellular components.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "Cross-species transfer of DNA was used as a tool for understanding the evolution of morphogenetic control mechanisms. For example, Pax-6 is a highly conserved master control gene for metazoan eye morphogenesis with homologous genes found in insects and vertebrates, including mice and humans. Its loss-of-function mutations lead to reduced or completely lost eye structures.",
      "section": "Cross",
      "primary_topic": "Morphogenetic Evolution",
      "secondary_topics": [
        "Pax-6",
        "DNA transfer",
        "cross-species analysis",
        "eye morphogenesis",
        "gene conservation",
        "loss-of-function mutation"
      ],
      "chunk_summary": "Cross-species DNA transfer, exemplified by Pax-6 studies, reveals conserved morphogenetic control mechanisms despite evolutionary divergence.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Although mammals and insects diverged more than 500 million years ago, mouse Pax-6 can still induce eye formation in Drosophila with structural morphology typical for the host (Gehring and Ikeo, 1999; Halder et al., 1995), illustrating the versatile context-sensitive nature of morphogenetic modules, whose internal component mechanisms can change during evolution while maintaining a conserved trigger.",
      "section": "Cross",
      "primary_topic": "Morphogenetic Modules",
      "secondary_topics": [
        "Pax-6",
        "Drosophila",
        "mouse model",
        "eye development",
        "evolutionary conservation",
        "context sensitivity",
        "morphogenetic modules"
      ],
      "chunk_summary": "Despite vast evolutionary distance, mouse Pax-6 can induce eye formation in Drosophila, highlighting the context-sensitive nature and conserved triggers of morphogenetic modules.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Using the molecular chimerism approach, it was even possible to show how enhancer elements shape social hierarchies in mammals. PAS1 (placental-accelerated sequence), which is not highly conserved within placental and non-placental clades, acts as an enhancer for the transcription factor Lhx2, a gene involved in brain development and social stratification in mice. While male PAS1-deletion mice cannot establish proper social hierarchies, transgenic knock-in mice carrying ortholog sequences of PAS1 from non-amniotic (wallaby and chicken) animals showed different levels of social dominance depending on their genotype, without compromising other aspects of development and behavior (Wang et al., 2020).",
      "section": "Using the molecular chimerism approach",
      "primary_topic": "Molecular Chimerism",
      "secondary_topics": [
        "enhancer elements",
        "social hierarchies",
        "PAS1",
        "Lhx2",
        "transgenic mice",
        "gene regulation",
        "brain development",
        "behavior"
      ],
      "chunk_summary": "Molecular chimerism experiments, specifically manipulating the PAS1 enhancer element, reveal its role in shaping social hierarchies in mice by influencing Lhx2 expression and brain development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "These examples illustrate how creation of animals with chimeric genetic information can reveal important genotype:phenotype relationships spanning morphology and behavior.",
      "section": "Using the molecular chimerism approach",
      "primary_topic": "Genotype-Phenotype",
      "secondary_topics": [
        "molecular chimerism",
        "morphology",
        "behavior",
        "genetic information",
        "animal models"
      ],
      "chunk_summary": "Creating animals with chimeric genetic information is a powerful approach for understanding the relationship between genotype and phenotype across morphology and behavior.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "On the level of the gene, chimeric fusion genes (CFG), formed by a process called exon shuffling (Gilbert, 1978), results in the merging of two individual genes; this has been proposed to significantly contribute to the evolution of new genes coding for proteins with novel structures and functions (Jones and Begun, 2005). For example, synthetic fusion genes have been generated to study the function of homeotic genes and their role in establishing the body plan. In Drosophila, mutations in homeotic genes lead to the transformation and replacement of one body structure with another (McGinnis et al., 1984).",
      "section": "On the level of the gene",
      "primary_topic": "Chimeric Fusion Genes",
      "secondary_topics": [
        "exon shuffling",
        "gene evolution",
        "protein function",
        "homeotic genes",
        "Drosophila",
        "genetic mutations"
      ],
      "chunk_summary": "Chimeric fusion genes, formed by exon shuffling, contribute to the evolution of new genes and can be studied through synthetic fusion genes in model organisms like Drosophila.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "Expression of the master control gene Antennapedia (Antp) specifies the second thoracic segment, and ectopic overexpression of Antp leads to the homeotic transformation of antennae into second legs (Schneuwly et al., 1987). This was achieved by creating an artificial fusion protein Antp fused to the inducible heat-shock promotor hsp70, which was introduced into the germline via P-element mediated germline transformation (Gibson and Gehring, 1988; Schneuwly et al., 1987). This illustrates the notion of a spatial chimera, where the foreign material or information molecules were sourced not from another species but from a different region of the body.",
      "section": "On the level of the gene",
      "primary_topic": "Spatial Chimeras",
      "secondary_topics": [
        "Antennapedia",
        "homeotic transformation",
        "hsp70 promoter",
        "P-element transformation",
        "germline",
        "ectopic expression"
      ],
      "chunk_summary": "The artificial fusion of Antp with hsp70 and its overexpression in Drosophila demonstrates the concept of a spatial chimera, where genetic material from a different body region causes phenotypic changes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "On the level of chromosomes, genetic expression chimeras can occur naturally in female mammals, by sex-chromosome inactivation which is the transcriptional silencing of one of the two copies of the X chromosomes resulting in cellular mosaicism. In calico cats, for instance, this results in a patched color pattern of the fur (Gartler and Goldman, 2001; Panning, 2008), illustrating a natural and ubiquitous chimerism.",
      "section": "On the level of the gene",
      "primary_topic": "X-chromosome Inactivation",
      "secondary_topics": [
        "genetic chimeras",
        "cellular mosaicism",
        "calico cats",
        "sex chromosomes",
        "transcriptional silencing"
      ],
      "chunk_summary": "X-chromosome inactivation in female mammals, exemplified by the coat color pattern in calico cats, represents a natural form of genetic chimerism due to cellular mosaicism.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "Mutations are often found in tumors, which exhibit increased genomic instability (Negrini et al., 2010), elevated mutation rates, and epigenetic changes (Chen et al., 1998). The stochastic nature of mutations results in the development of intra- and intertumor heterogeneity with altered levels of gene expression (Burrell et al., 2013; Swanton, 2012). Due to these changes to the host genome, cancer results in high levels of molecular chimerism even within a single solid tumor. Affected cells lose their ability to properly cooperate with their environment, and de-couple from the information processing of cellular collectives that normally keep cells working toward large-scale morphogenetic goals (Chernet and Levin, 2013; Moore et al., 2017).",
      "section": "Mutations are often found in tumors",
      "primary_topic": "Tumor Heterogeneity",
      "secondary_topics": [
        "mutations",
        "genomic instability",
        "epigenetic changes",
        "gene expression",
        "molecular chimerism",
        "cell communication",
        "morphogenesis"
      ],
      "chunk_summary": "Mutations drive tumor heterogeneity and disrupt cell communication within the tumor microenvironment, leading to a loss of coordinated morphogenetic behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In a sense, cancer cells free themselves by gaining autonomy from the constraints of their collective and regressing to the transcriptional and behavioral properties of unicellular ancestors (Levin, 2019b, 2021; Zhou et al., 2018). Waddington (1935) and Needham (1936) described this process as a \"morphological escape\" from the controlling influence of the individuation field of the host organism (Needham, 1936; Seilern-Aspang and Kratochwil, 1962; Waddington, 1935). This newly acquired individuality can reach an extent where cancer cells can even leave their hosts, as occurs in the case of facial tumor disease, a transmissible cancer affecting populations of Tasmanian devils with a mortality rate of almost 100%.",
      "section": "Mutations are often found in tumors",
      "primary_topic": "Morphological Escape",
      "secondary_topics": [
        "cancer cell autonomy",
        "unicellular regression",
        "individuation field",
        "Tasmanian devil facial tumor disease",
        "transmissible cancer"
      ],
      "chunk_summary": "Cancer cells achieve a \"morphological escape\" from the host organism, reverting to unicellular-like behavior and, in extreme cases, becoming transmissible like the Tasmanian devil facial tumor disease.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Since the disease is spread as an allograft through biting during social interactions, it is able to continue to exist even though its original host has ceased to exist long before (Patton et al., 2020), using parasitic chimerism as a strategy to perpetuate the cellular lineage.",
      "section": "Mutations are often found in tumors",
      "primary_topic": "Parasitic Chimerism",
      "secondary_topics": [
        "allograft",
        "transmissible cancer",
        "cellular lineage",
        "Tasmanian devil facial tumor disease"
      ],
      "chunk_summary": "Transmissible cancers, like the Tasmanian devil facial tumor disease, utilize parasitic chimerism to propagate their cellular lineage beyond the original host.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5"
    },
    {
      "text": "At the next level of organization above the molecular, we consider mixing of larger subcellular components, such as in \"cybrids\", or fusions between cells and cytoplasts (Bacman et al., 2020; Narbonne and Gurdon, 2012; Narbonne et al., 2012; Narbonne et al., 2011) to examine the roles of nuclei and mitochondria (Fig. 2B).",
      "section": "At the next level of organization above the molecular",
      "primary_topic": "Subcellular components",
      "secondary_topics": [
        "cybrids",
        "cytoplasts",
        "cell fusion",
        "nuclei",
        "mitochondria",
        "subcellular mixing"
      ],
      "chunk_summary": "This chunk discusses the mixing of subcellular components like nuclei and mitochondria through cybrids and cell-cytoplast fusions to understand their respective roles.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The chimeric approach was used initially to address the question formulated by Boveri in 1889 (Boveri, 1889; Boveri, 1893; Hadorn, 1937): are species-specific traits determined by the nucleus or the cytoplasm?",
      "section": "At the next level of organization above the molecular",
      "primary_topic": "Species-specific traits",
      "secondary_topics": [
        "chimeric approach",
        "nucleus",
        "cytoplasm",
        "species variation",
        "Boveri",
        "Hadorn"
      ],
      "chunk_summary": "This chunk highlights the use of chimeric approaches to investigate whether species-specific traits are determined by the nucleus or the cytoplasm, referencing Boveri's historical question.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "To study the interplay between, and the respective roles of, the nucleus and the cytoplasm, amoebae, which are relatively large uninucleated eukaryotic cells without a rigid shape, were used (Lorch and",
      "section": "To study the interplay between",
      "primary_topic": "Amoebae Model",
      "secondary_topics": [
        "nucleus",
        "cytoplasm",
        "eukaryotic cells",
        "cell biology",
        "model organism"
      ],
      "chunk_summary": "Amoebae were chosen as a model organism to study the interplay between the nucleus and cytoplasm due to their large size, uninucleated nature, and lack of rigid shape.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Danielli (1953b) observed that enucleation, the removal of the nucleus, leads to disrupted movement and digestion in amoebae. Surprisingly, enucleated amoebae can survive for up to 20 days and display periods of seemingly normal movement for several days (Lorch and Danielli, 1953a).  Similarly, fragments of human somatic cells can survive without a nucleus for a period, exhibiting altered behavior like galvanotaxis compared to nucleated cells (Sun et al., 2013).",
      "section": "Danielli",
      "primary_topic": "Enucleation Effects",
      "secondary_topics": [
        "nucleus",
        "amoebae",
        "somatic cells",
        "galvanotaxis",
        "cell survival",
        "cell behavior"
      ],
      "chunk_summary": "Enucleation affects cell movement and digestion but doesn't immediately cause cell death, with both amoebae and human somatic cell fragments showing altered behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Enucleated cells can be reactivated through homo- or heterologous nuclear transfer, enabling the study of organelle-level chimerism. Following heterologous nuclear transfer, the host cell's cytoplasm primarily dictates cell shape during movement (species-specific), locomotion pattern, and the transplanted nucleus's size, conforming to the host's specific nucleus size (Lorch and Danielli, 1953a; Lorch and Danielli, 1953b).",
      "section": "Danielli",
      "primary_topic": "Nuclear Transfer",
      "secondary_topics": [
        "nuclear transfer",
        "chimerism",
        "cytoplasm",
        "cell shape",
        "locomotion",
        "nucleus size",
        "organelle"
      ],
      "chunk_summary": "Heterologous nuclear transfer experiments reveal the host cytoplasm's dominant role in determining cell shape, locomotion, and transplanted nucleus size.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "A truly outstanding model system in probing the contributions to large-scale shape of the nucleus and the cytoplasm in morphogenesis is the unicellular giant Acetabularia. This organism possess a complex morphology and the ability to live, grow, and regenerate without a nucleus for up to two months (Hämmerling, 1932). Grafting experiments have shown that when the nucleus-containing rhizoid is amputated (Fig. 3), followed by a cap amputation a few days later, the cap can regenerate even without a nucleus (Hämmerling, 1943b).",
      "section": "A",
      "primary_topic": "Acetabularia Morphogenesis",
      "secondary_topics": [
        "regeneration",
        "nucleus",
        "cytoplasm",
        "grafting",
        "morphology",
        "unicellular"
      ],
      "chunk_summary": "Acetabularia, a unicellular giant alga, is an excellent model system for studying morphogenesis due to its complex morphology and ability to regenerate even without a nucleus.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Interspecific grafting of Acetabularia crenulate rhizoid onto the stalk of A. mediterranea with a developed cap blastema results in a cap of intermediate morphological phenotype, meaning that the shape of the cap will be a hybrid combination of the two species. Future work must address the mechanisms by which morphogenetic substances (e.g., mRNAs) from the original nucleus mix with newly synthesized morphogens from the transplanted nucleus, and ways in which non-chemical morphogenetic field information can combine (Briere and Goodwin, 1990; Chaplain and",
      "section": "A",
      "primary_topic": "Interspecies Grafting",
      "secondary_topics": [
        "morphogens",
        "mRNA",
        "morphogenetic field",
        "hybrid morphology",
        "blastema",
        "rhizoid"
      ],
      "chunk_summary": "Interspecies grafting experiments in Acetabularia demonstrate hybrid morphology, highlighting the need for further research into the interaction of morphogenetic substances and field information.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Sleeman (1990), Goodwin and Pateromichelakis (1979) demonstrated that if the cap of Acetabularia is amputated a second time, the regenerated cap develops the morphology specific to A. crenulata (Hämmerling, 1932; 1934, 1943a, 1943b; 1953; Maschlanka, 1943; Werz and Hämmerling, 1961). This phenomenon highlights the ability to transform one species into another by mixing subcellular components located in different parts of the cell.  Furthermore, this process can create hybrid morphologies, occupying intermediate regions of morphospace between the two original phenotypes.",
      "section": "Sleeman",
      "primary_topic": "Morphological Transformation",
      "secondary_topics": [
        "Acetabularia",
        "regeneration",
        "morphospace",
        "phenotype",
        "subcellular components",
        "hybrids",
        "species transformation"
      ],
      "chunk_summary": "Mixing subcellular components can transform species and create hybrid morphologies in Acetabularia.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Nuclear transfer experiments have been conducted in higher organisms. For example, somatic endodermal nuclei transfer into enucleated axolotl eggs tested whether somatic nuclei undergo genetic changes during embryonic development and retain their ability to induce normal development after transfer.  Most nuclei, regardless of origin, can induce cleavage but usually don't develop past the blastula or gastrula stages. These limitations suggest investigating the limits of interoperability to determine what prevents these systems from maintaining life, even without correct morphology.",
      "section": "Nuclear transfer experiments have been conducted in higher or",
      "primary_topic": "Nuclear Transfer",
      "secondary_topics": [
        "somatic nuclei",
        "axolotl",
        "embryonic development",
        "genetic changes",
        "interoperability",
        "blastula",
        "gastrula"
      ],
      "chunk_summary": "Nuclear transfer experiments in higher organisms, like axolotl, reveal that while most transplanted nuclei can initiate cleavage, development often arrests before later stages, prompting investigation into the factors limiting developmental success.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Nuclear transfer between distantly related amphibians, such as Urodeles and Anurans, results in normally cleaved blastulae (Gurdon, 1986). Heterotypic nuclear transplantations between two Xenopus laevis subspecies develop into viable adult frogs with donor-characteristic phenotypes.",
      "section": "Nuclear transfer experiments have been conducted in higher or",
      "primary_topic": "Interspecies Transfer",
      "secondary_topics": [
        "Urodeles",
        "Anurans",
        "Xenopus laevis",
        "blastula",
        "phenotype",
        "nuclear transplantation"
      ],
      "chunk_summary": "Successful interspecies nuclear transfer between amphibians, even distantly related ones, demonstrates the potential for generating viable adults with donor-specific traits.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Although rare, some individuals showed an intermediate phenotype for some traits (Gurdon, 1961), suggesting that models of consequences of chimeric experiments need to include a stochastic component.",
      "section": "Although rare",
      "primary_topic": "Chimeric Phenotypes",
      "secondary_topics": [
        "intermediate phenotype",
        "stochasticity",
        "chimeric experiments",
        "developmental biology",
        "phenotypic variation"
      ],
      "chunk_summary": "Observations of intermediate phenotypes in chimeric experiments suggest the need for stochastic models.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Another example of the contribution of the cytoplasm to traits was provided using the technique of egg constriction. Hadorn fertilized palmatus eggs with cristatus sperm resulting in haploid hybrid merogones (with genetic contribution only from the sperm). Since these embryos don't live long enough to develop species-specific traits that would distinguish them, Hadorn transplanted presumptive skin ectoderm at early gastrula stage from the merogones onto wild type hosts (alpine newt), which allowed for the subsequent development beyond metamorphosis into adult stage.",
      "section": "Another example of the contribution of the cytoplasm to traits was",
      "primary_topic": "Cytoplasmic inheritance",
      "secondary_topics": [
        "egg constriction",
        "merogones",
        "haploid hybrids",
        "transplantation",
        "ectoderm",
        "gastrula stage",
        "metamorphosis"
      ],
      "chunk_summary": "Hadorn's experiment using egg constriction and transplantation of haploid hybrid merogone ectoderm onto wild-type hosts demonstrated the influence of cytoplasm on trait development beyond the genetic contribution of the sperm.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The skin of the haploid merogon resembled the morphology of the egg/cytoplasm-donating species (bumpy) in contrast to the sperm-donating species whose skin was smooth (Chen;",
      "section": "Another example of the contribution of the cytoplasm to traits was",
      "primary_topic": "Phenotype determination",
      "secondary_topics": [
        "skin morphology",
        "cytoplasmic influence",
        "paternal inheritance",
        "maternal inheritance"
      ],
      "chunk_summary": "The resulting skin morphology of the transplanted ectoderm resembled the egg donor, highlighting the cytoplasmic contribution to phenotypic traits despite having the genetic material of the sperm donor.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Hadorn (1936, 1937). However, cross-genus nuclear transplantation of the common carp nucleus into the enucleated goldfish egg resulted in quantities of vertebrae more similar to that of goldfish (28-30) than the carp (32-36), proving that the cytoplasm can contribute to developmental outcomes (Sun et al., 2005; Sun and Zhu, 2014).",
      "section": "Hadorn",
      "primary_topic": "Cytoplasmic Influence",
      "secondary_topics": [
        "nuclear transplantation",
        "cross-genus",
        "vertebrae development",
        "cytoplasmic inheritance",
        "developmental biology",
        "carp",
        "goldfish"
      ],
      "chunk_summary": "Cross-genus nuclear transplantation experiments demonstrate that the cytoplasm plays a role in developmental outcomes, as seen in the vertebral development of carp-goldfish hybrids.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Some of the most remarkable examples of inter-species subcellular chimerism crosses Kingdoms. Across phyla from protists to multicellular live forms, organisms have used the strategy of symbiogenesis or endosymbiosis for acquiring new biochemical capabilities by taking up parts or entire organisms and integrating them into their own bodies (Margulis, 2004; Nowack and Melkonian, 2010; O'Malley, 2015). Two strategies to achieve this, used by animals and plants, are termed kleptoplasty (the \"stealing\" of organelles from another organism) (Krause, 2015; Van Steenkiste et al., 2019) and karyoklepty (the stealing of another species' nucleus) (Johnson et al., 2007; Onuma and Horiguchi, 2015).",
      "section": "Some of the most remarkable examples of inter",
      "primary_topic": "Symbiogenesis",
      "secondary_topics": [
        "chimerism",
        "endosymbiosis",
        "kleptoplasty",
        "karyoklepty",
        "horizontal gene transfer",
        "evolution"
      ],
      "chunk_summary": "Organisms across various phyla utilize symbiogenesis and endosymbiosis, including kleptoplasty and karyoklepty, to acquire new biochemical capabilities by integrating parts or entire organisms into their own bodies.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "A remarkable example of kleptoplasty resulting from animal-plant chimerism is found in the sea slug Elysia chlorotica. These slugs have the ability to perform photosynthesis, which is most unusual in animals. They accomplish this by taking up chloroplasts from their algal food, storing them in their bodies as so-called kleptoplasts, and using the products of the resulting photosynthesis as an energy source (Rumpho et al., 2011). Since chloroplasts have lost many of their genes necessary for photosynthesis via HGT to their original algal hosts' nucleus, it is surprising that even when the slugs do not consume any algae, photosynthesis is maintained for months.",
      "section": "Some of the most remarkable examples of inter",
      "primary_topic": "Kleptoplasty",
      "secondary_topics": [
        "Elysia chlorotica",
        "photosynthesis",
        "chloroplasts",
        "algal symbiosis",
        "sea slugs"
      ],
      "chunk_summary": "The sea slug Elysia chlorotica exhibits kleptoplasty by incorporating chloroplasts from algae, enabling it to perform photosynthesis even without consuming algae for extended periods.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "It has been shown that genes coding for proteins necessary for photosynthesis have been horizontally transferred to the slug genome (Rumpho et al., 2011; Rumpho et al., 2008). It is striking that E. chlorotica even developed the morphology of a leaf.",
      "section": "Some of the most remarkable examples of inter",
      "primary_topic": "Horizontal Gene Transfer",
      "secondary_topics": [
        "Elysia chlorotica",
        "photosynthesis",
        "genome evolution",
        "adaptation",
        "morphology"
      ],
      "chunk_summary": "Horizontal gene transfer from algae to Elysia chlorotica has provided the slug with genes necessary for photosynthesis, contributing to its leaf-like morphology.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Because chloroplasts have transferred a significant part of their genome into the nucleus of their hosts, they depend on the external supply of gene products from the host environment in order to stay functional. Myrionecta rubra, a marine photosynthetic ciliate, preys on the cryptomonad Geminigera cryophila and steals its chloroplasts. To avoid a rapid decline in photosynthetic activity of the chloroplasts, it also commits kleptoplasty by accumulating the foreign nuclei in its body.",
      "section": "Because chloroplasts have transferred a significant part of their",
      "primary_topic": "Kleptoplasty",
      "secondary_topics": [
        "chloroplasts",
        "Myrionecta rubra",
        "Geminigera cryophila",
        "photosynthesis",
        "nucleus",
        "gene transfer",
        "symbiosis"
      ],
      "chunk_summary": "Myrionecta rubra steals chloroplasts and nuclei from Geminigera cryophila to maintain photosynthetic activity.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Even though the captured nuclei can no longer divide they stay transcriptionally active in the host's cytoplasm, supplying the chloroplasts with the necessary gene products for photosynthesis (Johnson et al., 2007; Onuma and Horiguchi, 2015).",
      "section": "Because chloroplasts have transferred a significant part of their",
      "primary_topic": "Nuclear Transcription",
      "secondary_topics": [
        "chloroplasts",
        "gene expression",
        "photosynthesis",
        "cytoplasm",
        "kleptoplasty",
        "symbiosis"
      ],
      "chunk_summary": "The stolen nuclei remain transcriptionally active, providing the chloroplasts with essential gene products for photosynthesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Chimerism between plants and animals has even been found in vertebrates. The spotted salamander Ambystoma maculatum embryo develops in an egg capsule inhabited by the unicellular green algae.",
      "section": "Chimerism between plants and animals has even been found in",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "symbiosis",
        "vertebrates",
        "salamander",
        "algae",
        "embryo",
        "Ambystoma maculatum",
        "plant-animal interaction"
      ],
      "chunk_summary": "Plant-animal chimerism, specifically between algae and salamander embryos, exists in vertebrates.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Oophila amblystomatis. Living in ectosymbiotic mutualism, the embryo supplies the algae with nitrogenous waste products. In return, the embryo profits from elevated oxygen levels resulting in decreased embryonic mortality (Gilbert, 1944). Recently it was discovered that this relationship is even closer, with algal cells using oviductal transmission to invade the embryonic cells and promote the transfer of photosynthate from the symbiont to the host.",
      "section": "Oophila amblystomatis",
      "primary_topic": "Symbiosis",
      "secondary_topics": [
        "Oophila amblystomatis",
        "ectosymbiosis",
        "mutualism",
        "nitrogenous waste",
        "oxygen",
        "embryonic mortality",
        "oviductal transmission",
        "photosynthate"
      ],
      "chunk_summary": "The symbiotic relationship between Oophila amblystomatis and its host embryo involves the exchange of nitrogenous waste for oxygen and photosynthate, with algal cells even invading embryonic cells.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Taken together, subcellular chimera experiments suggest that subcellular components such as nuclei and organelles even of evolutionary distant origin are able to function in a foreign cytoplasm, and emphasize the role of the cytoplasm with respect to guiding morphogenetic outcomes.",
      "section": "Oophila amblystomatis",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "subcellular chimera",
        "nuclei",
        "organelles",
        "cytoplasm",
        "morphogenesis",
        "evolutionary distance",
        "subcellular components"
      ],
      "chunk_summary": "Subcellular chimera experiments demonstrate the functional compatibility of even evolutionarily distant subcellular components within a foreign cytoplasm, highlighting the cytoplasm's role in guiding morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "In addition to spatial structure, chimeras can also be used to test temporal properties of morphogenesis. Transplanting nuclei from one stage of development to another can reveal how the timing of gene expression and cellular interactions influences the resulting form. This approach allows researchers to investigate the interplay between intrinsic developmental programs and external cues in shaping the trajectory of morphogenesis.",
      "section": "In addition to spatial structure",
      "primary_topic": "Temporal Morphogenesis",
      "secondary_topics": [
        "chimeras",
        "temporal properties",
        "morphogenesis",
        "nuclei transplantation",
        "developmental timing",
        "gene expression",
        "cellular interactions"
      ],
      "chunk_summary": "Chimeric organisms, created through nuclei transplantation, can be used to study the temporal dynamics of morphogenesis, revealing how the timing of developmental events influences form.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Tilapia to enucleated eggs of Loach resulted in a developmental rate similar to Loach, which is much faster than Tilapia egg development.",
      "section": "Tilapia to enucleated eggs of Loach resulted in a developmental rate",
      "primary_topic": "Developmental Rate",
      "secondary_topics": [
        "Tilapia",
        "Loach",
        "Enucleated Eggs",
        "Cross-species transplantation",
        "Embryonic development"
      ],
      "chunk_summary": "Transferring Tilapia nuclei into enucleated Loach eggs resulted in a developmental rate comparable to Loach, significantly faster than Tilapia's normal rate.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "Furthermore, larvae with transplanted nuclei show no development of external gills and oral barb rudiments, while Loach larva at a similar developmental stage possesses these traits (Yan et al., 2004), revealing that morphogenesis results from the interplay of genetic and epigenetic factors carried by the cytoplasm.",
      "section": "Furthermore",
      "primary_topic": "Morphogenesis",
      "secondary_topics": [
        "nuclear transplantation",
        "epigenetic factors",
        "cytoplasmic inheritance",
        "larval development",
        "gills",
        "oral barb rudiments",
        "genetic factors"
      ],
      "chunk_summary": "Nuclear transplantation experiments in larvae demonstrate that morphogenesis is influenced by both genetic and epigenetic factors present in the cytoplasm.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7"
    },
    {
      "text": "Another kind of chimera is formed by combining cells of diverse origins and properties (Fig. 2C). These chimeras have been especially useful in studying cell-extrinsic vs. cell-intrinsic (cell-autonomous vs. non-autonomous) regulatory mechanisms of development.",
      "section": "Another kind of chimera is formed by combining cells of diverse",
      "primary_topic": "Chimeras",
      "secondary_topics": [
        "cell-extrinsic regulation",
        "cell-intrinsic regulation",
        "cell autonomy",
        "development",
        "chimeric organisms",
        "cell properties"
      ],
      "chunk_summary": "Chimeras, formed by combining cells of different origins and properties, are valuable tools for studying cell-intrinsic and cell-extrinsic developmental regulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "For example, in addition to its role in eye morphogenesis, Pax-6 is involved in the development of the brain. Intrinsic Pax-6 expression is required by thalamic progenitor cells for normal development of thalamic neurons (Clegg et al., 2015). Homozygous mouse Pax6-null mutants show mispatterning of thalamic progenitors and fail to develop proper axonal projections to the cortex, resulting in neonatal death.",
      "section": "For example",
      "primary_topic": "Pax-6 function",
      "secondary_topics": [
        "brain development",
        "thalamus",
        "Pax-6 gene",
        "eye morphogenesis",
        "mouse mutants",
        "axonal projections"
      ],
      "chunk_summary": "Pax-6 is crucial for brain development, particularly in thalamic neurons, and its absence leads to mispatterning and neonatal death in mice.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "To overcome this obstacle, aggregation chimeras have been created consisting of Pax-6-/- and wild type (WT) Pax-6+/+ cells.",
      "section": "For example",
      "primary_topic": "Chimera model",
      "secondary_topics": [
        "aggregation chimeras",
        "Pax-6-/-",
        "wild type",
        "mouse model"
      ],
      "chunk_summary": "Aggregation chimeras combining Pax-6-/- and wild-type cells are used to study Pax-6 function.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "WT cells prevented early death and allowed Pax-6-/- cells to develop projections to the cortex, showing that despite cell-intrinsic lack of Pax-6 expression, those cells still have the ability to make regular axonal projections (Clegg et al., 2015; Swanson and Goldowitz, 2011; Yeung et al., 2016).",
      "section": "WT",
      "primary_topic": "Axonal Projections",
      "secondary_topics": [
        "Pax-6",
        "Cortex",
        "Cell Death",
        "WT Cells",
        "Axonal Development",
        "Genetic Expression"
      ],
      "chunk_summary": "Despite lacking Pax-6 expression, Pax-6-/- cells can still develop regular axonal projections to the cortex when co-cultured with WT cells.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The range of compatible cell complements is wider than might be expected, and numerous variations of xenoplastic transplantation experiments involving distantly related taxa have been conducted for studying neural cell differentiation. For example, adult rat hippocampal progenitor cells were transplanted into embryonic zebrafish (Sandquist et al., 2018) and Drosophila nerve cells were transplanted into amphibians (Korochkin et al., 1991; Saveliev et al., 1989; Saveliev et al., 1990); and even into human Parkinson patients, resulting in reduced tremor for some patients (Saveliev et al., 1997).",
      "section": "The range of compatible cell complements is wider than might be",
      "primary_topic": "Xenoplastic Transplantation",
      "secondary_topics": [
        "neural cell differentiation",
        "cross-species transplantation",
        "zebrafish",
        "Drosophila",
        "amphibians",
        "Parkinson's disease",
        "hippocampal progenitor cells"
      ],
      "chunk_summary": "Xenoplastic transplantation experiments demonstrate a surprising compatibility between distantly related species for studying neural cell differentiation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The transplanted neurons integrated and differentiated, forming various neural structures and establishing axonal connections with recipient neural cells and in some cases resulting in altered behavior reflecting the behavior of the donor (Alexandrova and Polezhaev, 1984; Andres and Rossler, 1977; Giersberg, 1935). The relevance of this work is not its degree of therapeutic efficacy, but rather to reveal the great degree of interoperability of biological systems across taxa, which enables future work to study emergent properties of neural circuits composed of very diverse components.",
      "section": "The range of compatible cell complements is wider than might be",
      "primary_topic": "Neural Integration",
      "secondary_topics": [
        "axonal connections",
        "neural circuits",
        "interspecies compatibility",
        "behavioral changes",
        "emergent properties",
        "cell integration",
        "differentiation"
      ],
      "chunk_summary": "Transplanted neurons successfully integrate and differentiate, forming connections and sometimes influencing recipient behavior, highlighting the interoperability of biological systems and paving the way for studying emergent properties of diverse neural circuits.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Interestingly, xenogenic influences were observed regarding developmental timing, inducing accelerated development in amphibians (Korochkin et al., 1991), as well as in human-mouse pluripotent stem cell co-cultures in a dose-dependent manner (Brown et al., 2020). The underlying mechanisms regulating developmental rate are an intense subject of current study (Ebisuya and Briscoe, 2018), revealing both intrinsic and extrinsic controls.",
      "section": "Interestingly",
      "primary_topic": "Xenogenic Influences",
      "secondary_topics": [
        "developmental timing",
        "accelerated development",
        "pluripotent stem cells",
        "xenoplastic transplantation",
        "intrinsic controls",
        "extrinsic controls"
      ],
      "chunk_summary": "Xenogenic influences can affect developmental timing, as demonstrated by accelerated development in amphibians and human-mouse stem cell co-cultures, with ongoing research exploring the underlying intrinsic and extrinsic control mechanisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Furthermore, the xenoplastic transplantation of cells between cold- and warm-blooded animals reveals that many cells can have a broader range of temperatures where they can remain viable.",
      "section": "Interestingly",
      "primary_topic": "Cell Viability",
      "secondary_topics": [
        "xenoplastic transplantation",
        "temperature tolerance",
        "cold-blooded animals",
        "warm-blooded animals",
        "cell survival"
      ],
      "chunk_summary": "Xenoplastic transplantation studies show that cells can remain viable across a wider temperature range than previously thought.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Some of the most informative examples of cell-level chimeras were constructed to study skin patterning (Chen and Chuong, 2012). To study how genotypic and phenotypic properties of embryonic skin cells relate to their morphogenetic patterns, Garber used aggregates consisting of mixed cell suspensions of skin cells obtained from chicken and mouse embryos at different ages, looking at the formation of feathers using chick cells and hair formation using mouse cells (Garber et al., 1968).",
      "section": "Some of the most informative examples of cell",
      "primary_topic": "Cell Chimeras",
      "secondary_topics": [
        "skin patterning",
        "morphogenesis",
        "embryonic skin cells",
        "chicken",
        "mouse",
        "feathers",
        "hair formation",
        "cell aggregates"
      ],
      "chunk_summary": "Studies using chimeric aggregates of chicken and mouse embryonic skin cells have provided insights into the relationship between genotypic and phenotypic properties and morphogenetic patterns, specifically feather and hair formation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Aggregates were transplanted on the chorioallantois of chicken embryos to ensure further morphogenesis. While aggregates consisting of cells from one species developed the corresponding histological structures such as feathers (chicken) or hair (mouse), mixed aggregates showed three types of developmental outcomes depending on the age of the embryonic cells used.",
      "section": "Aggregates were transplanted on the chorioallantois of chicken embryos",
      "primary_topic": "Morphogenesis",
      "secondary_topics": [
        "aggregates",
        "transplantation",
        "chicken embryo",
        "histological structures",
        "species-specific development"
      ],
      "chunk_summary": "Single-species cell aggregates develop species-specific structures, while mixed aggregates exhibit varied developmental outcomes depending on cell age.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "In aggregates of skin cells from older 14-15-day-old mouse embryos and younger 8-day-old chicken embryos, mouse cells suppressed feather formation, and only hair formed.",
      "section": "Aggregates were transplanted on the chorioallantois of chicken embryos",
      "primary_topic": "Inter-species interactions",
      "secondary_topics": [
        "mouse embryos",
        "chicken embryos",
        "skin cells",
        "feather formation",
        "hair formation",
        "suppression of development",
        "cell age"
      ],
      "chunk_summary": "In mixed aggregates of older mouse and younger chicken skin cells, mouse cells dominated development, resulting in hair formation and suppression of feather formation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Morphogenesis resulted in developing histological structures characteristic of both species such as hair and feathers when 13-day old mouse skin cells and 8-day-old chicken embryos were used. Cells from one species contributed to the morphogenesis of histological structures of the other species. Mouse cells were found to contribute to the formation of feathers, which was surprising to the authors since the formation of feathers is not part of the endogenous morphogenetic repertoire of mammalian cells.",
      "section": "[PAGE 8] Morphogenesis resulted in developing histological structures charac-",
      "primary_topic": "Morphogenesis",
      "secondary_topics": [
        "histological structures",
        "cross-species",
        "mouse skin cells",
        "chicken embryos",
        "feathers",
        "mammalian development"
      ],
      "chunk_summary": "Combining mouse and chicken cells resulted in the development of both species-specific structures, including mouse cells contributing to feather formation, a surprising finding given feathers are not part of mammalian development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "8"
    },
    {
      "text": "The authors concluded that \"These mouse skin cells function in a manner which either is not explicitly programmed in their genome or is present but never expressed in the usual course of development.\" (Garber et al., 1968; Garber and Moscona, 1964)",
      "section": "[PAGE 8] Morphogenesis resulted in developing histological structures charac-",
      "primary_topic": "Genetic Programming",
      "secondary_topics": [
        "gene expression",
        "development",
        "mouse skin cells",
        "unexpected phenotype"
      ],
      "chunk_summary": "The authors suggest that the observed cross-species morphogenesis indicates either a lack of explicit genetic programming for species-specific structures or the presence of unexpressed genetic potential in the mouse cells.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "8"
    },
    {
      "text": "Interspecies chimeras have also been used as a tool for cell complementation studies by knocking out a specific host cell line and thereby creating an open niche for xenogenic donor cells to occupy. For example, a mouse-human chimeric platform was used to test human neural crest cells (hNCCs) derived from pluripotent cells for their ability to integrate into the mouse organism and contribute to coat pigmentation. Using a mutant mouse line lacking melanoblasts to avoid competition with host cells, the researchers demonstrated successful integration and differentiation of hNCCs into functional melanocytes.",
      "section": "Interspecies chimeras have also been used as a tool for cell comple",
      "primary_topic": "Interspecies chimeras",
      "secondary_topics": [
        "cell complementation",
        "xenogenic transplantation",
        "neural crest cells",
        "hNCCs",
        "melanocytes",
        "pigmentation",
        "chimera model"
      ],
      "chunk_summary": "Interspecies chimeras, specifically a mouse-human model, are used to study cell complementation by creating a niche for donor cells, as demonstrated by the integration of human neural crest cells into mouse coat pigmentation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "NCCs, pluripotent human NCCs were injected in utero into mouse embryos. Human NCCs were able to complement missing melanoblasts resulting in chimeric mice with pigmented hair. In this regard, NCCs are particularly interesting, showing that human NCCs can detect and interpret the host environment's xenogenic cues crucial for proper NCC migration and functional integration into the host embryo (Cohen et al., 2016).",
      "section": "NCC",
      "primary_topic": "NCC Integration",
      "secondary_topics": [
        "NCCs",
        "xenogenic cues",
        "migration",
        "integration",
        "chimeric mice",
        "melanoblasts",
        "pluripotent"
      ],
      "chunk_summary": "Human NCCs injected into mouse embryos demonstrate successful integration by complementing missing melanoblasts and responding to host environmental cues.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Chimeras, organisms containing cells from different individuals, have provided insights into the role of internal clocks in developmental processes like nervous system formation, somitogenesis, and stem cell differentiation.  Studies using chimeras have highlighted the importance of time-keeping in morphogenesis (Ebisuya and Briscoe, 2018).",
      "section": "Chimeras between cells with different internal clocks have illumi",
      "primary_topic": "Chimeras in Development",
      "secondary_topics": [
        "developmental timing",
        "morphogenesis",
        "somitogenesis",
        "stem cell differentiation",
        "internal clocks",
        "chimeras"
      ],
      "chunk_summary": "Chimeras are valuable tools for studying the role of internal clocks in developmental processes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "8"
    },
    {
      "text": "A study using heteroplastic transplantation between zebrafish (donor) and medaka (host) at the blastula stage created interspecies chimeras to investigate developmental timing and the influence of intrinsic versus extrinsic factors in retinal neurogenesis.  The resulting chimeras developed an ectopic retina that followed the donor zebrafish's species-specific developmental timing, demonstrating the importance of intrinsic factors.  Despite following its own timing, the transplanted retina integrated with the host environment, using host cues for axonal outgrowth.",
      "section": "Chimeras between cells with different internal clocks have illumi",
      "primary_topic": "Interspecies Chimeras",
      "secondary_topics": [
        "heteroplastic transplantation",
        "zebrafish",
        "medaka",
        "retinal neurogenesis",
        "intrinsic factors",
        "extrinsic factors",
        "axonal outgrowth"
      ],
      "chunk_summary": "Interspecies chimeras reveal the interplay of intrinsic and extrinsic factors in retinal development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "8"
    },
    {
      "text": "Remarkably, the zebrafish retina in the medaka host was able to induce lens formation in the host tissue, leading to the development of chimeric eyes (Fuhrmann et al., 2020). This demonstrates the ability of transplanted tissues to influence host development and contribute to the formation of complex structures.",
      "section": "Chimeras between cells with different internal clocks have illumi",
      "primary_topic": "Chimeric Eye Formation",
      "secondary_topics": [
        "lens formation",
        "tissue induction",
        "chimeric eyes",
        "zebrafish",
        "medaka"
      ],
      "chunk_summary": "Transplanted zebrafish retina induced lens formation in the medaka host, resulting in chimeric eyes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "8"
    },
    {
      "text": "The next level of biological organization to consider, beyond individual cells, is the level of tissues. Tissues represent a higher order of complexity, where cells interact and cooperate to perform specific functions. This interaction is mediated by various mechanisms, including cell-cell communication, extracellular matrix interactions, and bioelectric signaling. Understanding how tissues are formed and maintained is crucial for comprehending developmental processes, regenerative capabilities, and the emergence of complex anatomical structures.",
      "section": "The next level of organization to consider exists at the level of tissues",
      "primary_topic": "Tissue Organization",
      "secondary_topics": [
        "cell-cell communication",
        "extracellular matrix",
        "bioelectric signaling",
        "tissue formation",
        "developmental processes",
        "regeneration",
        "anatomical structures"
      ],
      "chunk_summary": "Tissues represent a higher level of biological organization where cells interact to perform specific functions through mechanisms like cell communication and bioelectric signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Work on tissue chimeras, especially in plants, has a long and rich history with early references on plant grafting in the Hebrew bible and in Chinese literature more than 2000 years ago (Mudge et al., 2009). The oldest evidence on plant grafting was found in Sumerian cuneiform fragments from Mesopotamia, where the technique was probably discovered 3800 years ago (Harris et al., 2002; Mudge et al., 2009).",
      "section": "Work on tissue chimeras",
      "primary_topic": "Plant Grafting",
      "secondary_topics": [
        "tissue chimeras",
        "grafting",
        "plants",
        "history",
        "Sumerian",
        "Mesopotamia"
      ],
      "chunk_summary": "Plant grafting has a long history, dating back thousands of years with evidence found in ancient texts and Sumerian cuneiform fragments.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "It is thought that Sumerians may have grafted salt intolerant grape shoots onto salt-tolerant wild grape rootstocks to increase crop yield.",
      "section": "Work on tissue chimeras",
      "primary_topic": "Grafting Application",
      "secondary_topics": [
        "salt tolerance",
        "grape vines",
        "crop yield",
        "rootstocks",
        "Sumerians"
      ],
      "chunk_summary": "Sumerians likely used grafting to improve salt tolerance in grapevines and increase crop yield.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Grafting in plants occurs both frequently and naturally, happening when shoots or roots from the same or different plants grow close enough together to fuse (Mudge et al., 2009).",
      "section": "Grafting in plants does occur quite frequently and naturally",
      "primary_topic": "Plant Grafting",
      "secondary_topics": [
        "grafting",
        "plants",
        "roots",
        "shoots",
        "fusion",
        "natural grafting"
      ],
      "chunk_summary": "Plant grafting occurs naturally when roots or shoots of the same or different plants grow close enough to fuse.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Three different graft combinations can occur: self-grafts, where structures of the same plant fuse; intraspecific grafts between structures of two different plants of the same species; and interspecific grafts between different plant species (Bormann and Graham, 1966).",
      "section": "Three different graft combinations can occur",
      "primary_topic": "Graft Combinations",
      "secondary_topics": [
        "self-grafting",
        "intraspecific grafting",
        "interspecific grafting",
        "plant fusion",
        "plant grafting"
      ],
      "chunk_summary": "This section describes three types of plant grafts: self-grafts (within the same plant), intraspecific grafts (between plants of the same species), and interspecific grafts (between different species).",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The cells of the grafts develop apoplastic and symplastic connections via plasmodesmata, resulting in a graft interface that allows for the exchange of cytoplasmic content (Coetzee and Fineran, 1989; Tiedemann, 1989).",
      "section": "The cells of the grafts develop apoplastic and symplastic connections via",
      "primary_topic": "Graft Integration",
      "secondary_topics": [
        "plasmodesmata",
        "apoplastic connections",
        "symplastic connections",
        "cytoplasmic exchange",
        "graft interface",
        "cell communication"
      ],
      "chunk_summary": "Graft cells establish apoplastic and symplastic connections through plasmodesmata, facilitating cytoplasmic exchange across the graft interface.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In 1972, research concluded that natural root grafting promotes cooperation between trees, enabling the exchange of resources like carbohydrates, water, and minerals to support neighboring trees in need, thus enhancing overall resilience (Eis, 1972).",
      "section": "In",
      "primary_topic": "Root grafting",
      "secondary_topics": [
        "tree cooperation",
        "resource sharing",
        "nutrient transfer",
        "resilience",
        "interconnectedness",
        "forest ecology",
        "plant communication"
      ],
      "chunk_summary": "Natural root grafting allows trees to share resources and improve their collective resilience.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Animals and Plants under Domestication\" Darwin coined the terms \"graft hybrids\" and \"graft hybridization\" claiming that grafted parts exchange properties that are heritable, resulting in plants different from the donors (Darwin, 1897; Wu et al., 2013b). Even though Darwin's ideas were met with skepticism at the time, recent advances shed light on the underlying mechanisms for exchanging and modifying genetic material between grafted plants.",
      "section": "Animals and Plants under Domestication",
      "primary_topic": "Graft Hybridization",
      "secondary_topics": [
        "graft hybrids",
        "heritable properties",
        "genetic exchange",
        "Darwin",
        "plant grafting"
      ],
      "chunk_summary": "Darwin's initially controversial concept of graft hybridization, where grafted plants exchange heritable properties, is gaining support from recent research exploring the mechanisms of genetic material exchange between grafted plants.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Research indicates that the transfer of",
      "section": "Animals and Plants under Domestication",
      "primary_topic": "Genetic Transfer",
      "secondary_topics": [
        "genetic material",
        "grafted plants",
        "research findings"
      ],
      "chunk_summary": "Research suggests the transfer of genetic material occurs in grafted plants.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null
    },
    {
      "text": "RNA and DNA fragments, of entire plastid genomes, or alterations in",
      "section": "RNA",
      "primary_topic": "Genetic Material",
      "secondary_topics": [
        "RNA",
        "DNA",
        "plastid genomes",
        "genetic fragments",
        "genome alterations"
      ],
      "chunk_summary": "This section mentions different forms of genetic material, including RNA and DNA fragments, entire plastid genomes, and alterations within them.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "DNA methylation can induce heritable changes in graft hybrids (Liu et al., 2010; Stegemann and Bock, 2009; Thyssen et al., 2012; Wu et al., 2013a).  Tissue-level chimerism can automatically induce subcellular chimerism.  Tissue grafting can lead to horizontal transfer of entire mitochondria via tunneling nanotubes, extracellular vesicles, and cellular fusion (Torralba et al., 2016).",
      "section": "DNA",
      "primary_topic": "DNA Methylation",
      "secondary_topics": [
        "graft hybrids",
        "chimerism",
        "mitochondria transfer",
        "tunneling nanotubes",
        "extracellular vesicles",
        "cellular fusion",
        "heritable changes"
      ],
      "chunk_summary": "DNA methylation and tissue grafting can induce heritable changes and mitochondrial transfer in graft hybrids.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The literature on animal tissue chimeras is extensive, with the earliest and most famous experiments conducted by Hans Spemann and others in the early 20th century.  These pioneering studies demonstrated the remarkable ability of cells from different species to integrate and form functional tissues within a single organism.",
      "section": "The literature on animal tissue chimeras is extensive",
      "primary_topic": "Chimera Research",
      "secondary_topics": [
        "animal chimeras",
        "tissue chimeras",
        "Hans Spemann",
        "cell integration",
        "interspecies chimeras"
      ],
      "chunk_summary": "Early research on animal tissue chimeras, notably by Hans Spemann, demonstrated the capacity of cells from different species to integrate into functional tissues.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Hilde Mangold's research focused on the transplantation of organizers and various tissue types in frogs and salamanders, investigating their inductive capabilities and potencies (Mangold, 1929; Spemann, 1921, 1924; Spemann and Mangold, 1924; Spemann and Schotté, 1932).",
      "section": "Hilde Mangold on the transplantation of organisers and various other",
      "primary_topic": "Organizer Transplantation",
      "secondary_topics": [
        "inductive capabilities",
        "tissue transplantation",
        "frogs",
        "salamanders",
        "developmental biology",
        "embryonic induction",
        "Hilde Mangold"
      ],
      "chunk_summary": "Hilde Mangold studied the inductive properties of transplanted organizers and tissues in amphibian models.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Using Triton taeniatus embryos at early gastrula stages, Spemann tested the developmental potencies of the ectoderm. Through the homeoplastic exchange of the presumptive epidermis and presumptive neural plate, he showed that the transplanted parts were able to develop according to their new positions (Spemann, 1918). The same was true for heteroplastic transplantations between Triton taeniatus and cristatus (Spemann, 1921), where differences in both species' pigmentation allowed for later developmental analysis of the transplanted tissue (Harrison, 1898, 1903).",
      "section": "Using Triton taeniatus embryos at early gastrula stages",
      "primary_topic": "Developmental Potency",
      "secondary_topics": [
        "ectoderm",
        "transplantation",
        "homeoplastic",
        "heteroplastic",
        "Triton taeniatus",
        "Triton cristatus",
        "pigmentation",
        "gastrula"
      ],
      "chunk_summary": "Spemann's experiments using homeoplastic and heteroplastic transplantation in Triton embryos demonstrated that transplanted ectoderm develops according to its new position.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Spemann and Mangold have also shown that heteroplastic transplantation of a fragment of the blastopore lip (organizer) behaves very differently. Instead of integrating with the surrounding tissue, it keeps its identity and induces a secondary embryo with a neural tube, notochord, and somites formed by the host tissue (Spemann, 1918).",
      "section": "Using Triton taeniatus embryos at early gastrula stages",
      "primary_topic": "Organizer",
      "secondary_topics": [
        "blastopore lip",
        "induction",
        "secondary embryo",
        "neural tube",
        "notochord",
        "somites",
        "heteroplastic transplantation"
      ],
      "chunk_summary": "Transplantation of the blastopore lip organizer induces a secondary embryo in the host, demonstrating its unique inductive properties.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Spemann and Mangold (1924) demonstrated the organizing properties of the dorsal lip of the blastopore (the organizer) in amphibian embryos.  Xenoplastic transplantation, such as transplanting fish organizer from Danio rerio into amphibian Triturus, can induce a neural plate of the host's size, even if the grafted organizer is smaller than the host's (Oppenheimer, 1936).  These experiments are crucial for understanding how borders of structures are established during morphogenesis and how intercellular signals coordinate cells to contribute to the overall target morphology.",
      "section": "Spemann and Mangold",
      "primary_topic": "Organizer",
      "secondary_topics": [
        "xenoplastic transplantation",
        "neural plate induction",
        "morphogenesis",
        "intercellular signaling",
        "Danio rerio",
        "Triturus",
        "Spemann-Mangold organizer"
      ],
      "chunk_summary": "Classic experiments by Spemann and Mangold, including xenoplastic transplantations, reveal the organizer's role in inducing neural plate formation and coordinating morphogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Mangold used xenoplastic transplantations between Triton and Axolotl to study balancer development. Triton develops adhesive threads during early larval stages, while Axolotl does not. This cross-species approach allowed for investigation of the factors influencing the presence or absence of these structures.",
      "section": "Mangold used xenoplastic transplantations to study the development",
      "primary_topic": "Xenoplastic transplantation",
      "secondary_topics": [
        "balancer development",
        "Triton",
        "Axolotl",
        "adhesive threads",
        "larval stages",
        "cross-species transplantation"
      ],
      "chunk_summary": "Mangold's xenoplastic transplantation experiments using Triton and Axolotl investigated the development of balancer adhesive threads.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Transplantation of Axolotl neural plate tissue into the flank or blastocoel of Triton embryos at the neurula stage induced ectopic adhesive threads; in contrast, transplantation of Triton neural plate into Axolotl neurula would not induce any adhesive thread development, illustrating a technique for determining which tissues are responsible for specific anatomical features.",
      "section": "Transplantation of Axolotl neural plate tissue into the flank or blastocoel",
      "primary_topic": "Tissue Transplantation",
      "secondary_topics": [
        "Axolotl",
        "Triton",
        "neural plate",
        "ectopic adhesive threads",
        "neurula stage",
        "embryo",
        "transplantation"
      ],
      "chunk_summary": "Cross-species transplantation of neural plate tissue between Axolotl and Triton embryos reveals that Axolotl tissue induces ectopic adhesive threads in Triton, but not vice-versa, demonstrating a method for identifying tissue-specific contributions to anatomical development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In a second set of experiments, Spemann demonstrated the role of the epidermis in balancer development.  He transplanted presumptive epidermis tissue from Triton embryos into the future face region of Axolotl embryos. This resulted in the formation of adhesive threads, structures characteristic of the Triton balancer, in the Axolotl. This cross-species transplantation experiment highlighted the instructive capacity of the Triton epidermis to induce balancer formation, even in a different species.",
      "section": "In a second set of experiments",
      "primary_topic": "Epidermis induction",
      "secondary_topics": [
        "balancer development",
        "transplantation",
        "Triton",
        "Axolotl",
        "epidermis",
        "adhesive threads",
        "cross-species experiment"
      ],
      "chunk_summary": "Transplanting Triton epidermis into Axolotl embryos induced balancer-like structures, demonstrating the epidermis's role in balancer development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Conversely, the transplantation of Axolotl presumptive epidermis results only in the development of structures that are familiar to the Axolotl epidermis, such as eye lenses and gills (Mangold, 1931). These experiments illustrate the interplay between a tissue with an inductive capacity and the induced tissue itself, which needs to possess the potency to develop a given structure under the influence of the inducer.",
      "section": "Conversely",
      "primary_topic": "Inductive Capacity",
      "secondary_topics": [
        "Axolotl",
        "epidermis",
        "transplantation",
        "tissue induction",
        "developmental potency",
        "lens",
        "gills"
      ],
      "chunk_summary": "Transplantation experiments in Axolotl demonstrate the interplay between inductive signals from one tissue and the developmental potential of the responding tissue.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Along similar lines, Sengel and Dhouailly performed a series of dermo-epidermal recombination experiments between reptiles, birds, and mammals, studying the development of the corresponding cutaneous structures of scales, feathers, and hair (Fig. 2D). Dermo-epidermal recombination through xenoplastic grafting of the epidermis between different species has shown that the induction and development of cutaneous structures such as scales, feathers, and hair are a two-step process. In the first step, the dermis exerts a non-class specific induction signal inducing the differentiation of epidermal placodes (precursor of the specific structure such as scale, hair), which means that, e.g., mouse dermis can induce the development of feather formation and, conversely, chicken dermis can induce the formation of hair papillae.",
      "section": "[PAGE 9] Along similar lines, Sengel and Dhouailly performed a series of",
      "primary_topic": "Dermal Induction",
      "secondary_topics": [
        "dermo-epidermal recombination",
        "xenoplastic grafting",
        "cutaneous structures",
        "scales",
        "feathers",
        "hair",
        "epidermal placodes",
        "species specificity"
      ],
      "chunk_summary": "Initial dermo-epidermal interactions in cutaneous structure development are not species-specific, allowing cross-species induction of placodes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "9"
    },
    {
      "text": "A second dermal induction is required for proper development, which is class-specific and cannot be transmitted across species. As a result, the development of cutaneous structures in recombinants gets arrested at an early stage (Dhouailly, 1975; Sengel, 2003; Sengel and Dhouailly, 1977).",
      "section": "[PAGE 9] Along similar lines, Sengel and Dhouailly performed a series of",
      "primary_topic": "Species Specificity",
      "secondary_topics": [
        "dermal induction",
        "cutaneous structures",
        "cross-species grafting",
        "developmental arrest",
        "class-specific signals"
      ],
      "chunk_summary": "Later stages of cutaneous structure development require species-specific dermal signals, leading to developmental arrest in cross-species recombinants.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "9"
    },
    {
      "text": "An example of developmental control via tissue-level chimerism is observed with respect to intercalary growth. In amphibian, insect, and crustacean limbs, rotation of grafted tissue induces the growth of ectopic structures at the boundary (French, 1980; Meinhardt, 1983; Mittenthal and Nuelle, 1988; Muneoka and Murad, 1987). This is due to discontinuities in the axial coordinates of tissue: sites at which neighboring cells possess non-adjacent positional information will undergo significant morphogenetic activity to resolve the discrepancy and fill in (intercalate) the missing positional values via growth and remodeling.",
      "section": "An example of developmental control via tissue",
      "primary_topic": "Intercalary Growth",
      "secondary_topics": [
        "tissue chimerism",
        "ectopic structures",
        "positional information",
        "morphogenesis",
        "axial coordinates",
        "limb regeneration",
        "grafting"
      ],
      "chunk_summary": "Tissue-level chimerism, particularly the rotation of grafted tissue in amphibian, insect, and crustacean limbs, leads to intercalary growth due to discontinuities in axial coordinates and positional information.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Such experiments in vertebrate limbs and planaria (Agata et al., 2003; Saito et al., 2003)) reveal that informational chimerism (with respect to positional information) is detected by tissue and used as an input to morphogenetic decision-making to coordinate growth and repair.",
      "section": "An example of developmental control via tissue",
      "primary_topic": "Informational Chimerism",
      "secondary_topics": [
        "positional information",
        "morphogenesis",
        "growth control",
        "tissue repair",
        "planaria",
        "vertebrate limbs",
        "developmental plasticity"
      ],
      "chunk_summary": "Experiments in vertebrate limbs and planaria demonstrate that tissues detect informational chimerism and use it to guide morphogenetic decision-making for growth and repair.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Remarkably, the same phenomenon is observed in single cells (such as ciliates, (Nelsen and Frankel, 1989; Shi et al., 1991)), suggesting that this design principle is re-used at different levels of organization, from subcellular to tissue-level positional information (Agata et al., 2003).",
      "section": "Remarkably",
      "primary_topic": "Scaling of Bioelectric Patterning",
      "secondary_topics": [
        "positional information",
        "single cells",
        "ciliates",
        "subcellular",
        "tissue-level",
        "bioelectric signaling",
        "design principle"
      ],
      "chunk_summary": "Bioelectric positional information encoding is observed across multiple scales, from single cells like ciliates to tissues, suggesting a conserved design principle.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Saito et al. (2003) demonstrated an example of tissue-level chimerism influencing patterning.  This involves malignant neoplasms (disordered growth) induced by the in vivo juxtaposition of tissues not normally adjacent, such as testis and spleen or ovary and spleen (Biskind and).  Importantly, these neoplasms arise without DNA damage or oncogenic mutations.",
      "section": "Saito et al",
      "primary_topic": "Tissue Chimerism",
      "secondary_topics": [
        "patterning",
        "malignant neoplasms",
        "in vivo juxtaposition",
        "tissue interactions",
        "cancer",
        "oncogenic mutations",
        "DNA damage"
      ],
      "chunk_summary": "Tissue-level chimerism can induce malignant neoplasms without genetic mutations by juxtaposing normally non-adjacent tissues.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Biskind, 1945; Biskind and Biskind, 1944).",
      "section": "Biskind",
      "primary_topic": "Citations",
      "secondary_topics": [
        "Biskind",
        "1945",
        "1944",
        "references"
      ],
      "chunk_summary": "This chunk provides citations for prior work, likely related to the topic discussed in the subsequent section.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "9"
    },
    {
      "text": "Transplantation can be used to create chimeric bodies consisting of a mix of organs of diverse origins, which is especially helpful to understand not only the structural but also the functional aspects of the part/whole relationship. For example, transplantation of the eye cup has been used to study induction, as transplantation of additional eye cups can induce ectopic lenses (Twitty and Elliott, 1934).",
      "section": "Transplantation can be used to create chimeric bodies consisting of a",
      "primary_topic": "Transplantation",
      "secondary_topics": [
        "chimeric bodies",
        "organ transplantation",
        "induction",
        "ectopic lenses",
        "developmental modularity"
      ],
      "chunk_summary": "Transplantation experiments, such as eye cup transplantation inducing ectopic lenses, reveal the modularity of development and the functional relationship between parts and the whole organism.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This reveals the modularity of development and highlights the control points that can be used in the context of a wild-type genome to modulate anatomy.",
      "section": "Transplantation can be used to create chimeric bodies consisting of a",
      "primary_topic": "Developmental Modularity",
      "secondary_topics": [
        "wild-type genome",
        "anatomical modulation",
        "control points",
        "developmental biology"
      ],
      "chunk_summary": "Transplantation experiments demonstrate the modularity of development and highlight control points within the genome that can be manipulated to alter anatomy.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Trying to understand the underlying mechanisms of organ scaling and organ intrinsic and extrinsic factors involved in size regulation, classical workers used the technique of grafting entire functional units such as limbs, eyes (Harrison, 1929; Twitty and Elliott, 1934), heart (Copenhaver, 1927, 1930, 1939), and spinal cord between the two salamander species Ambystoma tigrinum (larger and faster-growing) and",
      "section": "Trying to understand the underlying mechanisms of organ scaling and",
      "primary_topic": "Organ Scaling",
      "secondary_topics": [
        "size regulation",
        "grafting",
        "limbs",
        "eyes",
        "heart",
        "spinal cord",
        "Ambystoma tigrinum"
      ],
      "chunk_summary": "Classical researchers investigated organ scaling and size regulation by grafting organs like limbs, eyes, hearts, and spinal cords between two salamander species.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Ambystoma punctatum is a smaller and slower-growing species of salamander.  Harrison's classic paper \"Some unexpected results of the heteroplastic transplantation of limbs\" investigated limb development and regeneration using this species.",
      "section": "Ambystoma punctatum",
      "primary_topic": "Ambystoma punctatum",
      "secondary_topics": [
        "salamander",
        "limb development",
        "regeneration",
        "heteroplastic transplantation",
        "Harrison"
      ],
      "chunk_summary": "This chunk introduces Ambystoma punctatum as a model organism used in Harrison's classic study on limb transplantation and regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Harrison observed that forelimbs from A. tigrinum transplanted onto the forelimb position of A. punctatum after a short period of slow growth not only catch up and grow to the size specific for the donor but significantly exceed it in size. On the other hand, transplantation of A. punctatum forelimbs onto A. tigrinum results in even smaller limbs than the original donor limb size (Harrison, 1924). These experiments showed that both limbs are able to grow and develop in the new host environment and suggest that limb size is regulated by a combination of organ-intrinsic properties and extrinsic factors.",
      "section": "Harrison observed that forelimbs from A",
      "primary_topic": "Limb Size Regulation",
      "secondary_topics": [
        "transplantation",
        "growth factors",
        "organ-intrinsic properties",
        "extrinsic factors",
        "A. tigrinum",
        "A. punctatum",
        "limb development"
      ],
      "chunk_summary": "Transplantation experiments between A. tigrinum and A. punctatum demonstrate that limb size is regulated by both intrinsic organ properties and extrinsic host factors.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "One possibility is that A. tigrinum limbs on A. punctatum bodies have a competitive advantage (or higher sensitivity) for those external resources such as nutrients and growth factors (growth hormones) provided by the host body (such competition within the body is reviewed in (Gawne et al., 2020)).",
      "section": "Harrison observed that forelimbs from A",
      "primary_topic": "Growth Factor Competition",
      "secondary_topics": [
        "nutrients",
        "growth hormones",
        "competitive advantage",
        "resource allocation",
        "host-graft interaction"
      ],
      "chunk_summary": "A potential explanation for the observed size differences is that A. tigrinum limbs may outcompete A. punctatum limbs for host-provided nutrients and growth factors.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Transplantation of eyes between two species results in eyes similar in size to the donor species, demonstrating minimal influence of the host environment on eye growth (Twitty and Schwind, 1931).  Chimeric composite eyes, created by exchanging lenses between species, revealed a scaling relationship where lens size regulates retinal development (Harrison, 1929). This coordination is functionally important, as proper eye function relies on the proportional relationship between lens and retina.",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Eye Development",
      "secondary_topics": [
        "transplantation",
        "eye size",
        "lens",
        "retina",
        "interspecies scaling",
        "chimeric eyes"
      ],
      "chunk_summary": "Interspecies eye transplantation experiments demonstrate intrinsic size control mechanisms and a crucial link between lens size and retinal development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In contrast, heart and spinal cord transplants initially grow according to their intrinsic genetic program but later adapt to the host environment (Copenhaver, 1939). This adaptation is functionally crucial, as vital organs like the heart must be appropriately sized relative to the body. Recent research indicates that bioelectric properties (Beane et al., 2013; Daane et al., 2018; Lanni et al., 2019; Perathoner et al., 2014) and biochemical signals (Vollmer et al., 2017a; Yamamoto and Mak, 2017) mediate organ size coordination.",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Organ Size Control",
      "secondary_topics": [
        "heart",
        "spinal cord",
        "transplantation",
        "adaptation",
        "bioelectric properties",
        "biochemical signals",
        "size regulation"
      ],
      "chunk_summary": "Heart and spinal cord transplants exhibit initial intrinsic growth followed by host environment adaptation, with bioelectric and biochemical signals playing a role in size coordination.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Different organs employ distinct size regulation mechanisms.  Transplanting multiple fetal thymus glands into a developing mouse embryo results in normally sized glands (Metcalf, 1963), demonstrating intrinsic size control. Conversely, transplanting multiple fetal spleens leads to coordinated growth, resulting in smaller individual spleens but a total mass comparable to a single normal spleen (Metcalf, 1963; Vollmer et al., 2017b).",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Organ-Specific Regulation",
      "secondary_topics": [
        "thymus",
        "spleen",
        "transplantation",
        "intrinsic size control",
        "coordinated growth",
        "organ mass"
      ],
      "chunk_summary": "Organ size regulation varies; thymus transplants demonstrate intrinsic control, while spleen transplants exhibit coordinated growth maintaining overall mass.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Another rather spectacular finding by Farinella-Ferruzza resulted from xenoplastic transplantation of the tail bud from Axolotl (urodele) onto Anuran embryos during the neural stage. The transplanted tail bud first develops into an anatomically normal and functional tail. When the tail bud is transplanted into the host's limb field, it transforms during metamorphosis into a limb with a variable number of digits (Farinella-",
      "section": "Another rather spectacular finding by Farinella-Ferruzza resulted",
      "primary_topic": "Xenoplastic Transplantation",
      "secondary_topics": [
        "tail bud",
        "Axolotl",
        "Anuran",
        "metamorphosis",
        "limb development",
        "neural stage",
        "xenograft"
      ],
      "chunk_summary": "Farinella-Ferruzza's xenoplastic transplantation of Axolotl tail buds onto Anuran embryos resulted in the development of a functional tail or a limb with variable digits, depending on the transplantation site.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Ferruzza (1950) and Farinella-Ferruzza (1956b), along with Holtfreter (1955), conducted experiments demonstrating the influence of morphogenetic fields on tissue remodeling. Holtfreter's work showed that tail blastema transplanted to heterotopic sites within the limb field could transform into limb or gill-like structures, influenced by the host's morphogenetic field.  These findings suggest that remodeling and morphogenetic changes can be triggered not only by wounding but also by deviations from the correct global form, as seen in the transplanted tail tips which, despite being locally in a correct environment and free from trauma, still underwent transformation due to their incorrect global positioning.",
      "section": "Ferruzza",
      "primary_topic": "Morphogenetic Fields",
      "secondary_topics": [
        "blastema",
        "heterotopic transplantation",
        "tissue remodeling",
        "limb regeneration",
        "global form",
        "morphogenesis"
      ],
      "chunk_summary": "Early experiments by Ferruzza and Holtfreter demonstrated that morphogenetic fields can induce tissue remodeling and transformation even in the absence of wounding, simply by placing tissue in an incorrect global location.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Such data reveal global error-correcting homeostatic loops (Friston et al., 2015; Kuchling et al., 2020; Pezzulo and Levin, 2015, 2016). The classical papers showed that grafts sometimes induced the growth of supernumerary limbs, which could fuse with the induced tail and form a limb-tail chimera.",
      "section": "Such data reveal global error",
      "primary_topic": "Homeostatic Loops",
      "secondary_topics": [
        "error correction",
        "grafts",
        "supernumerary limbs",
        "limb-tail chimera",
        "anatomical target morphologies"
      ],
      "chunk_summary": "Classical experiments demonstrating the existence of error-correcting homeostatic loops revealed that grafts can induce the growth of extra limbs, sometimes forming chimeras.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This suggests fascinating questions around how large-scale anatomical target morphologies (the arrangement that, once achieved, causes further growth and remodeling to cease) are encoded and detected by mixed cell populations.",
      "section": "Such data reveal global error",
      "primary_topic": "Target Morphologies",
      "secondary_topics": [
        "anatomical targets",
        "morphogenesis",
        "cell communication",
        "tissue organization",
        "growth control",
        "remodeling"
      ],
      "chunk_summary": "The observed chimera formation raises questions about how mixed cell populations encode and detect large-scale anatomical target morphologies that regulate growth and remodeling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "One of the most important aspects of organ-level chimerism is the opportunity to study robustness of function. Transplantation of supernumerary eyes at ectopic positions has shown that eyes can adapt to their new position and alien host environments. Axonal projections can still be formed and do not depend on following typical pathways for growing to their proper target structures in the brain (Constantine-Paton and Law, 1978; Harris, 1980; Hibbard, 1959; Sharma and Hollyfield, 1980).",
      "section": "One of the most important aspects of organ",
      "primary_topic": "Organ Chimerism",
      "secondary_topics": [
        "robustness",
        "transplantation",
        "ectopic eyes",
        "axonal projections",
        "brain adaptation"
      ],
      "chunk_summary": "Transplanted supernumerary eyes demonstrate functional robustness by adapting to new locations and forming axonal projections, even outside typical pathways.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In Xenopus embryos, it has been shown that heteroplastically transplanted eye primordia onto ectopic positions along the body, including the tail, not only develop into anatomically functional eyes but develop optic nerve connections to the posterior spinal cord. Behavioral analysis (instrumental training with color cues) confirmed that the tadpoles could perform well in visual tasks despite having no primary eyes, and that the brain could readily learn to interpret visual information generated at ectopic positions without the need for lengthy evolutionary adjustments to the new bodyplan layout (Blackiston and",
      "section": "One of the most important aspects of organ",
      "primary_topic": "Ectopic Eye Function",
      "secondary_topics": [
        "Xenopus",
        "eye primordia",
        "optic nerve",
        "spinal cord",
        "behavioral analysis",
        "visual learning",
        "developmental plasticity"
      ],
      "chunk_summary": "Xenopus embryos with ectopic eyes demonstrate functional vision and spinal cord integration, highlighting the brain's adaptability to novel sensory input without evolutionary adaptation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Levin (2013) explored the role of bioelectric signals in shaping morphology and behavior. This work highlights the importance of ion channels and gap junctions in regulating cell-to-cell communication, which influences large-scale pattern formation during development and regeneration.  The study suggests that bioelectric signaling acts as a key mechanism for controlling complex morphogenetic processes.",
      "section": "Levin",
      "primary_topic": "Bioelectric signaling",
      "secondary_topics": [
        "ion channels",
        "gap junctions",
        "morphogenesis",
        "regeneration",
        "cell communication",
        "developmental biology"
      ],
      "chunk_summary": "Levin (2013) investigated the role of bioelectric signals in morphogenesis and behavior, emphasizing the importance of ion channels and gap junctions in cell communication and pattern formation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Sensory organs, such as eyes, play a significant role in peripheral information processing. To test whether an increase in the sensory process impacts regeneration, researchers examined the role of the dermis in inducing epidermal placodes. The dermis initially exerts a non-class specific induction signal, meaning mouse dermis can induce feather formation and chicken dermis can induce hair papillae.",
      "section": "Sensory organs",
      "primary_topic": "Sensory processing",
      "secondary_topics": [
        "sensory organs",
        "peripheral information processing",
        "regeneration",
        "dermis",
        "epidermal placodes",
        "induction signals"
      ],
      "chunk_summary": "Sensory organs play a role in peripheral information processing, and the dermis exerts a non-class specific induction signal on epidermal placodes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9"
    },
    {
      "text": "A second, class-specific dermal induction is necessary for proper development and cannot be transmitted across species. This species-specific requirement leads to arrested development in cross-species recombinants.  This two-step dermal induction process highlights the complex interplay between tissue layers in organ development.",
      "section": "Sensory organs",
      "primary_topic": "Dermal induction",
      "secondary_topics": [
        "dermal induction",
        "species specificity",
        "cross-species recombinants",
        "development",
        "tissue interaction"
      ],
      "chunk_summary": "A second, class-specific dermal induction is required for proper development, and its absence in cross-species recombinants halts development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "9"
    },
    {
      "text": "An example of developmental control via tissue-level chimerism is observed with respect to intercalary growth. In amphibian, insect, and crustacean limbs, rotation of grafted tissue induces the growth of ectopic structures at the boundary (French, 1980; Meinhardt, 1983; Mittenthal and Nuelle, 1988; Muneoka and Murad, 1987). This is due to discontinuities in the axial coordinates of tissue: sites at which neighboring cells possess non-adjacent positional information will undergo significant morphogenetic activity to resolve the discrepancy and fill in (intercalate) the missing positional values via growth and remodeling.",
      "section": "An example of developmental control via tissue",
      "primary_topic": "Intercalary Growth",
      "secondary_topics": [
        "tissue chimerism",
        "ectopic structures",
        "positional information",
        "morphogenesis",
        "axial coordinates",
        "limb regeneration",
        "grafting"
      ],
      "chunk_summary": "Tissue-level chimerism, particularly the rotation of grafted tissue in amphibian, insect, and crustacean limbs, leads to intercalary growth due to discontinuities in axial coordinates and positional information.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Such experiments in vertebrate limbs and planaria (Agata et al., 2003; Saito et al., 2003)) reveal that informational chimerism (with respect to positional information) is detected by tissue and used as an input to morphogenetic decision-making to coordinate growth and repair.",
      "section": "An example of developmental control via tissue",
      "primary_topic": "Informational Chimerism",
      "secondary_topics": [
        "positional information",
        "morphogenesis",
        "growth control",
        "tissue repair",
        "planaria",
        "vertebrate limbs",
        "developmental plasticity"
      ],
      "chunk_summary": "Experiments in vertebrate limbs and planaria demonstrate that informational chimerism, related to positional information, influences morphogenetic decision-making for growth and repair.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Remarkably, the same phenomenon is observed in single cells (such as ciliates, (Nelsen and Frankel, 1989; Shi et al., 1991)), suggesting that this design principle is re-used at different levels of organization, from subcellular to tissue-level positional information (Agata et al., 2003).",
      "section": "Remarkably",
      "primary_topic": "Positional Information",
      "secondary_topics": [
        "single cells",
        "ciliates",
        "design principle",
        "subcellular",
        "tissue-level",
        "positional information"
      ],
      "chunk_summary": "The principle of positional information is conserved across different levels of biological organization, from single cells like ciliates to tissues.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Saito et al. (2003) demonstrated an example of tissue-level chimerism influencing patterning.  This involves malignant neoplasms (disordered growth) induced by the in vivo juxtaposition of tissues not normally adjacent, such as testis and spleen or ovary and spleen (Biskind and).  This disordered growth occurs without DNA damage or oncogenic mutations.",
      "section": "Saito et al",
      "primary_topic": "Tissue Chimerism",
      "secondary_topics": [
        "patterning",
        "malignant neoplasms",
        "disordered growth",
        "in vivo juxtaposition",
        "testis",
        "spleen",
        "ovary"
      ],
      "chunk_summary": "Tissue-level chimerism can induce disordered growth (malignant neoplasms) without genetic damage when normally non-adjacent tissues are juxtaposed.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Biskind, 1945; Biskind and Biskind, 1944).",
      "section": "Biskind",
      "primary_topic": "Citation",
      "secondary_topics": [
        "Biskind",
        "1945",
        "1944"
      ],
      "chunk_summary": "This chunk cites the work of Biskind from 1944 and 1945.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "9"
    },
    {
      "text": "Organ-level chimeras represent a novel approach to studying the interplay between structure and function in complex biological systems. By combining cells or tissues from different organisms or species, researchers can create hybrid organs that exhibit unique properties and functionalities. This approach allows for the investigation of how different cellular components contribute to overall organ function and can provide insights into the mechanisms underlying development, regeneration, and disease.  The study of organ-level chimeras has the potential to advance our understanding of fundamental biological processes and pave the way for new therapeutic strategies.",
      "section": "6. Organ-level chimeras: from structure to function",
      "primary_topic": "Organ-level chimeras",
      "secondary_topics": [
        "chimeras",
        "organ function",
        "interspecies",
        "tissue engineering",
        "developmental biology",
        "regenerative medicine",
        "disease modeling"
      ],
      "chunk_summary": "Organ-level chimeras, created by combining cells/tissues from different sources, offer a powerful tool for studying structure-function relationships, developmental processes, and disease mechanisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Transplantation can be used to create chimeric bodies consisting of a mix of organs of diverse origins, which is especially helpful to understand not only the structural but also the functional aspects of the part/whole relationship (Fig. 2E). For example, transplantation of the eye cup has been used to study induction, as transplantation of additional eye cups can induce ectopic lenses (Twitty and Elliott, 1934).",
      "section": "Transplantation can be used to create chimeric bodies consisting of a",
      "primary_topic": "Transplantation",
      "secondary_topics": [
        "chimeric bodies",
        "organ transplantation",
        "induction",
        "ectopic lenses",
        "developmental modularity"
      ],
      "chunk_summary": "Organ transplantation, particularly eye cup transplantation, can be used to create chimeric organisms and study developmental induction, revealing modularity in development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This reveals the modularity of development and highlights the control points that can be used in the context of a wild-type genome to modulate anatomy.",
      "section": "Transplantation can be used to create chimeric bodies consisting of a",
      "primary_topic": "Developmental Modularity",
      "secondary_topics": [
        "wild-type genome",
        "anatomical modulation",
        "developmental control points",
        "transplantation"
      ],
      "chunk_summary": "Transplantation experiments reveal the modular nature of development and highlight control points within the genome that can be manipulated to alter anatomy.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Trying to understand the underlying mechanisms of organ scaling and organ intrinsic and extrinsic factors involved in size regulation, classical workers used the technique of grafting entire functional units such as limbs, eyes (Harrison, 1929; Twitty and Elliott, 1934), heart (Copenhaver, 1927, 1930, 1939), and spinal cord between the two salamander species Ambystoma tigrinum (larger and faster-growing) and",
      "section": "Trying to understand the underlying mechanisms of organ scaling and",
      "primary_topic": "Organ Scaling",
      "secondary_topics": [
        "size regulation",
        "grafting",
        "limbs",
        "eyes",
        "heart",
        "spinal cord",
        "Ambystoma tigrinum"
      ],
      "chunk_summary": "Classical researchers investigated organ scaling and size regulation by grafting organs between two salamander species.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Ambystoma punctatum is a smaller and slower-growing species of salamander.  Harrison's classic paper, \"Some unexpected results of the heteroplastic transplantation of limbs,\" investigated aspects of limb development and regeneration using this species.",
      "section": "Ambystoma punctatum",
      "primary_topic": "Ambystoma punctatum",
      "secondary_topics": [
        "salamander",
        "limb development",
        "regeneration",
        "heteroplastic transplantation",
        "Harrison"
      ],
      "chunk_summary": "This chunk introduces Ambystoma punctatum as a research organism used by Harrison in his classic study on limb transplantation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Harrison observed that forelimbs from A. tigrinum transplanted onto the forelimb position of A. punctatum after a short period of slow growth not only catch up and grow to the size specific for the donor but significantly exceed it in size. On the other hand, transplantation of A. punctatum forelimbs onto A. tigrinum results in even smaller limbs than the original donor limb size (Harrison, 1924). These experiments showed that both limbs are able to grow and develop in the new host environment and suggest that limb size is regulated by a combination of organ-intrinsic properties and extrinsic factors.",
      "section": "Harrison observed that forelimbs from A",
      "primary_topic": "Limb Size Regulation",
      "secondary_topics": [
        "transplantation",
        "growth factors",
        "organ-intrinsic properties",
        "extrinsic factors",
        "A. tigrinum",
        "A. punctatum",
        "limb development"
      ],
      "chunk_summary": "Transplantation experiments between A. tigrinum and A. punctatum demonstrate that limb size is regulated by both intrinsic organ properties and extrinsic host factors.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "One possibility is that A. tigrinum limbs on A. punctatum bodies have a competitive advantage (or higher sensitivity) for those external resources such as nutrients and growth factors (growth hormones) provided by the host body (such competition within the body is reviewed in (Gawne et al., 2020)).",
      "section": "Harrison observed that forelimbs from A",
      "primary_topic": "Growth Factor Competition",
      "secondary_topics": [
        "nutrients",
        "growth hormones",
        "competitive advantage",
        "resource allocation",
        "host-graft interaction"
      ],
      "chunk_summary": "A potential explanation for the observed size differences is that A. tigrinum limbs may outcompete A. punctatum limbs for host-provided nutrients and growth factors.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Transplantation of eyes between two species results in eyes similar in size to the donor species, demonstrating minimal influence of the host environment on eye growth (Twitty and Schwind, 1931).  Chimeric composite eyes, created by exchanging lenses between species, revealed a scaling relationship where lens size regulates retinal development (Harrison, 1929). This coordination is functionally important, as proper eye function relies on the proportional relationship between lens and retina.",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Eye Development",
      "secondary_topics": [
        "transplantation",
        "eye size",
        "lens",
        "retina",
        "interspecies scaling",
        "chimeric eyes"
      ],
      "chunk_summary": "Interspecies eye transplantation experiments reveal intrinsic size control mechanisms and a crucial link between lens size and retinal development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In contrast, heart and spinal cord transplants initially grow according to their intrinsic genetic program but later adapt to the host environment (Copenhaver, 1939). This adaptation is functionally critical, ensuring appropriate organ size relative to the body. Recent studies have identified bioelectric properties (Beane et al., 2013; Daane et al., 2018; Lanni et al., 2019; Perathoner et al., 2014) and biochemical signals (Vollmer et al., 2017a; Yamamoto and Mak, 2017) as mechanisms coordinating organ size control.",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Organ Size Control",
      "secondary_topics": [
        "heart",
        "spinal cord",
        "transplantation",
        "adaptation",
        "bioelectric properties",
        "biochemical signals",
        "intrinsic genetic program"
      ],
      "chunk_summary": "Heart and spinal cord transplants demonstrate initial intrinsic growth followed by host environment adaptation, with bioelectric and biochemical signals implicated in size regulation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Different organs exhibit distinct size regulation mechanisms.  Transplanting multiple fetal thymus glands into a developing mouse embryo results in normal-sized glands (Metcalf, 1963), demonstrating intrinsic size control. Conversely, transplanting multiple fetal spleens leads to coordinated growth, resulting in smaller individual spleens but a total mass comparable to a single normal spleen (Metcalf, 1963; Vollmer et al., 2017b).",
      "section": "Transplantation of eyes between the two species results in eyes very",
      "primary_topic": "Organ-Specific Regulation",
      "secondary_topics": [
        "thymus",
        "spleen",
        "transplantation",
        "intrinsic size control",
        "coordinated growth",
        "organ mass"
      ],
      "chunk_summary": "Thymus and spleen transplantation experiments highlight organ-specific size regulation mechanisms, with the thymus exhibiting intrinsic control and the spleen demonstrating coordinated growth.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Another rather spectacular finding by Farinella-Ferruzza resulted from xenoplastic transplantation of the tail bud from Axolotl (urodele) onto Anuran embryos during the neural stage. The transplanted tail bud first develops into an anatomically normal and functional tail. When the tail bud is transplanted into the host's limb field, it transforms during metamorphosis into a limb with a variable number of digits (Farinella-",
      "section": "Another rather spectacular finding by Farinella-Ferruzza resulted",
      "primary_topic": "Xenoplastic Transplantation",
      "secondary_topics": [
        "tail bud",
        "Axolotl",
        "Anuran",
        "metamorphosis",
        "limb development",
        "neural stage",
        "xenograft"
      ],
      "chunk_summary": "Farinella-Ferruzza's xenoplastic transplantation of Axolotl tail buds onto Anuran embryos resulted in the development of a functional tail or a limb with variable digits, depending on the transplantation site.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Ferruzza (1950) and Farinella-Ferruzza (1956b), along with Holtfreter (1955), conducted experiments demonstrating the influence of morphogenetic fields on tissue remodeling. Holtfreter's work showed that tail blastema transplanted to heterotopic sites within the limb field could transform into limb or gill-like structures, influenced by the host's morphogenetic field. These findings suggest that remodeling and morphogenetic changes can be triggered not only by wounding but also by deviations from the correct global form, as seen in the transformation of transplanted tail tips despite their lack of local trauma.",
      "section": "Ferruzza",
      "primary_topic": "Morphogenetic Fields",
      "secondary_topics": [
        "blastema",
        "transplantation",
        "heterotopic",
        "remodeling",
        "tissue regeneration",
        "limb field",
        "gill",
        "morphogenesis"
      ],
      "chunk_summary": "Early experiments by Ferruzza and Holtfreter demonstrated that morphogenetic fields can induce tissue remodeling and transformation even in the absence of local injury.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Such data reveal global error-correcting homeostatic loops (Friston et al., 2015; Kuchling et al., 2020; Pezzulo and Levin, 2015, 2016). The classical papers showed that grafts sometimes induced the growth of supernumerary limbs, which could fuse with the induced tail and form a limb-tail chimera.",
      "section": "Such data reveal global error",
      "primary_topic": "Homeostatic Loops",
      "secondary_topics": [
        "error correction",
        "grafts",
        "supernumerary limbs",
        "limb-tail chimera",
        "tissue regeneration",
        "developmental biology"
      ],
      "chunk_summary": "Studies reveal the existence of homeostatic loops that correct errors in biological systems, as evidenced by graft-induced growth of extra limbs that can fuse with tails, forming chimeras.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This suggests fascinating questions around how large-scale anatomical target morphologies (the arrangement that, once achieved, causes further growth and remodeling to cease) are encoded and detected by mixed cell populations.",
      "section": "Such data reveal global error",
      "primary_topic": "Target Morphologies",
      "secondary_topics": [
        "anatomical targets",
        "morphogenesis",
        "cell signaling",
        "tissue patterning",
        "growth control",
        "remodeling",
        "cell populations"
      ],
      "chunk_summary": "The observed phenomena raise questions about how mixed cell populations encode and detect large-scale anatomical target morphologies, which regulate growth and remodeling processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "One of the most important aspects of organ-level chimerism is the opportunity to study robustness of function. Transplantation of supernumerary eyes at ectopic positions has shown that eyes can adapt to their new position and alien host environments. Axonal projections can still be formed and do not depend on following typical pathways for growing to their proper target structures in the brain (Constantine-Paton and Law, 1978; Harris, 1980; Hibbard, 1959; Sharma and Hollyfield, 1980).",
      "section": "One of the most important aspects of organ",
      "primary_topic": "Organ Chimerism",
      "secondary_topics": [
        "robustness",
        "transplantation",
        "ectopic eyes",
        "axonal projections",
        "brain adaptation"
      ],
      "chunk_summary": "Transplanted supernumerary eyes demonstrate functional robustness by adapting to new locations and forming axonal projections regardless of typical pathways.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In Xenopus embryos, it has been shown that heteroplastically transplanted eye primordia onto ectopic positions along the body, including the tail, not only develop into anatomically functional eyes but develop optic nerve connections to the posterior spinal cord. Behavioral analysis (instrumental training with color cues) confirmed that the tadpoles could perform well in visual tasks despite having no primary eyes, and that the brain could readily learn to interpret visual information generated at ectopic positions without the need for lengthy evolutionary adjustments to the new bodyplan layout (Blackiston and",
      "section": "One of the most important aspects of organ",
      "primary_topic": "Ectopic Eye Function",
      "secondary_topics": [
        "Xenopus",
        "eye primordia",
        "optic nerve",
        "spinal cord",
        "behavioral analysis",
        "visual learning",
        "brain plasticity"
      ],
      "chunk_summary": "Xenopus embryos with ectopic eyes demonstrate functional vision and brain plasticity, indicating the brain's ability to adapt to novel sensory input without evolutionary adjustments.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Levin (2013) explored the role of bioelectric signals in shaping morphology and behavior. This work highlights the importance of ion channels and bioelectric gradients in regulating cellular processes during development and regeneration.",
      "section": "Levin",
      "primary_topic": "Bioelectric signaling",
      "secondary_topics": [
        "ion channels",
        "morphogenesis",
        "regeneration",
        "bioelectric gradients",
        "cell communication",
        "developmental biology"
      ],
      "chunk_summary": "Levin (2013) investigated the influence of bioelectric signals on morphology and behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Sensory organs, such as eyes, play a significant role in peripheral information processing. To test whether an increase in the sensory capacity could increase the learning rate in animals, removal of naturally occurring eyes and/or transplantations of ectopic eyes onto salamander larvae were performed (Schneider and Pietsch, 1968). Using a light-dependent behavioral avoidance assay, acquisition rates were tested in normal salamanders with two eyes, one eye, Triclops with three eyes (two natural eyes plus an additional eye), and Cyclops with the two normal eyes removed and one grafted eye.",
      "section": "Sensory organs",
      "primary_topic": "Sensory Capacity",
      "secondary_topics": [
        "eyes",
        "learning rate",
        "salamanders",
        "transplantation",
        "behavioral assay",
        "information processing"
      ],
      "chunk_summary": "Experiments involving eye removal and transplantation in salamanders were conducted to investigate the relationship between sensory capacity and learning rate.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "10"
    },
    {
      "text": "Information processing and learning rates were measured. Surprisingly, Cyclops animals (with one grafted eye) learned at a much higher rate (Schneider and Pietsch, 1968), suggesting that there must be other benefits of having two eyes that balance this effect in terms of evolutionary fitness.",
      "section": "Sensory organs",
      "primary_topic": "Learning Rate",
      "secondary_topics": [
        "information processing",
        "Cyclops",
        "evolutionary fitness",
        "eye transplantation"
      ],
      "chunk_summary": "Salamanders with a single grafted eye exhibited surprisingly faster learning rates, implying that having two eyes offers other evolutionary advantages.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "10"
    },
    {
      "text": "Whole and partial brain transplantations have been used to study some basic principles of behavior (Balaban, 1990; Balaban et al., 1988).",
      "section": "Whole and partial brain transplantations have been used to study",
      "primary_topic": "Brain Transplantation",
      "secondary_topics": [
        "behavior",
        "transplantation",
        "brain",
        "partial brain transplant",
        "whole brain transplant"
      ],
      "chunk_summary": "Brain transplantations, both whole and partial, have been employed to investigate fundamental behavioral principles.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Gahr, 2003) and brain development (Balaban et al., 1988; Le Douarin et al., 1997; Long et al., 2001; Streit and Stern, 2014). Chick-quail brain chimeras have been produced by transplanting quail mesencephalic and diencephalic primordium to the chicken brain at the 8- to 15 somite stage for studying crowing behavior. The transplantation resulted in chimeras producing segmented crowing sounds uncharacteristic for chicken, with a temporal pattern specific for quail (Balaban et al., 1988), suggesting that different aspects of behavior have distinct degrees of modularity or localizability.",
      "section": "Gahr",
      "primary_topic": "Brain Chimeras",
      "secondary_topics": [
        "chick-quail chimeras",
        "brain development",
        "crowing behavior",
        "transplantation",
        "modularity",
        "localizability",
        "mesencephalon",
        "diencephalon"
      ],
      "chunk_summary": "Chick-quail brain chimera experiments reveal that crowing behavior, transplanted from quail to chicken, demonstrates species-specific temporal patterns, suggesting modularity and localizability of behavioral traits.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Moreover, beyond inborn instinctual behaviors, the same assays can be used to test the dynamics and localization of learned information - testing the possibility of memory transfer between organisms (Pietsch, 1981; Pietsch and Schneider, 1969). For instance, reports have been published on brain transplantation between salamander larvae and frog tadpoles looking for changes in feeding behavior (Balaban, 2003; Pietsch, 1972; Pietsch, 1981; Pietsch and",
      "section": "Gahr",
      "primary_topic": "Memory Transfer",
      "secondary_topics": [
        "learned information",
        "memory transfer",
        "brain transplantation",
        "feeding behavior",
        "salamander",
        "frog tadpole",
        "behavioral assays"
      ],
      "chunk_summary": "Beyond innate behaviors, brain transplantation assays can explore the dynamics and localization of learned information, including the potential for memory transfer between organisms, as investigated in studies involving salamander larvae and frog tadpoles.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Schneider (1969) reported the transfer of behavioral patterns and memory, measured as improved performance on specific tasks.",
      "section": "Schneider",
      "primary_topic": "Memory Transfer",
      "secondary_topics": [
        "behavioral patterns",
        "memory transfer",
        "learning",
        "task performance",
        "Schneider"
      ],
      "chunk_summary": "Schneider's 1969 study demonstrated the transfer of learned behaviors and memory enhancement between organisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "If we are committed to the idea that memory resides in the brain, then transferring the memory medium should also transfer the memory. However, amphibian memory transfer experiments have been inconclusive, requiring further investigation into the nature of memories, their encoding/decoding, and the mechanisms of neural tissue cohesion into a cognitive Subject. This relates to the ownership of experience and memory (Ameriks, 1976; Wilson and Arch, 1972).  Attempts to demonstrate this have been made in various animal models (Holt and Bentz, 1983b; Miller and Holt, 1977b; Reinis, 1968; Setlow, 1997).",
      "section": "If we are committed to the idea that memory resides in the brain",
      "primary_topic": "Memory Transfer",
      "secondary_topics": [
        "memory",
        "brain",
        "transfer",
        "amphibians",
        "neural tissue",
        "cognitive subject",
        "animal models"
      ],
      "chunk_summary": "The transfer of memory medium should theoretically transfer memory itself, but amphibian experiments remain inconclusive, prompting further research into memory's nature and neural mechanisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Modern experiments on chimeric memory content have focused on injecting RNA extracted from trained donors' central nervous systems into naïve animals. This has been demonstrated in the marine mollusk Aplysia (Bédécarrats et al., 2018), and with brain and liver RNA extracts and brain tissue homogenate in rats (Holt and Bentz, 1983a; Miller and Holt, 1977a; Whiddon et al., 1976). Therefore, future experiments on chimeric memories within a single organism could involve mixtures of cellular, molecular, or tissue-level information.",
      "section": "If we are committed to the idea that memory resides in the brain",
      "primary_topic": "Chimeric Memory",
      "secondary_topics": [
        "RNA injection",
        "memory transfer",
        "Aplysia",
        "rats",
        "central nervous system",
        "chimeric memory",
        "molecular transfer",
        "tissue transfer"
      ],
      "chunk_summary": "Modern research explores chimeric memory through RNA injections from trained donors into naïve recipients, suggesting future experiments could involve various levels of biological information transfer.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "10"
    },
    {
      "text": "Parabiosis is a surgical technique that involves joining the circulatory systems of two living organisms. This allows for the exchange of blood and other circulating factors between the two individuals. While the section title suggests the relevance of parabiosis to the overall topic of the paper, the lack of further details prevents a deeper analysis of its specific role in this context.  Further information is needed to understand how parabiosis experiments might contribute to the study of bioelectric signaling, morphogenesis, or other related phenomena.",
      "section": "7. Parabiosis",
      "primary_topic": "Parabiosis",
      "secondary_topics": [
        "surgical technique",
        "circulatory systems",
        "exchange of blood",
        "bioelectric signaling",
        "morphogenesis"
      ],
      "chunk_summary": "This section introduces parabiosis as a surgical technique involving the joining of circulatory systems, but lacks further details on its specific application in the study.",
      "position_in_section": "Beginning",
      "certainty_level": "Low",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Even larger-scale organism-level chimeras can be created through parabiosis, a technique first performed in 1864, involving the surgical connection of two bodies to establish a shared circulatory system (Bert, 1864). This method has been employed to investigate embryonic left-right asymmetry in amphibians (von Kraft, 1999) and birds (Levin, 1998, 1999, 2001; Levin et al., 1997).  These studies explored the influence of lateralization molecules.",
      "section": "Even larger",
      "primary_topic": "Parabiosis",
      "secondary_topics": [
        "chimeras",
        "embryonic asymmetry",
        "lateralization",
        "circulatory system",
        "surgical connection",
        "amphibians",
        "birds"
      ],
      "chunk_summary": "Parabiosis, a technique involving the surgical connection of two organisms, has been used to study embryonic left-right asymmetry in amphibians and birds.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Sonic hedgehog and Nodal from one side of one body affects the LR identity of the adjacent side of the second body. This revealed much about the signaling range, timing, and nature of the large-scale asymmetry signals, especially since the geometry and relative ages of the two embryos were controlled during the grafting, showing how specific factors such as Sonic hedgehog and Nodal can cross between embryos.",
      "section": "Sonic hedgehog and Nodal from one side of one body affects the LR",
      "primary_topic": "LR Asymmetry Signaling",
      "secondary_topics": [
        "sonic hedgehog",
        "nodal",
        "embryonic grafting",
        "signaling range",
        "asymmetry signals",
        "embryo geometry"
      ],
      "chunk_summary": "Grafting experiments revealed the range, timing, and nature of large-scale asymmetry signals, particularly how Sonic hedgehog and Nodal cross between embryos and influence LR identity.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Impact the acquisition of identity information by half of the body based on information obtained from the grafted adjacent body.",
      "section": "Sonic hedgehog and Nodal from one side of one body affects the LR",
      "primary_topic": "LR Identity Acquisition",
      "secondary_topics": [
        "sonic hedgehog",
        "nodal",
        "embryonic grafting",
        "identity information",
        "adjacent body influence"
      ],
      "chunk_summary": "Grafted tissue influences the LR identity acquisition of half of the adjacent body.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Punctatum tigrinum whole-body chimeras have been created by uniting the larvae's anterior and posterior portions, resulting in viable graft hybrids with each half and its appendages showing scaling relationships according to the donor species (Burns and Burns, 1929).",
      "section": "Punctatum tigrinum whole",
      "primary_topic": "Chimera Creation",
      "secondary_topics": [
        "chimera",
        "grafting",
        "Punctatum tigrinum",
        "larvae",
        "scaling",
        "appendages",
        "development"
      ],
      "chunk_summary": "Whole-body chimeras of Punctatum tigrinum have been successfully created by joining anterior and posterior larval sections, demonstrating scaling relationships based on the donor.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Church, 1956). Heterochronic parabiosis, which is the surgical fusion of two organisms of different age, e.g. an adult and a juvenile, have been used to study the process of aging, showing that a supply of \"young blood\" or blood serum can counteract the effects of aging at the molecular, structural and functional level (Villeda et al., 2014).",
      "section": "Church",
      "primary_topic": "Parabiosis",
      "secondary_topics": [
        "heterochronic parabiosis",
        "aging",
        "young blood",
        "blood serum",
        "rejuvenation",
        "surgical fusion"
      ],
      "chunk_summary": "Heterochronic parabiosis, the surgical joining of organisms of different ages, has been used to study aging and demonstrates that young blood can counteract age-related effects.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This phenomenon has been shown to be induced by the transfer of factors such as",
      "section": "Church",
      "primary_topic": "Rejuvenation factors",
      "secondary_topics": [
        "blood factors",
        "aging reversal",
        "molecular transfer"
      ],
      "chunk_summary": "The rejuvenating effects of parabiosis are attributed to the transfer of specific factors within the blood.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "GDF11 (Katsimpardi et al., 2014) and hormones like oxytocin (Elabd et al., 2014) contribute to the rejuvenation of aged stem cells, resulting in increased regenerative potential (Conboy et al., 2005).  The impact of young blood on age-related cancer development remains an open question.",
      "section": "GDF",
      "primary_topic": "Stem cell rejuvenation",
      "secondary_topics": [
        "GDF11",
        "oxytocin",
        "aging",
        "stem cells",
        "regeneration",
        "cancer"
      ],
      "chunk_summary": "Factors like GDF11 and oxytocin can rejuvenate aged stem cells and enhance regenerative capacity, but their effect on age-related cancer is unknown.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "A natural form of parabiosis referred to as sexual parasitism is found in some anglerfish species. The males of some anglerfish can be significantly smaller than the females and fuse permanently to the female body, developing a shared circulatory system and becoming dependent on blood-transported nutrients by the host female. In return the males supply the female with sperm, turning the female into a self-fertilizing hermaphrodite (Pietsch, 2005).",
      "section": "A",
      "primary_topic": "Sexual Parasitism",
      "secondary_topics": [
        "parabiosis",
        "anglerfish",
        "fusion",
        "circulatory system",
        "hermaphrodite",
        "reproduction"
      ],
      "chunk_summary": "Some anglerfish exhibit sexual parasitism, where the smaller male fuses with the female, sharing a circulatory system and providing sperm in exchange for nutrients.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Taken together, the work on fusions of entire bodies presents new perspectives on the mechanisms, and the functional consequences, of boundaries on the border between the self and the outside world. It enables the study of homeostatic and other physiological systems when the scale of a single body is radically expanded (being the complementary technique to the study of ex-vivo organ culture which fragments whole bodies into autonomous subunits).",
      "section": "A",
      "primary_topic": "Body Fusion",
      "secondary_topics": [
        "parabiosis",
        "self/non-self",
        "homeostasis",
        "physiological systems",
        "ex-vivo organ culture",
        "boundaries"
      ],
      "chunk_summary": "Studying whole-body fusion provides insights into the concept of self and the consequences of expanding the boundaries of a single organism, offering a complementary approach to ex-vivo organ culture.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "10"
    },
    {
      "text": "Population-level chimeras represent a fascinating area of biological research, involving the combination of cells from different individuals within a single organism. While this section title suggests a complex topic, the lack of further content prevents a detailed analysis of specific mechanisms or experimental approaches.  Further information would be needed to discuss the implications of such chimeras for understanding developmental biology, evolutionary processes, or potential biomedical applications.",
      "section": "8. Population-level chimeras",
      "primary_topic": "Chimeras",
      "secondary_topics": [
        "cell combination",
        "different individuals",
        "organism",
        "developmental biology",
        "evolutionary processes",
        "biomedical applications"
      ],
      "chunk_summary": "This section title introduces the concept of population-level chimeras but lacks the content to elaborate on specific mechanisms or research directions.",
      "position_in_section": "Beginning",
      "certainty_level": "Low",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Populations can be regarded as a very high scale of biological organization. Living in groups, organisms often show collective behaviors resulting in synchronized movement and migration patterns as observed in fish schools and animal flocks, the formation of the migrating slug in Dictyostelium, dynamics of cancer cells, and even bacteria in biofilms. The spatio-temporal structures formed by organismal groups are studied by the field of collective intelligence.",
      "section": "Populations can be regarded as a very high scale of biological or",
      "primary_topic": "Collective Behavior",
      "secondary_topics": [
        "organismal groups",
        "synchronized movement",
        "migration patterns",
        "collective intelligence",
        "spatio-temporal structures",
        "Dictyostelium",
        "cancer cells",
        "biofilms"
      ],
      "chunk_summary": "Organisms in populations exhibit collective behaviors, forming spatio-temporal structures studied by the field of collective intelligence.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Collective intelligence illustrates important invariants between the computations of patterning agents in morphospace and those of behavioral systems in functional space at this larger scale.",
      "section": "Populations can be regarded as a very high scale of biological or",
      "primary_topic": "Collective Intelligence",
      "secondary_topics": [
        "morphospace",
        "functional space",
        "patterning agents",
        "behavioral systems",
        "computations"
      ],
      "chunk_summary": "Collective intelligence reveals commonalities between computations in morphospace and functional space at the population level.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Eusocial insects such as ants and termites are known for their ability to collectively build nests and mounds resulting in structures which can be several meters high (Korb, 2003), with complex architecture and functionality maintaining homeostasis (Turner, 2009a). The architecture of the mound depends on the species and the environmental conditions (Ocko et al., 2019).",
      "section": "Eusocial insects such as ants and termites are known for their ability",
      "primary_topic": "Collective Construction",
      "secondary_topics": [
        "eusocial insects",
        "nest building",
        "mound architecture",
        "homeostasis",
        "environmental factors"
      ],
      "chunk_summary": "Eusocial insects like ants and termites build large, complex nests and mounds whose architecture depends on species and environment, contributing to homeostasis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The mound structure itself is involved in maintaining homeostasis between the termites and its own structure, regulating temperature, carbon dioxide concentrations and air humidity at constant levels (also referred to as extended or embodied physiology) (Turner, 2005). Furthermore, it shows characteristics of a living organism, such as growth, development and regeneration mediated by feedback loops between the mound and the termites (Ocko et al., 2019;",
      "section": "Eusocial insects such as ants and termites are known for their ability",
      "primary_topic": "Mound Homeostasis",
      "secondary_topics": [
        "extended physiology",
        "embodied physiology",
        "temperature regulation",
        "CO2 regulation",
        "humidity regulation",
        "growth",
        "development",
        "regeneration",
        "feedback loops"
      ],
      "chunk_summary": "The mound structure maintains homeostasis through regulating temperature, CO2, and humidity, exhibiting characteristics of a living organism with growth, development, and regeneration mediated by feedback loops with the termites.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Turner (2009b).",
      "section": "Turner",
      "primary_topic": "Citation",
      "secondary_topics": [
        "Turner",
        "2009b",
        "reference"
      ],
      "chunk_summary": "This chunk cites Turner (2009b).",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "These structures can be understood as a form of an extended phenotype or body (Turner, 2004). As an analog to cells which use themselves as building blocks to build the body of a multicellular organism through the process of morphogenesis, termites build the structure of their mounds using soil as material. Since no single termite is thought to have an internal representation of the actual mound structure, the collective must rely upon simple genetically encoded behavioral rules that use local information (such as pheromones) to successfully build the mound (Ocko et al., 2019) - a classic example of emergent complexity arising from parallel execution of local rules by active agents.",
      "section": "These structures can be understood as a form of an extended",
      "primary_topic": "Extended Phenotype",
      "secondary_topics": [
        "stigmergy",
        "morphogenesis",
        "emergent complexity",
        "collective intelligence",
        "pheromones",
        "termites",
        "local rules"
      ],
      "chunk_summary": "Termite mounds are an example of an extended phenotype, built through emergent complexity arising from local interactions and pheromone signaling, analogous to morphogenesis in multicellular organisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "11"
    },
    {
      "text": "Such animals also utilize an indirect form of communication via deposited chemical signals, known as stigmergy (Theraulaz and Bonabeau, 1999). This enables the collective intelligence of the hive to coordinate the building of complex mound structures, using the environment as an informational scratchpad - the memory medium of the collective intelligence of the group (Heylighen, 2016a, 2016b).",
      "section": "These structures can be understood as a form of an extended",
      "primary_topic": "Stigmergy",
      "secondary_topics": [
        "chemical signals",
        "collective intelligence",
        "communication",
        "environment",
        "information processing",
        "termites",
        "mound building"
      ],
      "chunk_summary": "Stigmergy, communication via environmental chemical signals, facilitates collective intelligence in termites, allowing them to coordinate complex mound construction.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "11"
    },
    {
      "text": "Khuong et al. (2016a, 2016b) demonstrated the multi-scale nature of coordinating structure and function, a design principle also observed in bacteria colonies (Gloag et al., 2016).",
      "section": "Khuong et al",
      "primary_topic": "Multi-scale coordination",
      "secondary_topics": [
        "structure",
        "function",
        "bacteria",
        "colony",
        "morphogenesis"
      ],
      "chunk_summary": "The principle of coordinating structure and function across scales is evident in both multicellular organisms and bacterial colonies.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This same principle is used by cells within the body, which utilize extracellular matrix information to coordinate somatic morphogenesis (Yan and Lin, 2009).",
      "section": "Khuong et al",
      "primary_topic": "Somatic morphogenesis",
      "secondary_topics": [
        "extracellular matrix",
        "cell communication",
        "tissue organization",
        "development"
      ],
      "chunk_summary": "Cells use extracellular matrix information to coordinate somatic morphogenesis, demonstrating the multi-scale nature of this coordination principle.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Since the mound architecture emerges from non-linear collective behavior based on local information and local interactions, it presents us (as does morphogenesis) with the inverse problem of trying to predict its shape from known behaviors of individual ants. Parallel to the problem of inferring interventions in regenerative medicine, one could ask which ant behaviors need to be changed to alter mound structure toward a specific shape, and whether this is most efficiently done by manipulating the genes of the ants or by specific stimuli during the construction process.",
      "section": "Since the mound architecture emerges from non",
      "primary_topic": "Mound Morphogenesis",
      "secondary_topics": [
        "collective behavior",
        "local interactions",
        "inverse problem",
        "regenerative medicine",
        "genetic manipulation",
        "environmental stimuli"
      ],
      "chunk_summary": "Predicting mound shape from individual ant behaviors is an inverse problem, similar to regenerative medicine, and can be approached by manipulating ant genes or environmental stimuli.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Much could be learned by introducing into the collective biological or engineered individuals whose behavior differs from that of others.",
      "section": "Since the mound architecture emerges from non",
      "primary_topic": "Experimental Manipulation",
      "secondary_topics": [
        "engineered individuals",
        "collective behavior",
        "behavioral modification",
        "biological systems"
      ],
      "chunk_summary": "Introducing individuals with altered behavior into the collective can provide insights into the system's dynamics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "It is unfortunately very difficult to perform such \"population-level\" chimeric grafting experiments, as olfaction-based cues are used to implement aggressive self vs. not-self distinctions inhibiting the cooperation of individuals from different populations and species (much as immune incompatibilities hamper certain kinds of somatic chimerism experiments).",
      "section": "It is unfortunately very difficult to perform such",
      "primary_topic": "Chimeric Grafting",
      "secondary_topics": [
        "olfaction",
        "aggression",
        "self-recognition",
        "interspecies chimerism",
        "somatic chimerism",
        "immune incompatibility"
      ],
      "chunk_summary": "Population-level chimeric grafting is challenging due to olfaction-based self-recognition mechanisms that lead to aggression between individuals from different populations and species, similar to immune incompatibilities in somatic chimerism.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Nevertheless, some experiments have worked around this problem to a degree, by amputating a portion of the antenna, the anatomical structure where smell is located (Fielde, 1903). A different method is to raise larvae of different species together, which accustoms them to the odor of individuals from different colonies (Fielde, 1903), and perhaps future work using transgenic ants or use of psychoactive compounds could overcome this resistance to chimerism at the colony level.",
      "section": "It is unfortunately very difficult to perform such",
      "primary_topic": "Overcoming Chimerism Challenges",
      "secondary_topics": [
        "antenna amputation",
        "larval co-rearing",
        "transgenic ants",
        "psychoactive compounds",
        "colony-level chimerism",
        "olfactory adaptation"
      ],
      "chunk_summary": "Experimental approaches to overcome chimerism challenges include antenna amputation, co-rearing larvae of different species to induce olfactory adaptation, and potential future use of transgenic ants or psychoactive compounds.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "11"
    },
    {
      "text": "An exemption to the typical behavior of ants establishing their own colonies are slave-making ants. These ants capture the brood of other ant species, usually closely related ones, and integrate these captured ants into their own workforce.",
      "section": "An exemption to this behavior occurring in nature are slave",
      "primary_topic": "Slave-making ants",
      "secondary_topics": [
        "ant behavior",
        "brood capturing",
        "social parasitism",
        "colony establishment",
        "interspecies interaction",
        "workforce integration"
      ],
      "chunk_summary": "Slave-making ants capture the brood of other ant species to integrate them into their workforce, deviating from typical colony establishment behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Zimmerli (1991) studied the impact of worker ant size on nest architecture.  While the effect on natural nest architecture remains unknown, laboratory studies have demonstrated that ants of varying sizes within the same species and colony create distinct nest structures.",
      "section": "Zimmerli",
      "primary_topic": "Nest Architecture",
      "secondary_topics": [
        "ant behavior",
        "worker size",
        "colony structure",
        "laboratory studies",
        "species variation"
      ],
      "chunk_summary": "Ant worker size influences nest architecture, with different sized ants within the same species and colony building distinct structures in laboratory settings.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "A mixture of small and big ants (Fig. 4) results in the emergence of a new nest structure with an increased number of branches and an architecture that can't be predicted by the sum of nest morphologies created by the two different ant worker types (Kwapich et al., 2018). This and previous studies reveal that ants might use their body length as a template for construction (Khuong et al., 2016b; Kwapich et al., 2018), showing how chimeric experiments can shed light on the computational properties (such as measurement and decision-making mechanisms) of collectives (whether made of cells or whole organisms).",
      "section": "A",
      "primary_topic": "Collective Behavior",
      "secondary_topics": [
        "Ants",
        "Nest Building",
        "Chimeric Experiments",
        "Computational Properties",
        "Morphogenesis",
        "Body Size",
        "Decision-Making"
      ],
      "chunk_summary": "Experiments with mixed-size ant colonies reveal that nest architecture is an emergent property influenced by individual body size and collective decision-making, highlighting the computational properties of collectives.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The relationship between solving problems in 3-dimensional space (such as behavior or mound construction) and in anatomical morphospace (building or repairing specific body structures) is seen in forms such as slime molds. For example, Physarum polycephalum explores and navigates the world via outgrowth and die-back – for this animal, active morphogenesis is its behavior. This fascinating transitional case of problem-solving in very different spaces can also be analyzed by chimerism.",
      "section": "The relationship between solving problems in",
      "primary_topic": "Morphospace & Behavior",
      "secondary_topics": [
        "slime molds",
        "Physarum polycephalum",
        "morphogenesis",
        "behavior",
        "3-dimensional space",
        "anatomical morphospace",
        "chimerism"
      ],
      "chunk_summary": "Slime molds like Physarum polycephalum demonstrate the link between problem-solving in 3D space and anatomical morphospace, where morphogenesis acts as behavior, analyzable through chimerism.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "12"
    },
    {
      "text": "Different species of cellular slime molds are able to form chimeras, under some circumstances resulting in chimeric fruiting bodies. In each case, the number of cells is dominated by one species, determining the morphology of the fruiting body. One paper reports the emergence of a chimeric phenotype. For mixed bacteria involved in biofilm formation, it has been shown that it is possible to generate chimeric biofilms with new fractal or flowerlike biofilm morphologies unlike the inherent morphology of either contributing species.",
      "section": "The relationship between solving problems in",
      "primary_topic": "Chimeric Morphologies",
      "secondary_topics": [
        "cellular slime molds",
        "chimeras",
        "fruiting bodies",
        "biofilms",
        "fractal morphology",
        "bacteria",
        "phenotype"
      ],
      "chunk_summary": "Chimerism in slime molds and bacteria can result in novel morphologies of fruiting bodies and biofilms, respectively, often dominated by one species' cell count.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "12"
    },
    {
      "text": "Many opportunities exist to use microbes to understand the emergence of colony-level form driven by metabolic, game-theoretic, evolutionary, and biophysical phenomena.",
      "section": "The relationship between solving problems in",
      "primary_topic": "Microbial Colony Form",
      "secondary_topics": [
        "microbes",
        "colony-level form",
        "metabolic phenomena",
        "game-theoretic",
        "evolutionary phenomena",
        "biophysical phenomena"
      ],
      "chunk_summary": "Microbial colonies offer opportunities to study the emergence of form driven by various factors, including metabolic, game-theoretic, evolutionary, and biophysical processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "12"
    },
    {
      "text": "Jacob et al., 2006; Jacob et al., 2004; Norris et al., 2011).",
      "section": "Jacob et al",
      "primary_topic": "Citations",
      "secondary_topics": [
        "references",
        "prior work",
        "publications"
      ],
      "chunk_summary": "This chunk lists citations related to the topic.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Population level chimeras can even span across several taxa as is the case for lichen, a composite organism arising from the symbiotic relationship of fungi with algal and/or cyanobacterial photobionts living as extracellular endosymbionts surrounded by fungal filaments. Interestingly, lichen possess a high level of morphological diversity; at the same time, morphologically similar phenotypes can arise from unrelated fungal taxa with various combinations of photobionts.",
      "section": "Population level chimeras can even span across several taxa as is the",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "symbiosis",
        "lichen",
        "fungi",
        "algae",
        "cyanobacteria",
        "morphology",
        "phenotype",
        "taxa"
      ],
      "chunk_summary": "Lichen, a chimeric organism composed of fungi and algal/cyanobacterial photobionts, exhibits high morphological diversity, with similar phenotypes arising from unrelated fungal taxa and diverse photobiont combinations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This provides exciting opportunities to understand cooperation and competition.",
      "section": "This provides exciting opportunities to understand cooperation and",
      "primary_topic": "Cooperation and Competition",
      "secondary_topics": [
        "cooperation",
        "competition",
        "biological systems",
        "evolutionary dynamics",
        "complex systems"
      ],
      "chunk_summary": "The study of cooperation and competition presents exciting opportunities for understanding biological systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "In recent years, synthetic robotic swarms emerged as a new tool for studying the inverse problem: the difficulty of inferring what changes need to be made to the functional properties of individual agents in order to make desired changes to the structure or function of the system-level collective. Individual robots equipped with sensors for distance measurements and programmed with a simple set of behavioral rules are able to form complex structures as a swarm based on local interactions (Korb, 2014; Rubenstein et al., 2014; Werfel et al., 2014). Swarm robotics is a medium in which conceptual aspects of chimerism, and the development of strategies for predicting stable goal states of swarm dynamics, can be studied (Barca and Sekercioglu, 2013; Brambilla et al., 2013; Gomes et al., 2013; Trianni and Campo, 2015).",
      "section": "In recent years",
      "primary_topic": "Swarm Robotics",
      "secondary_topics": [
        "inverse problem",
        "collective behavior",
        "local interactions",
        "chimerism",
        "swarm dynamics",
        "robotic agents"
      ],
      "chunk_summary": "Swarm robotics provides a platform for studying how individual agent properties influence system-level collective behavior and chimerism.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In addition to physical robots, simulations including cellular automata and neural network components, with many surprising and emergent features, are powerful tools with which to understand how large-scale control and global properties arise from the interactions of diverse subunits (Mordvintsev et al., 2020; Wang-Chak Chan, 2018). In this way, Artificial Life research is poised to help biologists develop computational and conceptual tools to understand complexity.",
      "section": "In recent years",
      "primary_topic": "Artificial Life",
      "secondary_topics": [
        "cellular automata",
        "neural networks",
        "emergent properties",
        "large-scale control",
        "computational modeling",
        "simulation"
      ],
      "chunk_summary": "Simulations, including cellular automata and neural networks, are valuable tools in Artificial Life research for understanding how complex systems arise from the interaction of diverse subunits.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "12"
    },
    {
      "text": "At first they led a somewhat wretched existence and lived without rule after the manner of beasts. Oannes ... had the whole body of a fish, but above his fish's head he had another head which was that of a man, and human feet emerged from beneath his fish's tail. He taught them the use of letters, sciences and arts of all kinds. He taught them to construct cities, to found temples, to compile laws, and explained to them the principles of geometrical knowledge.",
      "section": "9. Conclusion",
      "primary_topic": "Civilization Origins",
      "secondary_topics": [
        "Oannes",
        "mythology",
        "knowledge transfer",
        "ancient history",
        "cultural evolution"
      ],
      "chunk_summary": "This mythological account describes Oannes, a fish-human hybrid, as the bringer of civilization, teaching humans language, arts, sciences, and governance.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The significance of chimeras for driving increases in knowledge has been known long before the common era. One of the oldest known mentions of a mythological chimera is the Sumerian amphibious half-man half-fish hybrid god called Oannes (Uanna in Sumerian) from the 4th century BCE. Oannes taught humanity the arts and sciences, how to read and write, how to build cities and how to create a functioning society.",
      "section": "The significance of chimeras for driving increases in knowledge has",
      "primary_topic": "Chimeras in mythology",
      "secondary_topics": [
        "Oannes",
        "Sumerian mythology",
        "knowledge acquisition",
        "cultural evolution",
        "ancient history"
      ],
      "chunk_summary": "Ancient Sumerian mythology, featuring the chimeric god Oannes, demonstrates the long-standing recognition of chimeras' connection to knowledge advancement.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "In short, he was believed to have brought humankind all the emergent properties of culture and civilization. It is an intriguing thought that this pre-scientific civilization was already using the idea of chimerism to understand the emergent properties of human culture.",
      "section": "The significance of chimeras for driving increases in knowledge has",
      "primary_topic": "Chimerism and culture",
      "secondary_topics": [
        "emergent properties",
        "cultural evolution",
        "pre-scientific thought",
        "civilization",
        "mythological interpretation"
      ],
      "chunk_summary": "The Sumerian myth of Oannes suggests that even pre-scientific civilizations used the concept of chimerism to explain the complex emergence of human culture and civilization.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "13"
    },
    {
      "text": "Today, centuries later, we are again using the concept of chimerism in an attempt to understand the emergent properties of life.",
      "section": "Today",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "emergent properties",
        "life",
        "biological systems",
        "developmental biology",
        "synthetic biology"
      ],
      "chunk_summary": "The concept of chimerism is being revisited to understand the emergent properties of life.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "All living things are deeply multi-scale, modular systems defined by the interactions of subunits within and across levels of organization. The science of complexity has given rise to a number of paradigms relevant to understanding collective dynamics, including cellular automata, dynamical systems theory, network theory, and deterministic chaos.",
      "section": "All living things are deeply multi",
      "primary_topic": "Biological Complexity",
      "secondary_topics": [
        "multi-scale systems",
        "modular systems",
        "collective dynamics",
        "cellular automata",
        "dynamical systems theory",
        "network theory",
        "deterministic chaos",
        "complexity science"
      ],
      "chunk_summary": "Living organisms are complex multi-scale systems whose collective dynamics can be understood through paradigms from complexity science, such as cellular automata, dynamical systems theory, and network theory.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Mitchell, 2009). However, the work of predicting system-level properties and multi-scale relationships from interaction rules of molecular components is just beginning; moreover, the general ability to infer low-level rules sufficient to drive desired high-order structures is an even more distant goal. Similarly, evolutionary game theory offers a rich set of formalisms for understanding the conditions under which subsystems with diverse origins and goals might cooperate or compete (Axelrod et al., 2006; Rainey and Monte, 2014; Szathmary and Maynard Smith, 1997). Despite the many studies highlighted above, which reveal aspects of control in specific chimeric cases, inferring general principles and design strategies for understanding chimeric configurations remains as a future goal.",
      "section": "Mitchell",
      "primary_topic": "Predictive Modeling",
      "secondary_topics": [
        "system-level properties",
        "multi-scale relationships",
        "molecular components",
        "evolutionary game theory",
        "cooperation",
        "competition",
        "chimeric configurations"
      ],
      "chunk_summary": "Predicting system-level properties from molecular interactions and understanding the cooperation/competition dynamics in chimeric systems are nascent fields with significant potential.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The hard work of predicting degree of cooperation from subsystem rules, inferring and rationally modifying the large-scale outcomes of such cooperation, and taming combinations of cooperation and competition (Gawne et al., 2020) in biomedical contexts and engineered systems has only begun. This presents an important future challenge and an exciting opportunity to develop the science of complexity and learn to understand, predict, and tame emergence and the scaling of properties. Moving beyond standard components to test the interactions and emergent higher-level dynamics of composite living systems is a powerful tool for reverse-engineering biology.",
      "section": "Mitchell",
      "primary_topic": "Complexity Science",
      "secondary_topics": [
        "cooperation",
        "competition",
        "biomedical contexts",
        "engineered systems",
        "emergence",
        "scaling of properties",
        "reverse-engineering biology",
        "composite living systems"
      ],
      "chunk_summary": "Developing the science of complexity to understand and control emergent properties in composite living systems is a crucial future challenge with significant implications for reverse-engineering biology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "This is especially true since artificially combining subunits that have not had eons of evolutionary selection to hone their interactions reveals aspects of plasticity, interoperability, and origins of novelty. Thus, the study of how molecules, cells, tissues, etc. act to create a specific anatomical outcome requires continuous cycles of inquiry in which understanding of subunits drives insight into larger scales of organization, while in turn questions at these higher levels suggest new experiments to reveal more about the capabilities of the subunits (Fig. 5A,B).",
      "section": "Mitchell",
      "primary_topic": "Reverse-Engineering Biology",
      "secondary_topics": [
        "plasticity",
        "interoperability",
        "novelty",
        "anatomical outcome",
        "multi-scale organization",
        "experimental design",
        "subunit capabilities"
      ],
      "chunk_summary": "Studying artificially combined biological subunits reveals insights into plasticity and novelty, requiring iterative investigation across scales of organization to understand anatomical outcomes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "We suggest that numerous kinds of experiments, in contexts ranging from molecular biology to swarm ecology, are instances of one powerful, common approach: multi-scale chimerism, whether experimental or natural (Table 1). All of these examples have in common the ability to shed light on the key question for the 21st century: how higher-level properties emerge from the properties of individual components.",
      "section": "We suggest that numerous kinds of experiments",
      "primary_topic": "Multi-scale chimerism",
      "secondary_topics": [
        "molecular biology",
        "swarm ecology",
        "emergent properties",
        "systems biology",
        "biological complexity",
        "reductionism",
        "interdisciplinary research"
      ],
      "chunk_summary": "Diverse experiments, from molecular biology to swarm ecology, can be viewed as instances of multi-scale chimerism, offering insights into how higher-level properties emerge from individual components.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Despite its long history, our ability to predict the morphological and functional outcomes of chimeric systems remains limited.  Chimeras, therefore, offer a crucial complement to the study of pure systems, whose predictable development often obscures fundamental questions about morphogenesis.  While it's assumed that frog eggs develop into tadpoles and axolotl eggs into axolotl larvae, the underlying mechanisms governing anatomical homeostasis in mixed-species collectives remain unclear.  This raises questions about how setpoints for anatomical structure are established in chimeric organisms composed of diverse genetic and cellular material.",
      "section": "Despite its long history we have very little ability to make predictions",
      "primary_topic": "Chimeric systems",
      "secondary_topics": [
        "morphogenesis",
        "regulative development",
        "anatomical homeostasis",
        "interspecies chimeras",
        "predictive modeling",
        "developmental biology"
      ],
      "chunk_summary": "Chimeric systems, unlike pure systems, offer valuable insights into the complex mechanisms of morphogenesis and anatomical homeostasis, challenging our predictive abilities and raising fundamental questions about developmental setpoints in mixed-species contexts.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "The central question revolves around the developmental outcome of combining cells from different species, such as frog and axolotl.  Specifically, what anatomical structures will emerge from such a mixture?  Will the resulting organism exhibit characteristics of both species, such as the presence of legs, or will an entirely novel morphology arise?  These questions highlight the need for further research into the complex interplay of genetic and cellular factors in chimeric development.",
      "section": "Despite its long history we have very little ability to make predictions",
      "primary_topic": "Interspecies chimeras",
      "secondary_topics": [
        "frog",
        "axolotl",
        "morphology",
        "genetic regulation",
        "cell fate",
        "developmental plasticity",
        "limb development"
      ],
      "chunk_summary": "The study of interspecies chimeras, like frog-axolotl combinations, seeks to understand how mixed cellular populations determine the resulting organism's morphology and whether novel structures or combinations of species-specific traits will emerge.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "Axolotls do, and Xenopus embryos do not)? And if so, will those legs contain Xenopus cells? How do genomes function in such novel environments? What new aspects of cooperation and competition are revealed (Gawne et al., 2020), when the normally tight linkage between genetic relatedness and somatic proximity is made to diverge? Few predictions on such questions can be made in advance, despite the growing deluge of genetic information and molecular pathway details.",
      "section": "Axolotls do",
      "primary_topic": "Genome Function",
      "secondary_topics": [
        "Xenopus",
        "Axolotl",
        "Genetic Relatedness",
        "Somatic Proximity",
        "Genome Plasticity",
        "Chimeras",
        "Developmental Biology",
        "Cross-species grafting"
      ],
      "chunk_summary": "This section questions how genomes function in novel chimeric environments where genetic relatedness and physical proximity are decoupled, highlighting the limitations of current genetic and molecular data in predicting outcomes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "The ability to mix diverse biological components into whole functional systems has several important consequences. First, it emphasizes fundamental knowledge gaps present but not apparent in work on pure, standard model systems and phylogenetic lineages. Second, it creates opportunities to improve our predictive understanding of morphogenetic scaling and collective decision-making.",
      "section": "The ability to mix diverse biological components into whole",
      "primary_topic": "Synthetic Biology",
      "secondary_topics": [
        "knowledge gaps",
        "model systems",
        "phylogenetic lineages",
        "morphogenetic scaling",
        "collective decision-making",
        "predictive understanding"
      ],
      "chunk_summary": "Combining diverse biological components reveals knowledge gaps in standard model systems and offers opportunities to improve predictive understanding of morphogenesis and collective decision-making.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "13"
    },
    {
      "text": "Third, it provides model systems different from existing organisms, enabling the study of novel forms outside specific contingencies of the biosphere's evolutionary history.",
      "section": "The ability to mix diverse biological components into whole",
      "primary_topic": "Novel Model Systems",
      "secondary_topics": [
        "synthetic biology",
        "evolutionary history",
        "biosphere",
        "novel forms",
        "model organisms"
      ],
      "chunk_summary": "Creating synthetic biological systems allows for studying novel forms outside the constraints of existing organisms and evolutionary history.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "13"
    },
    {
      "text": "Thus, one of the most enticing aspects about chimerism is how it highlights what we do not know. In making explicit our lack of ability to predict the resulting morphology of chimeric forms, this work draws attention to our basic inability to predict anatomical forms from genetic or cell biological data even within one species.",
      "section": "Thus",
      "primary_topic": "Chimerism limitations",
      "secondary_topics": [
        "morphology prediction",
        "genetic data",
        "cell biology",
        "anatomical forms",
        "knowledge gaps"
      ],
      "chunk_summary": "Chimerism reveals our limited understanding of how to predict morphology from genetic or cell biological data.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "As with developmental biology, machine learning could be used to predict the outcomes of such experiments. However, the black box problem (interpreting successful",
      "section": "Thus",
      "primary_topic": "Machine learning",
      "secondary_topics": [
        "predictive modeling",
        "developmental biology",
        "black box problem",
        "interpretability"
      ],
      "chunk_summary": "Machine learning could predict chimeric experiment outcomes, but the interpretability of these models remains a challenge.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null
    },
    {
      "text": "AI systems based on human-understandable rules are crucial for gaining insight beyond mere performance, especially when distinguishing between successful case prediction and a deep understanding of biological algorithms (Sero et al., 2019).  Current knowledge gaps necessitate not only more molecular detail and big data but also the integration of computational and cognitive science techniques. These techniques are essential for understanding the origin, encoding, and decoding of target morphology information for anatomical homeostasis (Levin et al., 2018; Pezzulo and Levin, 2015, 2016).",
      "section": "Al systems via human",
      "primary_topic": "AI and Biological Algorithms",
      "secondary_topics": [
        "AI systems",
        "human-understandable rules",
        "biological algorithms",
        "knowledge gaps",
        "computational science",
        "cognitive science",
        "anatomical homeostasis",
        "morphology"
      ],
      "chunk_summary": "AI systems based on human-understandable rules are needed to bridge knowledge gaps in understanding biological algorithms and anatomical homeostasis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Furthermore, understanding how collectives (molecular, cellular, and swarm) make system-level decisions is critical (Friston et al., 2015; Heylighen, 2013; Kuchling et al., 2020; Sole et al., 2016).  Experimental models for testing insights from these approaches are emerging in synthetic bioengineering (Doursat and Sanchez, 2014; Doursat et al., 2013; Macia et al., 2017; Olle-Vila et al., 2016; Sole, 2016a, 2016b; Sole et al., 2016; Urrios et al., 2016).  These models provide a platform for exploring collective decision-making and its implications for biological systems.",
      "section": "Al systems via human",
      "primary_topic": "Collective Decision-Making",
      "secondary_topics": [
        "system-level decisions",
        "molecular collectives",
        "cellular collectives",
        "swarm intelligence",
        "synthetic bioengineering",
        "experimental models"
      ],
      "chunk_summary": "Synthetic bioengineering provides experimental models for investigating how collectives make system-level decisions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "While numerous facts about specific developmental processes can be discerned based on individual cases described above, there are a few general conclusions suggested by the work on chimerism. The first is that the many disparate types of recombination experiments, done by diverse communities (molecular geneticists, developmental biologists, behavioral scientists working on swarm intelligence, etc.) are facets of one unified approach. Chimerism results from the powerful engineering strategy of modular reconstitution, which can be applied (in parallel) on multiple scales of organization, from molecules to whole communities. Second, this is not only a strategy for scientists to better reverse-engineer life, but also a strategy used by evolution for augmentation of the basic (vertical) Darwinian cycle.",
      "section": "While numerous facts about specific developmental processes can be",
      "primary_topic": "Chimerism",
      "secondary_topics": [
        "Modular reconstitution",
        "Recombination experiments",
        "Evolutionary strategy",
        "Darwinian cycle",
        "Reverse-engineering"
      ],
      "chunk_summary": "Chimerism, achieved through modular reconstitution across multiple scales, is a powerful strategy used by both scientists and evolution.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Third, both the natural and bioengineering versions of chimerism work because of remarkable interoperability of living components at all scales. Recombining DNA, molecular circuits, organelles, cells, tissues, etc. results in coherent living organisms even when their sources are evolutionarily quite distant. This may suggest important revisions to notions of cooperativity based on genetic relatedness toward notions based on informational or computational compatibility. Together with the increasing appreciation of competition within bodies (Gawne et al., 2020), an emphasis on chimerism suggests a systems view of components that interact in highly diverse combinations across boundaries of standard model system bodies (Fields and Levin, 2017; Fields and Levin, 2018; Fields and Levin, 2020).",
      "section": "While numerous facts about specific developmental processes can be",
      "primary_topic": "Interoperability of components",
      "secondary_topics": [
        "Chimerism",
        "Genetic relatedness",
        "Computational compatibility",
        "Systems biology",
        "Competition within bodies",
        "Model systems"
      ],
      "chunk_summary": "The interoperability of living components in chimeras, even from distant evolutionary sources, suggests a shift towards understanding cooperativity based on informational compatibility rather than genetic relatedness.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Fourth, chimerism reveals life's plasticity and ability to produce adaptive structure and function in novel circumstances. Chimeras, consisting of components that have never lived together in evolutionary history, form viable new life forms even without a lengthy history of selection. This reveals the ease and speed with which biological novelty can be produced, and suggests that components can be evolved individually and recombined later – a powerful property that both engineers and evolution exploit for rapid development of complex systems.",
      "section": "While numerous facts about specific developmental processes can be",
      "primary_topic": "Biological novelty",
      "secondary_topics": [
        "Chimerism",
        "Plasticity",
        "Adaptive structure",
        "Evolutionary history",
        "Rapid development",
        "Complex systems"
      ],
      "chunk_summary": "Chimerism demonstrates the plasticity of life and the rapid generation of biological novelty through the recombination of individually evolved components.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "14"
    },
    {
      "text": "These features suggest new aspects of the evolution of bodies and the relationship between genomes and anatomies (Levin, 2020).",
      "section": "These features suggest new aspects of the evolution of bodies and the",
      "primary_topic": "Evolution of Bodies",
      "secondary_topics": [
        "genomes",
        "anatomies",
        "evolutionary biology",
        "developmental biology"
      ],
      "chunk_summary": "The described features offer new perspectives on how bodies evolved and the connection between genetic information and anatomical structures.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "They also have strong implications for synthetic bioengineering efforts to make novel living constructs (Kamm and Bashir, 2014; Kamm et al., 2018).",
      "section": "These features suggest new aspects of the evolution of bodies and the",
      "primary_topic": "Synthetic Bioengineering",
      "secondary_topics": [
        "bioengineering",
        "synthetic biology",
        "living constructs",
        "novel organisms",
        "tissue engineering"
      ],
      "chunk_summary": "These findings are relevant to synthetic bioengineering aiming to create new living structures.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Kriegman et al. (2020) describe constructs that can incorporate DNA, cells, and tissues from various species, along with inorganic elements like nanomaterials and AI-integrated electronics for brain-computer interfaces (Chamola et al., 2020; Green and Kalaska, 2011).",
      "section": "Kriegman et al",
      "primary_topic": "Bioengineered constructs",
      "secondary_topics": [
        "DNA",
        "cells",
        "tissues",
        "nanomaterials",
        "AI",
        "brain-computer interfaces"
      ],
      "chunk_summary": "Bioengineered constructs can combine biological and inorganic components, including AI-integrated electronics for brain-computer interfaces.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "15"
    },
    {
      "text": "The in silico evolution (Kriegman et al., 2020) and design (Kamm and Bashir, 2014; Kamm et al., 2018) of these bioengineered organisms will provide insights into the adaptability of genomic utilization of fundamental physical principles (Arias).",
      "section": "Kriegman et al",
      "primary_topic": "In silico evolution",
      "secondary_topics": [
        "bioengineered organisms",
        "genomic plasticity",
        "physics",
        "design",
        "computational modeling"
      ],
      "chunk_summary": "Computational modeling of bioengineered organisms will illuminate how genomes leverage fundamental physics for adaptable biological function.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Del Angel et al., 2020; Newman, 2016) and cellular decision-making in novel contexts (Baluška and Levin, 2016). At the same time, chimeric assembloids (Panoutsopoulos, 2020; Sahu and Sharan, 2020; Vogt, 2021) will provide critical basic knowledge for biomedical efforts to control complex, system-level outcomes.",
      "section": "Del Angel et al",
      "primary_topic": "Cellular Decision-Making",
      "secondary_topics": [
        "chimeric assembloids",
        "biomedical applications",
        "system-level outcomes",
        "cell behavior",
        "novel contexts"
      ],
      "chunk_summary": "Chimeric assembloids offer valuable insights for understanding cellular decision-making in novel contexts and controlling complex biological systems, with implications for biomedical applications.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "Importantly, advances in this interdisciplinary area are as useful for basic biology and biomedicine as for robotics, which likewise struggles with developing strategies for the design and control of multi-scale robotic swarms (de Oca et al., 2010;",
      "section": "Del Angel et al",
      "primary_topic": "Interdisciplinary Applications",
      "secondary_topics": [
        "robotics",
        "multi-scale systems",
        "biomedicine",
        "basic biology",
        "control strategies",
        "robotic swarms"
      ],
      "chunk_summary": "Advances in understanding and controlling complex biological systems are relevant not only to biology and biomedicine but also to robotics, particularly in the design and control of multi-scale robotic swarms.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null
    },
    {
      "text": "Nishikawa et al., 2016; Patil, 2014; Slavkov et al., 2018). The possibility of chimeric forms with emergent new structures and functions will not only result in useful synthetic living machines and cybernetic organisms, but will also provide a near-infinite collection of \"model systems\" for exploring not only the results of Earth's specific evolutionary timeline, but Life as it Could Be (Langton, 1995).",
      "section": "Nishikawa et al",
      "primary_topic": "Synthetic Biology",
      "secondary_topics": [
        "Chimeric Forms",
        "Emergent Structures",
        "Cybernetic Organisms",
        "Model Systems",
        "Evolutionary Timeline",
        "Synthetic Living Machines"
      ],
      "chunk_summary": "Chimeric life forms with new structures and functions could lead to synthetic living machines and cybernetic organisms, providing model systems for exploring alternative evolutionary possibilities.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null
    },
    {
      "text": "This section consists of references cited throughout the paper and is therefore excluded from semantic chunking as it does not contain prose suitable for analysis.",
      "section": "[PAGE 17] References (excluded)",
      "primary_topic": "References",
      "secondary_topics": [
        "citations",
        "bibliography"
      ],
      "chunk_summary": "This section contains the cited references and is excluded from analysis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "17"
    }
  ],
  "processed_at": "2025-08-14T14:12:23.567825",
  "chunk_count": 234,
  "processing_method": "document_splitting"
}