{
  "chunk_id": "OD5TOsPZIQY_chunk_016",
  "text": "So it gives rise to this incredible plasticity that we're going to look at the implications of this momentarily. What we'd like to know is how does all this work? What's the cognitive Gl that binds individual competent subunits like cells, and in fact molecular networks into cells, into tissues, organs and so on? What are the mechanisms and policies that allow these things to work together and embody a higher order individual that knows things that its parts don't know? Well, we know how this works in our bodies. As far as cognition is concerned, the cognitive glue that binds individual neurons together into us is, is electrophysiology or bioelectricity. It's the electrical networking of the cells in your brain that allow us to know things that our neurons don't know, and so on. Well, it turns out that that in particular is a scheme that evolution had discovered long before there were brains and muscles and things like that, using electricity to bind things together into a larger scale. Collective intelligence goes back to at least bacterial biofilms. It's very ancient. And more generally, I don't have time to talk about this.",
  "token_count": 194,
  "sentence_count": 12,
  "start_sentence": 16,
  "end_sentence": 27,
  "start_time_ms": 839140,
  "end_time_ms": 912970,
  "start_time_seconds": 839.14,
  "end_time_seconds": 912.97,
  "primary_topics": [
    "Cellular Plasticity",
    "Bioelectricity",
    "Collective Intelligence",
    "Evolution of Bioelectricity"
  ],
  "secondary_topics": [
    "Cognitive Glue",
    "Cellular Networking",
    "Bacterial Biofilms",
    "Molecular Networks",
    "Tissue and Organ Development",
    "Evolutionary Biology"
  ],
  "key_terms": [
    "Plasticity",
    "Bioelectricity",
    "Cognitive Glue",
    "Neurons",
    "Electrophysiology",
    "Bacterial Biofilms",
    "Molecular Networks",
    "Collective Intelligence"
  ],
  "content_summary": "The presentation discusses the concept of cellular plasticity and how bioelectricity serves as a 'cognitive glue' that binds individual cells and molecular networks into tissues and organs. The speaker also highlights that this mechanism of using electricity for collective intelligence predates the evolution of brains and muscles, tracing back to bacterial biofilms.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}