{
  "chunk_id": "OD5TOsPZIQY_chunk_027",
  "text": "So it's not that they're more selfish, is that they have smaller selves. The border between self and world shrinks. And whereas before it was part of this big collective that could entertain thoughts about, you know, building a proper skin and muscle and whatever, now it's just an amoeba doing its thing. So metastasis. But what you can do is forcibly reconnect these cells to the collective. And we've done that here. And if you do that, the oncoprotein is still there. It's labeled in red, so you can see it's blazingly expressed. This is the same animal, but there's no tumor. We didn't kill the cells. We didn't fix the genetic lesion. We didn't do any of that. What we did do is force the cells to be part of this electrical network where it is now part of a larger self with larger goals, working on anatomical things instead of being an amoeba in an environment.",
  "token_count": 159,
  "sentence_count": 13,
  "start_sentence": 27,
  "end_sentence": 39,
  "start_time_ms": 1362410,
  "end_time_ms": 1406720,
  "start_time_seconds": 1362.41,
  "end_time_seconds": 1406.72,
  "primary_topics": [
    "Cellular communication",
    "Bioelectricity",
    "Cancer metastasis",
    "Cellular identity"
  ],
  "secondary_topics": [
    "Oncoprotein expression",
    "Genetic lesions",
    "Cellular network",
    "Anatomical development",
    "Cellular reconnection"
  ],
  "key_terms": [
    "Selfish cells",
    "Amoeba",
    "Metastasis",
    "Oncoprotein",
    "Electrical network",
    "Larger self",
    "Anatomical things"
  ],
  "content_summary": "The speaker discusses the concept of cellular identity and communication, particularly in the context of cancer metastasis. They describe an experiment where they forcibly reconnect cancerous cells to the collective cellular network, which results in the cessation of tumor growth despite the continued presence of the oncoprotein.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}