{
  "chunk_id": "OD5TOsPZIQY_chunk_039",
  "text": "So we are at the center of all kinds of continuum, both developmentally, evolutionarily, whatever you think that humans are or can do, you have to have a story for where did it sort of evolve, where does it, does it come from and how does it scale in fact, both with biological changes and technological changes. This again, the standard human category becomes extreme, extremely diffuse because of the plasticity of life that allows us to, that allows it to interact, be interoperable with all kinds of modifications and this, this sort of thing. If, if you in the audience, if you're a therapist or you're interested in the crisis of meaning and helping people through this and, and so on, you've got a set of some constituents that count on you for help. You really have to start thinking about here. Here are your, here are your patients of the future. Okay, this is, you know, the standard human patient is, is not enough. There are going to be all kinds of interesting new beings with all kinds of needs that we are going to have to address in some way.",
  "token_count": 193,
  "sentence_count": 10,
  "start_sentence": 39,
  "end_sentence": 48,
  "start_time_ms": 1921090,
  "end_time_ms": 1976780,
  "start_time_seconds": 1921.09,
  "end_time_seconds": 1976.78,
  "primary_topics": [
    "Human Evolution",
    "Biological Plasticity",
    "Technological Changes",
    "Therapy and Patient Care"
  ],
  "secondary_topics": [
    "Human Development",
    "Bio-technological Interactions",
    "Crisis of Meaning",
    "Future Healthcare Needs",
    "Bioelectric Modifications"
  ],
  "key_terms": [
    "Continuum",
    "Evolve",
    "Scale",
    "Biological Changes",
    "Technological Changes",
    "Plasticity of Life",
    "Interoperable",
    "Constituents",
    "Patients of the Future"
  ],
  "content_summary": "The speaker discusses the continuum of human evolution and development, emphasizing the role of biological plasticity and technological changes. They highlight the need for therapists and healthcare providers to adapt to the evolving needs of future patients, who may be biologically or technologically modified.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Bio-technology",
  "enhanced": true
}