{
  "chunk_id": "OD5TOsPZIQY_chunk_007",
  "text": "For example, we have theories of mapping of functions onto brain structure and so on. And yet there are clinical cases, and Karina Kaufman, I reviewed it in this paper. There are cases where individuals have radically reduced amounts of brain tissue despite normal or even above normal performance. Even that's not simple. The mapping between brain and performance, even that's not easy. But in order to really understand what we are and how we come to be as embodied agents, we need to look at our origins, both evolutionarily and developmentally. All of us start life as a little blob of chemistry and physics. Here's an unfertilized oocyte. Through the incredible process of embryogenesis, we become a fodder for either behavioral science or maybe psychoanalysis and other deeper kinds of things. One thing developmental biology shows us is that there is no magic kind of bright line at which. At which physics ticks over to psychology. There is no special place where that happens. It's a continuous, gradual process, and it's really important to be able to understand that process. And by the way, this is not the end of the road because there are other processes that can happen afterwards, including dissociative disorder known as cancer. I'll talk about that in a minute. And really other very strange things, such as your cells, for example, after the death of the body, your cells continuing their life in a totally novel embodiment such as these anthrobots that I'm going to show you in a minute. And it's also important to note that even the notion of an embryo isn't simple, because if you look at an early blastoderm.",
  "token_count": 279,
  "sentence_count": 18,
  "start_sentence": 7,
  "end_sentence": 24,
  "start_time_ms": 343660,
  "end_time_ms": 445990,
  "start_time_seconds": 343.66,
  "end_time_seconds": 445.99,
  "primary_topics": [
    "Brain-function mapping",
    "Embryogenesis",
    "Developmental biology",
    "Bioelectricity",
    "Cancer"
  ],
  "secondary_topics": [
    "Clinical cases of reduced brain tissue",
    "Evolutionary origins",
    "Transition from physics to psychology",
    "Post-death cellular activity",
    "Anthrobots",
    "Concept of an embryo"
  ],
  "key_terms": [
    "Brain structure",
    "Performance",
    "Embodied agents",
    "Unfertilized oocyte",
    "Behavioral science",
    "Psychoanalysis",
    "Dissociative disorder",
    "Blastoderm"
  ],
  "content_summary": "The speaker discusses the complexity of mapping brain functions to structure, and highlights cases of individuals with reduced brain tissue but normal or superior performance. They emphasize the importance of understanding our evolutionary and developmental origins, from embryogenesis to adulthood, and the continuous process from physics to psychology. The speaker also mentions post-death cellular activity and introduces the concept of 'anthrobots'.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}