{
  "chunk_id": "OD5TOsPZIQY_chunk_026",
  "text": "But these kinds of, these kinds of, for example, morphogenetic systems have huge grandiose goals like building a limb. And no individual cell knows what a finger is or how many fingers you're supposed to have. But the collective absolutely does. And you know that because if you try to deviate it from it, you'll see, you'll see that it knows what the set point is. So there's this question, can we, can we show how connecting cells into a larger network allows them to have larger goals? How do you expand the size of the cognitive lycone? This weird way of thinking about it has therapeutic Benefits. We try to show some practical implications for all this strange stuff that we say so that other people can see why it's useful to think about it this way. Here's a human oncogene injected into a tadpole. It normally makes a tumor. You can track why. It's because oncogenes make the cells disconnect electrically from the rest of the network. When they do that, as far as they're concerned, the rest of the body is just external environment.",
  "token_count": 187,
  "sentence_count": 13,
  "start_sentence": 26,
  "end_sentence": 38,
  "start_time_ms": 1306170,
  "end_time_ms": 1361690,
  "start_time_seconds": 1306.17,
  "end_time_seconds": 1361.69,
  "primary_topics": [
    "Morphogenetic systems",
    "Cellular networks",
    "Bioelectricity",
    "Oncogenes",
    "Tumor development"
  ],
  "secondary_topics": [
    "Cellular cognition",
    "Therapeutic benefits",
    "Electrical disconnection of cells",
    "External environment perception by cells",
    "Practical implications of cellular networks"
  ],
  "key_terms": [
    "Morphogenetic systems",
    "Cognitive lycone",
    "Oncogene",
    "Tumor",
    "Cellular network",
    "Bioelectricity",
    "Therapeutic benefits"
  ],
  "content_summary": "The presentation discusses the concept of morphogenetic systems and cellular networks in the context of bioelectricity. It explores how cells, though individually unaware, collectively form structures like limbs. The speaker also discusses the role of oncogenes in tumor development, where cells disconnect electrically from the rest of the network, perceiving the body as an external environment.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}