{
  "chunk_id": "OD5TOsPZIQY_chunk_041",
  "text": "But even looking at deterministic, extremely simple things that people that computer scientists study, like sorting algorithms already, you see that, yeah, it does the thing the algorithm tells it to do. But if you know how to look, you also find it doing all kinds of interesting side quests that the algorithm does not ask them to do that are, in fact, kinds of, that are things that you would recognize as aspects of cognition, very minimal, but yet there they are. And so, and so I really think this goes all the way down. This ability to have the freedom to express patterns from that space that are not fully determined by the physics of your world or the algorithms that, that we think you are following, it is always richer than that, even in extremely simple systems. And so just, just to remind us again, you know, Magritte was telling us that, that our formal models are not the thing itself. And I would say the same thing. You know, there's a lot of organic thinkers who are down on computationalism, and they say living things aren't, aren't machines. They say, right, nothing is machine because a machine is a formal model that humans have defined to, to handle certain aspects of what physical objects do in the world. And it doesn't fully describe even the simplest kinds of systems, never mind, of course, the biological systems.",
  "token_count": 240,
  "sentence_count": 11,
  "start_sentence": 41,
  "end_sentence": 51,
  "start_time_ms": 2032010,
  "end_time_ms": 2106369,
  "start_time_seconds": 2032.01,
  "end_time_seconds": 2106.369,
  "primary_topics": [
    "Deterministic Systems",
    "Computational Models",
    "Biological Systems"
  ],
  "secondary_topics": [
    "Sorting Algorithms",
    "Cognition",
    "Freedom of Expression in Systems",
    "Formal Models",
    "Organic Thinkers",
    "Physical Objects"
  ],
  "key_terms": [
    "Deterministic",
    "Algorithms",
    "Cognition",
    "Physics",
    "Computationalism",
    "Machines",
    "Biological Systems"
  ],
  "content_summary": "Michael Levin discusses the complexity of deterministic systems, such as sorting algorithms, and how they can exhibit aspects of cognition not dictated by their programming. He emphasizes that computational models, including those used to describe biological systems, are always more complex than their formal definitions, and that nothing, including living things, can be fully described as a machine.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Computer Science",
  "enhanced": true
}