{
  "document_type": "research_paper",
  "title": "Toward an ethics of autoppoietic technology: Stress, care, and intelligence",
  "authors": [
    "Olaf Witkowski",
    "Thomas Doctor",
    "Elizaveta Solomonovna",
    "Bill Duane",
    "Michael Levin"
  ],
  "journal": "BioSystems",
  "publication_year": 2023,
  "doi": "10.1016/j.biosystems.2023.104964",
  "abstract": "The relationship between humans and technology has attracted increasing attention with the advent of ever more sophisticated artificial intelligence. This has led to calls for an \"ethics of technology\" to ensure that technology serves human needs and not rather in a perverse or neglectful relationship with humans. Our model of loops of stress, care, and intelligence in this paper suggests that technology should not be seen as a mere tool or instrument, but rather as a form of artificial agency. We argue that both human and artificial agents, as well as their substrates, are intelligent and can be understood as needing to respond to a perceived mismatch between current and desired future states. We demonstrate through the example of self-constructing loops of chemotaxis and persistence for proposing similar stress, care, intelligence feedback loops (SCI) for virtual, semiome and notions of all the agents and singulares (SCI loops can be seen as individual only by short formulation) and conclude that this loop acknowledges and transforms and begins to seem by the mutually constitutive entanglement within which humans and technology co-evolve. We present a minimal implementation of these dynamics by the SCI loop in an integral environment technology of Vardi's project, considering as foundational both the notions of cognitive domain and its dynamics, and as a concrete implementation the notion of a Biohatsu. We explain, and are thus initiating SCI loops of human and technological agency can be seen as mutually constitutive and fundamentally entangled, rather than in a subordinate, servant, or tool relation, in other words, neither of the other either ontological nor in ethical terms, suggesting instead criteria based on the respect and intelligence suggests an expassive model of technology that is bound by localized limitations and subject to the vagaries of interaction between humans and technology in a way that artificial intelligence is based mutual privileged composition of history of an agents.",
  "extraction_confidence": "high",
  "filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896.pdf",
  "extraction_timestamp": "2025-08-12T22:06:32.712938",
  "extraction_method": "gemini_pro",
  "pages_analyzed": 3
}