{
  "document_type": "research_paper",
  "title": "Machine Learning-Driven Bioelectronics for Closed-Loop Control of Cells",
  "authors": [
    "John Selberg",
    "Mohammad Jafari",
    "Juanita Mathews",
    "Manping Jia",
    "Pattawong Pansodtee",
    "Hanika Dechiraju",
    "Chuanxiao Wu",
    "Sergio Cordero",
    "Alexander Flora",
    "Nebuyu Yonas",
    "Sophia Jannetty",
    "Miranda DiBerardinis",
    "Mircea Teodorescu",
    "Michael Levin"
  ],
  "journal": "Advanced Intelligent Systems",
  "publication_year": 2020,
  "doi": "10.1002/aisy.202000140",
  "abstract": "From the simplest unicellular organisms to complex animals, feedback control based on sensing and actuation is a staple of self-regulation in biological systems. Bioelectronic devices that interface electronic processes and biological components at the cellular level enable the design of closed-loop systems for disease or for directing desired cellular function. Such devices that can be used in sensing and actuation of biological processes have potential for novel therapeutic applications. Due to the complexity of biological systems and the challenge of affecting their innate self-regulation, fluorescence-based measurements are often used to provide real-time information. Herein, bioelectronic proton-conducting devices are integrated with living cells in a closed-loop control system, which continuously assesses and modifies pH in the cell culture media. Proton concentration is measured using genetically encoded fluorescent sensors, and is demonstrated that the real-time actuation using machine learning to provide closed-loop control of biological sensors in living cells. Voltage-controlled bioelectronic devices control pH in the cell culture media, and fluorescence-based measurements dynamically control V_cell toward a desired setpoint. In this fashion, given proof-of-concept of closed-loop control, differentiation, and proliferation. This real-time control opens up many possibilities in bioelectronic regulation control of cell systems.",
  "extraction_confidence": "high",
  "filename": "pdf_20250812_095125_139116.pdf",
  "extraction_timestamp": "2025-08-12T09:52:19.373857",
  "extraction_method": "gemini_pro",
  "pages_analyzed": 3
}