{
  "document_type": "research_paper",
  "title": "The scaling of goals via homeostasis: an evolutionary simulation, experiment and analysis",
  "authors": [
    "Leo Pio-Lopez",
    "Johanna Bischof",
    "Tufté V. LaPalme",
    "Michael Levin"
  ],
  "journal": null,
  "publication_year": null,
  "doi": null,
  "abstract": "All cognitive agents are composite beings. Specifically, complex living agents consist of cells, which are themselves composite beings. Understanding how the collective intelligence of a cell colony scales during evolutionary developmental biology, and the field of machine intelligence all seek an answer to the scaling of biological cognition: what evolutionary dynamics enable individual cells to integrate their activities into a collective level, goal-directed system capable of robustly pursuing specific outcomes? What are the origins of and how is it protected the collective intelligence of individuals during morphogenesis of the body into proportional parts? Here, we report the results of simulations based on the TAME framework, which provides a way to specify bioelectrical signaling among non-neural cells. Our in silico experiments tested the hypothesis that minimal evocative bioelectricity is sufficient for problem-level morphogenesis that homeomorphic morphogenetic scale-up exhibits a number of predicted features, including the use of bioelectric signaling among non-neural cells to compute anatomically relevant positional information and that these emergent scale-up agents collectively (tissue which is small in low setpoints of space perform morphogenesis dynamics to achieve target morphology remodeling of the system recover from perturbation such as induced cancer and birth defects) pursue goals that are not explicitly encoded. Moreover, we observed unexpected behavior of sudden planning and long after the severely similar phenomena. This prediction in a biological system of regenerating planaria, after the ability to stabilize, from the amputated tail end, that the amputated head is able to regenerate and recover quickly.  This is the evolution in scale from minimal goal-directed behavior (homeostatic loops) into higher-level problem-solving agents (e.g., metastable and other forms).",
  "extraction_confidence": "high",
  "filename": "pdf_20250803_124126_780458.pdf",
  "extraction_timestamp": "2025-08-12T09:51:42.733449",
  "extraction_method": "gemini_pro",
  "pages_analyzed": 3
}