{
  "chunk_id": "CXzaq4_MEV8_chunk_050",
  "text": "But because Newton's universe was already sort of haunted by truths that are not determined by anything that happens in the physical world, but in turn affect what does happen I think, I think this was, this was already dead And I think the relationship here, so this is, this is kind of a hypothesis that I'm floating, is that the way to think about mind body interactions is the same way that people think about how the truths of mathematics determine physics And there are lots of aspects of biology For example, cicadas come out at particular at 13 and 17 years because of the way prime numbers work, not because of anything in physics or biology It rests on the properties of prime numbers And Darcy Thompson's book on growth and form in the 20s shows many amazing examples of how biology makes use of this stuff And so I think epiphenomenalism is as hopeless for mathematics as it is for models of mine I think I actually argue for an interactionist model And so the final thing I want to just bring up is this And I don't have time to go into it in detail, but you can grab this paper and take a look what we found long and short by looking at very minimal models, in particular here, sorting algorithms",
  "token_count": 226,
  "sentence_count": 11,
  "start_sentence": 50,
  "end_sentence": 60,
  "start_time_ms": 2409820,
  "end_time_ms": 2481840,
  "start_time_seconds": 2409.82,
  "end_time_seconds": 2481.84,
  "primary_topics": [
    "Mind-body interactions",
    "Mathematics' influence on physics",
    "Biology's use of mathematical properties"
  ],
  "secondary_topics": [
    "Newton's universe",
    "Epiphenomenalism",
    "Interactionist model",
    "Prime numbers in biology",
    "Darcy Thompson's growth and form",
    "Sorting algorithms"
  ],
  "key_terms": [
    "Newton's universe",
    "Epiphenomenalism",
    "Interactionist model",
    "Prime numbers",
    "Darcy Thompson's growth and form",
    "Sorting algorithms",
    "Mind-body interactions"
  ],
  "content_summary": "The speaker proposes a hypothesis that mind-body interactions can be understood similarly to how mathematical truths determine physics. They provide examples of how biology utilizes mathematical properties, such as cicadas emerging in intervals based on prime numbers. The speaker also mentions a paper detailing findings from studying minimal models, specifically sorting algorithms.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Mathematics",
  "enhanced": true
}