{
  "chunk_id": "CXzaq4_MEV8_chunk_044",
  "text": "So this is novel These are novel gene expressions, novel behaviors such as kinematic self replication and responding to sound stimuli that the original material does not do This raises an interesting question and I'll explain why I think this is relevant to consciousness work What you would typically say is that the frog genome over the years of interactions with the environment has produced this kind of things The developmental stages, tadpoles that have certain behaviors, but it also produces xenobots with their own weird developmental sequence and behaviors that have have never existed before There's never been any xenobots, there's never been any selection to be a Good xenobot And so one wants to ask the question, we know when the computations were done to derive a frog, a frog embryo, that was done for the eons that this genome has been butting up against the environment When were the computations done to figure out how to be a good xenobot Because that's never existed And you might say that, well, it has sort of happened at the same time as you evolved a frog",
  "token_count": 187,
  "sentence_count": 10,
  "start_sentence": 44,
  "end_sentence": 53,
  "start_time_ms": 2016470,
  "end_time_ms": 2080460,
  "start_time_seconds": 2016.47,
  "end_time_seconds": 2080.46,
  "primary_topics": [
    "Novel gene expressions",
    "Kinematic self replication",
    "Response to sound stimuli",
    "Frog genome evolution",
    "Xenobot development"
  ],
  "secondary_topics": [
    "Environmental interactions",
    "Developmental stages",
    "Tadpole behaviors",
    "Computational derivation of frog embryos",
    "Evolutionary computations"
  ],
  "key_terms": [
    "Gene expressions",
    "Behaviors",
    "Kinematic self replication",
    "Sound stimuli",
    "Frog genome",
    "Developmental stages",
    "Tadpoles",
    "Xenobots",
    "Computational derivation",
    "Evolutionary computations"
  ],
  "content_summary": "The speaker discusses novel gene expressions and behaviors such as kinematic self-replication and response to sound stimuli. They question when the computations were done to derive a frog and a xenobot, considering the latter has never existed before. The speaker suggests that the computations for the xenobot might have occurred simultaneously with the evolution of the frog.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Evolutionary Biology",
  "enhanced": true
}