{
  "chunk_id": "CXzaq4_MEV8_chunk_043",
  "text": "This is spontaneous I don't think any other creature does this normal or has in the lineage And we can do one other interesting thing We can ask what their transcriptomes look like What does this novel being, what genes do they express Well, it turns out that they express hundreds of new genes that their original age matched embryos do not express And lots of interesting stuff here, but among these genes is a cluster of genes related to hearing or sensitive sensory perception of sound So basically we decided to test this and PI put a speaker underneath these guys and cause some sound and vibration And what we basically see is that they respond You can tell from their behavior that they actually react to these stimuli in ways that actually embryos do not do",
  "token_count": 138,
  "sentence_count": 10,
  "start_sentence": 43,
  "end_sentence": 52,
  "start_time_ms": 1963420,
  "end_time_ms": 2016310,
  "start_time_seconds": 1963.42,
  "end_time_seconds": 2016.31,
  "primary_topics": [
    "Spontaneous gene expression",
    "Sensory perception of sound",
    "Behavioral response to stimuli"
  ],
  "secondary_topics": [
    "Transcriptomes",
    "Novel gene expression",
    "Embryonic development",
    "Bioelectricity",
    "Sound and vibration",
    "Sensory perception",
    "Gene clusters"
  ],
  "key_terms": [
    "Transcriptomes",
    "Gene expression",
    "Sensory perception",
    "Stimuli",
    "Embryos",
    "Cluster of genes",
    "Behavioral response"
  ],
  "content_summary": "The presentation discusses a unique spontaneous gene expression in certain organisms, leading to the expression of hundreds of new genes not found in age-matched embryos. Among these genes, a cluster related to hearing or sensitive sensory perception of sound was identified. The organisms were found to respond behaviorally to sound and vibration stimuli, unlike typical embryos.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}