{
  "chunk_id": "CXzaq4_MEV8_chunk_045",
  "text": "But that of course undermines the whole specificity of environment to outcome That's kind of the point of evolutionary theory, is that there should be very tight specificity between what you're selected for in your environment and what actually happens in the end So now this raises an interesting question In anthrobots and xenobots, where do their goals come from Well, we could say that the goals of these creatures, anatomical goals, physiological set points, transcriptional set points, and so on, come from a history of selection You can't say that for these Where do they come from Where do the cognitive and other capacities of, so the forms of body and of behavior, where do they come from if it's not going to be a history of selection And so now here's kind of the weirdest part of the talk where I'm going to say, say some kind of out there things and we can all decide on what we think",
  "token_count": 162,
  "sentence_count": 9,
  "start_sentence": 45,
  "end_sentence": 53,
  "start_time_ms": 2080460,
  "end_time_ms": 2130710,
  "start_time_seconds": 2080.46,
  "end_time_seconds": 2130.71,
  "primary_topics": [
    "Evolutionary Theory",
    "Anatomical Goals",
    "Physiological Set Points",
    "Transcriptional Set Points",
    "Anthrobots and Xenobots"
  ],
  "secondary_topics": [
    "Environmental Specificity",
    "Outcome Specificity",
    "Cognitive Capacities",
    "Behavioral Forms",
    "Selection History",
    "Body Forms"
  ],
  "key_terms": [
    "Evolutionary Theory",
    "Anatomical Goals",
    "Physiological Set Points",
    "Transcriptional Set Points",
    "Anthrobots",
    "Xenobots",
    "Cognitive Capacities",
    "Selection History"
  ],
  "content_summary": "The speaker discusses the evolutionary theory and its implications on the specificity of environment to outcome. The focus is on anthrobots and xenobots, questioning where their goals and cognitive capacities come from if not from a history of selection.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}