{
  "chunk_id": "CXzaq4_MEV8_chunk_041",
  "text": "However, we can start doing some interesting things So this is calcium signaling Remember, there are no neurons here There's just basically prospective skin cells But what you can do is look at the calcium signaling in these guys and just to focus on one of them It's also interesting if they're talking to each other We don't know that yet But just to look at one, we can look at the connectivity that we see and use the kind of tools that are used to analyze brain connectivity and in particular to analyze things like integrated information So to compare this fi r of our xenobots with the null models as people do in FMRI data And this is work of Thomas Bar Barley and Josh Bongard's lab And PI in my group start to look at what exactly is the same and what's different as what these kinds of metrics tell you about signaling in the brain and beyond And if you do see things like this, you get an interesting You have to answer an interesting question Do we learn from what the method is telling us or do we somehow sort of by fiat assume that it's just income doesn't apply here for whatever reason that we've stretched these things beyond where they need to be applied and if so, why",
  "token_count": 225,
  "sentence_count": 14,
  "start_sentence": 41,
  "end_sentence": 54,
  "start_time_ms": 1851970,
  "end_time_ms": 1920020,
  "start_time_seconds": 1851.97,
  "end_time_seconds": 1920.02,
  "primary_topics": [
    "Calcium signaling",
    "Skin cell connectivity",
    "Brain connectivity analysis",
    "Integrated information"
  ],
  "secondary_topics": [
    "Neuronal communication",
    "Xenobots",
    "FMRI data",
    "Null models",
    "Signal analysis"
  ],
  "key_terms": [
    "Calcium signaling",
    "Neurons",
    "Prospective skin cells",
    "Connectivity",
    "Integrated information",
    "FMRI data",
    "Null models",
    "Xenobots"
  ],
  "content_summary": "The speaker discusses the exploration of calcium signaling in prospective skin cells, likening it to brain connectivity. They mention the use of tools for analyzing brain connectivity and integrated information, comparing it to the functioning of xenobots. They also question the applicability of these methods in this context.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}