{
  "chunk_id": "CXzaq4_MEV8_chunk_036",
  "text": "This is what you will build if you get injured at a future plan time And if you don't get injured, then this stays a latent memory The tissues ignore it until they get injured, and then they obey and construct what this says So you can think about these very, very minimal And by the way, as any good memory, it's permanent So if you take these two headed animals and keep recutting them, they will continuously regenerate as two headed, even though we haven't touched the genetics So this ability to change your memory without changing the hardware So, so normal genome, but now a completely different body plan architecture and the ability to store patterns that are not reflective of what's true right now, that is past or future, but not right now I think these are basal model systems for some of the amazing things our brains do in terms of the time travel that they can, the mental time travel they can do, and so on Okay, so what I've shown you so far is that we can start to think about somewhat alien minds by looking at a situation where the system is navigating a space that is very hard for us to visualize",
  "token_count": 210,
  "sentence_count": 10,
  "start_sentence": 36,
  "end_sentence": 45,
  "start_time_ms": 1653620,
  "end_time_ms": 1718240,
  "start_time_seconds": 1653.62,
  "end_time_seconds": 1718.24,
  "primary_topics": [
    "Bioelectricity",
    "Developmental Biology",
    "Regeneration",
    "Memory in Tissues",
    "Body Plan Architecture"
  ],
  "secondary_topics": [
    "Genetics",
    "Pattern Storage",
    "Time Travel Concept in Biology",
    "Mental Processes",
    "System Navigation"
  ],
  "key_terms": [
    "Latent Memory",
    "Injury",
    "Regeneration",
    "Genome",
    "Body Plan Architecture",
    "Mental Time Travel",
    "System Navigation"
  ],
  "content_summary": "The speaker, Michael Levin, discusses the concept of bioelectricity and its role in tissue regeneration. He explains how tissues have a 'memory' that dictates their regeneration process, even in the absence of genetic changes. He likens this to the brain's ability to 'time travel', storing and recalling patterns not reflective of the current state.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}