{
  "chunk_id": "o-0lj02cBPY_chunk_021",
  "semantic_text": "So, yeah, I would agree with that. You know, creating a therapeutic space is really a critical. Safety is probably the central piece of that. If you can establish they feel safe, then you can deal with a lot of other issues. Yeah. And I think that the thing that I would stress in a way about the trauma here, I'm very much struck by the data that we and others have about attachment and particular form of attachment called type D attachment, which is very disruptive. People call it disorder. Dissociative attachment is highly correlated with later developing high levels of dissociation, pathological levels usually of dissociation. There are two or three longitudinal studies that have started out classifying infants and then ended up looking at adults. Those basically all found that infants and toddlers classified as highly type D attachment end up with. As adults with the higher levels of dissociation. So the question and what we know is that the parenting practices there are harsh, abusive kinds of. And you see some studies, as much as 80% of really maltreated children will have a type D attachment or attachment disturbance. They're very different clearly from the ABC type classifications that came before. So how does that trauma impact these kids? Well, I think part a lot of it has to do with safety and creating a safe sense and kind of going internalizing someplace I can go where I feel safe. But it also has to do with the fact that the parents aren't teaching the generalization of information across states. I think parents very much good parenting very much involves helping the child understand that a lot of principals cross your different states. And so, and. But all. And also having to address the idea that certain states are appropriate in certain situations and not appropriate in others. So you have one state in sort of a religious situation and another state when you're in a football state to you, and that these are different ways of being and sort of different senses of self that go along with it and identification with different sort of processes, whether it's your religion or it's your favorite team kind of thing. And once, when is it appropriate to be going, you know, go this, go that versus, you know. And what we see is that that's not going on with these kids. So they're kind of left on their own to develop their sort of set of states. And nobody's attempting to integrate across those states to say, remember what we learned here, where you can apply that there, this is part of that cause and effect, you know. And so I think there they. There's a tendency, I think in general for kids to play a lot with personality. You think about doll play or super figure play or dress up or pretend play. It has a lot to do with identity and personality and role kinds of things. And so you can be a cowboy or you can be a astronaut or you can be rock star or whatever, but you develop kind of these sorts of states. And so I think that's a normal process that gets recruited by these kids under these circumstances to help them cope with this. And so they don't have stable senses of self that generalized very well.",
  "speaker": "multiple",
  "speaker_name": "Multiple Speakers",
  "speaker_role": "Multiple Roles",
  "is_levin": false,
  "speaker_order": "multiple",
  "speaker_additional_context": null,
  "speaker_identified_at": "2025-08-22T14:12:48.699543",
  "start_time": 2691220,
  "end_time": 2933430,
  "timestamp": "2691220.00s - 2933430.00s",
  "primary_topics": [],
  "secondary_topics": [],
  "key_terms": [],
  "conversation_context": {
    "speaker_context": {
      "speakers_involved": [
        "A",
        "C"
      ],
      "speaker_details": {
        "A": {
          "speaker_id": "A",
          "name": "Frank Putnam",
          "role": "UNC at Chapel Hill",
          "is_levin": false,
          "speaker_order": 2,
          "additional_context": "Dept. of Psychiatry",
          "identified_at": "2025-08-22T11:42:22.299847"
        },
        "C": {
          "speaker_id": "C",
          "name": "Alexey Tolchinsky",
          "role": "George Washington University",
          "is_levin": false,
          "speaker_order": 3,
          "additional_context": null,
          "identified_at": "2025-08-22T11:43:13.147300"
        }
      },
      "conversation_type": "dialogue"
    },
    "levin_context": {
      "levin_involved": false,
      "levin_role": "not_involved",
      "levin_contribution_type": null,
      "levin_expertise_area": null,
      "levin_insights": []
    },
    "multi_speaker_context": {
      "total_speakers": 2,
      "speaker_interaction_type": "dialogue",
      "conversation_flow": [
        "A: So, yeah, I would agree with that. You know, creat...",
        "C: Yeah....",
        "A: And I think that the thing that I would stress in ..."
      ],
      "collaboration_pattern": "dialogue"
    }
  },
  "chunk_entries": [
    {
      "speaker_id": "A",
      "speaker_name": "Frank Putnam",
      "speaker_role": "UNC at Chapel Hill",
      "is_levin": false,
      "speaker_order": 2,
      "text": "So, yeah, I would agree with that. You know, creating a therapeutic space is really a critical. Safety is probably the central piece of that. If you can establish they feel safe, then you can deal with a lot of other issues.",
      "start_time": 2691220,
      "end_time": 2706100,
      "timestamp": "2691220.00s - 2706100.00s"
    },
    {
      "speaker_id": "C",
      "speaker_name": "Alexey Tolchinsky",
      "speaker_role": "George Washington University",
      "is_levin": false,
      "speaker_order": 3,
      "text": "Yeah.",
      "start_time": 2706580,
      "end_time": 2706980,
      "timestamp": "2706580.00s - 2706980.00s"
    },
    {
      "speaker_id": "A",
      "speaker_name": "Frank Putnam",
      "speaker_role": "UNC at Chapel Hill",
      "is_levin": false,
      "speaker_order": 2,
      "text": "And I think that the thing that I would stress in a way about the trauma here, I'm very much struck by the data that we and others have about attachment and particular form of attachment called type D attachment, which is very disruptive. People call it disorder. Dissociative attachment is highly correlated with later developing high levels of dissociation, pathological levels usually of dissociation. There are two or three longitudinal studies that have started out classifying infants and then ended up looking at adults. Those basically all found that infants and toddlers classified as highly type D attachment end up with. As adults with the higher levels of dissociation. So the question and what we know is that the parenting practices there are harsh, abusive kinds of. And you see some studies, as much as 80% of really maltreated children will have a type D attachment or attachment disturbance. They're very different clearly from the ABC type classifications that came before. So how does that trauma impact these kids? Well, I think part a lot of it has to do with safety and creating a safe sense and kind of going internalizing someplace I can go where I feel safe. But it also has to do with the fact that the parents aren't teaching the generalization of information across states. I think parents very much good parenting very much involves helping the child understand that a lot of principals cross your different states. And so, and. But all. And also having to address the idea that certain states are appropriate in certain situations and not appropriate in others. So you have one state in sort of a religious situation and another state when you're in a football state to you, and that these are different ways of being and sort of different senses of self that go along with it and identification with different sort of processes, whether it's your religion or it's your favorite team kind of thing. And once, when is it appropriate to be going, you know, go this, go that versus, you know. And what we see is that that's not going on with these kids. So they're kind of left on their own to develop their sort of set of states. And nobody's attempting to integrate across those states to say, remember what we learned here, where you can apply that there, this is part of that cause and effect, you know. And so I think there they. There's a tendency, I think in general for kids to play a lot with personality. You think about doll play or super figure play or dress up or pretend play. It has a lot to do with identity and personality and role kinds of things. And so you can be a cowboy or you can be a astronaut or you can be rock star or whatever, but you develop kind of these sorts of states. And so I think that's a normal process that gets recruited by these kids under these circumstances to help them cope with this. And so they don't have stable senses of self that generalized very well.",
      "start_time": 2706980,
      "end_time": 2933430,
      "timestamp": "2706980.00s - 2933430.00s"
    }
  ]
}