{
  "chunk_id": "o-0lj02cBPY_chunk_007",
  "semantic_text": "Right. And then when the goal is accomplished, let's say adulthood or a certain organ is built, then from that point forward, there's not much future. The future is predicted to be the same, and there's no need to use the memory systems much. There's no construction going on. So the temporal depth collapses. The temporal light cone is shrinking in that point. And conversely, this could be seen as the onset of aging, if you wish. I just wanted to put it out there that the word you used, it's. It's a morphogenic dissociation in that sense, that the temporal depth collapses when the aging starts because the goal is reached. This is why reaching the goal is happening. Then if you do your cure of regenerative work, let's say regeneration of a limb, the new goal shows up, there's again a planning for the future, there's again the use of the past, and the system is again hopeful. So then I just want to put the time parameter there explicitly and to go to Frank's work now with, let's say, complex ptsd. Now, the scale is different. Your work is cells, tissues, organs. Frank's work is the entire person, and perhaps over longer timescales, like several generations. But if we take complex ptsd, which briefly is prolonged unbearable stress in circumstances when there's no escape and repeated trauma, then we can say that sometimes the person becomes resigned, saying there's nothing to do, which we call helplessness and nobody's coming in to help. Right? And that's the. There's no more goals because there's nothing to do, it's helpless. And also there's no future. The person's extremely pessimistic, if not depressed and dysphoric. The only prediction is the pain and suffering will continue. But nothing good is predicted. Right. And in that sense, there's no goals in the future. You know, there's just perpetuation of suffering. And the extreme form of that is suicidality. Saying that the only way to resolve it is to. Is, you know, destructive. What I'm saying is that state of resignment is also the collapse of the temporal goal. There is no future and there's no need for use the past. You know, the only prediction is, is that. So there's some similarity in that, in that sense. Now in therapy, many things happen and Frank helped us so much with Bethany Brand's work and Ruth Lenius have sort of finding common ground. But one of the small components of therapy, at some point in the middle maybe is installation of hope. The hope comes back, there's something to live for, as Nietzsche said. Right. And the third perspective is free energy principle, which I think complements your work nicely, because fep, I think, is about maintenance after you've reached the goal. The morphostasis, the maintenance of the shape is fep. And FEP has optimism bias. The FEP system predicts to remain and it does certain things to do. So it perceives the world, builds the model of the world, and it acts upon the world to continue persisting. So in that sense, it, it, it's optimistic. Now, you know, as you know, there's forces of nature that are trying to decay the THEP system and for different reasons. So there's sort of stress on the boundary, on the Markov blanket, and the nature wants the system to stop. But what then? We need energy to maintain the system. Morphostasis takes energy, as Chris Fields succinctly says, it takes energy to reduce uncertainty. So in fact, it takes energy to reduce uncertainty. Whether I'll live or I'll die.",
  "speaker": "multiple",
  "speaker_name": "Multiple Speakers",
  "speaker_role": "Multiple Roles",
  "is_levin": false,
  "speaker_order": "multiple",
  "speaker_additional_context": null,
  "speaker_identified_at": "2025-08-22T14:12:48.699470",
  "start_time": 828780,
  "end_time": 1036100,
  "timestamp": "828780.00s - 1036100.00s",
  "primary_topics": [],
  "secondary_topics": [],
  "key_terms": [],
  "conversation_context": {
    "speaker_context": {
      "speakers_involved": [
        "A",
        "C"
      ],
      "speaker_details": {
        "A": {
          "speaker_id": "A",
          "name": "Frank Putnam",
          "role": "UNC at Chapel Hill",
          "is_levin": false,
          "speaker_order": 2,
          "additional_context": "Dept. of Psychiatry",
          "identified_at": "2025-08-22T11:42:22.299847"
        },
        "C": {
          "speaker_id": "C",
          "name": "Alexey Tolchinsky",
          "role": "George Washington University",
          "is_levin": false,
          "speaker_order": 3,
          "additional_context": null,
          "identified_at": "2025-08-22T11:43:13.147300"
        }
      },
      "conversation_type": "dialogue"
    },
    "levin_context": {
      "levin_involved": false,
      "levin_role": "not_involved",
      "levin_contribution_type": null,
      "levin_expertise_area": null,
      "levin_insights": []
    },
    "multi_speaker_context": {
      "total_speakers": 2,
      "speaker_interaction_type": "dialogue",
      "conversation_flow": [
        "A: Right....",
        "C: And then when the goal is accomplished, let's say ..."
      ],
      "collaboration_pattern": "dialogue"
    }
  },
  "chunk_entries": [
    {
      "speaker_id": "A",
      "speaker_name": "Frank Putnam",
      "speaker_role": "UNC at Chapel Hill",
      "is_levin": false,
      "speaker_order": 2,
      "text": "Right.",
      "start_time": 828780,
      "end_time": 829020,
      "timestamp": "828780.00s - 829020.00s"
    },
    {
      "speaker_id": "C",
      "speaker_name": "Alexey Tolchinsky",
      "speaker_role": "George Washington University",
      "is_levin": false,
      "speaker_order": 3,
      "text": "And then when the goal is accomplished, let's say adulthood or a certain organ is built, then from that point forward, there's not much future. The future is predicted to be the same, and there's no need to use the memory systems much. There's no construction going on. So the temporal depth collapses. The temporal light cone is shrinking in that point. And conversely, this could be seen as the onset of aging, if you wish. I just wanted to put it out there that the word you used, it's. It's a morphogenic dissociation in that sense, that the temporal depth collapses when the aging starts because the goal is reached. This is why reaching the goal is happening. Then if you do your cure of regenerative work, let's say regeneration of a limb, the new goal shows up, there's again a planning for the future, there's again the use of the past, and the system is again hopeful. So then I just want to put the time parameter there explicitly and to go to Frank's work now with, let's say, complex ptsd. Now, the scale is different. Your work is cells, tissues, organs. Frank's work is the entire person, and perhaps over longer timescales, like several generations. But if we take complex ptsd, which briefly is prolonged unbearable stress in circumstances when there's no escape and repeated trauma, then we can say that sometimes the person becomes resigned, saying there's nothing to do, which we call helplessness and nobody's coming in to help. Right? And that's the. There's no more goals because there's nothing to do, it's helpless. And also there's no future. The person's extremely pessimistic, if not depressed and dysphoric. The only prediction is the pain and suffering will continue. But nothing good is predicted. Right. And in that sense, there's no goals in the future. You know, there's just perpetuation of suffering. And the extreme form of that is suicidality. Saying that the only way to resolve it is to. Is, you know, destructive. What I'm saying is that state of resignment is also the collapse of the temporal goal. There is no future and there's no need for use the past. You know, the only prediction is, is that. So there's some similarity in that, in that sense. Now in therapy, many things happen and Frank helped us so much with Bethany Brand's work and Ruth Lenius have sort of finding common ground. But one of the small components of therapy, at some point in the middle maybe is installation of hope. The hope comes back, there's something to live for, as Nietzsche said. Right. And the third perspective is free energy principle, which I think complements your work nicely, because fep, I think, is about maintenance after you've reached the goal. The morphostasis, the maintenance of the shape is fep. And FEP has optimism bias. The FEP system predicts to remain and it does certain things to do. So it perceives the world, builds the model of the world, and it acts upon the world to continue persisting. So in that sense, it, it, it's optimistic. Now, you know, as you know, there's forces of nature that are trying to decay the THEP system and for different reasons. So there's sort of stress on the boundary, on the Markov blanket, and the nature wants the system to stop. But what then? We need energy to maintain the system. Morphostasis takes energy, as Chris Fields succinctly says, it takes energy to reduce uncertainty. So in fact, it takes energy to reduce uncertainty. Whether I'll live or I'll die.",
      "start_time": 830060,
      "end_time": 1036100,
      "timestamp": "830060.00s - 1036100.00s"
    }
  ]
}