{
  "video_id": "OD5TOsPZIQY",
  "video_metadata": {},
  "transcript_metadata": {},
  "chunking_parameters": {
    "max_chunk_tokens": 300,
    "min_chunk_tokens": 100,
    "overlap_tokens": 50
  },
  "total_chunks": 44,
  "total_tokens": 6820,
  "chunks": [
    {
      "chunk_id": "OD5TOsPZIQY_chunk_000",
      "text": "What I'm going to talk about today is some, some efforts that, that we and others have made to try to expand what I think of as significant mind blindness that affects us because of our evolutionary history and our focus on particular kinds of minds. And I'm going to spend the mid, the middle part of the talk discussing results that we have using the collective intelligence of body cells as a model system to understand a diverse intelligence that lives in a weird space that's hard for us to imagine, and the progress that we've actually made in communicating with that intelligence.",
      "token_count": 104,
      "sentence_count": 4,
      "start_sentence": 0,
      "end_sentence": 3,
      "start_time_ms": 640,
      "end_time_ms": 34050,
      "start_time_seconds": 0.64,
      "end_time_seconds": 34.05,
      "primary_topics": [
        "Mind Blindness",
        "Evolutionary History",
        "Collective Intelligence of Body Cells",
        "Diverse Intelligence",
        "Communication with Cellular Intelligence"
      ],
      "secondary_topics": [
        "Model Systems",
        "Evolutionary Focus on Minds",
        "Cellular Communication",
        "Understanding Intelligence",
        "Biological Systems"
      ],
      "key_terms": [
        "Mind Blindness",
        "Evolutionary History",
        "Collective Intelligence",
        "Model System",
        "Diverse Intelligence",
        "Cellular Communication"
      ],
      "content_summary": "Michael Levin discusses the concept of 'mind blindness' that arises from our evolutionary history and our focus on certain types of minds. He presents his research on using the collective intelligence of body cells as a model system to understand and communicate with diverse forms of intelligence that are difficult for us to comprehend.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Cognitive Science",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_001",
      "text": "So it's kind of a case study for us. But I'm also going to talk about some much, much weirder things. If anybody's interested in the primary papers, the data sets, the software, everything is here. And then here's where I keep my own kind of personal thoughts about what it all means. So I want to start off by just reminding ourselves of something that happened over history is that prior to having a solid theory of electromagnetism, we had static electricity and we had lightning, and we had magnets and we had light. And we all thought those were different things, okay? We thought these were, these were completely different kinds of, kinds of phenomena. And we were also unaware that we actually were only sensitive to a tiny part of this spectrum. What a good theory of electromagnetism did for us is several things.",
      "token_count": 147,
      "sentence_count": 10,
      "start_sentence": 1,
      "end_sentence": 10,
      "start_time_ms": 34050,
      "end_time_ms": 86050,
      "start_time_seconds": 34.05,
      "end_time_seconds": 86.05,
      "primary_topics": [
        "Electromagnetism",
        "Static Electricity",
        "Lightning",
        "Magnets",
        "Light"
      ],
      "secondary_topics": [
        "Spectrum Sensitivity",
        "Historical Perspective of Electromagnetism",
        "Theory of Electromagnetism",
        "Scientific Data Sets",
        "Scientific Software"
      ],
      "key_terms": [
        "Electromagnetism",
        "Static Electricity",
        "Lightning",
        "Magnets",
        "Light",
        "Spectrum",
        "Theory",
        "Data Sets",
        "Software"
      ],
      "content_summary": "Michael Levin discusses the historical understanding of electromagnetism, noting that phenomena like static electricity, lightning, magnets, and light were once thought to be separate. He emphasizes the importance of a solid theory of electromagnetism in understanding these phenomena as part of a broader spectrum, to which humans are only sensitive to a small part.",
      "scientific_domain": "Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_002",
      "text": "First of all, it revealed that all of these different things are in fact manifestations of the same thing, and that it is a spectrum and that the labels we put on this spectrum are convenient, but they're for our purposes. The underlying thing is a continuum. And it allowed us to develop a technology driven by the theory that now lets us interact with this enormous range of things in the universe around us, to which we were previously basically completely blind, and that allows us to make applications that improve quite quality of life. So I want to argue that this, this, this idea, the idea of a unification that reveals a spectrum and an underlying symmetry to, to, to seemingly disparate phenomena is in fact the, the exact way we should start thinking about diverse kinds of minds.",
      "token_count": 141,
      "sentence_count": 7,
      "start_sentence": 2,
      "end_sentence": 8,
      "start_time_ms": 86050,
      "end_time_ms": 134220,
      "start_time_seconds": 86.05,
      "end_time_seconds": 134.22,
      "primary_topics": [
        "Unification of phenomena",
        "Spectrum of phenomena",
        "Theory-driven technology"
      ],
      "secondary_topics": [
        "Interaction with the universe",
        "Quality of life improvement",
        "Conceptual labels",
        "Continuum of phenomena",
        "Diverse kinds of minds",
        "Underlying symmetry"
      ],
      "key_terms": [
        "Unification",
        "Spectrum",
        "Continuum",
        "Symmetry",
        "Phenomena",
        "Theory-driven technology"
      ],
      "content_summary": "The speaker discusses the concept of unifying seemingly disparate phenomena into a spectrum, revealing an underlying symmetry. This understanding has led to the development of technology that allows us to interact with a broader range of elements in the universe, improving quality of life.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Theoretical Physics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_003",
      "text": "So in my group, what I would like to do is to develop a framework that helps us to recognize and ethically relate to a very wide range of beings. And so not just the primates and birds and maybe an octopus or conventionally we think about, but also some really weird biological, such as colonial organisms and swarms, synthetic new life forms, AIs, whether robotic or purely software, someday maybe exobiological alien entities and some even very weird things. That I probably won't have time to really talk about today, which aren't even conventional physical objects. And I think what we have here is exactly this kind of spectrum where we have names for different types of agents along the spectrum all the way from passive matter. And I'm not sure there is any such thing.",
      "token_count": 137,
      "sentence_count": 6,
      "start_sentence": 3,
      "end_sentence": 8,
      "start_time_ms": 134540,
      "end_time_ms": 182460,
      "start_time_seconds": 134.54,
      "end_time_seconds": 182.46,
      "primary_topics": [
        "Ethical Recognition of Various Beings",
        "Spectrum of Biological Entities",
        "Concept of Agency in Different Entities"
      ],
      "secondary_topics": [
        "Primates, Birds, and Octopuses",
        "Colonial Organisms and Swarms",
        "Synthetic Life Forms",
        "Artificial Intelligence",
        "Exobiological Alien Entities",
        "Non-conventional Physical Objects"
      ],
      "key_terms": [
        "Biological Entities",
        "Synthetic Life Forms",
        "Artificial Intelligence",
        "Exobiological Alien Entities",
        "Non-conventional Physical Objects",
        "Agency",
        "Ethics"
      ],
      "content_summary": "Michael Levin discusses his group's aim to develop a framework for ethically recognizing a wide range of beings, not just conventional animals but also entities like colonial organisms, synthetic life forms, artificial intelligence, and potentially alien life forms. He also mentions the concept of a spectrum of agency, from passive matter to more complex entities.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Bioethics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_004",
      "text": "But, but, but we tend to think of the kinds of things that physics studies as sort of passive dumb materials all the way up to whatever humans are with their metacognitive abilities and everything in between. And so, and so what I'm interested in are theories of transformation and change. Not, not sort of sharp categories, but, but actually how things scale along this continuum. And all the details are here. One thing to remember is that as we study these kinds of things, what I think we are working up along is this kind of spectrum where things get progressively weirder as you start to leave this conventional area. The kinds of agents that we think about get stranger and stranger. And one other precedent that we have is in the discovery of numbers.",
      "token_count": 136,
      "sentence_count": 8,
      "start_sentence": 4,
      "end_sentence": 11,
      "start_time_ms": 182460,
      "end_time_ms": 232760,
      "start_time_seconds": 182.46,
      "end_time_seconds": 232.76,
      "primary_topics": [
        "Theories of transformation and change",
        "Spectrum of complexity",
        "Concept of scaling"
      ],
      "secondary_topics": [
        "Metacognitive abilities",
        "Study of passive materials",
        "Concept of strange agents",
        "Discovery of numbers",
        "Conventional and unconventional areas of study"
      ],
      "key_terms": [
        "Physics",
        "Metacognition",
        "Spectrum",
        "Scaling",
        "Agents",
        "Numbers"
      ],
      "content_summary": "The speaker discusses the study of transformation and change, focusing on how things scale along a spectrum from passive materials to complex human metacognition. They mention the increasing strangeness of agents as one moves away from conventional areas of study, and reference the discovery of numbers as a precedent.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Physics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_005",
      "text": "So originally we had the counting numbers and then somebody invented zero and then negative numbers. And then eventually people figured out that even the rationals weren't the limit of things and so on. And what's important here is that each one of these expansions required a conceptual leap. It required us to break prior categories that we thought define what is essential about numbers. It actually was quite disturbing. So lots of people died, for example, when irrationals were discovered. Like this poor guy Hippasus was either killed or drowned on his own from the horror of this kind of thing. And we just need to remember that expanding these categories is not trivial, it's often painful. And the ability to recognize other kinds of things that didn't fit your previous category is in order so that you can do something useful with them. And in, in the context of what we're talking about now, which is other types of beings actually have some sort of active compassionate relationship with them is, is not easy. We as humans are really primed to recognize this kind of thing.",
      "token_count": 188,
      "sentence_count": 11,
      "start_sentence": 5,
      "end_sentence": 15,
      "start_time_ms": 233080,
      "end_time_ms": 301100,
      "start_time_seconds": 233.08,
      "end_time_seconds": 301.1,
      "primary_topics": [
        "Conceptual expansion in mathematics",
        "Historical evolution of numbers",
        "Cognitive categorization"
      ],
      "secondary_topics": [
        "Concept of zero",
        "Negative numbers",
        "Rational and irrational numbers",
        "Historical reactions to mathematical advancements",
        "Human cognitive biases"
      ],
      "key_terms": [
        "Counting numbers",
        "Zero",
        "Negative numbers",
        "Rationals",
        "Irrationals",
        "Cognitive categories"
      ],
      "content_summary": "The speaker discusses the historical evolution of numbers, from counting numbers to the introduction of zero, negative numbers, and eventually rational and irrational numbers. They emphasize the conceptual leaps and cognitive challenges associated with these advancements, and draw parallels to the difficulty of recognizing and categorizing new types of beings.",
      "scientific_domain": "Developmental biology, Cognitive science",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_006",
      "text": "So, so here's this Oscar winning performance where, where this, this little squirrel like creature sets up a little accident scene here, right? So he puts it right on the neck. He knows what his owners, he's got a very good theory of mind. He knows what the owners are looking for in terms of paying attention to him. He's going to check in a minute to see whether anybody's watching, right? So these kinds of things, it's very easy for us to understand that there's a mind here. And so on. And that's because they operate at the same spatial temporal scale. They operate within the same space as we do. They have roughly similar biological goals. And so things that are driven by brains, especially mammals, not really problematic, usually. Well, there are some weird situations.",
      "token_count": 138,
      "sentence_count": 12,
      "start_sentence": 6,
      "end_sentence": 17,
      "start_time_ms": 301100,
      "end_time_ms": 343660,
      "start_time_seconds": 301.1,
      "end_time_seconds": 343.66,
      "primary_topics": [
        "Animal Behavior",
        "Theory of Mind",
        "Spatial Temporal Scale",
        "Biological Goals"
      ],
      "secondary_topics": [
        "Mammalian Cognition",
        "Attention Seeking Behavior",
        "Problem Solving",
        "Animal-Owner Interaction",
        "Animal Intelligence",
        "Brain-Driven Behavior"
      ],
      "key_terms": [
        "Theory of Mind",
        "Spatial Temporal Scale",
        "Biological Goals",
        "Mammals",
        "Brains"
      ],
      "content_summary": "The speaker discusses the behavior of a squirrel-like creature, highlighting its ability to understand and manipulate its owner's attention. This behavior is attributed to the creature's theory of mind, operating at the same spatial temporal scale as humans, and having similar biological goals.",
      "scientific_domain": "Developmental Biology, Animal Behavior",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_007",
      "text": "For example, we have theories of mapping of functions onto brain structure and so on. And yet there are clinical cases, and Karina Kaufman, I reviewed it in this paper. There are cases where individuals have radically reduced amounts of brain tissue despite normal or even above normal performance. Even that's not simple. The mapping between brain and performance, even that's not easy. But in order to really understand what we are and how we come to be as embodied agents, we need to look at our origins, both evolutionarily and developmentally. All of us start life as a little blob of chemistry and physics. Here's an unfertilized oocyte. Through the incredible process of embryogenesis, we become a fodder for either behavioral science or maybe psychoanalysis and other deeper kinds of things. One thing developmental biology shows us is that there is no magic kind of bright line at which. At which physics ticks over to psychology. There is no special place where that happens. It's a continuous, gradual process, and it's really important to be able to understand that process. And by the way, this is not the end of the road because there are other processes that can happen afterwards, including dissociative disorder known as cancer. I'll talk about that in a minute. And really other very strange things, such as your cells, for example, after the death of the body, your cells continuing their life in a totally novel embodiment such as these anthrobots that I'm going to show you in a minute. And it's also important to note that even the notion of an embryo isn't simple, because if you look at an early blastoderm.",
      "token_count": 279,
      "sentence_count": 18,
      "start_sentence": 7,
      "end_sentence": 24,
      "start_time_ms": 343660,
      "end_time_ms": 445990,
      "start_time_seconds": 343.66,
      "end_time_seconds": 445.99,
      "primary_topics": [
        "Brain Structure and Function Mapping",
        "Embryogenesis",
        "Developmental Biology",
        "Bioelectricity"
      ],
      "secondary_topics": [
        "Evolutionary Origins",
        "Behavioral Science",
        "Psychoanalysis",
        "Cancer",
        "Cellular Life after Death",
        "Anthrobots"
      ],
      "key_terms": [
        "Unfertilized Oocyte",
        "Embodied Agents",
        "Dissociative Disorder",
        "Blastoderm",
        "Continuous Gradual Process"
      ],
      "content_summary": "The presentation discusses the complex relationship between brain structure and function, and the remarkable process of embryogenesis. It emphasizes the continuous, gradual nature of development from physics to psychology, and explores intriguing concepts such as cellular life after death and the complexity of defining an embryo.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_008",
      "text": "So let's say there's a couple of hundred thousand cells here, and you say, well, there's an embryo. What are you actually counting when you say there's one embryo? What is there one of? Well, what there's one of is alignment. What there's one of is a story that all of the cells have bought into a self model that guides their movement in anatomical space, in the space of possible anatomical configurations. And the reason there's one embryo is because all the cells agree that is where they're going. If you were to, and I used to do this in duck embryos as a graduate student. If you take a little needle and you put some scratches in this plastoderm. Each one of these islands doesn't feel a presence of the others, and so they align among themselves. They decide they're the embryo, but they all do it. And this is how you get twins and triplets and things like this. That means that the number of individuals inside an embryonic medium is not determined. It's certainly not set by genetics. It could be anywhere from zero to probably half a dozen or more in a standard blastoderm. And so how many actual individuals or cells can emerge from that medium is not obvious. And it's a physiological outcome that shares actually a lot of both mechanistic and functional similarities with issues of individuation in the cognitive sense.",
      "token_count": 239,
      "sentence_count": 16,
      "start_sentence": 8,
      "end_sentence": 23,
      "start_time_ms": 445990,
      "end_time_ms": 520820,
      "start_time_seconds": 445.99,
      "end_time_seconds": 520.82,
      "primary_topics": [
        "Embryonic Development",
        "Cellular Alignment",
        "Individuation"
      ],
      "secondary_topics": [
        "Cellular Communication",
        "Genetic Influence",
        "Anatomical Configuration",
        "Physiological Outcomes",
        "Mechanistic Similarities",
        "Functional Similarities",
        "Cognitive Sense"
      ],
      "key_terms": [
        "Embryo",
        "Cells",
        "Self Model",
        "Anatomical Space",
        "Blastoderm",
        "Individuation",
        "Physiological Outcome"
      ],
      "content_summary": "The speaker discusses the concept of cellular alignment in embryonic development, emphasizing that the number of individuals in an embryonic medium is not predetermined by genetics. The speaker also draws parallels between this process and cognitive individuation.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_009",
      "text": "So things like split brain patients, dissociative identity disorders, how many individuals are within a given set of real estate in the brain and how many can actually fit? What's the maximum carrying capacity? We know this for standard computation. We do not know how to calculate this for neural substrates. And so it's incredibly dynamic process, self making. Literally self making is a very dynamic process and it's driven by this sort of thing. This is what we are all made of. This is a single cell. Now this is a free living organism, but you get the idea. It's a single cell. There's no brain, there's no nervous system. There is, however, great competency in managing its own tiny little cognitive light cone. The spatiotemporal region of goals that it can pursue is small, but, but it's very good at doing what it, what it needs to do. And even this, I mean, a lot of people are now catching on that, that cells have a kind of, kind of intelligence and competency and whatever.",
      "token_count": 177,
      "sentence_count": 14,
      "start_sentence": 9,
      "end_sentence": 22,
      "start_time_ms": 520900,
      "end_time_ms": 577350,
      "start_time_seconds": 520.9,
      "end_time_seconds": 577.35,
      "primary_topics": [
        "Neural Substrates",
        "Cellular Intelligence",
        "Cognitive Light Cone",
        "Self-making Process"
      ],
      "secondary_topics": [
        "Split Brain Patients",
        "Dissociative Identity Disorders",
        "Spatiotemporal Region",
        "Cell Competency",
        "Carrying Capacity of Brain"
      ],
      "key_terms": [
        "Neural Substrates",
        "Cognitive Light Cone",
        "Spatiotemporal Region",
        "Dissociative Identity Disorders",
        "Split Brain",
        "Self-making Process",
        "Cellular Intelligence"
      ],
      "content_summary": "The presentation discusses the complexity of neural substrates and the dynamic process of self-making. It emphasizes the intelligence and competency of single cells, despite their lack of a brain or nervous system, and their ability to manage their own 'cognitive light cone'.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Neuroscience",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_010",
      "text": "But, but it's not just that this goes down to the cell level. No, it's, it goes far beyond that because even the chemical material inside of that cell, not the cell itself, not the nucleus, not any of that. But, but, but, but just the chemical pathways, for example, gene regulatory networks or other, other, just from the way the math works, they are themselves capable of at least six different kinds of learning, including Pavlovian conditioning. You don't need anything else. Just a set of interacting chemicals is already potentially capable of several different kinds of learning already. Not only are we collective intelligences made of cells, but actually the cells themselves are collective intelligence made up of components that do all kinds of interesting things that I don't have time to talk about today.",
      "token_count": 137,
      "sentence_count": 8,
      "start_sentence": 10,
      "end_sentence": 17,
      "start_time_ms": 577350,
      "end_time_ms": 622440,
      "start_time_seconds": 577.35,
      "end_time_seconds": 622.44,
      "primary_topics": [
        "Cellular Intelligence",
        "Biochemical Learning Mechanisms",
        "Gene Regulatory Networks"
      ],
      "secondary_topics": [
        "Pavlovian Conditioning",
        "Collective Intelligence",
        "Cellular Components",
        "Chemical Pathways",
        "Cellular Structure"
      ],
      "key_terms": [
        "Cell",
        "Nucleus",
        "Chemical Pathways",
        "Gene Regulatory Networks",
        "Pavlovian Conditioning",
        "Collective Intelligence"
      ],
      "content_summary": "The speaker, Michael Levin, discusses the concept of cellular intelligence, emphasizing that not only are organisms collective intelligences made of cells, but the cells themselves are collective intelligences made up of components. He further explains that the chemical pathways within cells, specifically gene regulatory networks, are capable of several types of learning, including Pavlovian conditioning.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_011",
      "text": "But we are, for example, in our lab, taking advantage of the ability of these molecular networks to learn to make Applications such as drug conditioning and things like that. So our body is a multiscale competency architecture. Every level, from the molecular networks on up, is a kind of agent that solves problems in various weird spaces. And because of our evolutionary firmware, we are pretty good at recognizing intelligence in three dimensional space. You know, we're obsessed with the 3D world because of our vision and medium sized objects moving at medium speeds, like birds and things like this, we can sort of pick that up.",
      "token_count": 108,
      "sentence_count": 5,
      "start_sentence": 11,
      "end_sentence": 15,
      "start_time_ms": 622680,
      "end_time_ms": 665950,
      "start_time_seconds": 622.68,
      "end_time_seconds": 665.95,
      "primary_topics": [
        "Molecular Networks",
        "Multiscale Competency Architecture",
        "Evolutionary Firmware",
        "Intelligence Recognition",
        "Three Dimensional Space"
      ],
      "secondary_topics": [
        "Drug Conditioning",
        "Problem Solving",
        "Vision",
        "Medium Sized Objects",
        "Speed",
        "Evolution",
        "Learning"
      ],
      "key_terms": [
        "Molecular Networks",
        "Multiscale Competency Architecture",
        "Evolutionary Firmware",
        "Intelligence Recognition",
        "Three Dimensional Space",
        "Drug Conditioning",
        "Problem Solving",
        "Vision"
      ],
      "content_summary": "The presentation discusses the use of molecular networks in applications like drug conditioning in the lab. It highlights the concept of our body as a multiscale competency architecture, where each level, from molecular networks upwards, acts as an agent solving problems. The speaker also discusses our evolutionary firmware's ability to recognize intelligence in a three-dimensional space.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_012",
      "text": "But biology exploits intelligence and goal directed navigation in lots of different spaces. So the space of possible gene expressions, the space of possible physiological states, and the one we're going to talk about most is the anatomical morphospace. This, this, this thing that's essential for intelligence, this perception action loop, happens in all kinds of other spaces that are very difficult for us to recognize. This has lots of implications for things like, like AIs and, and various hybrid hybrids and organoids and things where people look at them and say, well, this is not embodied, it just sits there, it doesn't move in the physical world. Right, but the physical world is not the only world where you can do this critical perception action loop. And so what I mean by anatomical intelligence, I don't just mean complexity and I don't even just mean reliability. I mean problem solving. And so here's a very simple example of a goal directed system.",
      "token_count": 163,
      "sentence_count": 9,
      "start_sentence": 12,
      "end_sentence": 20,
      "start_time_ms": 666110,
      "end_time_ms": 720000,
      "start_time_seconds": 666.11,
      "end_time_seconds": 720.0,
      "primary_topics": [
        "Intelligence in Biology",
        "Goal-Directed Navigation",
        "Anatomical Morphospace",
        "Perception-Action Loop",
        "Anatomical Intelligence"
      ],
      "secondary_topics": [
        "Gene Expressions",
        "Physiological States",
        "Implications for AI",
        "Hybrid Organoids",
        "Problem Solving"
      ],
      "key_terms": [
        "Anatomical Morphospace",
        "Perception-Action Loop",
        "Anatomical Intelligence",
        "Gene Expressions",
        "Physiological States",
        "Artificial Intelligence",
        "Hybrid Organoids",
        "Goal-Directed System"
      ],
      "content_summary": "Michael Levin discusses the concept of intelligence in biology, focusing on the anatomical morphospace and the perception-action loop. He emphasizes that the physical world is not the only space where this loop can occur, which has implications for AI and hybrid organoids. Levin defines anatomical intelligence as problem-solving, not just complexity or reliability.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_013",
      "text": "So you have this, this axolotl. They are incredibly regenerative. They can, they can restore most of their body parts. If it loses a limb anywhere along this axis, the cells immediately detect that they've been deviated from their target state. They will work really hard to get back there. And then the most amazing thing of all, they stop when they're done. When do they stop? They stop when a correct axolotl limb has formed. So this is an example of a very simple homeostatic process. The system has a goal. You deviated from that goal, it expends lots of energy to get there and then it stops.",
      "token_count": 109,
      "sentence_count": 11,
      "start_sentence": 13,
      "end_sentence": 23,
      "start_time_ms": 720000,
      "end_time_ms": 751560,
      "start_time_seconds": 720.0,
      "end_time_seconds": 751.56,
      "primary_topics": [
        "Axolotl Regeneration",
        "Homeostatic Process",
        "Cellular Response to Injury"
      ],
      "secondary_topics": [
        "Energy Expenditure in Regeneration",
        "Regenerative Biology",
        "Target State in Cellular Systems",
        "Biological Goals",
        "Stop Mechanism in Regeneration"
      ],
      "key_terms": [
        "Axolotl",
        "Regeneration",
        "Homeostasis",
        "Cellular Deviation",
        "Target State"
      ],
      "content_summary": "The speaker discusses the remarkable regenerative capabilities of the axolotl, a type of salamander. The cells of the axolotl can detect when they have deviated from their target state, such as when a limb is lost, and will expend energy to restore the limb. This process is an example of a homeostatic process, where the system works to maintain a stable, constant condition.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_014",
      "text": "But this ability to, and in fact it will work no matter where you cut. It makes exactly the right steps from here to there so we can regain its position in that anatomical space it navigates. But this is not just about damage. It leads to that incredible plasticity leads to phenomena like this. If we make this tadpole with no primary eyes, this is a tadpole of the frog. Here's the mouth, here are the nostrils, the brain, the tail. If we make a tadpole with no primary eyes, but we put an eye on its tail, and I'll show you in a minute how we can do that. What happens is that that eye makes a single optic nerve. The optic nerve does not go to the brain.",
      "token_count": 131,
      "sentence_count": 9,
      "start_sentence": 14,
      "end_sentence": 22,
      "start_time_ms": 751960,
      "end_time_ms": 785750,
      "start_time_seconds": 751.96,
      "end_time_seconds": 785.75,
      "primary_topics": [
        "Anatomical Regeneration",
        "Biological Plasticity",
        "Eye Transplantation in Tadpoles"
      ],
      "secondary_topics": [
        "Anatomical Navigation",
        "Damage Repair",
        "Optic Nerve Development",
        "Brain Connectivity",
        "Experimental Biology",
        "Amphibian Development"
      ],
      "key_terms": [
        "Anatomical Space",
        "Plasticity",
        "Primary Eyes",
        "Optic Nerve",
        "Brain"
      ],
      "content_summary": "The speaker discusses the remarkable ability of organisms to regenerate and navigate anatomical space, highlighting the plasticity of biological systems. An experiment involving the transplantation of an eye to the tail of a tadpole is mentioned, with the resulting optic nerve not connecting to the brain.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_015",
      "text": "Sometimes it synapses on the spinal cord here, sometimes to the gut, sometimes nowhere at all. And these animals can see perfectly well. How do we know? Because we built a device that trains them, automatically trains them on visual cues. And we can show that they learn through visual assays. This is amazing. Why do you not need additional rounds of evolutionary adaptation? Here you've got an animal with a radically different sensory motor architecture, the eyes connected to the spinal cord or some other organ. Why does this just work out of the box? And that's because every instance of embryogenesis or regeneration or remodeling or metamorphosis is not a hardwired process driven by the chemistry of genetics. What it is is a problem solving process that takes place when an active agent interprets the information that it has, including its genetic affordances and everything else.",
      "token_count": 148,
      "sentence_count": 11,
      "start_sentence": 15,
      "end_sentence": 25,
      "start_time_ms": 785750,
      "end_time_ms": 839140,
      "start_time_seconds": 785.75,
      "end_time_seconds": 839.14,
      "primary_topics": [
        "Sensory Motor Architecture",
        "Embryogenesis",
        "Regeneration",
        "Remodeling",
        "Metamorphosis"
      ],
      "secondary_topics": [
        "Evolutionary Adaptation",
        "Visual Assays",
        "Genetic Affordances",
        "Problem Solving Process",
        "Active Agent Interpretation",
        "Information Processing",
        "Visual Cues",
        "Training Devices"
      ],
      "key_terms": [
        "Synapses",
        "Spinal Cord",
        "Visual Cues",
        "Genetics",
        "Embryogenesis",
        "Regeneration",
        "Remodeling",
        "Metamorphosis"
      ],
      "content_summary": "The speaker discusses an animal's ability to adapt to changes in sensory motor architecture, such as the eyes connecting to the spinal cord or another organ, without additional evolutionary adaptation. This is attributed to the problem-solving process that occurs during embryogenesis, regeneration, remodeling, or metamorphosis, which is not solely driven by genetics but also involves the active interpretation of information, including genetic affordances.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_016",
      "text": "So it gives rise to this incredible plasticity that we're going to look at the implications of this momentarily. What we'd like to know is how does all this work? What's the cognitive Gl that binds individual competent subunits like cells, and in fact molecular networks into cells, into tissues, organs and so on? What are the mechanisms and policies that allow these things to work together and embody a higher order individual that knows things that its parts don't know? Well, we know how this works in our bodies. As far as cognition is concerned, the cognitive glue that binds individual neurons together into us is, is electrophysiology or bioelectricity. It's the electrical networking of the cells in your brain that allow us to know things that our neurons don't know, and so on. Well, it turns out that that in particular is a scheme that evolution had discovered long before there were brains and muscles and things like that, using electricity to bind things together into a larger scale. Collective intelligence goes back to at least bacterial biofilms. It's very ancient. And more generally, I don't have time to talk about this.",
      "token_count": 194,
      "sentence_count": 12,
      "start_sentence": 16,
      "end_sentence": 27,
      "start_time_ms": 839140,
      "end_time_ms": 912970,
      "start_time_seconds": 839.14,
      "end_time_seconds": 912.97,
      "primary_topics": [
        "Cellular Plasticity",
        "Bioelectricity",
        "Collective Intelligence",
        "Evolution of Bioelectricity"
      ],
      "secondary_topics": [
        "Cognitive Glue",
        "Cellular Networking",
        "Bacterial Biofilms",
        "Molecular Networks",
        "Tissue and Organ Development",
        "Evolutionary Biology"
      ],
      "key_terms": [
        "Plasticity",
        "Bioelectricity",
        "Cognitive Glue",
        "Neurons",
        "Electrophysiology",
        "Bacterial Biofilms",
        "Molecular Networks",
        "Collective Intelligence"
      ],
      "content_summary": "The presentation discusses the concept of cellular plasticity and how bioelectricity serves as a 'cognitive glue' that binds individual cells and molecular networks into tissues and organs. The speaker also highlights that this mechanism of using electricity for collective intelligence predates the evolution of brains and muscles, tracing back to bacterial biofilms.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_017",
      "text": "But more generally, what evolution, I think has done is to pivot some of the same navigational tricks across all kinds of spaces as life got more complex. So from metabolic spaces, physiological spaces, gene expression spaces, eventually multicellularity, and you get anatomical amorphous space, then muscles and brains appear and you've got 3D behavioral space and then eventually linguistic spaces, and who knows what else. But the interesting thing here is that what our brains are using to embody conventional Cognition is exactly the same molecular mechanisms, meaning ion channels, electrical synapses and neurotransmitters. Exactly the same machinery as the collective intelligence of the body uses to make anatomical decisions. And so this is interesting. I don't plan to talk about consciousness too much in this talk, but just, just when I give these kinds of talks, I remind people that when you attribute consciousness to other humans that you're talking to or other beings, you typically use one of three criteria.",
      "token_count": 163,
      "sentence_count": 8,
      "start_sentence": 17,
      "end_sentence": 24,
      "start_time_ms": 913130,
      "end_time_ms": 975300,
      "start_time_seconds": 913.13,
      "end_time_seconds": 975.3,
      "primary_topics": [
        "Evolution and complexity of life",
        "Molecular mechanisms of cognition",
        "Collective intelligence of the body"
      ],
      "secondary_topics": [
        "Metabolic spaces",
        "Physiological spaces",
        "Gene expression spaces",
        "Multicellularity",
        "Anatomical amorphous space",
        "3D behavioral space",
        "Linguistic spaces",
        "Consciousness"
      ],
      "key_terms": [
        "Ion channels",
        "Electrical synapses",
        "Neurotransmitters",
        "Anatomical decisions"
      ],
      "content_summary": "The speaker discusses how evolution has led to the development of complex life forms, from metabolic and physiological spaces to multicellularity and beyond. They highlight that the same molecular mechanisms, such as ion channels, electrical synapses, and neurotransmitters, are used in cognition and the collective intelligence of the body for making anatomical decisions.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_018",
      "text": "Either you're looking at mechanisms, you say, hey, they use the same mechanisms that I use and I'm conscious, so therefore they must be too, or you're looking at behavior, so some sort of creative problem solving or something. And you say, okay, this is a sign of cognition and consciousness. Or you're looking at evolutionary continuity. You say, well, they're on the same evolutionary stream and therefore they must have had it too. If you like any of these criteria, then you have to take very seriously the idea that every structure in your body potentially has some sort of likely non verbal and so you don't hear from it, but, but",
      "token_count": 113,
      "sentence_count": 6,
      "start_sentence": 18,
      "end_sentence": 23,
      "start_time_ms": 975300,
      "end_time_ms": 1006680,
      "start_time_seconds": 975.3,
      "end_time_seconds": 1006.68,
      "primary_topics": [
        "Consciousness",
        "Cognition",
        "Evolutionary Continuity"
      ],
      "secondary_topics": [
        "Mechanisms of Consciousness",
        "Behavioral Indicators of Consciousness",
        "Problem Solving",
        "Evolutionary Stream",
        "Non-verbal Communication"
      ],
      "key_terms": [
        "Mechanisms",
        "Behavior",
        "Cognition",
        "Consciousness",
        "Evolutionary Continuity",
        "Problem Solving",
        "Non-verbal Communication"
      ],
      "content_summary": "The speaker discusses different perspectives on consciousness and cognition, including the use of similar mechanisms, behavioral indicators, and evolutionary continuity. The speaker suggests that every structure in the body potentially has some form of non-verbal consciousness.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Cognitive Science",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_019",
      "text": "some, some, some level of conscious experience because it fulfills all of the criteria that we normally use to acquire to attribute consciousness to each other. So what we're interested in is understanding, okay, if we're going to use the collective intelligence of morphogenesis as a model system, one of the things we'd like to do is to communicate with it. And in order to do that, the first thing we developed were some tools to basically read the information content of its mind. And so basically to read out the electrical activities the way that neuroscientists read out the states of the brain. And we developed a fluorescent dye technology that allows us. Here are a bunch of cells in dish deciding whether they should be a collective or not. Here are some cells in an early frog embryo.",
      "token_count": 140,
      "sentence_count": 7,
      "start_sentence": 19,
      "end_sentence": 25,
      "start_time_ms": 1006680,
      "end_time_ms": 1051450,
      "start_time_seconds": 1006.68,
      "end_time_seconds": 1051.45,
      "primary_topics": [
        "Consciousness in Morphogenesis",
        "Collective Intelligence",
        "Bioelectricity in Development"
      ],
      "secondary_topics": [
        "Cellular Communication",
        "Fluorescent Dye Technology",
        "Neuroscience",
        "Brain States",
        "Cellular Decision Making",
        "Early Frog Embryo Development"
      ],
      "key_terms": [
        "Morphogenesis",
        "Collective Intelligence",
        "Bioelectricity",
        "Fluorescent Dye Technology",
        "Neuroscience",
        "Brain States",
        "Cellular Decision Making",
        "Frog Embryo"
      ],
      "content_summary": "The speaker discusses the concept of consciousness and collective intelligence in morphogenesis. They mention the development of tools to read the 'mind' of this system, akin to how neuroscientists read brain states, using fluorescent dye technology. The context includes cells deciding on collective behavior and early frog embryo development.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_020",
      "text": "So these are not models. This is real, real data in time lapse. And you can see, you can see all the electrophysiology that goes on as the cells figure out who's going to be left, who's going to be right, anterior, posterior and so on. So we have all kinds of computational methods that we've developed to model this phenomenon and to understand how it can underly memories and large scale circuits that do pattern completion, which is basically regeneration, right? You lose a part of the body and then you can sort of complete that pattern later. So we have all kinds of simulations. I want to show you some of these patterns. Not only do these electrical patterns serve as a kind of cognitive Glue to bind cells together into a single body. And so here we have, this is a frog embryo putting its face together. And so this is one frame from that video. We call this the electric phase. Because what you see here is that before the gene expression and the cell behaviors that lead to forming a face, this is the memory that you can read out of what it's planning to build.",
      "token_count": 201,
      "sentence_count": 13,
      "start_sentence": 20,
      "end_sentence": 32,
      "start_time_ms": 1051450,
      "end_time_ms": 1110820,
      "start_time_seconds": 1051.45,
      "end_time_seconds": 1110.82,
      "primary_topics": [
        "Electrophysiology",
        "Cellular Development",
        "Bioelectricity",
        "Regeneration",
        "Computational Modelling"
      ],
      "secondary_topics": [
        "Gene Expression",
        "Cell Behavior",
        "Memory",
        "Large Scale Circuits",
        "Pattern Completion",
        "Simulations",
        "Embryonic Development"
      ],
      "key_terms": [
        "Electrophysiology",
        "Anterior",
        "Posterior",
        "Computational Methods",
        "Regeneration",
        "Simulations",
        "Electric Phase",
        "Gene Expression",
        "Cell Behaviors"
      ],
      "content_summary": "The speaker discusses the role of electrophysiology in cellular development, specifically in determining cell positions and roles. He also mentions the use of computational models to understand this phenomenon and its connection to memory and regeneration. The concept of 'electric phase' is introduced, which precedes gene expression and cell behaviors in embryonic development.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_021",
      "text": "So here's where the eye is going to go, here's where the mouth is going to go. Here are some placard structures. So the bioelectric stores a memory of what the thing is going to build, but it's also a cognitive glue across individuals. So here you can see when we poke this one, these two find out about this in short order. And the same thing here, you poke this embryo, there's a wave that goes. Each one of these is a whole embryo. These are not cells, these are whole embryos. You can see that there's communication within and communication between individuals. They're sitting in an aqueous medium, which is how the wave can propagate. And then here are just a bunch of cells where you can see the incredibly complex electrical activity that they're able to drive. Okay, so we're able to read these things.",
      "token_count": 148,
      "sentence_count": 11,
      "start_sentence": 21,
      "end_sentence": 31,
      "start_time_ms": 1110820,
      "end_time_ms": 1152330,
      "start_time_seconds": 1110.82,
      "end_time_seconds": 1152.33,
      "primary_topics": [
        "Bioelectricity",
        "Embryonic Development",
        "Inter-embryo Communication",
        "Cellular Electrical Activity"
      ],
      "secondary_topics": [
        "Cellular Memory",
        "Bioelectric Signals",
        "Wave Propagation",
        "Aqueous Medium",
        "Cellular Complexity"
      ],
      "key_terms": [
        "Bioelectric",
        "Embryo",
        "Placard Structures",
        "Cognitive Glue",
        "Aqueous Medium",
        "Electrical Activity"
      ],
      "content_summary": "The speaker, Michael Levin, discusses the role of bioelectricity in embryonic development, emphasizing its function as a 'memory' for building structures and as a means of communication between embryos. He also mentions the complex electrical activity within cells.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_022",
      "text": "Now if you're going to communicate, you can't just listen. You have to be able to convey messages to. And so this is just one example. I could show you hours of this kind of stuff where what we can do is say to some, some cells that are going to normally make a gut, we can give them the message that says make an eye. And that message is encoded electrically. We introduce it using ion channel potassium channels encoded by RNA that make a little voltage gradient that looks just like that eye spot that I showed you a minute ago. And sure enough, the cells get the message and they make an eye.",
      "token_count": 116,
      "sentence_count": 7,
      "start_sentence": 22,
      "end_sentence": 28,
      "start_time_ms": 1152330,
      "end_time_ms": 1181810,
      "start_time_seconds": 1152.33,
      "end_time_seconds": 1181.81,
      "primary_topics": [
        "Cellular communication",
        "Bioelectricity",
        "Developmental biology",
        "Cellular differentiation"
      ],
      "secondary_topics": [
        "Ion channels",
        "Potassium channels",
        "RNA encoding",
        "Voltage gradient",
        "Eye development"
      ],
      "key_terms": [
        "Ion channel",
        "Potassium channels",
        "RNA",
        "Voltage gradient",
        "Cell differentiation",
        "Bioelectricity"
      ],
      "content_summary": "The speaker discusses the ability to manipulate cellular development through bioelectric signals. By introducing a voltage gradient via potassium channels encoded by RNA, cells that would normally develop into gut tissue can be instructed to form an eye instead.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_023",
      "text": "Now there's something very important here, which is that when I'm talking to you all, I don't need to worry about reaching in and making sure that all your synaptic connections are doing the right biochemical things so that you remember what I'm saying. You are going to take care of all of that because you're a multi scale cognitive system. All I need to do is give you prompts with a very thin linguistic interface and then you will do all the hard work of arranging the internals of your brain to, to, to, to act accordingly. The same thing is true here. We provide a very simple signal. It's a prompt. It says make an eye. We don't tell the cells what to do. We don't tell which genes to turn on and off. We don't talk to the stem cells. We, in fact, we have no idea how to actually make an eye any more than I have any idea of how to manipulate your synapses so that you remember what I'm saying. The system takes care of all of that because it is a multiscale cognitive agent that takes high level information and it handles all the stuff downstream, including, if we only get a few cells here, they will do the job of telling their neighbors.",
      "token_count": 221,
      "sentence_count": 14,
      "start_sentence": 23,
      "end_sentence": 36,
      "start_time_ms": 1181970,
      "end_time_ms": 1236490,
      "start_time_seconds": 1181.97,
      "end_time_seconds": 1236.49,
      "primary_topics": [
        "Multiscale Cognitive System",
        "Biochemical Synaptic Connections",
        "Cellular Communication"
      ],
      "secondary_topics": [
        "Linguistic Interface",
        "Gene Regulation",
        "Stem Cells",
        "Neural Synapses",
        "High Level Information Processing",
        "Cellular Signaling"
      ],
      "key_terms": [
        "Synaptic connections",
        "Multiscale cognitive system",
        "Linguistic interface",
        "Gene regulation",
        "Stem cells",
        "Neural synapses",
        "Cellular signaling"
      ],
      "content_summary": "The speaker discusses the concept of a multiscale cognitive system, where high-level prompts can trigger complex internal processes without direct manipulation of the system's components. This is compared to how a simple signal can prompt cells to create an eye, without needing to directly control each cell's actions.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_024",
      "text": "So the blue ones are the ones that we injected. All of this other stuff, this lens that's sitting out in the, in the flank of a tadpole, we didn't touch any of those cells. These cells told those cells what to do. They said, they said, you need to participate with us to make this thing because there's not enough of us to make to. And by the way, these other cells resist. They have a different vision of the future that they were following before. And we can actually track the communication that goes back and forth and to see who wins. Because it's a cancer suppression mechanism. Cells don't just pick up whatever message you happen to give them, they resist. They have their own idea of what they should be doing.",
      "token_count": 135,
      "sentence_count": 10,
      "start_sentence": 24,
      "end_sentence": 33,
      "start_time_ms": 1236490,
      "end_time_ms": 1266700,
      "start_time_seconds": 1236.49,
      "end_time_seconds": 1266.7,
      "primary_topics": [
        "Cell Communication",
        "Cellular Resistance",
        "Cancer Suppression Mechanisms"
      ],
      "secondary_topics": [
        "Cell Injection",
        "Cellular Identity",
        "Cellular Cooperation",
        "Cellular Conflict",
        "Bioelectric Signaling",
        "Cellular Development",
        "Cellular Behavior"
      ],
      "key_terms": [
        "Injected Cells",
        "Lens Cells",
        "Cell Communication",
        "Cancer Suppression",
        "Cellular Resistance",
        "Bioelectric Signaling"
      ],
      "content_summary": "The speaker discusses an experiment where certain cells were injected into a tadpole. These injected cells communicated with the existing cells, instructing them to cooperate in a certain task. However, the existing cells resisted this instruction, demonstrating a cancer suppression mechanism and their own cellular identity.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_025",
      "text": "So it's really all this morphogene is a constant battle of worldviews. It's a battle of models. And cell collectives have to decide which model of the future they're going to go with. Another thing you can do with this interface is to actually change the scale, the size of the self, in other words, the scale of the cognitive light cone or the size of the goals that it can pursue. So again, the individual cells have little tiny cognitive light cones and they remember very simple goals like hunger level or ph or things like that. And then that's what they pursue. Their, their homeostatic set points are very simple things like that.",
      "token_count": 115,
      "sentence_count": 7,
      "start_sentence": 25,
      "end_sentence": 31,
      "start_time_ms": 1266780,
      "end_time_ms": 1305450,
      "start_time_seconds": 1266.78,
      "end_time_seconds": 1305.45,
      "primary_topics": [
        "Morphogenesis",
        "Cellular Decision Making",
        "Cognitive Light Cones",
        "Cellular Goals",
        "Homeostatic Set Points"
      ],
      "secondary_topics": [
        "Cellular Memory",
        "Cellular Scale",
        "Cellular Models",
        "Cellular Worldviews",
        "Cellular Interfaces",
        "Cellular Homeostasis",
        "Cellular Behavior"
      ],
      "key_terms": [
        "Morphogene",
        "Cell Collectives",
        "Interface",
        "Scale",
        "Self",
        "Cognitive Light Cone",
        "Goals",
        "Hunger Level",
        "pH",
        "Homeostatic Set Points"
      ],
      "content_summary": "The presentation discusses the concept of morphogenesis as a battle of models or worldviews, where cell collectives decide their future. It also explores the idea of changing the scale or size of the 'self', referring to the scope of goals or 'cognitive light cones' that individual cells can pursue. These cells remember and pursue simple goals, such as hunger level or pH, which are their homeostatic set points.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_026",
      "text": "But these kinds of, these kinds of, for example, morphogenetic systems have huge grandiose goals like building a limb. And no individual cell knows what a finger is or how many fingers you're supposed to have. But the collective absolutely does. And you know that because if you try to deviate it from it, you'll see, you'll see that it knows what the set point is. So there's this question, can we, can we show how connecting cells into a larger network allows them to have larger goals? How do you expand the size of the cognitive lycone? This weird way of thinking about it has therapeutic Benefits. We try to show some practical implications for all this strange stuff that we say so that other people can see why it's useful to think about it this way. Here's a human oncogene injected into a tadpole. It normally makes a tumor. You can track why. It's because oncogenes make the cells disconnect electrically from the rest of the network. When they do that, as far as they're concerned, the rest of the body is just external environment.",
      "token_count": 187,
      "sentence_count": 13,
      "start_sentence": 26,
      "end_sentence": 38,
      "start_time_ms": 1306170,
      "end_time_ms": 1361690,
      "start_time_seconds": 1306.17,
      "end_time_seconds": 1361.69,
      "primary_topics": [
        "Morphogenetic systems",
        "Cellular networks",
        "Bioelectricity",
        "Oncogenes",
        "Tumor development"
      ],
      "secondary_topics": [
        "Cellular cognition",
        "Therapeutic benefits",
        "Electrical disconnection of cells",
        "External environment perception by cells",
        "Practical implications of cellular networks"
      ],
      "key_terms": [
        "Morphogenetic systems",
        "Cognitive lycone",
        "Oncogene",
        "Tumor",
        "Cellular network",
        "Bioelectricity",
        "Therapeutic benefits"
      ],
      "content_summary": "The presentation discusses the concept of morphogenetic systems and cellular networks in the context of bioelectricity. It explores how cells, though individually unaware, collectively form structures like limbs. The speaker also discusses the role of oncogenes in tumor development, where cells disconnect electrically from the rest of the network, perceiving the body as an external environment.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_027",
      "text": "So it's not that they're more selfish, is that they have smaller selves. The border between self and world shrinks. And whereas before it was part of this big collective that could entertain thoughts about, you know, building a proper skin and muscle and whatever, now it's just an amoeba doing its thing. So metastasis. But what you can do is forcibly reconnect these cells to the collective. And we've done that here. And if you do that, the oncoprotein is still there. It's labeled in red, so you can see it's blazingly expressed. This is the same animal, but there's no tumor. We didn't kill the cells. We didn't fix the genetic lesion. We didn't do any of that. What we did do is force the cells to be part of this electrical network where it is now part of a larger self with larger goals, working on anatomical things instead of being an amoeba in an environment.",
      "token_count": 159,
      "sentence_count": 13,
      "start_sentence": 27,
      "end_sentence": 39,
      "start_time_ms": 1362410,
      "end_time_ms": 1406720,
      "start_time_seconds": 1362.41,
      "end_time_seconds": 1406.72,
      "primary_topics": [
        "Cellular communication",
        "Bioelectricity",
        "Cancer metastasis",
        "Cellular identity"
      ],
      "secondary_topics": [
        "Oncoprotein expression",
        "Genetic lesions",
        "Cellular network",
        "Anatomical development",
        "Cellular reconnection"
      ],
      "key_terms": [
        "Selfish cells",
        "Amoeba",
        "Metastasis",
        "Oncoprotein",
        "Electrical network",
        "Larger self",
        "Anatomical things"
      ],
      "content_summary": "The speaker discusses the concept of cellular identity and communication, particularly in the context of cancer metastasis. They describe an experiment where they forcibly reconnect cancerous cells to the collective cellular network, which results in the cessation of tumor growth despite the continued presence of the oncoprotein.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_028",
      "text": "So just to kind of recap, what I've showed you is that this bioelectrical interface allows you to detect, reset and communicate with a very unconventional collective intelligence. And what it does is think about how to move an anatomical configuration through the space of anatomical possibilities. And if we had more time, I could show you a whole bunch of different problem solving kind of competencies that it has along those lines. So all of this kind of way of thinking about it suggests to me a different kind of biomedicine. So everything that we do today is mostly bottom up. It's focused on the hardware here. If we actually focus not only on the software, but actually on the intelligence inside the agential material of life, you end up with all kinds of applications. Most of this I didn't get to show you as far as training cells and tissues and top down communication via, via electroceuticals and things like that.",
      "token_count": 163,
      "sentence_count": 8,
      "start_sentence": 28,
      "end_sentence": 35,
      "start_time_ms": 1408560,
      "end_time_ms": 1462950,
      "start_time_seconds": 1408.56,
      "end_time_seconds": 1462.95,
      "primary_topics": [
        "Bioelectrical Interface",
        "Collective Intelligence",
        "Anatomical Configuration",
        "Biomedicine",
        "Agential Material of Life"
      ],
      "secondary_topics": [
        "Problem Solving Competencies",
        "Bottom Up Approach",
        "Hardware and Software in Biomedicine",
        "Training Cells and Tissues",
        "Top Down Communication",
        "Electroceuticals"
      ],
      "key_terms": [
        "Bioelectrical Interface",
        "Anatomical Configuration",
        "Biomedicine",
        "Agential Material",
        "Electroceuticals",
        "Collective Intelligence",
        "Problem Solving Competencies"
      ],
      "content_summary": "Michael Levin discusses the bioelectrical interface's ability to detect, reset, and communicate with a collective intelligence, which can navigate through various anatomical possibilities. He suggests a shift from a bottom-up to a top-down approach in biomedicine, focusing on the intelligence within the agential material of life, leading to potential applications such as training cells and tissues and utilizing electroceuticals.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_029",
      "text": "So I think the future, future medicine is not going to look like chemistry. It's going to look a lot more like a kind of somatic psychiatry. Bioelectrics is one interface Layer. No doubt there are others. There are, you know, biophotons and other, other things that probably will be developed. But, but I think the most well developed at this point is bioelectricity. So now we can ask. Okay, so, so if the future of all of this is really the study of patterns, it's the study of patterns of thought and behavior that occur in these weird media such as, such as the electrical networks of your body, where do these patterns come from? And the standard answer in biology is, well, they come from two places. Biologists love two kinds of explanations for things. One is history.",
      "token_count": 140,
      "sentence_count": 12,
      "start_sentence": 29,
      "end_sentence": 40,
      "start_time_ms": 1463270,
      "end_time_ms": 1509710,
      "start_time_seconds": 1463.27,
      "end_time_seconds": 1509.71,
      "primary_topics": [
        "Future of Medicine",
        "Bioelectricity",
        "Study of Patterns"
      ],
      "secondary_topics": [
        "Somatic Psychiatry",
        "Interface Layers",
        "Biophotons",
        "Electrical Networks of the Body",
        "Biological Explanations"
      ],
      "key_terms": [
        "Bioelectrics",
        "Biophotons",
        "Somatic Psychiatry",
        "Bioelectricity",
        "Electrical Networks"
      ],
      "content_summary": "The speaker, Michael Levin, suggests that the future of medicine will not be centered around chemistry, but rather will resemble somatic psychiatry, with bioelectricity as a key interface layer. He emphasizes the importance of studying patterns, particularly those found in the electrical networks of the body.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_030",
      "text": "In other words, a history of selection. The pattern is what it is because everything else died out. And this is what we have now. So in other words, there's a historical explanation for why this pattern, not some other pattern. And the other thing the biologists like is physics. In other words, patterns are constrained by physical effects and the properties of the physical world. And so some of those patterns just come from the physics. So what's interesting though is that there are some patterns, and we can start with the one studied by mathematicians, that have neither a genetic nor an environmental explanation.",
      "token_count": 106,
      "sentence_count": 8,
      "start_sentence": 30,
      "end_sentence": 37,
      "start_time_ms": 1509790,
      "end_time_ms": 1544380,
      "start_time_seconds": 1509.79,
      "end_time_seconds": 1544.38,
      "primary_topics": [
        "Natural Selection",
        "Physical Constraints on Biological Patterns",
        "Mathematical Patterns in Biology"
      ],
      "secondary_topics": [
        "Genetic Influence on Biological Patterns",
        "Environmental Influence on Biological Patterns",
        "Historical Explanations in Biology",
        "Physics in Biology",
        "Pattern Formation"
      ],
      "key_terms": [
        "Selection",
        "Pattern",
        "Physics",
        "Genetics",
        "Environment",
        "Mathematical Patterns"
      ],
      "content_summary": "The speaker discusses the influence of natural selection and physical constraints on biological patterns. They also mention that some patterns studied by mathematicians lack genetic or environmental explanations.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Evolutionary Biology",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_031",
      "text": "In other words, this thing that you're looking at here, and then here are some videos of what the pattern actually looks like when you start tweaking the formula. This is a very simple function in complex number z, so z cubed plus 7. For example, if you do something called a Hali plot, where it's a very simple algorithm for plotting the roots of this and how the roots behave of this function, you get this amazing complex pattern. Doesn't hurt that it's kind of very organic looking, which is why I use this example. But what's salient here is that there's a tiny seed. It encodes a very complex, very rich kind of structure. And if you wanted to explain why it looks like this, there are no facts of the physical world that explain it. There is nothing in the history of, of the physics of the universe that explains why this is the way it is. The explanation does not come from the physical world. You cannot tweak any of the, you know, the, the constants of, of the universe at the beginning of the Big Bang. And get a different pattern out of this. It, it is an extra thing that is, is distinct from information you get from your genetic lineage and information you get from your physical environment. Environment. And there are plenty of patterns like this and like this and like this in that space. As you, as you play with these kinds of, you play with these kinds of things.",
      "token_count": 259,
      "sentence_count": 15,
      "start_sentence": 31,
      "end_sentence": 45,
      "start_time_ms": 1544380,
      "end_time_ms": 1614960,
      "start_time_seconds": 1544.38,
      "end_time_seconds": 1614.96,
      "primary_topics": [
        "Complex Numbers",
        "Patterns in Nature",
        "Mathematical Functions"
      ],
      "secondary_topics": [
        "Hali Plot",
        "Roots of Functions",
        "Information Encoding",
        "Physical Constants",
        "Big Bang Theory"
      ],
      "key_terms": [
        "Complex Number",
        "Z Cubed Plus 7",
        "Hali Plot",
        "Roots",
        "Physical World",
        "Constants of the Universe",
        "Genetic Lineage",
        "Physical Environment"
      ],
      "content_summary": "The speaker discusses the complex patterns that can be created from simple mathematical functions, specifically using complex numbers. They highlight that these patterns cannot be explained by physical constants or the history of physics, suggesting that they represent a distinct form of information separate from genetic lineage and physical environment.",
      "scientific_domain": "Mathematical Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_032",
      "text": "So so, so now, now we can start to ask, okay, so what does this have to do with biology? Could we, could we find any living forms without a large scale history? In other words, if biologists will say that, that whatever form you have is driven by your evolutionary history, are there any for any beings that, that are picking up forms that cannot be explained in this way? So I'm going to show you just one. This is something called an anthrobot. If I showed it to you for the first time, you may have already seen this. If you saw this for the first time, you might be tempted to guess that this is some sort of primitive organism that we picked up at the bottom of a pond somewhere. You might take a guess about its genome. You might think that, well, this will have an early genome of an early metazoan.",
      "token_count": 157,
      "sentence_count": 10,
      "start_sentence": 32,
      "end_sentence": 41,
      "start_time_ms": 1615280,
      "end_time_ms": 1657840,
      "start_time_seconds": 1615.28,
      "end_time_seconds": 1657.84,
      "primary_topics": [
        "Evolutionary Biology",
        "Developmental Biology",
        "Genomics"
      ],
      "secondary_topics": [
        "Anthrobot",
        "Primitive Organisms",
        "Metazoan",
        "Genome Analysis",
        "Biology of Form"
      ],
      "key_terms": [
        "Evolutionary History",
        "Living Forms",
        "Large Scale History",
        "Genome",
        "Metazoan",
        "Anthrobot"
      ],
      "content_summary": "The speaker, Michael Levin, discusses the concept of evolutionary biology and how it influences the form of living beings. He introduces the term 'anthrobot', a presumably primitive organism, and speculates about its genome, suggesting it might be similar to that of an early metazoan.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Genomics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_033",
      "text": "For example, if you were actually sequenced, this genome, you would find out that it's 100% Homo sapiens. These anthrobots are self assembled from adult human cells. They come from tracheal epithelia that human patients donate. Some of these patients are alive and well when they donate this, some are not. So for those that are not, this is a weird kind of life after death where these cells self assemble into a motile little organism. It matches no stage of normal human development. You would not be able to guess from the human genome that this is what you would get. Actually, you wouldn't even guess from the genome that the human body is what you would get.",
      "token_count": 119,
      "sentence_count": 8,
      "start_sentence": 33,
      "end_sentence": 40,
      "start_time_ms": 1657840,
      "end_time_ms": 1697780,
      "start_time_seconds": 1657.84,
      "end_time_seconds": 1697.78,
      "primary_topics": [
        "Genome sequencing",
        "Cell self-assembly",
        "Human development"
      ],
      "secondary_topics": [
        "Cell donation",
        "Tracheal epithelia",
        "Anthrobots",
        "Life after death concept",
        "Genome and physical form correlation"
      ],
      "key_terms": [
        "Homo sapiens",
        "Genome",
        "Tracheal epithelia",
        "Self-assembly",
        "Anthrobots",
        "Motile organism"
      ],
      "content_summary": "The speaker discusses the concept of anthrobots, which are self-assembled from adult human cells, specifically tracheal epithelia. Despite their human genetic makeup, these entities do not match any stage of normal human development, illustrating the complex relationship between a genome and the physical form it can produce.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Genomics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_034",
      "text": "But you certainly wouldn't know this. So it's interesting. What capacities does this creature have? It's never existed on Earth before. There have never been any anthropods. There's never been any selection to have to be a good anthrobot. What can it do? And where do those patterns come from? Well, one thing it can do, if you played a bunch of, a bunch of human neurons on a dish and make a big scratch through them like this, one thing you'll find is that these, these anthrobots cluster in what we call a superbot. So they make this, this like pile up. And then what they do is over the next four days they start healing the wound. And so if you lift it up, this is what you see. They're sitting there knitting across the gap. Okay, now who would have thought that your tracheal cells, which sit there in your airway for long periods of time, dealing with dust particles and whatnot, that given the opportunity to reboot their sel, to reboot their multicellularity, would go on and make this kind of self motile thing that by the way, has the ability to heal of your body.",
      "token_count": 200,
      "sentence_count": 16,
      "start_sentence": 34,
      "end_sentence": 49,
      "start_time_ms": 1697860,
      "end_time_ms": 1749570,
      "start_time_seconds": 1697.86,
      "end_time_seconds": 1749.57,
      "primary_topics": [
        "Anthrobots",
        "Cellular Multicellularity",
        "Wound Healing"
      ],
      "secondary_topics": [
        "Cellular Rebooting",
        "Cell Motility",
        "Tracheal Cells",
        "Neurons",
        "Cellular Clustering",
        "Bioelectricity"
      ],
      "key_terms": [
        "Anthrobots",
        "Superbot",
        "Neurons",
        "Tracheal Cells",
        "Multicellularity",
        "Cell Motility",
        "Wound Healing"
      ],
      "content_summary": "The speaker discusses the concept of 'anthrobots', a new type of multicellular organism created from human neurons. These anthrobots can cluster into a 'superbot' and demonstrate the ability to heal wounds over time, showing a surprising level of motility and adaptability.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_035",
      "text": "So obviously this is a technology that we're developing for in the body repair. It's made of your own cells. You won't need immunosuppression once we figure out how to ask these cells to do the things we want them to do. This is all kinds of useful technology. But the other important thing about this is that first of all, they have four different discrete behaviors. And you can draw an ethogram of those transition states between those behaviors like you would in any animal. They have a drastically remodeled transcriptome. What I mean by that is this volcano plot shows different genes that they express differently than the tissue they came from. Each one of these red genes, there are about 9,000 of them.",
      "token_count": 126,
      "sentence_count": 9,
      "start_sentence": 35,
      "end_sentence": 43,
      "start_time_ms": 1749730,
      "end_time_ms": 1789590,
      "start_time_seconds": 1749.73,
      "end_time_seconds": 1789.59,
      "primary_topics": [
        "Cellular Technology for Body Repair",
        "Cellular Behavior",
        "Transcriptome Remodeling"
      ],
      "secondary_topics": [
        "Immunosuppression",
        "Ethogram",
        "Transition States",
        "Gene Expression",
        "Volcano Plot"
      ],
      "key_terms": [
        "Immunosuppression",
        "Ethogram",
        "Transition States",
        "Transcriptome",
        "Volcano Plot",
        "Gene Expression"
      ],
      "content_summary": "The speaker discusses a developing technology for body repair using the patient's own cells, eliminating the need for immunosuppression. They also describe the cells' four distinct behaviors and the drastic remodeling of their transcriptome, with around 9,000 genes expressing differently than the tissue they originated from.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_036",
      "text": "So almost half the genome is differently expressed than it is in that tissue. So when we say why do humans look the way they look and have certain properties? You say, well, it's the human genome. Yeah. The same genome can also make this. And if you do enable them to make this, and we don't edit the genome, there's no weird nanomaterials, there are no scaffolds, no synthetic biology circuits. The cells do all the work when they do this. They will pick and choose what they express from their genome. About half of them to be in a completely different kind of form and function.",
      "token_count": 108,
      "sentence_count": 9,
      "start_sentence": 36,
      "end_sentence": 44,
      "start_time_ms": 1789590,
      "end_time_ms": 1820820,
      "start_time_seconds": 1789.59,
      "end_time_seconds": 1820.82,
      "primary_topics": [
        "Genome Expression",
        "Cellular Function",
        "Cellular Form"
      ],
      "secondary_topics": [
        "Human Genome",
        "Genetic Editing",
        "Nanomaterials",
        "Synthetic Biology Circuits",
        "Cellular Work",
        "Gene Expression"
      ],
      "key_terms": [
        "Genome",
        "Expression",
        "Properties",
        "Synthetic Biology",
        "Scaffolds",
        "Form",
        "Function"
      ],
      "content_summary": "The speaker discusses the variability of genome expression, emphasizing that the same genome can lead to different forms and functions. The speaker also highlights that this process does not involve genetic editing, nanomaterials, or synthetic biology circuits, but rather the cells themselves choosing what to express from their genome.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_037",
      "text": "So, okay, so just to kind of end here, I want to say a couple of quick things. The first thing, and so this is kind of the most, the latest and the most kind of exploratory aspect of all this work is that I see all of this stuff, the xenobots that we build, the anthrobots, the chimeras, all the things that we make. I see them as exploration vehicles. I see them as enabling a systematic mapping of the relationship between the interfaces that we make, which are the physical objects. So I think all physical objects, including cells and embryos and bodies and, and robots and everything, all of these things are physical, are interfaces or pointers into a space of pattern. Mathematicians have known this for a long time. They study kind of one region of that space. And there's all kinds of truths and patterns of mathematical objects that don't come from the physical world.",
      "token_count": 160,
      "sentence_count": 9,
      "start_sentence": 37,
      "end_sentence": 45,
      "start_time_ms": 1820980,
      "end_time_ms": 1874220,
      "start_time_seconds": 1820.98,
      "end_time_seconds": 1874.22,
      "primary_topics": [
        "Bioelectricity",
        "Developmental Biology",
        "Xenobots",
        "Anthrobots",
        "Chimeras"
      ],
      "secondary_topics": [
        "Physical Interfaces",
        "Systematic Mapping",
        "Space of Pattern",
        "Mathematical Objects",
        "Physical Objects"
      ],
      "key_terms": [
        "Exploration Vehicles",
        "Cells",
        "Embryos",
        "Bodies",
        "Robots",
        "Interfaces",
        "Pointers",
        "Patterns",
        "Mathematicians"
      ],
      "content_summary": "The speaker, Michael Levin, discusses the latest developments in bioelectricity and developmental biology. He views xenobots, anthrobots, and chimeras as exploration vehicles that enable a systematic mapping of the relationship between physical objects and patterns. He also draws a connection between these biological constructs and mathematical objects.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_038",
      "text": "But I actually think it's a much richer space and it contains other very high agency patterns that we recognize as kinds of minds. And everything, everything that we do are, is, is basically poking holes in this, in this kind of separation between the interfaces and the patterns that that ingress through, through these, through these interfaces. And so, and so it's just the very last thing I'll say is lest we get too smug about our ability to access this space because you know, among us are certain geniuses that can perceive incredible, incredible truths and works of art and literature and so on. And so they're picking out, right, they're picking out things out of that space and letting them come into the, come into the world. Lest we think that this is some kind capability, I will just point out that first of all, there are no humans as a sharp category.",
      "token_count": 156,
      "sentence_count": 7,
      "start_sentence": 38,
      "end_sentence": 44,
      "start_time_ms": 1874540,
      "end_time_ms": 1921090,
      "start_time_seconds": 1874.54,
      "end_time_seconds": 1921.09,
      "primary_topics": [
        "Perception of patterns",
        "Interface interaction",
        "Human cognition"
      ],
      "secondary_topics": [
        "Art and literature",
        "Human categorization",
        "Genius perception",
        "Access to cognitive space",
        "Pattern recognition"
      ],
      "key_terms": [
        "Agency patterns",
        "Interfaces",
        "Ingress",
        "Geniuses",
        "Cognitive space",
        "Human categorization"
      ],
      "content_summary": "The speaker discusses the rich complexity of human cognition, particularly in recognizing and interacting with patterns. They also touch on the unique abilities of certain 'geniuses' to perceive and bring forth complex truths from these cognitive spaces.",
      "scientific_domain": "Developmental biology, Cognitive science",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_039",
      "text": "So we are at the center of all kinds of continuum, both developmentally, evolutionarily, whatever you think that humans are or can do, you have to have a story for where did it sort of evolve, where does it, does it come from and how does it scale in fact, both with biological changes and technological changes. This again, the standard human category becomes extreme, extremely diffuse because of the plasticity of life that allows us to, that allows it to interact, be interoperable with all kinds of modifications and this, this sort of thing. If, if you in the audience, if you're a therapist or you're interested in the crisis of meaning and helping people through this and, and so on, you've got a set of some constituents that count on you for help. You really have to start thinking about here. Here are your, here are your patients of the future. Okay, this is, you know, the standard human patient is, is not enough. There are going to be all kinds of interesting new beings with all kinds of needs that we are going to have to address in some way.",
      "token_count": 193,
      "sentence_count": 10,
      "start_sentence": 39,
      "end_sentence": 48,
      "start_time_ms": 1921090,
      "end_time_ms": 1976780,
      "start_time_seconds": 1921.09,
      "end_time_seconds": 1976.78,
      "primary_topics": [
        "Human Evolution",
        "Biological and Technological Changes",
        "Plasticity of Life"
      ],
      "secondary_topics": [
        "Interoperability with Modifications",
        "Therapeutic Approaches",
        "Future Patients",
        "Crisis of Meaning",
        "Human Categories"
      ],
      "key_terms": [
        "Continuum",
        "Evolve",
        "Scale",
        "Biological Changes",
        "Technological Changes",
        "Plasticity",
        "Interoperable",
        "Modifications",
        "Therapist",
        "Constituents"
      ],
      "content_summary": "The speaker discusses the evolution of humans in the context of biological and technological changes. They emphasize the plasticity of life and the need for therapists to adapt to the future needs of patients, who may be significantly different due to biological and technological advancements.",
      "scientific_domain": "Developmental Biology, Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_040",
      "text": "Some of these will have the same existential concerns as us. Some will have very different concerns. I think that because of this interoperability, all natural life is a tiny corner of this option space and pretty much every combination of evolved material, design material, software and these patterns that you can't forget about as an ingredient is some kind of, you know, there will be hybrids and cyborgs and just every possible kind of being that we are going to have to enter some sort of ethical synthesis synth biosis with. And then the last thing I'll. Whoops, the last thing I'll say is just this, that even that there's some serious humility warranted in all of this because a lot of people think that A, it's complexity that that makes all this work or that B, there's something special about the biological material and this kind of trial and error process of evolution and our work. And again, I don't have time to get into the details.",
      "token_count": 169,
      "sentence_count": 9,
      "start_sentence": 40,
      "end_sentence": 48,
      "start_time_ms": 1976780,
      "end_time_ms": 2032010,
      "start_time_seconds": 1976.78,
      "end_time_seconds": 2032.01,
      "primary_topics": [
        "Interoperability of life",
        "Evolution of material and design",
        "Ethical considerations for new life forms"
      ],
      "secondary_topics": [
        "Existential concerns of life forms",
        "Role of software and patterns in life",
        "Concept of hybrids and cyborgs",
        "Humility in scientific research",
        "Complexity in biological systems",
        "Special characteristics of biological material",
        "Trial and error process in evolution"
      ],
      "key_terms": [
        "Interoperability",
        "Evolution",
        "Ethics",
        "Hybrids",
        "Cyborgs",
        "Complexity",
        "Biological material",
        "Trial and error process"
      ],
      "content_summary": "The speaker discusses the vast possibilities of life forms due to the interoperability of natural life and evolution of material and design. He mentions the emergence of hybrids and cyborgs and the ethical considerations that come with it. The speaker also emphasizes the need for humility in understanding the complexity and special characteristics of biological material in the process of evolution.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Bioethics",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_041",
      "text": "But even looking at deterministic, extremely simple things that people that computer scientists study, like sorting algorithms already, you see that, yeah, it does the thing the algorithm tells it to do. But if you know how to look, you also find it doing all kinds of interesting side quests that the algorithm does not ask them to do that are, in fact, kinds of, that are things that you would recognize as aspects of cognition, very minimal, but yet there they are. And so, and so I really think this goes all the way down. This ability to have the freedom to express patterns from that space that are not fully determined by the physics of your world or the algorithms that, that we think you are following, it is always richer than that, even in extremely simple systems. And so just, just to remind us again, you know, Magritte was telling us that, that our formal models are not the thing itself. And I would say the same thing. You know, there's a lot of organic thinkers who are down on computationalism, and they say living things aren't, aren't machines. They say, right, nothing is machine because a machine is a formal model that humans have defined to, to handle certain aspects of what physical objects do in the world. And it doesn't fully describe even the simplest kinds of systems, never mind, of course, the biological systems.",
      "token_count": 240,
      "sentence_count": 11,
      "start_sentence": 41,
      "end_sentence": 51,
      "start_time_ms": 2032010,
      "end_time_ms": 2106369,
      "start_time_seconds": 2032.01,
      "end_time_seconds": 2106.369,
      "primary_topics": [
        "Deterministic Systems",
        "Computational Models",
        "Biological Systems"
      ],
      "secondary_topics": [
        "Sorting Algorithms",
        "Cognition",
        "Freedom of Expression in Systems",
        "Formal Models",
        "Organic Thinkers",
        "Physical Objects"
      ],
      "key_terms": [
        "Deterministic",
        "Algorithms",
        "Cognition",
        "Physics",
        "Computationalism",
        "Machines",
        "Biological Systems"
      ],
      "content_summary": "Michael Levin discusses the complexity of deterministic systems, such as sorting algorithms, and how they can exhibit aspects of cognition not dictated by their programming. He emphasizes that computational models, including those used to describe biological systems, are always more complex than their formal definitions, and that nothing, including living things, can be fully described as a machine.",
      "scientific_domain": "Developmental Biology, Bioelectricity, Computer Science",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_042",
      "text": "So nothing is a machine. But some things look like the machines, like a machine to lazy observers. And I think for exactly the same reason that the rules of biochemistry don't encompass the story of the human mind. Formal models of algorithms and materials do not encompass the story of minimal beings. So really, I think we have to get much wider in our perception of what we can relate with. So I'll just, I'm going to end here and just thank the people who did the work that I showed you. Here's some postdocs and students and collaborators in our lab and disclosures are three companies that have spun off from the work that we do. And of course, thank our funders and the model systems because they've done the most hard work in teaching us about this stuff.",
      "token_count": 141,
      "sentence_count": 8,
      "start_sentence": 42,
      "end_sentence": 49,
      "start_time_ms": 2106680,
      "end_time_ms": 2147160,
      "start_time_seconds": 2106.68,
      "end_time_seconds": 2147.16,
      "primary_topics": [
        "Biochemistry",
        "Algorithms",
        "Material Science",
        "Perception"
      ],
      "secondary_topics": [
        "Human Mind",
        "Minimal Beings",
        "Scientific Collaboration",
        "Scientific Funding",
        "Model Systems",
        "Bioelectricity Research"
      ],
      "key_terms": [
        "Biochemistry",
        "Algorithms",
        "Material Science",
        "Perception",
        "Human Mind",
        "Minimal Beings",
        "Postdocs",
        "Students",
        "Collaborators",
        "Disclosures",
        "Model Systems"
      ],
      "content_summary": "The speaker emphasizes the need for a broader perception in understanding biochemistry and its relation to the human mind. He acknowledges the contributions of his team, collaborators, and funders, and highlights the importance of model systems in their research.",
      "scientific_domain": "Developmental Biology and Bioelectricity",
      "enhanced": true
    },
    {
      "chunk_id": "OD5TOsPZIQY_chunk_043",
      "text": "So thank you so much and I'll stop here.",
      "token_count": 9,
      "sentence_count": 1,
      "start_sentence": 43,
      "end_sentence": 43,
      "start_time_ms": 2147320,
      "end_time_ms": 2148920,
      "start_time_seconds": 2147.32,
      "end_time_seconds": 2148.92,
      "primary_topics": [],
      "secondary_topics": [],
      "key_terms": [],
      "content_summary": "",
      "scientific_domain": "",
      "enhanced": true
    }
  ],
  "processing_timestamp": ""
}