{
  "chunk_id": "zKjdkxrvE6k_chunk_030",
  "text": "So I'm very interested in this kind of stuff. When we make novel beings, whether technological hybrids or biological and cyborgs and augmented Humans, all kinds of weird stuff that is already partially in existence. What else? I mean, these, you know, these things, these things here don't really necessarily have a history of selection for specific properties. Where else are they getting these goals if it's not? Where do these patterns come from if it's not selection? And by the way, one story I didn't show you is that there is an anatomical space. There are these attractors that correspond to different species shapes. And we can actually show that the same genetic hardware can actually visit multiple attractors. It doesn't have to go to its species specific attractor, but, but they're there. And then people will say, well, okay, fine, so these are shaped by evolution.",
  "token_count": 148,
  "sentence_count": 11,
  "start_sentence": 30,
  "end_sentence": 40,
  "start_time_ms": 1473340,
  "end_time_ms": 1523520,
  "start_time_seconds": 1473.34,
  "end_time_seconds": 1523.52,
  "primary_topics": [
    "Biohybrid organisms",
    "Cyborgs and augmented humans",
    "Evolutionary selection",
    "Species-specific attractors",
    "Genetic hardware"
  ],
  "secondary_topics": [
    "Anatomical space",
    "Evolutionary biology",
    "Genetic variation",
    "Pattern formation",
    "Developmental biology",
    "Bioelectricity",
    "Morphogenesis"
  ],
  "key_terms": [
    "Technological hybrids",
    "Biological and cyborgs",
    "Augmented humans",
    "Selection",
    "Anatomical space",
    "Attractors",
    "Species shapes",
    "Genetic hardware"
  ],
  "content_summary": "The speaker discusses the creation of novel beings, such as biohybrid organisms and augmented humans, questioning where their patterns and goals come from if not from selection. They also mention the existence of species-specific attractors in an anatomical space, which can be visited by the same genetic hardware.",
  "scientific_domain": "Developmental Biology and Bioelectricity",
  "enhanced": true
}