{
  "chunk_id": "zKjdkxrvE6k_chunk_020",
  "text": "But you also apparently can't. You don't know how many copies of your genetic material you're going to have. You don't know how big your cells are going to be. You don't know how many cells you're going to have. But you still have to make that newt. And in a minute I'm going to show you you can actually make other things. But you try really hard to make that newt, despite the fact that you can't even rely on your own parts, never mind the environment. You can't even assume that your parts are what they are. So here, for the next couple minutes, I just want to talk about this. That unlike most of the things we program, life really operates with a, with a poly computing architecture where you are free to reinterpret all the messages that you have, and those are genetic messages from the past. Everything you have is up for interpretation. Because your substrate is unreliable. You cannot afford to care too much about what your ancestors thought that your genes mean or what your past self thinks that Your memories meant you have to reinterpret all this stuff from scratch.",
  "token_count": 198,
  "sentence_count": 14,
  "start_sentence": 20,
  "end_sentence": 33,
  "start_time_ms": 967770,
  "end_time_ms": 1026640,
  "start_time_seconds": 967.77,
  "end_time_seconds": 1026.64,
  "primary_topics": [
    "Genetic Material",
    "Cellular Development",
    "Bioelectricity",
    "Poly Computing Architecture in Biological Systems",
    "Genetic Interpretation"
  ],
  "secondary_topics": [
    "Newt Development",
    "Genetic Variability",
    "Cellular Variability",
    "Environmental Influence on Development",
    "Ancestral Genetic Influence",
    "Memory Interpretation",
    "Substrate Unreliability"
  ],
  "key_terms": [
    "Genetic Material",
    "Cells",
    "Newt",
    "Poly Computing Architecture",
    "Genetic Messages",
    "Substrate",
    "Ancestors",
    "Memories"
  ],
  "content_summary": "The speaker discusses the unpredictability and variability in biological systems, such as the number of genetic material copies, cell size, and cell count. Despite these uncertainties, organisms like newts still develop. The speaker introduces the concept of a poly computing architecture in life, which allows for reinterpretation of genetic messages, emphasizing the need to reinterpret ancestral genetic meanings and personal memories due to the unreliability of the biological substrate.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}