{
  "chunk_id": "zKjdkxrvE6k_chunk_035",
  "text": "So if you make a big scratch through this neural tissue in vitro, they'll sit here in this biobot cluster and they'll heal it. And you can see here, they'll. And who would have known, who would have known that your tracheal cells can do this? And we've done this with, with frog embryos too. These are xenobots, which are made from frog skin cells, from embryonic epithelial cells. They don't have the ability to reproduce the way normal frogs do, but they've figured out something different. This is basically von Neumann's dream of a robot that finds material and makes copies of itself. If you provide them with loose epithelial cells, they will push them together into little piles and they then sort of polish the little piles. The little piles mature into the next generation of xenobots. And guess what that does? It does the same thing. It makes the next generation and the next. None of this existed before in evolution. There's been no evolutionary pressure to be a good xenobot or to be a good anthrobot. And so now we're confronted with some, with two options in order to try to deal with these novel, novel forms, behaviors and other patterns that, that are not directly selected for by evolution. We can say they're emergent, which basically just means that they're surprising to us. We can catalog them and when we come across them, well, there they are. We find emergent things. I don't really like it. I like it allows you to have a sparse ontology, but it's kind of a mysterious position. I don't like just saying that. Well, it's a fact that holds in the physical world.",
  "token_count": 284,
  "sentence_count": 22,
  "start_sentence": 35,
  "end_sentence": 56,
  "start_time_ms": 1704140,
  "end_time_ms": 1797360,
  "start_time_seconds": 1704.14,
  "end_time_seconds": 1797.36,
  "primary_topics": [
    "Xenobots",
    "Bioelectricity",
    "Developmental Biology",
    "Self-replication",
    "Emergent Properties"
  ],
  "secondary_topics": [
    "Neural Tissue Healing",
    "Tracheal Cells",
    "Frog Embryos",
    "Embryonic Epithelial Cells",
    "Evolutionary Pressure",
    "Sparse Ontology"
  ],
  "key_terms": [
    "In vitro",
    "Biobot Cluster",
    "Frog Skin Cells",
    "Von Neumann's Dream",
    "Anthrobot",
    "Emergent",
    "Physical World"
  ],
  "content_summary": "The speaker discusses the creation and behavior of xenobots, which are bio-robots made from frog skin cells. These xenobots can replicate themselves by pushing together loose epithelial cells, a process not seen in traditional evolution. The speaker also discusses the concept of emergent properties, which are unexpected behaviors or patterns not directly selected for by evolution.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}