{
  "chunk_id": "zKjdkxrvE6k_chunk_029",
  "text": "So that's William James's definition of intelligence And there's, there's sort of, they have these competencies The newt will be the same size even if you mess with the genetics or the size of cells or whatever But what happens when you make novel systems Where do their goals come from Because for all of the natural systems, you could say, well, evolution did that Evolution gave you the goal And that's what we normally say Why does this animal look the way it looks Why does it have behaviors that it has Because of selection Eons of selection gave you that goal Okay, what happens in novel systems I'm very interested in where goals come from I don't really think they come from evolution per se And so we wanted a model system that tries to study that aspect of it And so in biology, we like genetics and we like environment, and those are the two things, the two sources of information that we think and so on",
  "token_count": 170,
  "sentence_count": 17,
  "start_sentence": 29,
  "end_sentence": 45,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Intelligence definition",
    "Role of evolution in shaping goals",
    "Influence of genetics and environment in biology"
  ],
  "secondary_topics": [
    "Newt's size and genetics",
    "Novel systems and their goals",
    "Sources of information in biology",
    "Model systems in biological research",
    "Concept of selection"
  ],
  "key_terms": [
    "Intelligence",
    "Evolution",
    "Genetics",
    "Environment",
    "Selection",
    "Model system",
    "Novel systems",
    "Goals"
  ],
  "content_summary": "The speaker discusses the definition of intelligence and the role of evolution in shaping the goals of biological systems. They express interest in the origins of goals in novel systems, questioning the traditional belief that they come solely from evolution. The influence of genetics and environment in biology is also discussed.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}