{
  "chunk_id": "zKjdkxrvE6k_chunk_034",
  "text": "So it, it has influence in the physical world But, but, but it isn't something that you're going to find, you know, by, by, by, by studying physics And so we've started, we've, we've started to ask, you know, what other kinds of patterns might be interesting for biology And so I'll show you just a couple of quick things This little thing, when you're looking at it, you might think that this is some sort of primitive organism that we found from a pond somewhere If you were to sequence the genome, you would find out that you're very mistaken The genome is Homo sapiens, 100% Homo sapiens, normal Homo sapiens We call these anthrobots They're self constructing little biobots that, that are made from adult human tracheal epithelial cells They are not embryonic There's no embryonic tissue here They don't resemble any stage of normal human development They are what your cells do when liberated from the rest of your body and given a chance to have a new life The patient that donated these may or may not be alive, but these guys have rebooted their multicellularity They do some cool stuff They have novel behaviors which we can arrange in ethograms, like we do for animals Half their genome is expressed differently than what they were doing when they were part of the tissue inside the patient They have cool properties like they will heal your neural wounds",
  "token_count": 242,
  "sentence_count": 18,
  "start_sentence": 34,
  "end_sentence": 51,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Bioelectricity",
    "Developmental Biology",
    "Genomics",
    "Cellular Biology",
    "Biobots"
  ],
  "secondary_topics": [
    "Genome Sequencing",
    "Cellular Rebooting",
    "Multicellularity",
    "Ethograms",
    "Neural Wound Healing",
    "Adult Human Tracheal Epithelial Cells",
    "Cellular Liberation",
    "Cellular Behavior"
  ],
  "key_terms": [
    "Anthrobots",
    "Homo sapiens",
    "Genome",
    "Tracheal Epithelial Cells",
    "Embryonic Tissue",
    "Multicellularity",
    "Ethograms",
    "Neural Wounds"
  ],
  "content_summary": "The speaker discusses the creation of 'anthrobots', self-constructing biobots made from adult human tracheal epithelial cells. These cells, when separated from the body, exhibit novel behaviors and properties, including the ability to heal neural wounds. The anthrobots do not resemble any stage of normal human development and express half their genome differently than when they were part of the tissue inside the patient.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Genomics",
  "enhanced": true
}