{
  "chunk_id": "s-SL8qy-6kA_chunk_040",
  "text": "But it's really important to understand for definitive regenerative medicine, it's important to understand our material. And what I will tell you is that if you were to sequence this genetically sequence, what you would see is 100% Homo sapiens. These are adult human cells. In fact, we call them anthrobots because these are biobots made from adult patient donated tracheal epithelium. These cells in a special environment self assemble into this motile little thing that you just saw. This is what they look like when we stain them. They have little hairs on their surface that they use. Here are these little cilia that they use to swim around. And they have some really interesting competencies. I can only show you one today. Here's one. One. These are human neurons plated in a dish here and here. We've made a scratch wound. It's a defect, it's a scratch. And they navigate these wounds, they traverse them. Then what happens is they can settle there and they form these superbot clusters.",
  "token_count": 171,
  "sentence_count": 17,
  "start_sentence": 40,
  "end_sentence": 56,
  "start_time_ms": 2148020,
  "end_time_ms": 2204630,
  "start_time_seconds": 2148.02,
  "end_time_seconds": 2204.63,
  "primary_topics": [
    "Regenerative Medicine",
    "Biobots",
    "Cell Self-Assembly",
    "Cell Navigation"
  ],
  "secondary_topics": [
    "Genetic Sequencing",
    "Adult Human Cells",
    "Tracheal Epithelium",
    "Cilia",
    "Neurons",
    "Wound Healing",
    "Superbot Clusters"
  ],
  "key_terms": [
    "Anthrobots",
    "Homo sapiens",
    "Tracheal Epithelium",
    "Cilia",
    "Neurons",
    "Scratch Wound",
    "Superbot Clusters"
  ],
  "content_summary": "The speaker discusses the importance of understanding our biological material for regenerative medicine. They describe 'anthrobots', biobots made from adult human tracheal epithelium cells that self-assemble and navigate wounds. These cells can form 'superbot clusters'.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}