{
  "chunk_id": "s-SL8qy-6kA_chunk_037",
  "text": "But look at, look at this homeostatic system. This, this huge collective has enormous grandiose goals of building a limb. And when they're deviated from that, they work really hard to get back there. So evolution and development has allowed the scaling of the goals to, to rise during, during the lifetime. And of course there's a failure mode, unfortunately, to this process, and that's cancer. So this is human glioblastoma. What's happening here is that these cells are disconnecting from the electrical network. Network. When they disconnect, they can no longer remember this giant thing they're working on. They're back to their ancient unicellular, tiny little cognitive light cone. And then these cells, these cells are not more selfish than normal cells. They just have smaller selves. The idea is that cancer is a kind of a dissociative identity disorder of the cellular collective intelligence. These cells are only working on little tiny single cell goals now. And so this means two things. It means first of all that we can watch for this electrical change and we can envision.",
  "token_count": 181,
  "sentence_count": 16,
  "start_sentence": 37,
  "end_sentence": 52,
  "start_time_ms": 1964220,
  "end_time_ms": 2021320,
  "start_time_seconds": 1964.22,
  "end_time_seconds": 2021.32,
  "primary_topics": [
    "Homeostatic System",
    "Cellular Collective Intelligence",
    "Cancer as a Dissociative Identity Disorder"
  ],
  "secondary_topics": [
    "Evolution and Development",
    "Electrical Network of Cells",
    "Glioblastoma",
    "Cellular Goals",
    "Bioelectricity"
  ],
  "key_terms": [
    "Homeostasis",
    "Cellular Collective",
    "Glioblastoma",
    "Electrical Network",
    "Dissociative Identity Disorder",
    "Unicellular",
    "Cognitive Light Cone"
  ],
  "content_summary": "The speaker discusses the concept of cellular collective intelligence and homeostasis in the context of building a limb. They propose that cancer, specifically glioblastoma, is a result of cells disconnecting from the electrical network, causing them to revert to a unicellular state and lose sight of their collective goal, likening it to a dissociative identity disorder.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}