{
  "chunk_id": "s-SL8qy-6kA_chunk_019",
  "text": "This is something that we discovered that if you take this tadpole, which is supposed to become a frog, and in order to become a frog, it has to rearrange its face, the eyes, the jaws, the nostrils, everything must move. So all of this stuff has to rearrange. You might think, and people did think, that this was just a hardwired set of processes. Every organ moves in the right direction, the right amount, and eventually you go from a normal tadpole to a normal frog. So we decided to test that in order to see the intelligence of these materials, you need to challenge them with problems. You need to do perturbations, functional perturbations. What we did was we created the so called Picasso like tadpoles. What's happening here is, look, the eyes on the back of the head, the mouth is off to the side. The whole thing is scrambled, everything is rearranged. And what we found is that they still make remarkably normal frogs because all of these organs move through novel paths. In fact, sometimes they go too far and they must come back. They go through novel paths until they get to where they're going and then they stop. And we could track all of this with CT scan. It turns out that the genetics does not specify a hardwired set of movements. What it gives you is a system that executes an error minimization scheme. It is able to detect that it's in the wrong position, it's able to move in the correct direction, and then it stops when it's done.",
  "token_count": 268,
  "sentence_count": 17,
  "start_sentence": 19,
  "end_sentence": 35,
  "start_time_ms": 962420,
  "end_time_ms": 1044470,
  "start_time_seconds": 962.42,
  "end_time_seconds": 1044.47,
  "primary_topics": [
    "Developmental Biology",
    "Bioelectricity",
    "Organ Development",
    "Error Minimization Scheme"
  ],
  "secondary_topics": [
    "Tadpole to Frog Transformation",
    "Genetics",
    "Functional Perturbations",
    "Organ Movement",
    "Intelligence of Biological Materials",
    "CT Scanning"
  ],
  "key_terms": [
    "Hardwired Processes",
    "Perturbations",
    "Picasso Tadpoles",
    "Novel Paths",
    "Error Minimization Scheme",
    "CT Scan"
  ],
  "content_summary": "The presentation discusses an experiment involving the transformation of tadpoles into frogs, challenging the notion of hardwired organ development. It was found that despite functional perturbations causing disarrangement, the organs moved through novel paths and still formed normal frogs, suggesting an error minimization scheme rather than a hardwired genetic process.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}