{
  "chunk_id": "s-SL8qy-6kA_chunk_025",
  "text": "This is where the animal's right eye is going to be. Here's the mouth, here are the placodes. And if you manipulate this electrical data structure, you will see that the gene expression changes and the anatomy changes. And I'll show you that in a bit minute. This is a critical natural component of normal embryogenesis. We are reading now the bioelectrical pre pattern, the memory that these cells are going to use in order to plan and then build the face. Here's a pathological structure and we'll talk about that in a minute. This is human oncogenes have been injected into this tadpole. They're going to make a tumor. The tumor is going to metastasize here, but long before that happened happens. You can use these voltage dyes to read the electric state of these cells and see that there's a region here which is quite aberrant, it's quite abnormal, it's highly depolarized, very different than the rest. And here's where the tumor is going to be. And then here are some Straggler cells that you should watch out for.",
  "token_count": 181,
  "sentence_count": 14,
  "start_sentence": 25,
  "end_sentence": 38,
  "start_time_ms": 1319500,
  "end_time_ms": 1370040,
  "start_time_seconds": 1319.5,
  "end_time_seconds": 1370.04,
  "primary_topics": [
    "Bioelectricity",
    "Embryogenesis",
    "Gene Expression",
    "Tumor Formation"
  ],
  "secondary_topics": [
    "Cellular Memory",
    "Anatomy Changes",
    "Voltage Dyes",
    "Oncogenes",
    "Cellular Depolarization",
    "Metastasis",
    "Pathological Structures"
  ],
  "key_terms": [
    "Placodes",
    "Electrical Data Structure",
    "Bioelectrical Pre Pattern",
    "Human Oncogenes",
    "Tadpole",
    "Metastasize",
    "Voltage Dyes",
    "Depolarized",
    "Straggler Cells"
  ],
  "content_summary": "The presentation discusses the role of bioelectricity in embryogenesis, specifically how manipulating the electrical data structure affects gene expression and anatomy. It further explores how bioelectricity can be used to predict tumor formation and metastasis in a tadpole injected with human oncogenes.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}