{
  "chunk_id": "s-SL8qy-6kA_chunk_001",
  "text": "But actually this is exactly what happens every day during voluntary motion. When you wake up in the morning, you may have very high level executive goals, social goals, career goals, whatever. And in order for you to execute behavior that implements those goals, this intent must move ions across the cell membrane in your muscle cells. So this ability of high level intelligence and its goals to control the chemistry of the body is not some rare and unusual phenomenon. It is the everyday miracle that is implemented by the electrical system of the body. There's a scientist called Fabrizio Benedetti who, who has this beautiful phrase through his work on the placebo effect. And we'll come back to this at the end. He says words and drugs have the same mechanism of action. And this is because the intelligence of the mind and the mechanisms that drive the physiology and the morphology of the body are really part of the same system. And this is very important, I think, for the future of medicine. And this is what I will talk about today. The first thing to realize is that all of us are in an important sense, collective intelligences. Not just ants and, and termites and bird flocks and things like that, but all of us, because we are all made of a very interesting agential material.",
  "token_count": 230,
  "sentence_count": 13,
  "start_sentence": 1,
  "end_sentence": 13,
  "start_time_ms": 42050,
  "end_time_ms": 122100,
  "start_time_seconds": 42.05,
  "end_time_seconds": 122.1,
  "primary_topics": [
    "Voluntary motion",
    "Bioelectricity",
    "Cellular Ion Transport",
    "Collective Intelligences",
    "Mind-Body Connection"
  ],
  "secondary_topics": [
    "Placebo Effect",
    "Future of Medicine",
    "Agential Material",
    "Physiology",
    "Morphology",
    "High Level Intelligence",
    "Executive Goals"
  ],
  "key_terms": [
    "Cell membrane",
    "Muscle cells",
    "Electrical system of the body",
    "Mechanisms of action",
    "Physiology",
    "Morphology",
    "Collective intelligences",
    "Agential material"
  ],
  "content_summary": "The speaker discusses the concept of voluntary motion and how high-level goals can control the body's chemistry through bioelectricity. They highlight the importance of understanding the connection between the mind and body, and how this could impact the future of medicine. The concept of collective intelligences and 'agential material' is also introduced.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}