{
  "chunk_id": "s-SL8qy-6kA_chunk_023",
  "text": "So you can See the colors correspond to different voltage levels. And you can see all the cells having these little interactions with each other to determine who's going to be head tail, left, right. Could we learn to decode this? Could we understand what are the, the memories, what are the plans that this morphogenetic collective intelligence has? So we developed the first tools to read and write the electrical information of the non neural tissues. First we use voltage sensitive fluorescent dyes. Here you can see what that looks like. So there are some in this group of cells, there are some, of course, some rapid changes, but there are also some quite slow changes. There's all kinds of pattern. These cells are doing lots of things. We do a lot of computer simulation to tie the electrophysiology to the gene expression, understand its properties.",
  "token_count": 147,
  "sentence_count": 11,
  "start_sentence": 23,
  "end_sentence": 33,
  "start_time_ms": 1228450,
  "end_time_ms": 1275460,
  "start_time_seconds": 1228.45,
  "end_time_seconds": 1275.46,
  "primary_topics": [
    "Bioelectricity",
    "Cellular Interactions",
    "Morphogenetic Collective Intelligence",
    "Electrophysiology",
    "Gene Expression"
  ],
  "secondary_topics": [
    "Voltage Levels",
    "Cellular Memory",
    "Cellular Plans",
    "Voltage Sensitive Fluorescent Dyes",
    "Computer Simulation",
    "Pattern Recognition",
    "Rapid and Slow Changes",
    "Non-neural Tissues"
  ],
  "key_terms": [
    "Voltage",
    "Morphogenesis",
    "Collective Intelligence",
    "Electrical Information",
    "Voltage Sensitive Fluorescent Dyes",
    "Electrophysiology",
    "Gene Expression",
    "Computer Simulation"
  ],
  "content_summary": "The speaker discusses the concept of bioelectricity and its role in cellular interactions, specifically in determining cellular orientation (head, tail, left, right). They mention the development of tools to read and write the electrical information of non-neural tissues using voltage sensitive fluorescent dyes and computer simulations to understand the relationship between electrophysiology and gene expression.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}