{
  "chunk_id": "s-SL8qy-6kA_chunk_033",
  "text": "And we are now moving that technology through the use of wearable bioreactors into mammals and eventually we hope into human patients to be able to use these stimuli, these triggers of complex organ regeneration. And we're aiming with morphaceuticals, we're aiming for limb regeneration, hopefully eventually in patients. The next story I want to tell you about is birth defects. Once again, these bioelectrical patterns are critical for the organs to know what shape they should be. Here's the brain of a tadpole. So here's the forebrain, the midbrain, the hindbrain. If these embryos are exposed to a teratogen, for example, nicotine or alcohol, or many other things, you can see there's a defect. The forebrain is greatly damaged. The eyes are connected to the brain. There's not the right shape. Everything is problematic here. We decided to ask, what can we do about this? Could we fix this somehow? We made a computational model that linked the changes in the bioelectrics with the final outcome. That model was good enough that we could ask it a simple question. If the brain is incorrectly shaped, what ion channel could we open or close in order to repair that?",
  "token_count": 199,
  "sentence_count": 16,
  "start_sentence": 33,
  "end_sentence": 48,
  "start_time_ms": 1722540,
  "end_time_ms": 1794710,
  "start_time_seconds": 1722.54,
  "end_time_seconds": 1794.71,
  "primary_topics": [
    "Bioelectricity",
    "Organ Regeneration",
    "Morphaceuticals",
    "Birth Defects"
  ],
  "secondary_topics": [
    "Wearable Bioreactors",
    "Limb Regeneration",
    "Bioelectrical Patterns",
    "Teratogens",
    "Brain Development",
    "Computational Models",
    "Ion Channels"
  ],
  "key_terms": [
    "Bioelectricity",
    "Organ Regeneration",
    "Morphaceuticals",
    "Birth Defects",
    "Wearable Bioreactors",
    "Limb Regeneration",
    "Bioelectrical Patterns",
    "Teratogens",
    "Forebrain",
    "Midbrain",
    "Hindbrain",
    "Computational Models",
    "Ion Channels"
  ],
  "content_summary": "The presentation discusses the use of bioelectricity and wearable bioreactors for complex organ and limb regeneration, with potential applications in human patients. It also explores the role of bioelectrical patterns in organ development and the potential for correcting birth defects caused by teratogens through manipulation of ion channels.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}