{
  "chunk_id": "s-SL8qy-6kA_chunk_032",
  "text": "That information is spread across and we know bioelectrical networks are really good at spreading information. So now those of you interested medicine now can start to think what Kind of information about disease and injury is available at a distance on the opposite side of the body that we could read and have some kind of surrogate site diagnostics where you don't have to actually measure the tissue. You're talking about what other tissues are picking up damage information like that. But going beyond that, we decided to test if we could tell these cells to go to the regeneration area, not in the amorphous space, not the scarring area. We developed a cocktail of ionophore that basically triggers regeneration and immediately you start to get toes, you get a toenail, eventually you get a quite nice leg that keeps growing. The leg is touch sensitive, it is motile, you know, well patterned, fairly respectable. Again, the thing is that we don't say how to build a leg, we don't know how to build a leg. All we tell the cells is we communicate the goal, we say build a leg and then we don't touch it. A one day intervention with our cocktail tail results in a year and a half of leg growth, during which time we don't touch it at all. Once you've communicated to the cells, they do the rest. And at this point I have to do a disclosure because there's a company here called Morphaceuticals, which was started by David Kaplan and myself. And we are now moving that technology through the use of wearable bioreactors into mammals and eventually we hope into human patients to be able to use these stimuli, these triggers of complex organ regeneration.",
  "token_count": 295,
  "sentence_count": 13,
  "start_sentence": 32,
  "end_sentence": 44,
  "start_time_ms": 1640000,
  "end_time_ms": 1736930,
  "start_time_seconds": 1640.0,
  "end_time_seconds": 1736.93,
  "primary_topics": [
    "Bioelectrical networks",
    "Regeneration",
    "Cellular communication",
    "Surrogate site diagnostics",
    "Complex organ regeneration"
  ],
  "secondary_topics": [
    "Disease and injury information",
    "Amorphous space",
    "Scarring area",
    "Ionophore cocktail",
    "Morphaceuticals",
    "Wearable bioreactors",
    "Leg growth",
    "Cellular goals"
  ],
  "key_terms": [
    "Bioelectrical networks",
    "Regeneration",
    "Surrogate site diagnostics",
    "Ionophore",
    "Bioreactors",
    "Amorphous space",
    "Scarring area",
    "Morphaceuticals"
  ],
  "content_summary": "The presentation discusses the potential of bioelectrical networks in spreading information about disease and injury across the body, enabling surrogate site diagnostics. The speaker also highlights their experiment in triggering regeneration using an ionophore cocktail, leading to successful leg growth in an organism. The technology is being further developed by a company called Morphaceuticals, with the aim of applying it to mammals and eventually humans.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}