{
  "chunk_id": "s-SL8qy-6kA_chunk_010",
  "text": "This is what programming used to look like. What she's doing here is she's reprogramming this thing by physically moving the wires in and out, she's rewiring the hardware. And the reason that on your laptop, when you want to switch from PowerPoint to Microsoft Word, you don't get out your soldering iron and begin to rewire your laptop, is because computer science has learned something very important, that if your hardware is good enough, and I'm going to say that the biological hardware is absolutely good enough, then instead of trying to force everything bottom up at the level of the hardware, you can take advantage of reprogrammability and other competencies of the machine. And I think that we've only just begun to understand the high level information processing that exists in the amazing agential material of which we are all made. And this is what we need to focus on. Reprogrammability and problem solving capacity of our substrate.",
  "token_count": 160,
  "sentence_count": 8,
  "start_sentence": 10,
  "end_sentence": 17,
  "start_time_ms": 520590,
  "end_time_ms": 573010,
  "start_time_seconds": 520.59,
  "end_time_seconds": 573.01,
  "primary_topics": [
    "Hardware Reprogramming",
    "Bioelectricity",
    "Biological Hardware"
  ],
  "secondary_topics": [
    "Computer Science",
    "Information Processing",
    "Problem Solving Capacity",
    "Agential Material",
    "Substrate Reprogrammability"
  ],
  "key_terms": [
    "Hardware",
    "Reprogrammability",
    "Substrate",
    "Agential Material",
    "Information Processing"
  ],
  "content_summary": "The speaker draws a parallel between computer hardware reprogramming and bioelectricity, suggesting that biological hardware is capable of reprogramming without physical alteration. The speaker emphasizes the need to understand the high-level information processing and problem-solving capacity of our biological substrate.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}