{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_723640_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_723640.pdf",
    "file_size": 11640,
    "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
    "journal": "Cell",
    "doi": "10.1016/j.cell.2007.05.002",
    "year": "2007",
    "title": "Gap Junctions Provide New Links in Left-Right Patterning",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Gap junctions are increasingly recognized as key regulators of embryonic development, nervous system function, and neoplasia. Chuang et al. (2007) now show that developing neural circuits use communication through gap junctions to establish left-right asymmetry in the central nervous system of the worm *Caenorhabditis elegans*, revealing that nematodes share a mechanism for left-right asymmetry in common with vertebrates.",
      "section": "Introduction",
      "topic": "Gap junctions in left-right asymmetry",
      "chunk_summary": "Gap junctions play a crucial role in establishing left-right asymmetry in *C. elegans*, similar to vertebrates.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "Left-right asymmetry in the morphogenesis of the heart, brain, and viscera is a fascinating aspect of animal body plans. Yet no one mechanism for establishing left-right asymmetry is known to be universally conserved (Levin, 2006), which has led to considerable controversy and lively debate. In different species, tissues, and stages of development, various mechanisms have been implicated in left-right patterning, including ion flows, gap junctions, the neurotransmitter serotonin, cytoplasmic motors, and motile cilia (Figure 1). Yet in many ways, the worm *C. elegans* has remained separate, its asymmetry apparently accomplished by means different from those in other species. Now, worms take one step closer to vertebrates. In this issue of *Cell*, Chuang et al. (2007) show that establishing left-right asymmetry in *C. elegans* olfactory neurons involves Ca2+ signaling, tight junctions, and communication through gap junctions, which have previously been implicated in establishing elements of left-right asymmetry in vertebrates.",
      "section": "Introduction",
      "topic": "Mechanisms of left-right asymmetry",
      "chunk_summary": "Multiple mechanisms contribute to left-right asymmetry across species, and *C. elegans* now shows similarities to vertebrates through the involvement of gap junctions and Ca2+ signaling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "The overall body plan of *C. elegans* is bilaterally symmetrical, with left-right asymmetries involving the nervous system, gonad, and gut. Asymmetry is first evident at the six-cell stage of embryogenesis, due to the reorientation of a mitotic spindle. This allows subsequent cell interactions that are largely mediated by the Notch signaling pathway, resulting in left and right sides that are different. Other molecular pathways are used at later stages. For example, the postembryonic QR and QL neuroblasts are asymmetric in their sensitivity to Wnt signals, and the ASEL and ASER sensory neurons transform early Notch signals into the asymmetric function of miRNAs and transcription factors (Ch'ng et al., 2003; Poole and Hobert, 2006).",
      "section": "Introduction",
      "topic": "C. elegans asymmetry development",
      "chunk_summary": "*C. elegans* exhibits left-right asymmetry in several organs, established through processes involving Notch signaling, Wnt signaling, and miRNA regulation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "The central nervous system of *C. elegans* contains two bilaterally symmetrical olfactory neurons (AWC). During late embryogenesis, only one of these neurons will express the *str-2* gene, which encodes a putative G protein-coupled olfactory receptor (Hobert et al., 2002). The determination of which neuron is going to express *str-2* (AWCON) is stochastic, and the remaining neuron has the AWCOFF phenotype. Chuang et al. (2007) screened for worm mutants lacking *str-2* expression in either AWC neuron (isomerism) and identified *nsy-5*, a gene encoding a member of the innexin/pannexin gap-junction family of proteins. Gap-junction channels permit direct passage of small-molecule signals between the cytoplasmic spaces of adjacent cells. Functional characterization of the phenotype revealed that *nsy-5* mutants were unable to sense odorants normally processed by AWCON neurons and that reduction of *nsy-5* function resulted in both neurons having an AWCOFF phenotype. Elegant genetic experiments showed that *nsy-5* acts upstream of the calcium-signaling pathway. They also showed that the activity of *nsy-5* is independent of axon guidance signaling and that the claudin/calcium channel γ subunit *nsy-4* acts in parallel with *nsy-5*. They then used a transgene expressing green fluorescent protein under the control of the *nsy-5* promoter and showed that *nsy-5* is expressed in the central nervous system (specifically in the sensory neurons and interneurons of the head and tail) and that expression varies during development. The dynamic variation of *nsy-5* expression is very interesting, and investigation of *nsy-5* expression fluctuations will facilitate understanding of the transcriptional control of gap junctional communication during development.",
      "section": "Results",
      "topic": "nsy-5 and olfactory neuron asymmetry",
      "chunk_summary": "The *nsy-5* gene, encoding a gap junction protein, is essential for asymmetric *str-2* expression in *C. elegans* olfactory neurons and acts upstream of calcium signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "Using a *Xenopus* oocyte assay, Chuang et al. (2007) established that the NSY-5 protein can form functional hemichannels and provide electrical coupling between cells (although permeability criteria for small molecules based on charge and size are not yet known). Electron microscopy identified characteristic gap-junction structures in the cell bodies of AWC and nerve-ring neurons of wild-type worms, but not in *nsy-5* mutant worms. Additional genetic approaches showed that *nsy-5* has specific sites of action within different neuronal cell bodies. Strikingly, *nsy-5* can act autonomously to induce the future AWCON neuron based on a feedback mechanism between both AWC neurons. These experiments demonstrate that a network of neurons communicate with AWC via signaling that is dependent on *nsy-5* to determine asymmetric expression of the *str-2* gene.",
      "section": "Results",
      "topic": "NSY-5 function and neuronal communication",
      "chunk_summary": "NSY-5 forms functional hemichannels, enabling electrical coupling and intercellular communication necessary for asymmetric gene expression in *C. elegans* neurons.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "The data reveal some striking similarities between how gap junctions are used in invertebrates and their functions in vertebrate development (Levin, 2002). In chick and frog embryos, the left and right sides of the embryos communicate with each other to correctly assign left-right identity before the onset of asymmetric gene expression. In both *Xenopus* and *C. elegans*, increases and decreases in gap-junctional communication can lead to defects in left-right asymmetry. The native pattern of communication mediated by gap junctions in both vertebrates and nematodes is between the left and right sides and involves a zone of junctional isolation (in this case, provided by an extracellular matrix layer). Moreover, the experiments by Chuang et al. (2007) reveal an asymmetry in how the left and right AWCs respond to *nsy-5* expression, mirroring the difference in gap-junction permeability that has been described on the left and right sides of the early frog embryo (Guthrie et al., 1988). Crucially, the discovery of this intrinsic bias in *C. elegans* shows that, as in frog and chick, the communication via gap junctions does not initiate left-right information but functions as an intermediate step of the pathway. As in mice, zebrafish, and chicks, Ca2+ signaling is also now implicated in *C. elegans*.",
      "section": "Discussion",
      "topic": "Comparison of gap junction function in invertebrates and vertebrates",
      "chunk_summary": "Gap junctions play a similar role in left-right asymmetry in both invertebrates and vertebrates, mediating communication between left and right sides and involving Ca2+ signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "There are also differences between *C. elegans* and vertebrates in their use of gap junctions. In worms, gap junctions appear to facilitate a randomly oriented asymmetry from a biased state. This suggests a stochastic feedback model similar to that characterizing Notch signaling. This contrasts with findings in vertebrates, which feature asymmetry that must become oriented with time. It remains a puzzle why the worm needs an extra mechanism to randomize asymmetry in these neuronal cells, given that they already have an established and consistent asymmetry. The unique features of worm asymmetry also highlight the differences between asymmetries of the nervous system versus those of the heart and viscera. Although molecular mechanisms of neuroanatomical and behavioral asymmetry are beginning to be identified (Sun and Walsh, 2006), these have only begun to be integrated with the earlier steps that create laterality (McManus, 2005). Indeed, it has been argued that asymmetries of the brain and body may be set by distinct mechanisms. For instance, human patients with full situs inversus or primary ciliary dyskinesia exhibit organ reversal but have normal handedness and hemisphere language specialization.",
      "section": "Discussion",
      "topic": "Differences in gap junction function between C. elegans and vertebrates",
      "chunk_summary": "While gap junctions play a similar role in left-right asymmetry across species, differences exist in how they function in *C. elegans* compared to vertebrates, particularly in the nervous system.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "Some exciting questions remain to be addressed. Can the gain-of-function phenotype of *nsy-5* (or rescue of the loss of function) be obtained with a vertebrate connexin instead? Is NSY-5's native role in worm asymmetry through direct transfer of small molecules from one cell to its neighbor, or might there be noncanonical functions of gap-junction proteins, as observed in cancer biology (Jiang and Gu, 2005)? Future efforts may also identify a small-molecule signal that traverses these gap junctions during instructive left-right patterning. Based on existing data, strong candidates include electrical currents, Ca2+, and serotonin (which is thought to be the morphogen that moves through gap junctions during establishment of frog asymmetry; Levin, 2006). The relationship of this pathway to other known components that establish *C. elegans* asymmetry (such as Notch signaling and the ASE system) also remains to be worked out. Most crucially, are other innexins involved? With the discovery that even a species in which cell lineages are highly determined uses gap junctions as part of its repertoire for generating left-right asymmetry, it is clear that additional surprises await us in the exploration of physiological intercellular signals in the establishment of laterality.",
      "section": "Future Work",
      "topic": "Open questions and future directions",
      "chunk_summary": "Further research is needed to fully understand the role of gap junctions in left-right asymmetry, including investigating the potential involvement of other innexins and the specific signals traversing these junctions.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "M.L. is supported by AHA Established Investigator grant 0740088N and NIH grant 1-R01-GM-06227. N.J.O. is supported by NIH grant F32 GM-078774.",
      "section": "Acknowledgments",
      "topic": "Funding sources",
      "chunk_summary": "The authors acknowledge funding support from AHA and NIH.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "Inositol pyrophosphates are unique signaling molecules implicated in the regulation of diverse cellular processes. Two new studies by Mulugu et al. (2007) and Lee et al. (2007) extend the biological and metabolic diversity of this class of molecules. They identify yeast Vip1 as a new inositol pyrophosphate synthase and show that the products of Vip1 activity regulate a cyclin/cyclin-dependent kinase complex.",
      "section": "Introduction",
      "topic": "Inositol pyrophosphates",
      "chunk_summary": "Inositol pyrophosphates are signaling molecules involved in various cellular processes, and recent studies have identified a new synthase and a target of regulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "The fully phosphorylated six-carbon ring of IP6 (phytic acid) was thought to represent the end point of inositol phosphorylation. The discovery of inositol phosphate species with seven (diphosphoinositol pentakisphosphate; PP-IP5; IP7) or eight phosphates (bis-diphosphoinositol tetrakisphosphate; [PP]2-IP4; IP8) on the inositol ring was exciting and unexpected (Menniti et al., 1993; Stephens et al., 1993). These \"high-energy\" molecules have been linked to a wide range of biological functions, including vesicle trafficking, apoptosis, DNA repair, telomere maintenance, and the stress response (Bennett et al., 2006). Although the mechanisms of action of inositol pyrophosphates in these cellular processes remain unclear, IP7 has been shown to directly transfer the energetic β phosphate of the pyrophosphate moiety to multiple proteins, indicating that IP7 may regulate signaling pathways through a new mechanism of protein phosphorylation (Saiardi et al., 2004). Two new studies published in *Science* identify an enzyme that catalyzes the production of inositol pyrophosphates (Mulugu et al., 2007) and a new target of regulation by IP7, a cyclin/cyclin-dependent kinase complex (Lee et al., 2007).",
      "section": "Introduction",
      "topic": "Inositol pyrophosphate functions",
      "chunk_summary": "Inositol pyrophosphates, including IP7 and IP8, are involved in various cellular functions and may regulate signaling pathways through a novel protein phosphorylation mechanism.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    },
    {
      "text": "The inositol hexakisphosphate kinases (IP6K) are the enzymes responsible for synthesis of inositol pyrophosphates (Saiardi et al., 1999). They are highly conserved evolutionarily and at least one member of this enzyme family is present in all eukaryotic genomes sequenced so far (Bennett et al., 2006). Inositol pyrophosphates and their kinases have been predominantly",
      "section": "Introduction",
      "topic": "Inositol hexakisphosphate kinases",
      "chunk_summary": "IP6Ks are the enzymes responsible for synthesizing inositol pyrophosphates and are highly conserved across eukaryotes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_723640.pdf",
      "original_filename": "pdf_20250803_124126_723640_extracted_text.txt",
      "authors": "[\"Nestor J. Oviedo\", \"Michael Levin\"]",
      "year": "2007",
      "journal": "Cell",
      "doi": "10.1016/j.cell.2007.05.002"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:11:50.950161"
}