{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_180629_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_180629.pdf",
    "file_size": 31525,
    "authors": "Unknown",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Unknown",
    "confidence_score": null,
    "document_type": "patent"
  },
  "chunks": [
    {
      "text": "The present disclosure provides compositions and methods for treating neurodevelopmental disorders, such as Rett syndrome and cyclin-dependent kinase-like 5 (CDKL5) deficiency disorder.",
      "section": "Abstract",
      "topic": "Neurodevelopmental disorder treatment",
      "chunk_summary": "Compositions and methods are disclosed for treating neurodevelopmental disorders like Rett syndrome and CDKL5 deficiency disorder.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Rett syndrome (RTT) primarily affects females and is characterized by loss of language and hand skills, impaired gait, cognitive deficits, seizures, and autonomic irregularities. Mutations in MECP2 account for most RTT cases, while CDKL5 mutations cause atypical RTT with early epilepsy. CDD shares features with RTT, including seizures and developmental delays, but exhibits severe delay from birth and earlier seizure onset. Current treatments for RTT and CDD are often repurposed from other indications and show limited efficacy, particularly for non-neurological symptoms.",
      "section": "Background",
      "topic": "Rett Syndrome and CDKL5 Deficiency Disorder",
      "chunk_summary": "RTT and CDD are neurodevelopmental disorders with distinct genetic causes and overlapping symptoms, but current treatments are limited.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This disclosure describes methods for treating Rett syndrome symptoms by administering vorinostat, potentially combined with ivermectin, trofinetide, or Bacteroides fragilis/polysaccharide. It also covers treating CDKL5 deficiency disorder with vorinostat, ivermectin, trofinetide, or Bacteroides fragilis/polysaccharide. These agents may be administered alone or in combination, and the dosage and frequency can vary.",
      "section": "Summary",
      "topic": "Treatment Methods",
      "chunk_summary": "Methods for treating Rett syndrome and CDKL5 deficiency disorder involve administering vorinostat, ivermectin, trofinetide, or Bacteroides fragilis/polysaccharide, alone or in combination.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Rett syndrome is a rare genetic disorder affecting brain development, leading to progressive loss of motor skills and speech, primarily in girls. Symptoms typically appear after 6-18 months of normal development, including slowed growth, loss of movement and coordination, communication difficulties, repetitive hand movements, unusual eye movements, breathing problems, irritability, anxiety, cognitive disabilities, seizures, scoliosis, irregular heartbeat, and sleep disturbances.",
      "section": "Detailed Description",
      "topic": "Rett Syndrome Symptoms",
      "chunk_summary": "Rett syndrome is a rare genetic disorder causing progressive loss of motor and communication skills, with various other symptoms appearing after initial normal development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "CDKL5 deficiency disorder is characterized by early-onset seizures, severe developmental delays, intellectual disability, limited speech, impaired motor skills, vision problems, repetitive hand movements, sleep disruptions, feeding difficulties, and gastrointestinal issues. Some individuals exhibit distinctive facial features and other physical differences. While sharing some features with Rett syndrome, CDKL5 deficiency disorder is now considered a separate condition.",
      "section": "Detailed Description",
      "topic": "CDKL5 Deficiency Disorder Symptoms",
      "chunk_summary": "CDKL5 deficiency disorder involves early seizures, developmental delays, intellectual disability, and various other symptoms, distinct from Rett syndrome.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Vorinostat is a histone deacetylase (HDAC) inhibitor with antineoplastic activity. It inhibits HDACs, leading to hyperacetylation of histones and transcription factors, inducing cell cycle arrest and apoptosis. Vorinostat crosses the blood-brain barrier and is approved for cutaneous T cell lymphoma.",
      "section": "Detailed Description",
      "topic": "Vorinostat",
      "chunk_summary": "Vorinostat, an HDAC inhibitor, induces cell cycle arrest and apoptosis and is approved for cutaneous T cell lymphoma.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Ivermectin is an antiparasitic agent that activates glutamate-gated chloride channels in nematodes, causing paralysis and death. It is orally bioavailable and has potential antiviral activity.",
      "section": "Detailed Description",
      "topic": "Ivermectin",
      "chunk_summary": "Ivermectin is an antiparasitic agent that paralyzes and kills nematodes by activating chloride channels.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Trofinetide is a neuroprotective glypromate analog designed for intravenous and oral delivery. It mimics the functions of GPE, a product of IGF-1 breakdown, important for brain development and response to injury. Trofinetide may help prevent brain damage in conditions with low IGF-1 levels.",
      "section": "Detailed Description",
      "topic": "Trofinetide",
      "chunk_summary": "Trofinetide, a neuroprotective glypromate analog, mimics GPE functions and may prevent brain damage in conditions with low IGF-1.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bacteroides fragilis is a bacterium commonly isolated in anaerobic infections, particularly from the gastrointestinal microbiota. It is resistant to penicillin and its pathogenicity is partly due to its capsular polysaccharide, which includes PSA and PSB. PSA is a symbiosis factor that can activate T cell immune responses.",
      "section": "Detailed Description",
      "topic": "Bacteroides fragilis",
      "chunk_summary": "Bacteroides fragilis, a bacterium common in anaerobic infections, possesses a capsular polysaccharide contributing to its pathogenicity and immune-modulating properties.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Other therapeutic agents contemplated for treating neurodevelopmental disorders include tyrphostin-AG-1478, sirolimus, panobinostat, entinostat, trichostatin-a, palbociclib, nefazodone, pyrazolanthrone, tamoxifen, wortmannin, azacitidine, indole-3-carbinol, thapsigargin, diphenyleneiodonium, parthenolide, artesunate, chlorpromazine, pifithrin, cycloheximide, fluoxetine, clozapine, ethambutol, selamectin, triclosan, tunicamycin, mifepristone, genistein, and cinobufagin.",
      "section": "Detailed Description",
      "topic": "Other Therapeutic Agents",
      "chunk_summary": "A range of other therapeutic agents are being considered for the treatment of neurodevelopmental disorders.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Pharmaceutical compositions comprising the disclosed agents, along with pharmaceutically acceptable excipients, are provided. Hydroxypropyl B-cyclodextrin is an example of such an excipient.",
      "section": "Detailed Description",
      "topic": "Pharmaceutical Compositions",
      "chunk_summary": "Pharmaceutical compositions containing the disclosed agents and excipients like hydroxypropyl B-cyclodextrin are provided.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_180629.pdf",
      "original_filename": "pdf_20250803_124125_180629_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:01:05.605227"
}