{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_833937_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_833937.pdf",
    "file_size": 35049,
    "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
    "journal": "Development",
    "doi": "10.1242/dev.086900",
    "year": "2013",
    "title": "Bioelectric signaling regulates head and organ size during planarian regeneration",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "A main goal of regenerative medicine is to replace lost or damaged tissues and organs with functional parts of the correct size and shape. But the proliferation of new cells is not sufficient; we will also need to understand how the scale and ultimate form of newly produced tissues are determined. Using the planarian model system, we report that membrane voltage-dependent bioelectric signaling determines both head size and organ scaling during regeneration. RNA interference of the H+,K+-ATPase ion pump results in membrane hyperpolarization, which has no effect on the amount of new tissue (blastema) that is regenerated yet produces regenerates with tiny ‘shrunken' heads and proportionally oversized pharynges. Our data show that this disproportionality results from a lack of the apoptosis required to adjust head and organ size and placement, highlighting apoptotic remodeling as the link between bioelectric signaling and the establishment of organ size during regeneration.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "Bioelectric signaling, specifically H+,K+-ATPase activity, regulates head and organ size during planarian regeneration by controlling apoptosis and tissue remodeling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Numerous medically significant processes require the precise control of complex shape changes and tissue remodeling. Embryonic gastrulation movements transform a single cell layer into multiple germ layers, whereas during metamorphosis entire body plans are abandoned in favor of completely different ones. Extracellular matrix remodeling accompanies metastatic progression in cancer, and airway remodeling results from both injury (e.g. cigarette smoke) and disease (e.g. asthma). Remodeling even plays a central role during aging in tissues such as bone. But despite the importance of tissue remodeling, we do not yet understand the mechanisms that coordinate individual cell regulatory pathways into tissue- and organ-level organization. Understanding and learning to control the processes determining proportion during organism-wide tissue scaling is a paradigm case of a fundamental problem in systems biology.",
      "section": "Introduction",
      "topic": "Tissue remodeling in various biological contexts",
      "chunk_summary": "Tissue remodeling is crucial for diverse biological processes, but the mechanisms coordinating cellular pathways into organ-level organization remain poorly understood.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "For regenerative medicine, which aims to replace lost or damaged organs and limbs, elucidating these mechanisms is crucial because the production of new cells is not sufficient – new tissues must be the correct size and shape to restore form and function. Likewise, addressing malformations from birth defects requires the functional manipulation of multicellular structures, not merely the induction of differentiation or proliferation of distinct cell types. Planaria are a powerful model for such studies: they can regenerate any body structure after damage, and two centuries of observation has precisely detailed the morphological changes they undergo during regeneration. Recent work has begun to elucidate the molecular mechanisms underlying maintenance of their adult stem cell population, wound-induced injury responses, proliferation of new tissues, polarity assignment of the new tissue (the blastema) and stem cell differentiation in regenerating tissues.",
      "section": "Introduction",
      "topic": "Planaria as a model for regeneration",
      "chunk_summary": "Planaria offer a valuable model system for studying tissue remodeling and regeneration due to their remarkable regenerative capacity and well-characterized morphology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Crucially, original tissues are dynamically remodeled concurrently with new tissue growth during planarian regeneration. Thus, relative tissue proportions are maintained to current body size through allometric scaling of pre-existing structures. Thomas Hunt Morgan termed regenerative tissue remodeling or the rearrangement of existing cells ‘morphallaxis', delineating it from epimorphic regeneration mainly dependent on new proliferation. However, the signals that direct the scale and geometry of morphallactic remodeling relative to new tissue growth during regeneration remain unidentified. Understanding the highly regulative, flexible patterning programs of vertebrate development and the reparative pathways of regeneration requires that the molecular mechanisms underlying size and shape controls be analyzed in tractable model systems such as planaria. Although planarian research has focused on blastema formation, stem cell regulation, and polarity (head versus tail decisions), we still lack genetic entry points into how remodeling events are coordinated with predetermined ‘templates' that give rise to the same shape time and time again.",
      "section": "Introduction",
      "topic": "Morphallaxis and epimorphosis in regeneration",
      "chunk_summary": "Planarian regeneration involves both epimorphosis (new tissue growth) and morphallaxis (remodeling of existing tissues), but the signals coordinating these processes are unknown.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Regenerative repair of complex structures is often accomplished in part by programmed cell death or apoptosis; for example, apoptosis is required for proliferative outgrowth during Xenopus tail regeneration and head regeneration in Hydra is initiated by apoptosis-mediated Wnt signaling. We report here that the H+,K+-ATPase (H,K-ATPase) ion transporter regulates tissue remodeling via apoptosis during planarian regeneration. Our previous work revealed a role for H,K-ATPase in specifying anterior polarity in new tissues. In the present work, we demonstrate that H,K-ATPase is also required for head size and organ proportionality during regeneration, by mediating the apoptotic sculpting of original tissues. These molecular data for the first time link a bioelectric pathway determining anatomical polarity with cellular mechanisms that regulate shape determination and allometric scaling during regeneration.",
      "section": "Introduction",
      "topic": "H,K-ATPase and apoptosis in regeneration",
      "chunk_summary": "H,K-ATPase regulates tissue remodeling and organ proportionality during planarian regeneration by mediating apoptosis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Homologs to H+,K+-ATPase (H,K-ATPase) were used to search (tBlastn) the Schmidtea mediterranea Genome Database. To confirm H,K-ATPase identity, the seven planarian sequences co-identified by multiple homologs were used to search (tBlastx) NCBI BLAST and protein domain analyses were performed using both the NCBI Conserved Domains Database and SMART. An S. mediterranea cDNA library (from intact worms) was used to generate initial gene fragments by PCR with primers designed by Primer3. Because in invertebrates it is not possible to delineate between the two closely related P2C class plasma membrane ATPases Na+,K+-ATPase and H,K-ATPase, all potential candidates for either gene were identified.",
      "section": "Materials and Methods",
      "topic": "Gene identification and cloning",
      "chunk_summary": "Planarian H,K-ATPase homologs were identified and cloned using bioinformatics and molecular biology techniques.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Using the PCR fragments obtained, RNAi regeneration phenotypes and intracellular pH analyses were used to distinguish potential H,K-ATPase(s) from potential Na,K-ATPases, after which a single non-gastric H,K-ATPase alpha subunit was identified. For Smed-H,K-ATPase, the full-length gene sequence was then obtained using Smart/er RACE cDNA Amplification Kits (Clontech), from 5' and 3′ RACE cDNAs generated as described in the kit. Alignments were generated using MultAlin. Protein domain alignments were generated using the NCBI Conserved Domains Database.",
      "section": "Materials and Methods",
      "topic": "Gene sequencing and analysis",
      "chunk_summary": "The full-length sequence of Smed-H,K-ATPase was obtained and analyzed to confirm its identity and domain architecture.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "The CIW4 clonal line of asexual S. mediterranea was used and maintained at 20°C in the dark in 1× Montjuïc salts as previously described. Worms 4-7 mm long were starved for ≥1 week prior to use. Amputations were performed under a dissecting microscope with a scalpel, on filter paper over a moist Kimwipe kept chilled on a cold plate. Pharynx fragments were produced by cutting just above and just below the pharynx. Fragments were kept in welled non-treated tissue-culture plates in the dark at 19°C, and moved into fresh media and new wells once a week, until scored. For all membrane voltage and intracellular pH assays, pharynx regenerates were produced as above, except either the anterior or posterior cut was slanted at a 45° angle (equal numbers of each cut were made; only anterior slants shown). This provided an internal reference for the original anterior-posterior axis, to positively establish the identity of each blastema.",
      "section": "Materials and Methods",
      "topic": "Planarian culture and amputation",
      "chunk_summary": "Planarians were cultured under standard conditions and amputated to generate pharynx fragments for regeneration experiments.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "For RNAi experiments, dsRNA was generated and injected as described by Oviedo et al.. Control dsRNA was Venus-GFP. Worms were injected on days 1-3 and cut on day 8 or 14. The apoptosis inducer staurosporine (Calbiochem) was used at 20 nM. The apoptosis inhibitor M50054 (Calbiochem 178488) was used at 80 µM. All stocks were suspended in DMSO; DMSO controls (shown) had no effect.",
      "section": "Materials and Methods",
      "topic": "RNA interference and pharmacology",
      "chunk_summary": "RNA interference and pharmacological manipulations were used to modulate H,K-ATPase activity and apoptosis during regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Worms for whole-mount in situ hybridization were formalin fixed (or Carnoy's fixed for Inx9), and in situ hybridizations were performed as described by Pearson et al.. Probes: Cintillo; Inx9; sFRP-1 and Wnt11-5, kind gifts of P. Reddien. Worms for immunofluorescence were Carnoy's fixed and antibody stained as described. Primary antibodies were: a-phosphorylated histone H3 (H3P), 1:250 (Upstate); a-synapsin, 1:50 (Developmental Studies Hybridoma Bank); acetylated tubulin, 1:1000 (Sigma T7451); activated caspase-3, 1:1000 (Abcam ab13847); and a-arrestin, 1:10,000 (kind gift from K. Watanabe, University of Hyogo, Japan). Secondary antibodies were: goat anti-mouse Alexa488, 1:400 (Sigma) or (for H3P and caspase-3) an HRP-conjugated anti-rabbit antibody with TSA-Alexa568 anti-HRP (Molecular Probes).",
      "section": "Materials and Methods",
      "topic": "In situ hybridization and immunofluorescence",
      "chunk_summary": "In situ hybridization and immunofluorescence were used to analyze gene expression and protein localization during regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "DiBAC4(3) (bis-[1,3-dibarbituric acid]-trimethine oxanol) (Invitrogen), suspended in DMSO, was used at 0.475 µM to measure voltage; the ratiometric dye SNARF-5F-AM (Molecular Probes S-23923), suspended in DMSO with 20% w/v Pluronic F-127, was used at 5 µM to measure intracellular pH; both as previously described using 3% EtOH-immobilized worms. Movements were quantified with a custom-made computer vision system. Ten minute trials in the dark were recorded at 5 Hz. Occupancy heat maps and area covered data were generated with J-Specimen (Ebiotics).",
      "section": "Materials and Methods",
      "topic": "Membrane voltage, pH, and behavioral assays",
      "chunk_summary": "Membrane voltage, intracellular pH, and behavioral assays were conducted to assess the effects of H,K-ATPase manipulation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "Images were collected using either a Nikon SMZ1500 microscope with a Retiga 2000R camera (Q-Imaging) and Q-Capture imaging software; or an Olympus BX61 compound microscope with a Hamamatsu Orca AG CCD camera and IP Labs or MetaMorph imaging software. Quantify segment tool (IP Labs) was used to measure fluorescence pixel intensity. Adobe Photoshop was used to orient and scale images, and improve clarity (not for V$_{mem}$ or pH images). Data were neither added nor subtracted; original images available upon request. Microsoft Excel was used to calculate Student's t-test (two-tailed distribution, two independent samples, unequal variance). Error bars are standard deviation.",
      "section": "Materials and Methods",
      "topic": "Image collection and analysis",
      "chunk_summary": "Images were collected and analyzed using various microscopy and software tools to quantify morphological and molecular changes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "All measurements were carried out using images of worms when fully extended to prevent introducing ‘noise' into our calculations from worms that appeared to have wider body shapes owing to ‘scrunching' or thinner body shapes (especially in the head) from partial stretching of the body. Photoshop was used for measurements (in pixels) of area (magnetic lasso tool) and distance, length and width (ruler tool). Head size was calculated as (area of head)/(area of worm), with the auricles (for morphological analyses) or the posterior-most cintillo expression (for molecular analyses) providing the posterior boundary. Blastema size was calculated only by morphology as (area of blastema)/(area of worm), using the region of unpigmented tissue on 4 days post-amputation (dpa) as blastema area. Pharynx size was calculated as (area of pharynx)/(area of worm), with the ring of darkened pigment (for morphological analyses) and the borders of the synapsin-labeled pharyngeal neural plexus (for molecular analyses) determining area boundaries. Pharynx location was calculated as (length from the anterior tip of the pharynx to the anterior tip of the worm)/(square root of area of worm) for both morphological and molecular analyses. For all these calculations, measurements were controlled (by including total worm area) for differences in individual body sizes between worms, which can vary greatly. For measurements of body elongation, morphological analyses of worm width (on the medial-lateral axis) was calculated at the widest point on fully extended worms (with all images at the same magnification). For 0 dpa and 3 dpa fragments (which do not typically extend), width was measured at the midpoint of the pharynx. For calculations over time, the same individual worms were followed over the course of each assay, and the differences for each single worm were calculated prior to averaging numbers for the entire experiment.",
      "section": "Materials and Methods",
      "topic": "Morphological measurements",
      "chunk_summary": "Detailed morphological measurements of head size, blastema size, pharynx size and location, and body elongation were performed using image analysis software.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "For the purposes of this study, we defined epimorphic regeneration as the cell proliferation and migration associated with formation of the unpigmented blastema (or new tissue), whereas morphallactic regeneration was defined as the cell rearrangements that restore proportionality in the pre-existing pigmented fragment (or old tissue) largely without new proliferation. Molecular analyses of organism-wide morphallaxis are lacking for planarians, although a recent study has analyzed remodeling of the intestines. Therefore, establishing a baseline for detecting morphallactic changes was crucial. Pre-existing tissue remodeling during planarian regeneration is completed within ~3 weeks after amputation. Although all tissues and organs are remodeled during this process, the most dynamic morphological reorganizations involve maintaining head and pharynx proportions and pharyngeal location. We used cintillo, expressed in a ring of putative chemoreceptor neurons surrounding the head, to demarcate the head region, and anti-synapsin labeling of the pharyngeal neural plexus was used to delineate the pharynx. This enabled us to assess changes in remodeling by both morphological and molecular analyses, with percentages reported as an average of both methods.",
      "section": "Results",
      "topic": "Planarian regeneration and tissue remodeling",
      "chunk_summary": "Planarian regeneration involves both epimorphic and morphallactic processes, and this study focuses on quantifying changes in head and pharynx proportions during remodeling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "We examined head and pharynx size as a percentage of the whole worm to control for differences in worm size (which varies between individuals). Pharynx location was measured as the distance from the top of the worm to the anterior tip of the pharynx, divided by the square root of total worm area (again to control for worm size). In whole worms, the head region was on average 11.7% of the entire worm, whereas the pharynx averaged 7.6% and was located in (or just posterior to) the center of the anterior-posterior (A/P) axis. With these baselines established, we analyzed remodeling in pharynx regenerates by amputating worms just anterior, and just posterior, to the pharynx. These cuts produced fragments that retained their original pharynx, which now extended almost the entire length of the fragment. This allowed us to follow remodeling of the original pharynx as it shrinks and moves posteriorly on the A/P axis, as well as the process of head regeneration in tissues that originally had a more posterior polarity.",
      "section": "Results",
      "topic": "Quantifying tissue remodeling",
      "chunk_summary": "Head and pharynx size and location were quantified in regenerating planarians to assess the extent of tissue remodeling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "We tracked individual worms from their intact (uncut) state through 17 days post-amputation (dpa). Little to no remodeling was observed before 3 dpa, consistent with the regenerate's early focus on injury response and blastema formation. Rescaling pharynx size to the worm's new, smaller size was largely (75.9%) finished by 7 dpa. By 17 dpa, the pharynx was reduced by 19.7% from its original size. Pharynx relocation towards the posterior was mostly (81.4%) completed by 10 dpa. The head region (as a percentage of the whole worm), instead of just growing from the blastema to the correct proportion, increased by 10 dpa to 74.4% larger than in intact animals. Only after 10 dpa did the head begin to scale down towards its smaller, baseline percentage, although our data indicate that this process was only 57.1% completed by 17 dpa. These data suggest that pharynx remodeling is largely completed by 10 dpa, whereas scaling of the new head (following new tissue growth) does not occur until after the pharynx remodeling is finished.",
      "section": "Results",
      "topic": "Time course of remodeling",
      "chunk_summary": "Pharynx remodeling is largely complete by 10 dpa, while head scaling occurs later, after pharynx remodeling is finished.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "The final morphallactic event we analyzed was the rapid and reliable transformation of pharynx fragments from a wide, square shape to the thin, elongated typical planarian form. Over 17 days, regenerates reduced their width along the mediolateral axis by a total of 48.8% as elongation of the entire worm occurred. The majority (51.8%) of this elongation was accomplished by 7 dpa, concurrent with pharynx resizing. From 10 to 14 dpa, little body lengthening was observed; most of the remaining elongation occurred after 14 dpa, concurrent with the reduction in head size. Having quantified this remarkable combination of morphallactic events in control animals, we next sought to probe the molecular mechanisms involved.",
      "section": "Results",
      "topic": "Body elongation during regeneration",
      "chunk_summary": "Body elongation during regeneration occurs concurrently with pharynx resizing and is largely complete by 7 dpa.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    },
    {
      "text": "In our work with the Dugesia japonica planaria, we observed that chemical inhibition of the H,K-ATPase ion transporter (through regulation of blastema membrane voltage) blocked anterior polarity and head regeneration without preventing blastema growth. However, we also observed that regenerates had abnormally wide bodies, with very large pharynges that were atypically anterior. This suggested a lack of remodeling in these regenerates. To identify the genetic mechanisms behind this regenerative shape failure, we identified from the more genetically tractable Schmidtea mediterranea species a single homolog of the alpha subunit of the non-gastric H,K-ATPase, which had the same domain architecture and 69.9% pairwise identity to vertebrate homologs. Interestingly, RNA interference (RNAi) of the Smed-H,K-ATPase produced pharynx regenerates that not only displayed the large, anteriorly shifted pharynges noted previously, but, surprisingly, also had tiny, shrunken heads. Although Smed-H,K-ATPase(RNAi) injection did produce a consistently small number of headless regenerates (4.2%), similar to H,K-ATPase inhibition in D. japonica, the majority of regenerates (91.6%) regenerated with proportionally very tiny heads. This 'shrunken head' phenotype has not to our knowledge been reported from any other perturbation to date, and is consistent with tissue remodeling defects following loss of H,K-ATPase activity.",
      "section": "Results",
      "topic": "H,K-ATPase and regenerative scaling",
      "chunk_summary": "Inhibition of H,K-ATPase in S. mediterranea results in shrunken heads and large, anteriorly shifted pharynges, suggesting a defect in tissue remodeling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_833937.pdf",
      "original_filename": "pdf_20250803_124126_833937_extracted_text.txt",
      "authors": "[\"Wendy Scott Beane\", \"Junji Morokuma\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Development",
      "doi": "10.1242/dev.086900"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:17:44.931590"
}