{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_261510_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_261510.pdf",
    "file_size": 34536,
    "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
    "journal": "Disease Models & Mechanisms",
    "doi": "10.1242/dmm.000117",
    "year": "2008",
    "title": "Planarian PTEN homologs regulate stem cells and regeneration signaling",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "We have identified two genes, Smed-PTEN-1 and Smed-PTEN-2, capable of regulating stem cell function in the planarian Schmidtea mediterranea. Both genes encode proteins homologous to the mammalian tumor suppressor, phosphatase and tensin homolog deleted on chromosome 10 (PTEN). Inactivation of Smed-PTEN-1 and -2 by RNA interference (RNAi) in planarians disrupts regeneration, and leads to abnormal outgrowths in both cut and uncut animals followed soon after by death (lysis). The resulting phenotype is characterized by hyperproliferation of neoblasts (planarian stem cells), tissue disorganization and a significant accumulation of postmitotic cells with impaired differentiation capacity. Further analyses revealed that rapamycin selectively prevented such accumulation without affecting the normal neoblast proliferation associated with physiological turnover and regeneration. In animals in which PTEN function is abrogated, we also detected a significant increase in the number of cells expressing the planarian Akt gene homolog (Smed-Akt). However, functional abrogation of Smed-Akt in Smed-PTEN RNAi-treated animals does not prevent cell overproliferation and lethality, indicating that functional abrogation of Smed-PTEN is sufficient to induce abnormal outgrowths. Altogether, our data reveal roles for PTEN in the regulation of planarian stem cells that are strikingly conserved to mammalian models. In addition, our results implicate this protein in the control of stem cell maintenance during the regeneration of complex structures in planarians.",
      "section": "Summary",
      "topic": "PTEN function in planarian stem cells",
      "chunk_summary": "Smed-PTEN-1 and -2, homologs of the mammalian tumor suppressor PTEN, regulate stem cell function, regeneration, and tissue homeostasis in planarians, and rapamycin can prevent abnormalities caused by Smed-PTEN loss of function.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "The replacement of cells that are lost to normal physiological turnover relies, in part, on mechanisms that control stem cell number and the efficient, functional integration of their progeny into differentiated tissues. Examples of such tissue homeostasis are provided by the mammalian hematopoietic and digestive systems, in which millions of differentiated blood and epithelial cells expire daily, only to be replaced by the fresh division progeny of resident stem cells (Clarke and Fuller, 2006; Reya and Clevers, 2005). Failure in these processes can lead to a range of dysfunctions, including malignant transformation.",
      "section": "Introduction",
      "topic": "Tissue homeostasis and stem cells",
      "chunk_summary": "Tissue homeostasis relies on mechanisms controlling stem cell number and the integration of their progeny into differentiated tissues, and failure in these processes can lead to dysfunction.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "One of the most frequently mutated genes in human cancers is the gene encoding the phosphatase and tensin homolog deleted on chromosome 10 (PTEN) protein (Sansal and Sellers, 2004; Stiles et al., 2004; Sulis and Parsons, 2003). PTEN negatively regulates the phosphatidylinositol-3 kinase (PI3K)-AKT signaling, known to play crucial roles in cellular proliferation, differentiation and migration in both vertebrates and invertebrates (Sulis and Parsons, 2003). In mammals, when PTEN activity is lost in organs displaying high rates of cell turnover, primary and metastatic cancers are detected. Germline mutations of PTEN are found in both Cowden and Bannayan-Riley-Ruvalcaba syndromes (Liaw et al., 1997; Marsh et al., 1997; Marsh et al., 1999; Nelen et al., 1997), and somatic mutations have been associated with Non-Hodgkin's lymphoma (Nakahara et al., 1998), breast, and prostate cancers (Li et al., 1997). More recently, activation of PI3K and AKT owing to PTEN loss of function has been reported to occur not only in breast, but also in some types of pancreatic cancers (Asano et al., 2004; Kirkegaard et al., 2005). Thus, a rapidly growing body of evidence suggests a central role for PTEN in the regulation and misregulation of tissue homeostasis in mammals (Marx, 2007).",
      "section": "Introduction",
      "topic": "PTEN and cancer",
      "chunk_summary": "PTEN, a negative regulator of the PI3K-AKT signaling pathway, is frequently mutated in human cancers, and its loss of function is associated with various cancers and syndromes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "In invertebrates such as Drosophila melanogaster and Caenorhabditis elegans, PTEN appears to mainly control cell size and cell cycle during development (Hafen, 2004; Stiles et al., 2004). In C. elegans, PTEN (daf-18) has been associated with regulation of metabolic rates, longevity and dauer formation (Gil et al., 1999; Mihaylova et al., 1999; Ogg and Ruvkun, 1998). In Drosophila, PTEN plays critical roles during development, affecting cell proliferation, and cell and organ size (Gao et al., 2000; Goberdhan et al., 1999; Huang et al., 1999; Oldham et al., 2002). Although studies of PTEN in invertebrates have been highly informative, the study of PTEN in adult tissue homeostasis remains unexplored. As such, models are not yet available to dissect the mechanisms by which human diseases involving PTEN mutations are manifested.",
      "section": "Introduction",
      "topic": "PTEN in invertebrates",
      "chunk_summary": "In invertebrates, PTEN primarily controls cell size and cell cycle during development, but its role in adult tissue homeostasis is less understood.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "In contrast to flies and nematodes, the adult freshwater planarian Schmidtea mediterranea possesses an abundant population of undifferentiated cells, many of which are continuously undergoing cell division. The dividing, undifferentiated cells are known as neoblasts, and the animal derives its robust tissue homeostasis and regenerative properties from both regulating the proliferation of these cells and by determining their division progeny (Newmark and Sánchez Alvarado, 2000). Neoblasts are considered the adult stem cells in planarians because they constantly self-renew and produce daughter cells that will go on to differentiate into all known cell types found in the animal, including the germline (Newmark and Sánchez Alvarado, 2002). In fact, neoblasts are the only known proliferative cell in the flatworm, and their division progeny is instrumental in supporting, and maintaining, differentiated tissues during physiological cell turnover (Reddien and Sánchez Alvarado, 2004; Sánchez Alvarado, 2006). After amputation, planarians develop a specialized structure at the cut surface, known as a regeneration blastema, which is the result of extensive proliferation by neoblasts.",
      "section": "Introduction",
      "topic": "Planarian neoblasts and regeneration",
      "chunk_summary": "Planarians possess neoblasts, adult stem cells responsible for tissue homeostasis and regeneration, which proliferate extensively to form a blastema after amputation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "Here, we report the identification of two PTEN orthologs in planarians (Smed-PTEN-1 and Smed-PTEN-2). RNA interference (RNAi) of these genes is lethal; the phenotype is characterized by an inhibition of tissue regeneration, abnormal outgrowths associated with a neoblast-hyperproliferative response, and a lack of cell differentiation and tissue maintenance. Strikingly, we also observed that the abnormalities and lethality detected in worms with RNAi of both Smed-PTEN genes [Smed-PTEN-1, -2(RNAi) worms] could be prevented by pharmacological treatment with rapamycin (an inhibitor of the protein kinase, target of rapamycin [TOR]), without affecting physiological neoblast proliferation. Because specific upregulation of the planarian Akt-like gene (Smed-Akt) is detected in RNAi-treated animals and prevented by rapamycin treatment, it is likely that an involvement of the AKT pathway is necessary for the Smed-PTEN genes to exert their function. Together, these observations support recent evidence demonstrating that PTEN activity can help distinguish differences between normal and abnormal self-renewing mechanisms in stem cells during malignant transformation in mammals (Yilmaz et al., 2006; Zhang et al., 2006). We propose that, in planarians, PTEN modulates AKT function and that the abnormalities observed in the Smed-PTEN phenotype are due to both autonomous and non-autonomous stem cell roles of PTEN. Additionally, our data revealed that AKT is required for rapamycin to compensate for PTEN loss of function. Thus, we propose that planarians may serve as a powerful model system in which to dissect the roles of tumor suppressor activities in regulating stem cell functions.",
      "section": "Results",
      "topic": "Smed-PTEN RNAi phenotype and rapamycin rescue",
      "chunk_summary": "RNAi of Smed-PTEN genes leads to lethality, impaired regeneration, and abnormal outgrowths, but rapamycin can prevent these effects, suggesting a role for the AKT pathway.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "All known PTEN homologs share conserved phosphatase and tensin domains (Lee et al., 1999). Initially, we identified potential homologs by performing BLAST searches against the planarian genome with both the fly and human PTEN genes. We then took the predicted planarian sequences, which contained both of the conserved domains, and carried out reciprocal BLAST searches against the human and fly genomes. This returned a list of three potential orthologs of PTEN. In addition to PTEN, humans possess two other PTEN-like genes that contain phosphatase and tensin domains, TPIP and TPTE (Sulis and Parsons, 2003). To clearly define the orthology between planarian PTEN-like genes and the other human homologs, phylogenetic analyses were carried out (see Methods). The results indicate that planaria have two paralogous bona fide PTEN orthologs and a gene orthologous to the human TPTE and TPIP genes (Fig. 1A). cDNAs for both PTEN genes had been previously cloned as part of a cDNA sequencing project (Sánchez Alvarado et al., 2002). We will refer to these genes as Smed-PTEN-1 and Smed-PTEN-2.",
      "section": "Results",
      "topic": "Identification of planarian PTEN homologs",
      "chunk_summary": "Three potential PTEN orthologs were identified in the planarian genome, two of which are bona fide PTEN orthologs (Smed-PTEN-1 and -2) and one orthologous to human TPTE and TPIP.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "The general expression patterns of Smed-PTEN-1 and Smed-PTEN-2 were defined using whole-mount in situ hybridizations (ISH). Expression for both genes (Fig. 1B,C) is detected throughout mesenchymal tissues (dorsal/ventral and anterior/posterior), including postmitotic areas (i.e. the area in front of the photoreceptors and the pharynx). No obvious restriction to a particular organ system was observed; however, spatial expression patterns differ in that the Smed-PTEN-1 signal is dispersed, whereas Smed-PTEN-2 expression is detected in defined clusters throughout the mesenchyme (Fig. 1B,C). Expression patterns were confirmed as specific by performing several optimization rounds of the ISH protocol and standardizing the results with control probes of known expression patterns. Additionally, ISH with sense probes in wild-type worms and antisense probes in RNAi worms, for each Smed-PTEN gene confirmed the detected expression patterns (supplementary material Fig. S1 and data not shown). Because the spatial signal distribution precluded us from defining the cell types expressing Smed-PTEN-1 and Smed-PTEN-2, we performed quantitative real-time PCR (qRT-PCR) analyses on diverse cell populations isolated by fluorescence activated cell sorting (FACS) (Fig. 1D). We tested the irradiation-sensitive cells comprised by the X1 and X2 populations, and the irradiation-insensitive cell types represented by the Xins area of the FACS profile (Hayashi et al., 2006; Reddien et al., 2005b). These experiments revealed that expression of both Smed-PTEN genes is detectable in all three cell subpopulations (Fig. 1D). These data suggest that the expression of Smed-PTEN-1 and Smed-PTEN-2 is widespread and includes neoblasts.",
      "section": "Results",
      "topic": "Expression of Smed-PTEN genes",
      "chunk_summary": "Smed-PTEN-1 and -2 are expressed throughout mesenchymal tissues, including postmitotic areas, and are detectable in both irradiation-sensitive and -insensitive cell populations, including neoblasts.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "RNAi experiments were performed to abolish the expression of each Smed-PTEN gene individually or simultaneously. We designed and optimized a double-stranded RNA (dsRNA) microinjection schedule that consistently reproduces a particular phenotype (see below). This procedure requires a total of five microinjections distributed through 11 days (Fig. 2A). The dsRNA was synthesized in vitro according to standard protocols (Sánchez Alvarado and Newmark, 1999) and injected at different intervals during the schedule (Fig. 2A). Throughout the experiment, all groups were extensively evaluated under the microscope and scored for anatomical and/or behavioral changes (Reddien et al., 2005a). Additionally, abrogation of gene expression was confirmed by RT-PCR and whole-mount ISH (supplementary material Fig. S1 and data not shown). Representative results from different groups of animals, 12 days after the first microinjection, are shown in Fig. 2B. Planarians injected with water (control), dsRNA-Smed-PTEN-1 or dsRNA-Smed-PTEN-2 were indistinguishable from each other (Fig. 2B left panels). In contrast, all Smed-PTEN-1, -2(RNAi) worms (n>100) displayed behavioral and anatomical changes followed by death (100% penetrance). Signs of the phenotype began with a slowing of movements and a lack of normal photophobic response, followed by reabsorbtion of the most anterior area in front of the photoreceptors (head regression). Head regression in planarians is associated with impaired neoblast function (Guo et al., 2006; Reddien et al., 2005a; Reddien et al., 2005b); however, this phenotype is normally accompanied by a characteristic ventral curling, which did not occur at any time in Smed-PTEN-1, -2(RNAi) worms. Instead, as the phenotype progressed, abnormal growths became evident in different body parts, but tended to be more severe at anterior ends (Fig. 2B, arrows). These abnormal growths increased rapidly in size and number, and worms eventually began to lyse and die three to four days after the first obvious signs of the phenotype (supplementary material Table S1). In the majority of cases, these changes were most evident after the final injection (11±2.2 days after the first injection, average ± standard deviation [s.d.]); representative images of the phenotype (12 days after first injection) with different degrees of severity are shown in Fig. 2B (right panel). These data indicate that Smed-PTEN-1 and Smed-PTEN-2 functionally compensate each other, and that these genes play a role in regulating proper neoblast functions that may differ from those observed following either irradiation or silencing of smedwi-2 (a gene involved in the regulation of planarian stem cells) (Reddien et al., 2005b).",
      "section": "Results",
      "topic": "Smed-PTEN RNAi phenotype",
      "chunk_summary": "Simultaneous RNAi of Smed-PTEN-1 and -2 leads to behavioral and anatomical changes, including head regression and abnormal growths, followed by death, indicating functional compensation between the two genes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "To determine whether Smed-PTEN genes play a role during regeneration, we performed an RNAi time-course strategy similar to that carried out in intact worms, except that animals were amputated at pre/postpharyngeal levels one day after the third injection (Fig. 3A). Trunk fragments resulting from these amputations received two additional injections (days 1 and 3 post-amputation); subsequent behavioral and anatomical changes were evaluated (Reddien et al., 2005a). Animals subjected to either Smed-PTEN-1(RNAi) or Smed-PTEN-2(RNAi) developed anterior and posterior regeneration blastemas, with macroscopic regenerative dynamics that were indistinguishable from those observed in control animals (i.e. normal wound healing, blastema formation, photoreceptor pigmentation, photophobic response, etc.; Fig. 3B, left panels). In contrast, the Smed-PTEN-1, -2(RNAi) worms showed normal wound healing, but failed to form blastemas and by approximately the second day post-amputation (10±0.8 days after the first injection) signs of the phenotype (no blastema formation, scattered outgrowths) were evident in all animals (n=47/47). These abnormal growths multiplied and within one week after amputation (6.25±3.3 days) all animals were dead (Fig. 3B, right panel). These results are consistent with the effect observed for Smed-PTEN-1, -2(RNAi) in intact worms (supplementary material Table S1). Furthermore, in both uncut and regenerating animals, overt signs of the phenotype were noted at similar times after the first injection (~11 days; Student's t-test, P=0.25), suggesting that under these conditions amputation does not influence phenotype dynamics. These results support our previous conclusion that Smed-PTEN-1 and Smed-PTEN-2 are required for proper neoblast function and indicate that the planarian PTEN orthologs are necessary for blastema formation.",
      "section": "Results",
      "topic": "Smed-PTEN and regeneration",
      "chunk_summary": "Smed-PTEN genes are required for regeneration, as simultaneous RNAi prevents blastema formation and leads to abnormal growths and lethality after amputation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "We sought to better understand the cellular basis for the observed phenotype in Smed-PTEN-1, -2(RNAi) animals. We first performed fluorescent immunohistochemistry with antibodies specific to differentiated tissues, specifically neurons, muscle and cilia (Cebrià et al., 1996; Robb and Sánchez Alvarado, 2002; Sakai et al., 2000). Results from these experiments revealed unexpected and severe disruptions to the anatomical and functional integrity of these tissues (Fig. 4). Photoreceptor neurons were found in disarray, and were often dispersed and lacking optic chiasmatas (Fig. 4A); body wall musculature displayed areas devoid of myosin positive cells (Fig. 4B); and the surface area of dorsal cilia fields was reduced (Fig. 4C). Such defects are consistent with the idea that tissue maintenance by neoblasts and their progeny are compromised after silencing of Smed-PTEN-1 and Smed-PTEN-2. Histological analyses of RNAi-treated animals not only confirmed the tissue disorganization detected by immunohistology, but also uncovered discontinuities in the basement membrane (BM) and the presence of abnormal invasive cells (Fig. 4D,E). The BM (extracellular matrix underneath the epithelial cells; Fig. 4D, lower arrows) separates the epithelium from the underlying mesenchyme (Nelson and Bissell, 2006). In the Smed-PTEN-1, -2(RNAi) animals, the integrity of the BM is markedly disrupted, and in some areas a physical barrier separating epithelial cells and mesenchymal tissues cannot be detected (Fig. 4E, top right). Such direct contact between epithelium and mesenchyme is also observed in planarians during normal wound healing after amputation and is known to be involved in the proliferation of nearby neoblasts (Hori, 1979a; Hori, 1979b; Hori, 1980). This may explain, in part, the overproliferation of cells detected in Smed-PTEN-1, -2(RNAi) animals. The abnormal invasiveness of some cells in Smed-PTEN-1, -2(RNAi) animals was readily apparent in the pharynx (Fig. 4E, bottom right). Normally, postmitotic progeny of neoblasts migrate to the epithelium and pharynx to replace cells lost during cellular turnover and tissue regeneration (Newmark and Sánchez Alvarado, 2000). Although, in the Smed-PTEN phenotype no ectopic mitotic activity was noted (i.e. no mitotic figures were detected in front of the photoreceptors or pharynx; see Fig. 4G), the cellular infiltration (i.e. increase in cellularity in different organs) observed in the epithelium and pharynx (Fig. 4E) may be due to the migration of neoblast progeny. Bromodeoxyuridine (BrdU) experiments confirmed that the migratory ability of the neoblast progeny was not lost after abrogation of Smed-PTEN genes (data not shown). Additionally, these cellular infiltrations were characterized by the presence of basophilic cells (Fig. 4E).",
      "section": "Results",
      "topic": "Tissue disorganization and cellular infiltration",
      "chunk_summary": "Smed-PTEN RNAi leads to tissue disorganization, including disruptions in neurons, muscle, and cilia, as well as discontinuities in the basement membrane and abnormal invasive cells, potentially due to impaired neoblast function and migration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "To further characterize the Smed-PTEN-1, -2(RNAi) phenotype, we examined whether cell number and the anatomical composition of different tissue types were affected. First, we dissociated control and Smed-PTEN-1, -2(RNAi) planarians (n=10 for each group) into cell suspensions of equal volume. The cells were spotted onto slides and the nuclei counterstained with propidium iodide (PI) (see experimental procedures for details). PI signal quantification revealed an increase of ~20% in cell number in Smed-PTEN-1, -2(RNAi) worms; however, this increase in cell number was not associated with increases in animal length or cell size (Fig. 4F and data not shown). Qualitative anatomical analyses (visual inspection of nuclei counterstaining using Sytox green, Molecular Probes) were also performed in cross-sections of different areas (anterior, posterior) and revealed that the increase in cell number/density in the Smed-PTEN-1, -2(RNAi) phenotype was scattered rather than restricted to a specific tissue or organ (data not shown). However, in animals with a severe phenotype (n=5), we observed evidence for the occurrence of hyperplasia, in which the normally monolayered epidermis became multilayered in Smed-PTEN-1, -2(RNAi) animals (Fig. 4F). This finding is consistent with previous chemically-induced epithelial hyperplasia observed in planarian neoplasms (Foster, 1963). Because neoblasts are the only known proliferative cell type in asexual planarians, we sought to evaluate whether cell proliferation was involved in the increase in cell number observed in Smed-PTEN-1, -2(RNAi) animals. We assayed whole animals with an anti-phosphorylated histone-3 (H3P) antibody that specifically labels mitotic neoblasts (Newmark and Sánchez Alvarado, 2000). When signs of the Smed-PTEN phenotype became visible (12 days after the first injection, as described above), mitotic activity was quantified (Reddien et al., 2005a; Reddien et al., 2005b) in four different groups: 1) control; 2) Smed-PTEN-1(RNAi); 3) Smed-PTEN-2(RNAi) and 4) Smed-PTEN-1, -2(RNAi). We found no differences in mitotic activity between control animals and animals in which the Smed-PTEN genes were individually silenced (data not shown). However, a significant increase in mitotic cells (Student's t-test, P<0.001) was observed in Smed-PTEN-1, -2(RNAi) animals (Fig. 4G). These data suggest that loss of PTEN activity in planarians leads to hyperproliferation and may be responsible for the observed hyperplasia (Fig. 4F).",
      "section": "Results",
      "topic": "Cell number, hyperplasia, and neoblast proliferation",
      "chunk_summary": "Smed-PTEN RNAi results in a ~20% increase in cell number, hyperplasia of the epidermis, and a significant increase in mitotic neoblasts, suggesting hyperproliferation due to PTEN loss.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "To better understand the nature of the effects exerted by PTEN on neoblasts, we tested several markers associated with neoblast function. First, we carried out a quantitative analysis based on ISH, performed in dissociated control and Smed-PTEN-1, -2(RNAi) animals, which revealed that there was an important increase in cells expressing neoblast markers after abrogation of both Smed-PTEN genes (supplementary material Fig. S2). This suggests that, in addition to an increase in mitotic activity, the number of cells expressing neoblast-specific markers increased in the Smed-PTEN phenotype. In contrast, a marked reduction in the expression of markers for differentiated cells such as neuronal (Smed-SYT), excretory (Smed-CA) and digestive (smedinx-9) cells was observed in Smed-PTEN-1, -2(RNAi) animals (Fig. 5A). We independently confirmed these results by qRT-PCR (supplementary material Table S2). The measured increment in the numbers of both proliferative neoblasts and their postmitotic progeny is consistent with the increase in cell numbers detected histologically (Fig. 4F and supplementary material Fig. S2) in Smed-PTEN-1, -2(RNAi) worms. Taken together, the data indicate that loss of Smed-PTEN function is characterized by an increase in neoblast numbers, but also a decrease in differentiated tissues - probably owing to an inability of the neoblast progeny to properly differentiate.",
      "section": "Results",
      "topic": "Neoblast differentiation",
      "chunk_summary": "Loss of Smed-PTEN function leads to an increase in neoblast markers and a decrease in differentiated cell markers, suggesting impaired neoblast differentiation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "PTEN loss of function is associated with activated PI3K-Akt signaling pathway in many malignancies related to cancer. The macrolide rapamycin operates through the multicomplex protein TOR, and has been shown to be effective in reversing the symptoms observed in PTEN loss of function models (Guertin and Sabatini, 2007; Sabatini, 2006; Yilmaz et al., 2006). We sought to test whether the effects of rapamycin in mammals could be recapitulated in planarians (see experimental procedure for details). Planarians subjected to RNAi of both Smed-PTEN genes and, subsequently, to daily injections of rapamycin, failed to develop any macroscopic signs of the characteristic Smed-PTEN phenotype, either in the first two weeks (n=50/50), or after one month of treatment (n=19/20). However, exposure to rapamycin restored the ability of Smed-PTEN-1, -2(RNAi) animals to launch a regenerative response after amputation, i.e. rapamycin treatment restored neoblast proliferation in response to injury. RNAi-treated animals developed anterior and posterior blastemas with the same dynamics as controls (n=30/30), and survived for longer than two weeks after the first dsRNA injection (Fig. 5B). After suspending rapamycin treatment, only a fraction of worms developed signs of the Smed-PTEN phenotype within one month (n=7/19), indicating that the effect of rapamycin treatment perdures for several weeks. Moreover, similar levels of mitotic activity were observed among control worms, worms treated with rapamycin alone, and Smed-PTEN-1, -2(RNAi) worms receiving rapamycin, suggesting that rapamycin treatment does not affect basal neoblast proliferation, but specifically prevents abnormal proliferation in the absence of functional Smed-PTEN genes (Fig. 5C). To further evaluate the effects of rapamycin in planarians, gene expression analyses were performed using markers of proliferative and postmitotic progeny of neoblasts (Fig. 5D). The results revealed that the percentage of cells expressing proliferative and postmitotic markers is similar between the control groups and rapamycin-treated Smed-PTEN-1, -2(RNAi) worms. However, the expression of differentiated tissue markers was lower in Smed-PTEN-1, -2(RNAi) worms treated with rapamycin than in control worms, or in worms receiving rapamycin alone (Fig. 5E), indicating that rapamycin may not fully rescue gene expression in differentiated tissues. Altogether, these results suggest that rapamycin treatment prevents the tissue homeostasis and regeneration defects observed in Smed-PTEN-1, -2(RNAi) animals.",
      "section": "Results",
      "topic": "Rapamycin rescue of Smed-PTEN phenotype",
      "chunk_summary": "Rapamycin treatment prevents the Smed-PTEN RNAi phenotype, restores regenerative capacity, and does not affect basal neoblast proliferation, but may not fully rescue differentiated tissue gene expression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "The oncoprotein kinase Akt is an important downstream target in the PI3K pathway that has central roles in PTEN loss of function (Guertin and Sabatini, 2007; Sabatini, 2006). Thus, we identified and cloned the planarian Akt ortholog (Smed-Akt). Unlike PTEN, there is a single Akt gene in S. mediterranea. Smed-Akt expression is widely distributed through the mesenchyme including postmitotic areas and in some cell clusters around the cephalic ganglia (supplementary material Fig. S3). The wide distribution of the Smed-Akt signal was also confirmed by expression analyses of FACS-isolated cells revealing that Smed-Akt is expressed in approximately 50% of the cells in both the X1 (proliferating) and Xins (differentiated) fractions, whereas only approximately 20% of the cells in X2 express Smed-Akt (Fig. 6A). Strikingly, the distribution of Smed-Akt expression was dramatically altered after simultaneous abrogation of both Smed-PTEN genes (Fig. 6A), increasing significantly in the X1 and X2 compartments (1.3- and 4.2-fold, respectively), and in differentiated cells (Xins=1.6-fold). In fact, the increase in Smed-Akt positive cells was higher than that of any other neoblast marker (Fig. 5D), indicating that Smed-PTEN-1 and -2 play a role in regulating Smed-Akt expression in both neoblasts and cells of differentiated tissues. Furthermore, rapamycin treatment of Smed-PTEN-1, -2(RNAi) worms specifically prevents the abnormal increase of Smed-Akt signal, while maintaining its basal expression (Fig. 6B and C). Thus, rapamycin is not stochastically downregulating Smed-Akt expression, but it is effective in distinguishing between physiological levels of Smed-Akt and its abnormal expression after RNAi of Smed-PTEN-1 and Smed-PTEN-2.",
      "section": "Results",
      "topic": "Smed-Akt expression and regulation",
      "chunk_summary": "Smed-Akt expression is widely distributed and is upregulated after Smed-PTEN RNAi, but rapamycin treatment prevents this abnormal increase, suggesting Smed-PTEN regulates Smed-Akt expression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    },
    {
      "text": "To evaluate the function of Akt in the Smed-PTEN phenotype, RNAi experiments involving Smed-Akt and Smed-PTEN genes were carried out. At the gross morphological level, Smed-Akt(RNAi) animals displayed only locomotion defects (~12 days after first injection, n=40/40), and did not develop other external abnormalities or head regression even after more than one month (data not shown). Smed-Akt(RNAi) animals, however, displayed lower number of proliferative cells when compared with control animals (Student's t-test, P<0.002), suggesting that Smed-Akt is necessary to maintain basal proliferation levels (Fig. 6C). Nevertheless, Smed-Akt(RNAi) animals are still capable of forming blastemas after amputation and regenerate with similar dynamics as control animals (data not shown, n=30/30). Together, the data indicate that Smed-Akt is not sufficient to affect either long-term homeostasis or tissue regeneration. Worms subjected to triple RNAi [Smed-Akt(RNAi); Smed-PTEN-1, -2(RNAi)], with or without rapamycin treatment, failed to display head regression as observed in the Smed-PTEN phenotype, yet developed abnormal outgrowths and lethality with full penetrance (n=23/23, supplementary material Fig. S4). Moreover, the number of proliferating cells in triple RNAi worms and in Smed-PTEN-1, -2(RNAi) worms were not statistically different (Student's t-test, P>0.3). These results suggest that abrogating Smed-Akt is not enough to prevent the abnormal hyperproliferation observed in the Smed-PTEN phenotype. Surprisingly, after rapamycin treatment, the number of proliferating cells in triple RNAi worms was the same as in the control group (Student's t-test, P>0.4), although rapamycin treatment failed to prevent abnormal outgrowths (n=15/15, Fig. 6C and supplementary material Fig. S4). Altogether these data suggest that, irrespective of proliferative levels, functional abrogation of Smed-PTEN is sufficient to induce abnormal outgrowths. Additionally, functional disruption of both Smed-Akt and Smed-PTEN genes reduce the capacity of rapamycin to prevent the abnormalities observed in the Smed-PTEN phenotype, suggesting that to be fully effective, rapamycin treatment requires functional Akt.",
      "section": "Results",
      "topic": "Smed-Akt RNAi and interaction with rapamycin",
      "chunk_summary": "Smed-Akt RNAi alone does not recapitulate the Smed-PTEN phenotype, but triple RNAi of Smed-Akt and Smed-PTENs reveals that Smed-PTEN abrogation is sufficient for abnormal outgrowths, and rapamycin's effectiveness is reduced without functional Akt.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_261510.pdf",
      "original_filename": "pdf_20250803_124125_261510_extracted_text.txt",
      "authors": "[\"Néstor J. Oviedo\", \"Bret Pearson\", \"Michael Levin\", \"Alejandro Sánchez Alvarado\"]",
      "year": "2008",
      "journal": "Disease Models & Mechanisms",
      "doi": "10.1242/dmm.000117"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:33:50.552908"
}