{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_360975_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_360975.pdf",
    "file_size": 38912,
    "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
    "journal": "iScience",
    "doi": "10.1016/j.isci.2021.102505",
    "year": "2021",
    "title": "Synthetic living machines: A new window on life",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Increased control of biological growth and form is essential for medical advances like repairing birth defects, restoring organs, and normalizing tumors, which depend on understanding how cells cooperate to make functional large-scale structures. Despite advances in molecular genetics, our understanding of morphogenesis rules remains incomplete. An engineering approach involves creating novel synthetic living forms, extending model systems beyond evolved lineages. This review covers recent advances in synthetic morphogenesis, the bioengineering of novel multicellular living bodies. Emphasizing emergent self-organization, tissue-level guided self-assembly, and active functionality, this work represents the next generation of synthetic biology. Besides useful living machines, designing and analyzing new anatomies will advance our understanding of evolutionary developmental and cell biology.",
      "section": "Summary",
      "topic": "Synthetic Morphogenesis",
      "chunk_summary": "Synthetic morphogenesis, the bioengineering of novel multicellular living bodies, offers a promising approach to understanding and controlling biological growth and form, with potential applications in regenerative medicine and fundamental biology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "As knowledge grows, building systems that exploit natural laws becomes possible. Engineering approaches, like building novel devices, have led to fundamental advances in fields like thermodynamics and computation. Biology is embarking on a similar journey with synthetic morphology, expanding cell-level synthetic biology to reprogram multicellular collectives. Moving beyond reverse engineering natural systems like embryogenesis to constructing novel ones offers useful technologies and improves understanding of basic mechanisms. Guided self-assembly is key: understanding cellular collective properties and using this knowledge to design inputs to control emergent form and function.",
      "section": "Introduction",
      "topic": "Synthetic Morphology",
      "chunk_summary": "Synthetic morphology, an engineering approach to biology, aims to build novel multicellular systems, offering new technologies and advancing our understanding of biological mechanisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Continuous feedback between analyzing biological phenomena and engineering living systems with novel structure and function drives progress. This review highlights recent advances in bioengineering synthetic morphology and discusses how new examples of form and function are advancing biological science. These novel living systems are an emerging technology at the intersection of several fields, providing new \"model species\" to develop and test meso-scale morphogenetic theories. This multidisciplinary undertaking integrates techniques and ideas from cell and developmental biology, physics, computer science, and neuroscience.",
      "section": "Introduction",
      "topic": "Interdisciplinary Approach",
      "chunk_summary": "The iterative process of analyzing biological phenomena and engineering novel living systems drives progress in synthetic morphology, a multidisciplinary field integrating biology, physics, computer science, and neuroscience.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Design, a specification or process for constructing systems in engineering, has been less practiced in generating biological models. Recent approaches in biological engineering and synthetic biology have tried to implement such processes at different scales, from gene circuits to artificial cell-cell communication. Standard model organisms evolved through tinkering, not rational design. Building living constructs with predefined topology and functionality enables rational design approaches to control development or manufacture systems close to in vivo counterparts. It can also result in novel systems with new specifications and objectives for medical and environmental applications.",
      "section": "Introduction",
      "topic": "Rational Design in Biology",
      "chunk_summary": "Applying rational design principles to biology, by building living constructs with predefined topology and functionality, offers a new approach to controlling development and creating novel systems with specific applications.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Biology utilizes modular decomposition and analysis of parts, recombining sophisticated components into novel systems at multiple levels. Organ transplants and parabiosis experiments construct novel hybrid bodies at the large scale. Genomic editing, transgenics, and nanomaterials modulate the lowest level components. This review focuses on a new direction at the meso-scale: taking synthetic biology beyond reprogramming single-cell phenotypes to rationally control growth and form using genetic circuits, growth factors, and materials, along with top-down external stimuli, to implement multicellular morphogenesis to desired specifications. Gaining predictive control over system-level outcomes is important; inferring required starting configurations and real-time stimuli is facilitated by computational modeling and in silico experiments in virtual embryogeny. Such computational efforts are essential for a quantitative understanding of morphogenesis rules and how they relate to cell behavior, deriving principles to guide cellular collectives toward specific anatomical outcomes.",
      "section": "Introduction",
      "topic": "Meso-scale Synthetic Biology",
      "chunk_summary": "Meso-scale synthetic biology aims to rationally control multicellular growth and form using a combination of genetic, chemical, and physical tools, guided by computational modeling to achieve desired anatomical outcomes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Bioengineering at the meso-scale is unique because bioengineers build with highly competent parts, like cells with internal homeostatic and signaling systems. Experiments with biological parts can help understand swarm intelligence at the tissue level, contributing to improved control of anatomy (important for regenerative medicine) and its disorders like injury and cancer. These advances also inspire novel architectures in machine learning, AI, and swarm robotics. The focus on controlling emergent self-assembly of artificial proto-bodies, as well as their computational and behavioral capacities, parallels the biological study of natural model systems and forms an embodied branch of Artificial Life.",
      "section": "State of the Art",
      "topic": "Swarm Intelligence and Bioengineering",
      "chunk_summary": "Bioengineering with competent biological parts offers insights into swarm intelligence at the tissue level, with implications for regenerative medicine, disease modeling, and artificial intelligence.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "This \"build-to-understand\" approach decodes novel design principles and generates useful technological platforms. One set of studies reconstitutes or emulates developmental mechanisms in vitro, either in cell lines or stem cells. Genetic circuits and artificial cell-cell communication induce cell sorting and pattern formation in cell lines. Exploiting stem cell self-organization generates mimetics of early developmental tissues or later human organogenesis in vitro, producing living models to study human development. The other approach follows designs based on application specifications. These synthetic living systems represent a new form of artificial life built on morphology and function by design, like artificial stingrays and Xenobots. These efforts pave the way for complex biological living machines with adaptive and autonomous operation, sensory inputs, signal processing, and actuation.",
      "section": "Significant Advances So Far",
      "topic": "Synthetic Multicellularity",
      "chunk_summary": "Two approaches to synthetic multicellularity involve either reconstituting developmental mechanisms in vitro or designing systems based on application specifications, leading to new models of development and artificial life forms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Engineering synthetic multicellularity requires lessons from past evolutionary and ecological processes. The transition from single cells to multicellular entities is a key invention in life.  How a single zygote robustly produces a whole organism with diverse cell types, function, and controlled organization is a central question.  Scientists have focused on reconstructing these processes in silico or at the bench. After millions of years of evolution, organismal forms and anatomies show prevalence in stereotypical morphological motifs like folds, segments, and cavities.  The presence of physiogenetic processes to control pattern, shape, or structures was suggested to explain the conserved nature of such structures. Generic physical properties, active in both living and non-living systems, promote the generation of such morphological motifs. The GRNs governing cellular interaction, initiation, and development of multicellular entities operate within this framework, fine-tuning, stabilizing, and mobilizing the core generic properties.",
      "section": "Synthetic multicellularity",
      "topic": "Evolution of Multicellularity",
      "chunk_summary": "Understanding the evolution of multicellularity, including the conserved morphological motifs and the interplay between generic physical properties and GRNs, is crucial for engineering synthetic multicellular systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Cell-cell communication and pattern formation are early events in multicellular development. Understanding and engineering different modes of communication and patterning in prokaryotic and eukaryotic cells has been a quest for developmental and synthetic biologists. Inspired by Steinberg's work, studies used cadherins to probe differential adhesion, cell sorting, and pattern formations. Combining cadherin-mediated cell sorting with artificial cell-cell communication produced multi-layer self-organization and multicellular patterning.  Synthetic mammalian reaction-diffusion patterns were shown via reconstituting the Nodal-Lefty network. Future efforts will focus on engineering other morphological motifs like controlled tube formation and folding. It is unclear how far one can go in reconstituting fully new forms and whether our ability to invent is limited by inherent constraints imposed by natural physical properties within biological systems.",
      "section": "Synthetic multicellularity",
      "topic": "Cell Communication and Patterning",
      "chunk_summary": "Engineering cell-cell communication and pattern formation, inspired by natural mechanisms like cadherin-mediated sorting and reaction-diffusion systems, is crucial for building synthetic multicellular systems, but the limits of this approach remain to be explored.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Studying human embryos in vitro is ethically restricted to 14 days after creation, creating a knowledge gap regarding gastrulation, germ layer specification, and early body plan segregation and organ specification. Models of early development, including \"embryoids,\" \"blastoids,\" and \"gastruloids,\" produced from human and murine stem cells, provide insights into these early stages of human development. Pioneering studies used human embryonic stem cells in geometric confinement with developmental cues, leading to self-organization and patterning into fates similar to the three germ layers, arranged in concentric rings mimicking the embryo. This phenomenon has been used to study signal diffusion and how single-cell chirality leads to large-scale tissue asymmetry.",
      "section": "Synthetic embryo-like entities for early developmental engineering",
      "topic": "Embryoids, Blastoids, and Gastruloids",
      "chunk_summary": "Stem cell-derived embryoids, blastoids, and gastruloids offer valuable models for studying early human development, particularly processes like gastrulation and germ layer specification, which are ethically challenging to study directly in human embryos.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Combining embryonic and extraembryonic mouse stem cells in defined ratios resulted in structures resembling the early pre-implantation embryo, including a compacted epiblast surrounded by a blastocyst cavity created by trophoblast cells (blastoids). These blastoids can support trophoblast stem cell development and decidualization when implanted into the mouse uterus but fail to achieve later developmental milestones. They offer a high-throughput way to investigate early embryo-like structures. Other methodologies also resulted in novel synthetic embryo-like structures using combinations of embryonic and extraembryonic stem cells in 3D culture. These structures spatially organize into polarized embryonic compartments and form lumens, replicating the organization of a post-implantation embryo (ETX-embryo).  Similar to murine blastoids, these embryoids can implant and decidualize in utero but have limited ability to develop further. Gastruloids mimicking the posterior embryo were developed using mouse embryonic stem cell aggregates pulsed with a Wnt agonist. These aggregates elongate and polarize, forming structures similar to post-implantation embryonic somites, showing spatial segregation of Hox genes. These 3D models provide tools to study tissue development in vitro.",
      "section": "Synthetic embryo-like entities for early developmental engineering",
      "topic": "3D Embryo Models",
      "chunk_summary": "3D embryo models, including blastoids and ETX-embryos, created by combining embryonic and extraembryonic stem cells, recapitulate aspects of early embryonic development but have limitations in achieving later developmental stages.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Microfluidic devices were used to create controlled signaling environments mimicking extraembryonic tissues. Exposing pluripotent cells to a polar signaling environment, using a two-channel microfluidic device creating a directional BMP4 signal, led to lumen development and amnion segregation from epiblast. The epiblast-like cells differentiated into primitive streak-like and primordial germ cell-like cells. These microfluidic devices could allow recapitulation of more complex signaling environments, including the post-implantation uterine environment.",
      "section": "Synthetic embryo-like entities for early developmental engineering",
      "topic": "Microfluidic Devices for Embryo Modeling",
      "chunk_summary": "Microfluidic devices offer a way to create controlled signaling environments that mimic extraembryonic tissues, enabling the study of specific morphogenetic events in vitro.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Organoids are 3D mini replicas of human organs, created by combining stem cell and developmental biology with bioengineering.  Studies focused on recapitulating stem cell-niche interactions in 3D extracellular matrices with defined developmental cues, controlling self-renewal, differentiation, and generation of diverse cell types that self-organize into functional forms mimicking organogenesis.  Seminal studies showed self-organized formation of apico-basally polarized cortical tissues from human pluripotent stem cells and self-formation of optic cups. Parallel studies showed formation of mini-gut organoids using adult stem cells. A landmark study presented cerebral organoids with features of cortical development, brain region identities, and functional cortical neurons. These tissue replicas emerged as tools to decode organogenesis principles and model human disease, with a long-term perspective for regenerative therapies.",
      "section": "Organoids and synthetic tissues to mimic human organ-like structures",
      "topic": "Organoids",
      "chunk_summary": "Organoids, 3D mini replicas of human organs created from stem cells, provide valuable models for studying organogenesis, disease modeling, and potential regenerative therapies.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "More complex behavior was also modeled, such as traveling wave-like expression patterns representative of the segmentation clock, central to rhythmic somite and axial skeleton emergence.  Endoderm-, mesoderm-, and ectoderm-derived organoids have been generated. Each model provides a window to study human development, enabling us to understand broad questions.",
      "section": "Organoids and synthetic tissues to mimic human organ-like structures",
      "topic": "Organoid Applications",
      "chunk_summary": "Organoids enable the study of complex developmental processes, such as the segmentation clock, and offer models for various tissue types, providing insights into human development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "A key challenge with in vitro multicellular morphogenesis is controlling self-organization. Tools for quantitative and universal assessment of tissue function, identity, and cellular composition are missing.  Controlling and quantitating cell fate and tissue morphogenesis improves robustness and reproducibility in manufacturing. Many studies add growth factors to cell culture media to reconstitute niche-mediated signaling cues, but this can encounter challenges like supraphysiological concentrations. It is also challenging to reconstitute spatiotemporal dynamic and combinatorial cues displayed in native developing tissues. Microfluidic approaches and engineered matrices offer cell-extrinsic control for signaling cues. Shape-morphing materials (kinomorphs) can rationally control multicellular network shape and size. Self-organization of intestinal organoids-on-a-chip using scaffolds enabled regulation of morphological specifications, improving maturation and composition of cell types, providing mini-intestines with physiological hallmarks of the in vivo organ.",
      "section": "Perspective",
      "topic": "Challenges in Morphogenesis Control",
      "chunk_summary": "Controlling self-organization and developing quantitative assessment tools are key challenges in in vitro multicellular morphogenesis, with microfluidic approaches and engineered matrices offering promising solutions for controlling signaling cues and shaping tissue morphology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Engineering synthetic genetic circuits offers a cell-intrinsic approach to control cell fate, communication, and self-organization. Using cells as niche-associated signaling centers reconstitutes developmental cues and re-creates niche-stem cell cross talk. Genetically engineered Sonic Hedgehog (SHH)-expressing sender cells established a morphogen gradient and improved cell fate and self-organization in forebrain organoids. Genetically embedded gene circuits can drive multiline-age co-differentiation to produce pre-programmed tissues and organoids. Inducible and transient GATA6 expression triggered symmetry breaking, co-development of endoderm and mesoderm, and human fetal liver bud formation. Multilineage maturation was achieved through synthetic GRN control. Recent studies used orthogonal differentiation of genetically engineered stem cells to produce multicellular tissues like vascularized brain organoids. Transcription factor-based cell fate programming reduces dependence on medium signaling cues, alleviating the challenge of finding a supporting medium for multiple cell types. Synthetic genetic programs can interface with cell state, mechanical cues, light, and heat. How engineering genetic circuits might alter cell mechanical and electrical characteristics to modulate morphogenetic events is an attractive area for future studies.",
      "section": "Perspective",
      "topic": "Synthetic Genetic Circuits",
      "chunk_summary": "Engineering synthetic genetic circuits provides a cell-intrinsic approach to control cell fate, communication, and self-organization, offering precise control over tissue development and enabling the creation of complex multicellular structures.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Efforts have been made to understand and apply biomechanical design principles of marine organisms to generate novel technologies like bio-inspired autonomous underwater vehicles.  Medusa jellyfish were reverse-engineered to identify key design specifications in the context of structure-function, stroke kinematics, and animal-fluid interactions. Jellyfish stroke involves fast contraction and slow elastic recoil. To mimic this, a bilayer of muscle tissue and silicone polymer elastomer (medusoid) was engineered, controlled by an electrical field. The muscle provided contraction force, while the elastomer restored the original shape. Rat cardiac tissue, with its ordered myofibril organization and spatiotemporal coordination, was found suitable for generating a self-organized sheet of tissue with defined force generation axes and cell-to-cell electromechanical coupling.  Stimulated medusoids contract like a jellyfish power stroke, followed by elastic recoil. This allows medusoid biobots to move similarly to jellyfish, though lacking features like controlled turns and sense-response. Design, computational simulations, and experiments were used to optimize parameters. Medusoids demonstrate successful generation of macroscale functional morphologies by dividing complex behavior into mechanistic components, exploiting cell self-organization, and using engineering design algorithms and quantitative benchmarking. The similarity of mechanical behaviors between these biobots and other synthetic muscular pumps, like the human heart, enables application of this framework to model and build therapeutically valuable muscular pumps.",
      "section": "Medusoids and optogenetic stingrays: the swimming biobots",
      "topic": "Medusoids",
      "chunk_summary": "Medusoids, biobots inspired by jellyfish, demonstrate the potential of combining living tissues with synthetic materials to create functional macroscopic structures capable of jellyfish-like movement.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Medusoid swimming lacks control over turning and maneuvering. A follow-up study addressed this limitation by mimicking bathoid fish (skate and ray) anatomy and swimming patterns.  A synthetic ray, the size of a nickel, integrates optogenetic technology, rat muscle cells, a 3D elastomer body, and a gold skeleton. This biobot shows front-to-rear undulating motion controlled by light stimulation, mimicking real stingray motion. Muscle cells react to optical stimuli using a genetically engineered light-sensitive ion channel.  Electrically coupled cells via gap junctions enable action potential propagation and contractility.  Light frequency and stimulation synchrony between fins control movement speed and direction.  Stimulating both sides results in forward navigation, while asynchronous stimulation produces turns. The synthetic ray navigates a curved obstacle course at 1.5 mm/s over a distance 15 times its length (250 mm). However, it moves and turns slower than a living ray and requires laminar flow. Integrating multiple cell types with novel materials and sense-process-response circuits can equip synthetic rays with diverse behaviors. An example is a study combining computational design, optogenetics, and a neurovascular unit for neuron-enabled biohybrid machines. The synthetic ray couples sensory information to coordinated motor function and behavior, setting the stage for adaptive living machines with primitive cognition as additional processing circuits are added.",
      "section": "Medusoids and optogenetic stingrays: the swimming biobots",
      "topic": "Optogenetic Stingrays",
      "chunk_summary": "Optogenetic stingrays, biobots inspired by batoid fish, demonstrate controlled movement and turning using light-activated muscle cells, offering a platform for developing more complex biohybrid machines with sensory-motor integration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Locomotive biobots were made by combining muscle cell contractility with materials for moving functions. A silicon microdevice grew and self-assembled cardiac muscle bundles on a thermally responsive polymer (PNIPAAm).  Cooled PNIPAAm undergoes a solid-liquid phase transition, releasing the hybrid structures (~0.5 mm).  Collective muscle bundle motion governs device movement, with force overcoming friction. The biobot's speed was ~38 µm/s, depending on step size and contraction frequency.  More efficient living machines with velocities of 150-500 µm/s were developed, integrating 3D printing, hydrogel scaffolds, and living muscle tissue with computational design.",
      "section": "Walking biological machines",
      "topic": "Walking Biobots",
      "chunk_summary": "Walking biobots, created by combining muscle cells with microfabricated structures and materials, demonstrate locomotion driven by muscle contraction, with advancements in design leading to increased speed and efficiency.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Metazoan cells with a standard genome undergo embryogenesis and regeneration, building or repairing a species-specific body. However, genetically specified cellular components can implement physiological networks with morphological and functional flexibility. An engineering approach asks what else normal cells can build besides their genomic default outcomes and whether cellular collectives can form novel morphologies without genetic change. Artificial embryogenesis provides novel model systems to study the relationship between evolutionary forces, genomic information, and structural/behavioral outcomes. Examples include \"Xenobots\" (from Xenopus laevis frog embryos). The first type consists of skin and muscle cells. A computational process identified specific layering and sculpting patterns. These Xenobots exploit \"legs\" revealed by cell removal to exhibit forward movement (\"walking\"). Requiring no external stimulation, muscle cells contract synchronously, and skin cells conduct electrical signals and calcium waves synchronized for coherent forward motion. In silico evolution identified cell removal patterns predicted to result in locomotion, while cellular signaling, force transmission, and pacing emerged.",
      "section": "Xenobots",
      "topic": "Xenobots: Skin and Muscle",
      "chunk_summary": "Xenobots, built from frog skin and muscle cells, demonstrate the ability of cells to form novel morphologies and behaviors beyond their genetically programmed defaults, with computationally designed shapes enabling locomotion.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "The second Xenobot type is more self-organized, resulting from prospective ectoderm cells isolated from embryos. Dissociated cells reboot their multicellularity along a novel path, assembling into a spherical proto-body with morphology, behavior, and developmental sequence different from typical Xenopus embryos. These exhibit diverse swimming behavior driven by ciliary motion (including maze traversal and dynamic environmental interactions), repair after mechanical damage, and collective behavior rearranging particles into predictably modeled patterns. These constructs blur traditional definitions of living beings, robots, and machines, serving as a platform for bio-robotics.  A simple photo-memory functionality was demonstrated using a synthetic protein to implement a long-term, externally readable engram of light exposure experience.  Future work can program Xenobot morphogenesis and behavior using synthetic biology circuits in Xenopus cells.  However, these constructs also highlight endogenous plasticity, as these functions were obtained from genetically wild-type cells—their shape and function are not predictable from the genome alone.",
      "section": "Xenobots",
      "topic": "Xenobots: Self-Organized",
      "chunk_summary": "Self-organized Xenobots, formed from frog ectoderm cells, demonstrate diverse behaviors, including swimming, maze traversal, self-repair, and collective particle manipulation, highlighting the plasticity of cellular collectives and their potential for bio-robotics applications.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Xenopus cells evolved in the Earth's biosphere, but the skin cells' genome was selected for its role on the embryo's outer surface. In a novel configuration, skin cells self-organize structure and function toward a coherent proto-organism in hours—without evolutionary timescales and selection pressure for these organism-scale features. Their evolution occurred in a virtual world. This raises questions about cellular collective plasticity and their ability to reach morphospace areas beyond normal embryogenesis.  The study of Xenobot behaviors and the ability of cells from diverse species to self-organize novel functional anatomies is just beginning, promising a rich field of discoveries merging novel inputs with endogenous plasticity of swarms cooperating toward diverse specific anatomical outcomes despite their wild-type genomes.",
      "section": "Xenobots",
      "topic": "Cellular Plasticity",
      "chunk_summary": "Xenobots demonstrate the remarkable plasticity of cellular collectives, their ability to self-organize into novel functional forms beyond their genetically predetermined roles, raising fundamental questions about the potential of cells to explore new areas of morphospace.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    },
    {
      "text": "Synthetic Morphogenesis aims to understand and engineer developmental processes using engineering principles. Top-down decomposition of the process into operational subunits or modules, collections of signaling and morphogenetic events triggered by simple signals, is useful for studying existing design principles in organismal development. These modules work independently and interconnected at different scales, sculpting tissues and organs through morphological motifs. They can be classified as chemical, mechanical, electrical, and gene regulatory network (GRN) modules. They trigger cell type production, cellular self-organization, and functional maturation, participating in physiological and pathological processes during aging, degenerative disease, and tissue injury responses. Each module can be further divided into sense-process-actuation elements directing morphogenetic processes. Cells use GRN modules to differentiate and create distinct cell types with soluble and insoluble signaling cues. These cells form collectives, employing multilineage communication through chemical, bioelectrical, and biomechanical mechanisms to coordinate long-range outcomes.  The activation of these modules underlies symmetry breaking, growth, and morphogenesis.  Recent evidence shows feedback regulatory controls within and between modules, ensuring robustness and resilience during development. However, how distinct modules are linked and how hierarchical directionality is shaped are ongoing studies. From early embryogenesis, cellular GRNs are controlled by signals from the cell itself, its neighbors, or distant tissues, enabling continuous top-down feedback controls and the establishment of setpoints to operate within target morphology specs. Examples include regeneration to the same shape after damage and the ability of salamander kidney tubules to form the same shape and size from different-sized cells, by mechanisms depending on cell:cell communication or single-cell cytoskeletal shape control. Large-scale anatomical homeostasis involves bioelectric signaling across all tissues.",
      "section": "Developmental modules to build and control synthetic morphogenesis",
      "topic": "Developmental Modules",
      "chunk_summary": "Synthetic morphogenesis utilizes the concept of developmental modules, collections of signaling and morphogenetic events, to understand and engineer developmental processes, with these modules interacting at different scales to shape tissues and organs through various mechanisms, including chemical, mechanical, electrical, and gene regulatory networks.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_360975.pdf",
      "original_filename": "pdf_20250803_124125_360975_extracted_text.txt",
      "authors": "[\"Mo R. Ebrahimkhani\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "iScience",
      "doi": "10.1016/j.isci.2021.102505"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:44:05.355830"
}