{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_254208_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_254208.pdf",
    "file_size": 24254,
    "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
    "journal": "Development",
    "doi": "10.1242/dev.00698",
    "year": "2000",
    "title": "Fusicoccin signaling reveals 14-3-3 protein function as a novel step in left-right patterning during amphibian embryogenesis",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "To understand how H+ flux controls morphogenetic signals during embryogenesis, we tested Fusicoccin-A (FC) on frog embryos. FC, known to activate H+ pumping in plant cells, caused randomization of the left-right (LR) axis (heterotaxia) in frog embryos. We present biochemical and molecular-genetic evidence that 14-3-3 proteins are a necessary component of Xenopus FC receptors and that disrupting 14-3-3 protein function leads to heterotaxia.  Subcellular localization of 14-3-3 mRNAs and proteins reveals novel cytoplasmic destinations and a left-right asymmetry at the first cell division.  Our findings suggest that 14-3-3E protein is an endogenous and very early component of LR patterning. These data highlight conserved signaling pathways across kingdoms, suggest common polarity establishment mechanisms between C. elegans and vertebrate embryos, and reveal a new entry point into the LR asymmetry determination pathway.",
      "section": "Summary",
      "topic": "Fusicoccin and Left-Right Asymmetry",
      "chunk_summary": "Fusicoccin exposure disrupts left-right patterning in frog embryos through interaction with 14-3-3 proteins, revealing a novel early step in asymmetry determination.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "Ion flux, particularly H+ flux and resulting pH gradients, plays a crucial role in embryonic development and neoplastic progression.  Fusicoccin (FC), a metabolite of the plant pathogen *Fusicoccum amygdali* Del., stimulates various physiological processes in higher plants. FC binds to a receptor formed by 14-3-3 proteins and the plasma membrane H+-ATPase. 14-3-3 proteins are involved in cell cycle, apoptosis, and prion diseases. Binding of 14-3-3 to the H+ pump's C-terminal domain increases H+-extrusion and changes cytoplasmic pH. Despite the conservation of 14-3-3 proteins across plants and animals, FC binding sites have not been demonstrated outside plants.  H⁺ current modulation by FC and pH regulation of gap-junctional communication led us to investigate FC's effects on embryonic patterning in Xenopus laevis.  We found that FC exposure randomizes the left-right (LR) axis, a crucial aspect of development with medical implications for laterality defects in humans.",
      "section": "Introduction",
      "topic": "Ion Flux and Fusicoccin Signaling",
      "chunk_summary": "Ion flux, especially H+ flux, is crucial in development, and fusicoccin, which interacts with 14-3-3 proteins to modulate H+ pumps in plants, was investigated for its effects on left-right patterning in Xenopus embryos.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "Embryonic situs was assessed by examining heart, gut, and gall-bladder positioning in anesthetized stage 45 embryos. Embryos were homogenized for biochemical analysis by grinding in liquid nitrogen and centrifuging to separate microsomal and cytoplasmic fractions. Fusicoccin binding assays were performed using radiolabelled [3H]FC and protein extracts, with non-specific binding measured using unlabelled FC. Chromogenic in situ hybridization was performed using DIG-labeled probes.  Embryos were exposed to FC in 0.1×MMR medium at pH<6. Microinjection of peptides and mRNA was performed using standard methods. Immunohistochemistry involved fixing embryos, sectioning, and staining with primary and secondary antibodies, followed by detection using NBT and BCIP.",
      "section": "Materials and methods",
      "topic": "Experimental Methods",
      "chunk_summary": "This section details the methods used for assessing embryonic situs, preparing samples for biochemical analysis, performing fusicoccin binding assays, in situ hybridization, drug exposure, microinjection, and immunohistochemistry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "Exposure of Xenopus embryos to Fusicoccin (FC) from fertilization to stage 14 resulted in heterotaxia, a randomization of the left-right (LR) axis, affecting heart, gut, and gall-bladder positioning.  The rate of reversals in any one of these organs was 25% in FC-exposed embryos compared to 1% in controls.  FC exposure did not affect overall development or individual organ morphogenesis, suggesting a specific effect on LR cue orientation or interpretation.  Microinjection of FC into the egg yielded similar results.  FC-binding sites in Xenopus embryos were found to be cytoplasmic, unlike the plasma membrane localization in plant cells.  The embryo receptor had a medium-high affinity for FC, with a KD of 27.8±6.9 nM.  The embryo receptor showed greater sensitivity to chemical modifications of FC compared to the plant receptor.",
      "section": "Results",
      "topic": "Fusicoccin-Induced Heterotaxia",
      "chunk_summary": "Fusicoccin exposure specifically disrupts left-right asymmetry in Xenopus embryos, and the embryos possess a cytoplasmic FC receptor with distinct binding characteristics.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "A competitive binding experiment showed that the embryo FC receptor is more sensitive to chemical modifications of FC than the plant receptor.  A phosphorylated NR peptide, designed to disrupt 14-3-3 protein interactions, reduced FC binding to the embryo receptor by 75%. This suggests that 14-3-3 proteins are part of the embryo FC receptor.  Microinjection of the phosphorylated NR peptide into one-cell embryos resulted in 31% heterotaxia, while a non-phosphorylated control peptide had no effect. This supports the role of 14-3-3 proteins in LR patterning. Overexpression of 14-3-3E, but not 14-3-3Z, induced heterotaxia, particularly when injected at the one-cell stage.  This suggests a specific role for 14-3-3E in early LR patterning.  14-3-3E overexpression disrupted the normal left-sided expression of XNR1, placing 14-3-3E function upstream of XNR1 in the LR pathway.",
      "section": "Results",
      "topic": "14-3-3 Proteins and LR Patterning",
      "chunk_summary": "Experiments with a 14-3-3 blocking peptide and 14-3-3E overexpression confirm the involvement of 14-3-3 proteins, specifically 14-3-3E, in early left-right patterning upstream of XNR1.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "Immunohistochemistry revealed distinct localization patterns for 14-3-3E and 14-3-3Z proteins. 14-3-3Z was localized vegetally in the unfertilized egg and later in the endodermal yolk mass, showing no LR asymmetry.  14-3-3E was centrally localized before fertilization and became asymmetrically localized to one blastomere after the first cleavage, specifically the right blastomere at the two-cell stage. This asymmetric localization supports 14-3-3E's role in LR asymmetry.  Overexpression of 14-3-3E resulted in ubiquitous protein distribution in early embryos.  FC exposure abolished the normal asymmetry of 14-3-3E localization at the two-cell stage.  In situ hybridization showed distinct mRNA localization patterns for different 14-3-3 isoforms.  14-3-3T mRNA was cortical and later expressed in the nervous system.  14-3-3Z mRNA was cortical and later animal-vegetal, with no LR asymmetry.  14-3-3E mRNA showed an early asymmetry consistent with the protein localization.",
      "section": "Results",
      "topic": "14-3-3 Localization and FC Effects",
      "chunk_summary": "14-3-3E protein and mRNA exhibit early left-right asymmetry, while 14-3-3Z does not; fusicoccin exposure disrupts this asymmetry, further implicating 14-3-3E in left-right patterning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    },
    {
      "text": "These results demonstrate a novel role for 14-3-3 proteins in the determination of the left-right axis in *Xenopus* embryos. The data suggest that 14-3-3 proteins are involved in very early steps of LR patterning, upstream of the known asymmetric gene XNR1. The asymmetric localization of 14-3-3E protein and mRNA at the first cleavage stages is a striking finding and represents the earliest known LR asymmetry in any species.  The fact that FC exposure disrupts this asymmetry and causes heterotaxia further strengthens the link between 14-3-3E and LR determination.  The presence of FC receptors in *Xenopus* embryos, despite their absence in other animal models, suggests a unique signaling pathway in amphibians. The cytoplasmic localization of these receptors is also intriguing and warrants further investigation.  The findings highlight the importance of H+ flux and pH regulation in developmental processes and suggest a conserved mechanism for polarity establishment across different species.",
      "section": "Discussion",
      "topic": "14-3-3 and LR Asymmetry",
      "chunk_summary": "The study reveals a novel role for 14-3-3 proteins, particularly 14-3-3E, in early left-right axis determination in Xenopus, upstream of XNR1, and highlights the importance of H+ flux and pH regulation in development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_254208.pdf",
      "original_filename": "pdf_20250803_124125_254208_extracted_text.txt",
      "authors": "[\"Tom Bunney\", \"Albertus H. De Boer\", \"Michael Levin\"]",
      "year": "2000",
      "journal": "Development",
      "doi": "10.1242/dev.00698"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:23:27.386883"
}