{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_933407_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_933407.pdf",
    "file_size": 175833,
    "authors": "Unknown",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Unknown",
    "confidence_score": null,
    "document_type": "patent"
  },
  "chunks": [
    {
      "text": "Disclosed are engineered multicellular organisms. The disclosed organisms comprise an aggregate of ciliated cells, and the organisms move when the ciliated cells are actuated. The engineered multicellular organisms also are capable of kinematic self-replication. The engineered multicellular organisms are capable of moving a plurality of dissociated ciliated cells into piles of ciliated cells which form a multicellular organism comprising an aggregate of ciliated cells which moves when the ciliated cells are actuated. Also disclosed are systems and methods for designing, preparing, and utilizing the engineered multicellular organisms.",
      "section": "Abstract",
      "topic": "Engineered multicellular organisms",
      "chunk_summary": "Engineered multicellular organisms comprising ciliated cells are capable of movement and kinematic self-replication.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Disclosed are engineered multicellular organisms. The disclosed organisms comprise or consist of relatively small aggregates of ciliated cells, and the organisms move when the ciliated cells are actuated. The engineered multicellular organisms also are capable of kinematic self-replication. The engineered multicellular organisms are capable of moving a plurality of dissociated ciliated cells into piles of ciliated cells which form a multicellular organism comprising an aggregate of ciliated cells which moves when the ciliated cells are actuated. Also disclosed are systems and methods for designing, preparing, and utilizing the engineered multicellular organisms.",
      "section": "Summary",
      "topic": "Engineered multicellular organisms",
      "chunk_summary": "Engineered multicellular organisms are disclosed, which move via ciliated cells and are capable of kinematic self-replication.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The field of the invention relates to engineered multicellular organisms and systems and methods for designing, preparing, and utilizing engineered multicellular organisms. The engineered multicellular organisms may be configured for movement and other physical and biological activities. Here, we introduce \\\"Xenobots,\\\" which are multicellular biological robots (\\\"biobots\\\") from frog (Xenopus laevis) with a diameter ranging from 100 to 500 microns. Xenobots have a built-in capacity for motility in aqueous environments based on locomotive appendages called \\\"cilia\\\" which cover their surface. Xenobots are induced to arise by cellular self-organization and do not require scaffolds or microprinting, and the amphibian cells which form Xenobots are highly amenable to surgical, genetic, chemical, and optical stimulation to control the self-assembly process. Xenobots are motile and are capable of moving in various trajectories including loops, straight lines, large arcs, and even in zigzag patterns with a linear speed ranges from 5-50 microns/second.",
      "section": "Background",
      "topic": "Xenobots: Introduction and characteristics",
      "chunk_summary": "Xenobots, biobots derived from frog cells, are motile due to cilia and can be controlled through various stimuli.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Because Xenobots develop on their own without the need for external manipulation or micromanagement, many of them can be grown in parallel. This makes Xenobots amenable to easy mass fabrication, which not only makes their production more scalable and economical, but also enables easy generation of Xenobots swarms that may collectively accomplish task that cannot be accomplished by a single Xenobot. Furthermore, Xenobots can be loaded with exogenous payloads such as RNA, protein, drugs, dyes, and synthetic molecules. Therefore, Xenobots can be programmed on demand to execute a diverse set of tasks in different environments. Recently, we have found that semitoroidal shaped (\\\"Pac Man\\\" shape) xenobots are capable of kinematic self replication. We also found that xenobots can push individual frog cells into piles. The cells in these piles attach together and grow cilia-small motion-propelling hairs on the pile's outer face.",
      "section": "Background",
      "topic": "Xenobot applications and self-replication",
      "chunk_summary": "Xenobots are easily mass-produced, can carry payloads, and exhibit kinematic self-replication, pushing cells into piles that develop cilia.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Making functional self copies of oneself by amassing and organizing external material through motion is known as kinematic self replication. This differs from growth-based replication, the standard form of propagation in biology. We have observed that a swarm of semitoroids can trigger five rounds of this replicative process before losing the ability to self-replicate, if supplied with enough frog cells as construction material. It should be possible to keep this process going indefinitely if sufficient quantities of cells are provided. Further, starting with just a few starter semitoroids, a very large number of xenobots can be created automatically, thus classing this technology as an exponential technology. We have shown that, in theory, these swarms are capable of performing exponentially increasing amounts of useful work at the microscale, such as building and fixing microelectronics, or cleaning contaminants from soils and waterways.",
      "section": "Background",
      "topic": "Kinematic self-replication and potential applications",
      "chunk_summary": "Kinematic self-replication, distinct from growth-based replication, allows Xenobot swarms to perform potentially exponential amounts of microscale work.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The following discussion is presented to enable a person skilled in the art to make and use embodiments of the disclosure. Various modifications to the illustrated embodiments will be readily apparent to those skilled in the art, and the generic principles herein can be applied to other embodiments and applications without departing from embodiments of the disclosure. Thus, embodiments of the disclosure are not intended to be limited to embodiments shown, but are to be accorded the widest scope consistent with the principles and features disclosed herein. The following detailed description is to be read with reference to the figures. The figures, which are not necessarily to scale, depict selected embodiments and are not intended to limit the scope of embodiments of the disclosure. Skilled artisans will recognize the examples provided herein have many useful alternatives and fall within the scope of embodiments of the disclosure.",
      "section": "Detailed Description",
      "topic": "General description and scope",
      "chunk_summary": "This detailed description, along with the figures, provides guidance for understanding and implementing the disclosed embodiments, with the understanding that modifications and variations are possible within the scope of the invention.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The aggregate of cells may comprise, consist essentially of, or consist of ciliated cells. In some embodiments, the aggregate of cells may comprise or may not comprise additional non-ciliated cell types. In some embodiments, the engineered multicellular organisms are non-innervated (e.g., the organisms do not comprise neural cells or neural tissue) and/or or non-cartilaginous. The multicellular organisms may be described as \\\"engineered\\\" because they are different from naturally occurring organism that arise without the guidance of human ingenuity and modifications. In other words, the multicellular organisms are synthetic and non-naturally occurring, albeit the multicellular organism may utilize endogenous cell: cell signaling and morphogenesis.",
      "section": "Detailed Description",
      "topic": "Cellular composition and characteristics",
      "chunk_summary": "Engineered multicellular organisms are primarily composed of ciliated cells, are non-innervated and non-cartilaginous, and are synthetically created.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The aggregate of cells of the engineered multicellular organisms may comprise cells that have been engineered to express a heterologous molecule. In some embodiments, the cells of the organisms are engineered to express a heterologous protein or secrete specific desired molecules. In embodiments in which the aggregate of cells comprises cells that have been engineered to express a heterologous molecule, suitable heterologous molecules that are expressed may include enzymes. Suitable enzymes may include enzymes that metabolize a target substrate, which may include toxins. Other suitable heterologous molecules may include receptors for a target ligand (e.g., a target ligand sensed by the organism), or sensors of light, heat, and other physical properties in the environment. Other suitable heterologous molecules may include reporter molecules (e.g., photoconvertible fluorescent reporter molecules).",
      "section": "Detailed Description",
      "topic": "Heterologous molecule expression",
      "chunk_summary": "Engineered cells within the organisms can express heterologous molecules like enzymes, receptors, or reporter molecules for various functions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The disclosed engineered multicellular organisms may be self-repairing. In some embodiments, if the aggregate of cells is subjected to deaggregation (e.g., physical damage that disrupts aggregation of the cells), the cells will reaggregate and/or remodel to re-form the aggregate of cells having the original shape or a new shape. The engineered multicellular organisms may be configured in order to perform tasks. For example, the engineered multicellular organisms may be configured structurally and/or genetically. In some embodiments, the organism is configured for moving a target object (e.g., by pushing a target object). In further embodiments, the organism is configured for moving target objects (e.g., by pushing target objects) and collecting the moved target objections (i.e., aggregating the target objects).",
      "section": "Detailed Description",
      "topic": "Self-repair and task configuration",
      "chunk_summary": "The organisms are self-repairing and can be configured to perform tasks such as moving and aggregating target objects.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The engineered multicellular organisms may be configured to have a cavity. In some embodiments, the engineered multicellular organisms are configured to have a cavity for capturing and/or transporting a target object. The engineered multicellular organisms may be utilized in a number of applications. In some embodiments, the engineered multicellular organisms are utilized in methods for removing a target substrate from an environment (e.g., a toxin from an environment). The methods may comprise engineering the organisms to express an enzyme that metabolizes the target substrate and placing the organism in the environment to remove the target substrate from the environment.",
      "section": "Detailed Description",
      "topic": "Applications of engineered organisms",
      "chunk_summary": "Engineered organisms with cavities can capture and transport objects, and can be used for applications like toxin removal.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "In other embodiments, the engineered multicellular organisms are utilized in methods for detecting a target ligand in a sample. The methods may comprise engineering the organisms to express a receptor for the target ligand and place the organism in the sample, where the organism generates a signal after the receptor binds the target ligand. In other embodiments, the engineered multicellular organisms may express a photoconvertible fluorescent reporter molecule, and the organism generates a fluorescent signal when the photoconvertible fluorescent reporter molecule is exposed to light. As such, the activity and movement of the organisms may be monitored by placing the organisms in an environment and providing a light source for activating the photoconvertible fluorescent reporter molecule.",
      "section": "Detailed Description",
      "topic": "Detection methods using engineered organisms",
      "chunk_summary": "Engineered organisms can be used for detecting target ligands and their movement can be monitored using photoconvertible fluorescent reporter molecules.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Also disclosed are methods for preparing the engineered multicellular organisms. In some embodiments, the methods comprising explanting cells from tissue and culturing the explanted cells under conditions in which the cultured, explanted cells form the engineered multicellular organisms.",
      "section": "Detailed Description",
      "topic": "Preparation of engineered organisms",
      "chunk_summary": "Engineered multicellular organisms can be prepared by explanting and culturing cells under specific conditions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Robot swarms have to date been constructed from artificial materials. Motile biological constructs have been created from muscle cells grown on precisely shaped scaffolds. However, the exploitation of emergent self-organization and functional plasticity into a self-directed living machine has remained a major challenge. We report here an explant-based method for generation of in vitro biological robots from frog (Xenopus laevis) cells. These Xenobots exhibit coordinated locomotion via cilia present on their surface. These cilia arise through normal tissue patterning and do not require complicated construction methods or genomic editing, making biobot production amenable to high-throughput projects. The biobots arise by cellular self-organization and do not require scaffolds or microprinting; the amphibian cells are highly amenable to surgical, genetic, chemical, and optical stimulation during the self-assembly process. We show that the Xenobots can navigate aqueous environments in diverse ways, heal after damage, and show emergent group behaviors. We provide in silico simulations using evolutionary computation that explain how sensor-less behavior of Xenobots gives rise to observed manipulation of objects in their environment. In addition, we provide proof of principle for a writable molecular memory using a photoconvertible protein which can record exposure to a specific wavelength of light. Together, these results introduce a new platform that can be used to study many aspects of self-assembly, swarm behavior, and synthetic bioengineering, as well as provide versatile, soft-body living machines for numerous practical applications in biomedicine and the environment.",
      "section": "Example 1-a",
      "topic": "Xenobots: A cellular platform for synthetic living machines",
      "chunk_summary": "Xenobots, created from frog cells, exhibit coordinated locomotion, self-organization, and emergent group behaviors, offering a new platform for studying self-assembly and synthetic bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Constructing robot swarms at small scales remains an open problem. Fabrication challenges abound, yet manufacturing advances are allowing for the construction of large numbers of microrobots composed of diverse components. Formulating and programming complex control policies into very small devices to enable swarm behavior also raises many conceptual challenges. However, recent advances in synthetic biology suggest an alternative path to many-bodied microswarms that, to some degree, sidestep some of these manufacturing and conceptual challenges: constructing small-scale living machines solely from biological tissue in such a way that they inherit the adaptive potential of their wild type analogs. All organisms, including those that grow to macro size scales, pass through early stages of development in which they must achieve and maintain complex behaviors. This raises the possibility of direct and indirect perturbations to natural development, including tissue explantation and/or rearrangement, to achieve novel yet stable small-scale biological forms orthogonal to any found in nature. One major advantage of this approach is that living cells already possess numerous sensors, effectors, and signaling/computational circuits. Their native biochemical, biomechanical, and bioelectrical communication and control machinery can be repurposed for novel functionality at the system level and does not have to be directly engineered.",
      "section": "Introduction",
      "topic": "Challenges and opportunities in building robot swarms",
      "chunk_summary": "Building small-scale living machines from biological tissue offers a potential solution to the challenges of creating robot swarms, leveraging the adaptive potential and inherent functionalities of cells.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Classical developmental biology has long focused on uncovering the genes, organizing centers, and signaling cascades that drive specification of cells and tissues from undifferentiated precursors. Historically, this research used in vivo embryonic models to examine the effects of misexpression of early patterning genes on downstream phenotypes, creating morphological and molecular fate maps in their respective native systems. A more recent effort has been directed towards harnessing the information garnered from this classical basic biology to create complex systems from the ground up in vitro. These biological robots allow investigation into diverse topics ranging from the origin of multicellularity, aspects of basal cognition, new approaches to synthetic biology, and the creation of implantable bio-prosthetics.",
      "section": "Introduction",
      "topic": "Developmental biology and in vitro biological robots",
      "chunk_summary": "Classical developmental biology research, combined with recent efforts in creating in vitro biological robots, provides insights into multicellularity, basal cognition, synthetic biology, and bio-prosthetics.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A recognizable example of this methodology are organoids, 3-dimensional in vitro cultured representations of complex tissues and organs that reproduce the physiology of their in vivo counterparts. Indeed, this work has revealed many mechanisms of stem cell differentiation, and has enabled investigators to drive progenitor cells to a wide array of complex tissue types with diverse anatomies including components of the eye, cerebral structures, gut, liver, intestine, mammary gland, kidney, and pancreas among others. Furthermore, recent advances led the to the miniaturization and daisy-chaining of multiple organoid types, leading to body-on-a-chip systems aimed at recapitulating whole-organism nested physiology. The power of this technology enables investigators to model complex multi-organ diseases, understand drug interactions between organ systems, and better represent patient physiology compared to single organoids grown in culture. However, while these techniques further our understanding of many aspects of differentiation and self-assembly, they are designed to replicate existing in vivo systems rather than building novel morphologies. Moreover, they are largely produced by micromanaging (via bio-printing or scaffolds) cellular arrangement, and have yet to truly exploit the remarkable self-assembly and plasticity of cells in vivo. Similarly, they have not yet been explored for the ability to exhibit motility and interaction with changing environments. This important advance would enable the extension of physiological and biomedical studies into the emerging field of basal cognition which seeks to address the origin of computation, decision-making, and adaptive control in diverse body-plans. Developing amenable platforms for addressing this question is as crucial for understanding the evolution of brain-body complexity as they are for providing insight and biological inspiration for robotics and artificial intelligence.",
      "section": "Introduction",
      "topic": "Organoids and their limitations",
      "chunk_summary": "Organoids, while valuable for studying tissue and organ development, are limited by their replication of existing systems and lack of motility, hindering their application in basal cognition research.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Creation of novel biological forms and structures non-existent in nature is the goal of the emerging field of biorobotics. So far, efforts in this field have somewhat coalesced around biohybrid designs, combining synthetic scaffolds or components alongside living cells and tissues. These systems often use muscle actuators to drive rigid artificial body-parts, as in the case of phototaxis guided biohybrid stingray, micro walking and swimming biohybrids propelled by skeletal and cardiac muscle tissue, and macroscale sea turtle like Aplysia biohybrid. This design approach capitalizes on the benefits of traditional robotics; synthetic components can be modeled quickly in simulation, adjusted, and fabricated with a high degree of precision. It also enables the creation of morphologies which would be difficult or impossible to produce with living tissues, including micrometer thin sheets with high rigidity, thin filaments resistant to breaking, and sharp edges. However, these synthetic components also contain the limitations of traditional robotic systems-they are unable to regenerate or self-repair, they do not possess metabolic pathways, and are generally unable undergo extensive remodeling or migration like living cells and tissues.",
      "section": "Introduction",
      "topic": "Biorobotics and biohybrid designs",
      "chunk_summary": "Biorobotics aims to create novel biological forms, with biohybrid designs combining synthetic and living components, offering advantages in precision but limitations in regeneration and self-repair.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Instead of relying on synthetic components that specify the types of function the robot can accomplish, one could take advantage of the plasticity biology has to offer and build designs entirely out of cells and tissues, creating a fully biological machine. By using a combination of epidermal and cardiac muscle tissue, one can create biobots that can crawl through aqueous environments, collect debris in their immediate vicinity, and quickly heal from mechanical lacerations. While less precise in their functionality compared to biohybrids, the biobots are robust to damage and can respond to changes in their environment. These constructs are also completely self-powered, surviving ten days without additional nutrients, and are fully biodegradable, harmlessly breaking down at their end of life.",
      "section": "Introduction",
      "topic": "Fully biological machines",
      "chunk_summary": "Fully biological machines, built entirely from cells and tissues, offer advantages in robustness, self-powering, and biodegradability compared to biohybrids.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The current study expands on these fully biological machines, documenting a bottom up approach to produce synthetic living machines from cells of the frog Xenopus laevis. We hypothesized that when liberated from the rest of the animal, cells would self-organize into a functional morphology that was distinct from their genomically-specified default. We report here that tissue explanted from wild-type frog embryos forms synthetic constructs with fascinating morphology and behavior that are different from that of normal tadpoles. These \\\"Xenobots\\\" generate swimming motion through the beating of multiciliated cells present on their surface (repurposing machinery whose normal function is to distribute mucus and flow pathogens and other material off the skin). As opposed to imposing tissue placement and shape from the top down, the design method presented here uses whole explants from developing frog embryos. While these explants, known as animal caps, have been used for decades to understand the early patterning events of epidermal and neural cell lineages, they have not been examined for behavioral capacity as proto-organisms, or used to create novel living machines with specific functions. Here we report the use of Xenopus animal cells for generating swimming automata capable of locomoting through a variety of environments. In addition to categorizing their lifecycle, behavior, and regenerative capacity, we also document the ability to introduce simple read-write functionality via RNA encoded photoconvertible proteins, serving as a proof of principle that experiences can be encoded as a molecular memory and retrieved at a later time. We use computational modeling to explain their multi-scale behaviors and effects on their environment. These findings demonstrate that novel behaviors can be elicited from biobots, and that they also inherit useful behaviors exhibited by many organisms, such as robustness to damage, and a spontaneous drive to exhibit collective behavior. This may, in future, make coaxing desired collective behaviors from biobot swarms more straightforward than programming equivalent behaviors into swarms of microrobots. Together, these results contribute to a new field at the intersection of synthetic biology and developmental biology and represent a new bottom-up method to produce simple biological machines.",
      "section": "Introduction",
      "topic": "Xenobots: A bottom-up approach to synthetic living machines",
      "chunk_summary": "This study introduces a bottom-up approach to creating Xenobots, utilizing the self-organization of frog cells to generate swimming automata with novel morphologies and behaviors, including the ability to record experiences as molecular memory.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "We here survey the stages of the biological construction process (sects. m1-m8), computational design of simulated biobots to exhibit a representative collective behavior (sect. m9), and analysis of the distinct behaviors exhibited by a physical swarm of biobots performing this behavior (sect. m10). m1: Animal Husbandry. All experiments were conducted using fertilized Xenopus laevis embryos as donor tissue. Wild type embryos were collected 30 minutes post fertilization and reared in 0.1× Marcs Modified Ringer solution (MMR), pH 7.8, at 14° C. prior to microinjection or animal cap dissection. Experimental procedures using animals for experimental purposes were approved by the Institutional Animal Care and Use Committee and Tufts University Department of Laboratory Animal Medicine under protocol number M2020-35.",
      "section": "Methods",
      "topic": "Animal husbandry and ethical approvals",
      "chunk_summary": "Xenopus laevis embryos were used as donor tissue, following ethical guidelines and protocols approved by the Institutional Animal Care and Use Committee.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m2: Explant culture. Xenopus animal cap explants were performed using standard methods. Briefly, fertilized embryos were raised at 14° C. in 0.1×MMR (pH 7.8), until Neiuwkoop and Faber stage 9. The vitelline membrane of each embryo was removed with surgical forceps before being transferred to a 1% agarose lined petri dish containing 0.75×MMR for excision. Surgical forceps were then used to remove a circular mass of tissue from the animal-most region of each blastula embryo, after which the remainder of the embryo was removed from the dish. Each explant was then inverted and allowed to heal for 30 minutes to 1 hour in 0.75×MMR, allowing the tissue to ball up into a spherical mass. After healing, all the explants from each treatment were transferred to new 1% agarose covered dishes containing 10 ml 0.75×MMR and 5 ng/µl gentamicin and cultured at 14° C. until ready for use. Media was replaced three time a week to clean out cellular debris and any possible contamination. For long term growth studies extending beyond the normal 10-day lifespan, explants were raised in Xenopus cell culture media containing 50% Ringer's solution, 49% Leibovitz L-15 Medium, and 1% fetal bovine serum. Explants were placed into individual wells of a 24-well plate lined with 2% agarose and were fed with 1 m1 of culture media and 5 ng/µl gentamicin. Explants were moved to new wells with fresh media three times per week to reduce the likelihood of fungal contamination. In experiments using the K+ inhibitor/Ca2+ activator barium chloride, Xenobots were exposed a 2.0 mM solution in 0.75×MMR beginning 3-4 hours after excision/ healing and kept in the solutions throughout the remainder of the study. All pharmaceuticals were stored as stocks at 4° C. and working solutions were refreshed every three days.",
      "section": "Methods",
      "topic": "Explant culture and media conditions",
      "chunk_summary": "Xenopus animal cap explants were cultured in specific media conditions, with variations for long-term growth studies and barium chloride experiments.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m3: Microinjection. All mRNA was synthesized using standard message machine kits and stored at -80° C. until used. Prior to injection, cohorts of 4 cell stage embryos were transferred to a 3% Ficoll solution and aligned in a laser etched Petri dish. Individual embryos were then injected into each of the 4 cells using a pulled capillary to deliver approximately 500 ng of RNA in a 50 nL volume to each cell. Four cell embryos were chosen for injection over one cell due to the observation that expression tended to be more uniform at the 4-cell stage. Two hours after microinjection the embryos were washed twice in 0.1×MMR (pH 7.8), moved to new Petri dishes, and moved to a 22° C. incubator overnight. The following morning, the embryos were cleaned one final time before processing for animal cap excision. Constructs used in the current study included the multi-ciliated cell inhibitor Notch-ICD and EosFP.",
      "section": "Methods",
      "topic": "Microinjection procedures",
      "chunk_summary": "mRNA microinjection was performed on 4-cell stage embryos using specific constructs, including Notch-ICD and EosFP.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m4: Immunohistochemistry. Multi-ciliated cell number was visualized through immunohistochemistry with the monoclonal anti-acetylated alpha tubulin antibody using a protocol described previously. Cohorts of Xenobots from each treatment were pooled and transferred to a 3 ml scintillation vial containing MEMFA fixative. Fixation proceeded for 2H at room temperature on a nutator, after which the fixative was removed and the Xenobots were washed three times, ten minutes per wash, in phosphate buffered saline+0.1% Tween 20 (PBST) and stored at 4° С. until ready for processing. Processing began by blocking for 1H at room temperature with 10% goat serum in PBST. Samples were then rocked overnight at 4° C. in monoclonal anti-acetylated alpha tubulin antibody diluted 1:1000 in PBST+10% goat serum. Following primary incubation, samples were washed three times for 15 min in PBST before 60 min secondary incubation with AlexaFluor-555 conjugated secondary at 1:500 dilution in PBST. Following secondary incubation, samples were washed three times for 15 min in PBST.",
      "section": "Methods",
      "topic": "Immunohistochemistry protocol",
      "chunk_summary": "Immunohistochemistry was performed using anti-acetylated alpha tubulin antibody to visualize multi-ciliated cells.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m5: Behavioral analysis. Mazes used in behavioral tests were created from acrylic negatives and cast with 2% agarose. Each negative was affixed to the lid of a petri dish with cyanoacrylate-based adhesive and lowered into a dish containing sufficient volume of melted agarose to submerge the maze one half of its total height. Dishes cooled at room temperature for 1 hour before being wrapped and stored at 4° C. until use. For glass capillary experiments, standard capillaries were cut down to a 2 cm length using a diamond knife. Individual Xenobots were then manually loaded into one end of the capillary and observed for 10 minutes on a stereoscope with an attached camera. In cases where movement was observed moving out of the loading area (i.e. the opposite direction of the preferred movement), the individual was rotated 180 degrees and reloaded in the same manner. Trials were considered a success if the individual emerged from the opposite end of the capillary. For particle aggregation and displacement experiments, a stock solution carmine dye was created at a concentration of 0.01 g per 10 ml 0.75×MMR and vortexed for 10 seconds. Individual working solutions were then created in 1% agarose coated polystyrene petri dishes by diluting the stock 1:10, again in 0.75×MMR, for a final concentration of 0.001 g per 10 ml. Dishes containing the working solution were housed under an imaging microscope and allowed to settle for four hours at 22° C., creating a layer of particulate dye on the surface of the dish. Silicone coated iron oxide spheres were prepared in a similar manner, though only one hour of settling was necessary due to the higher density of the material.",
      "section": "Methods",
      "topic": "Behavioral analysis setup",
      "chunk_summary": "Behavioral analysis involved mazes, glass capillaries, and particle aggregation experiments to assess Xenobot movement and interactions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m6: Wound healing. To assess wound healing, individual Xenobots aged 4 to 7 days post-explantation were moved to fresh 1% agarose coated petri dishes containing 0.75×MMR. Surgical forceps were used to create a mechanical laceration spanning approximately one half the diameter of the individual. Images were collected before injury, directly following injury, minutes following injury, and after 48 h of healing. Images were first processed by cropping, downsampling, and binarization. To crop the images, contours were automatically drawn on the image by traversing the boundaries of each transition between body and background pixels to find closed loops (each of which is a contour). A bounding box was then drawn around the largest contour (by area), and the rest of the image is trimmed off. Finally, the cropped images were resized (downsampled) to a constant resolution. These processed images were then assessed by comparing each timepoint to its initial shape using Hausdorff distance. To calculate Hausdorff distance, the image was binarized, with each pixel assigned either 1 (for pixels belonging to the body of the organism) or 0 (the background). The Hausdorff distance is the largest discrepancy between pairs of pre- and post-damage body pixel coordinates, in terms of euclidean distance. Formally, the Hausdorff distance for tissue type 1 is defined as: H = max {sup a∈A inf b∈B d(a, b), sup b∈B inf a∈A d(a, b)}, where A and B are the sets of pre- and post-damage pixels, and d(a, b) is the Euclidean distance between pixels a and b. A small Hausdorff distance indicates that for every pixel prior to damage there is a pixel nearby post-damage, and vice versa. During repair, we measure the amount of shape change toward the pre-damage shape using the statistic Δ = Hpost/Hinjury, which is a ratio of two Hausdorff distances: one taken recovery (numerator) and the other immediately after injury (denominator). Because H is sensitive to rotation, H was calculated 360 times for every post-damage image, each time rotating the image by 1 degree. The rotation with the best match (the smallest H) was selected and plotted. Because H is sensitive to the position of the body within the frame of an image, copies of images were auto-cropped such that the edge of the design fills the frame, and H was recalculated (with 360 rotations). Final Hausdorff distances conformed to normality and were compared using a repeated measures ANOVA, followed by Dunnett's post-hoc comparison of injury values to all proceeding timepoints.",
      "section": "Methods",
      "topic": "Wound healing assessment",
      "chunk_summary": "Wound healing was assessed by measuring changes in shape using Hausdorff distance, comparing pre- and post-injury images.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "m7: Imaging. Xenobot morphology was imaged using a Nikon SMZ-1500 microscope attached to a QImaging Retiga 2000R CCD camera. Live samples were photographed in 0.75×MMR at 22° C. using both overhead and substage illumination in combination with a concavity slide to keep the Xenobots in view. Immunofluorescence was detected using standard filter on an Olympus BX-61 microscope equipped with a Photometrics CoolSNAP DYNO CCD camera and CoolLED PE-300 lightsource. Images were captured as tiff z-stacks and combined into composite images using Metamorph software before being moved to ImageJ for analysis. m8: Motion tracking. Motion tracking of Xenobot behavior was completed by uploading time-lapse videos into Ethovision XT v.14/15. A scaled background image was uploaded prior to data processing to accurately set movement speeds and distance. Tracking was completed using automated settings and the coordinates of each xenobot position across the time lapse was then exported as an .xslv file via analysis tools. Any tracking errors were manually removed (field values left empty) in the .xslv file after the coordinates were exported from Ethovision for statistical analysis.",
      "section": "Methods",
      "topic": "Imaging and motion tracking",
      "chunk_summary": "Xenobot morphology was imaged using microscopes, and motion tracking was performed using Ethovision XT software.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_933407.pdf",
      "original_filename": "pdf_20250803_124126_933407_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:59:14.901739"
}