{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_541624_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_541624.pdf",
    "file_size": 40605,
    "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
    "journal": "Science Robotics",
    "doi": "10.1126/scirobotics.abf1571",
    "year": "2021",
    "title": "A cellular platform for the development of synthetic living machines",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Robot swarms have, to date, been constructed from artificial materials. Motile biological constructs have been created from muscle cells grown on precisely shaped scaffolds. However, the exploitation of emergent self-organization and functional plasticity into a self-directed living machine has remained a major challenge. We report here a method for generation of in vitro biological robots from frog (Xenopus laevis) cells. These xenobots exhibit coordinated locomotion via cilia present on their surface. These cilia arise through normal tissue patterning and do not require complicated construction methods or genomic editing, making production amenable to high-throughput projects. The biological robots arise by cellular self-organization and do not require scaffolds or microprinting; the amphibian cells are highly amenable to surgical, genetic, chemical, and optical stimulation during the self-assembly process. We show that the xenobots can navigate aqueous environments in diverse ways, heal after damage, and show emergent group behaviors. We constructed a computational model to predict useful collective behaviors that can be elicited from a xenobot swarm. In addition, we provide proof of principle for a writable molecular memory using a photoconvertible protein that can record exposure to a specific wavelength of light. Together, these results introduce a platform that can be used to study many aspects of self-assembly, swarm behavior, and synthetic bioengineering, as well as provide versatile, soft-body living machines for numerous practical applications in biomedicine and the environment.",
      "section": "Abstract",
      "topic": "Xenobot creation and capabilities",
      "chunk_summary": "This study introduces xenobots, biological robots created from frog cells, capable of locomotion, self-healing, emergent group behaviors, and molecular memory, offering a platform for studying self-assembly, swarm behavior, and bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Classical developmental biology has long focused on uncovering the genes, organizing centers, and signaling cascades that drive specification of cells and tissues from undifferentiated precursors. Historically, this research used in vivo embryonic models to examine the effects of misexpression of early patterning genes on downstream cell fates. More recently, advances in stem cell biology and tissue engineering have enabled the creation of three-dimensional organotypic cultures, termed organoids, that recapitulate many aspects of in vivo tissue architecture and function. These techniques have enabled investigators to create complex systems from the ground up in vitro. These biological robots allow investigation into diverse topics ranging from the origin of multicellularity, aspects of basal cognition, synthetic morphology, and the creation of implantable bio-prosthetics.",
      "section": "Introduction",
      "topic": "Developmental biology and organoids",
      "chunk_summary": "Classical developmental biology and recent advances in organoid technology have enabled the creation of complex in vitro systems, providing insights into multicellularity, basal cognition, and bio-prosthetics.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "A recognizable example of this methodology is organoids, three-dimensional in vitro cultured representations of complex tissues and organs that reproduce the physiology of their in vivo counterparts. This work has revealed many mechanisms of stem cell differentiation and has enabled investigators to drive progenitor cells to a wide array of complex tissue types with diverse anatomies, including components of the eye, cerebral structures, gut, liver, intestine, mammary gland, kidney, and pancreas among others. Furthermore, recent advances led to the miniaturization and daisy-chaining of multiple organoid types, leading to body-on-a-chip systems aimed at recapitulating whole-organism nested physiology. The power of this technology enables investigators to model complex multiorgan diseases, understand drug interactions between organ systems, and better represent patient physiology compared with single organoids grown in culture. However, although these techniques further our understanding of many aspects of differentiation and self-assembly, they are designed to replicate existing in vivo structures and do not readily lend themselves to the creation of novel arrangements and functionality of cells in vivo. Similarly, they have not yet been explored for the abilities to exhibit motility and to interact with changing environments. These important advances would enable the extension of physiological and biomedical studies into the emerging field of basal cognition, which seeks to address the origin of computation, decision-making, and adaptive control in diverse body plans. Developing amenable platforms for addressing this question is as crucial for understanding the evolution of brain-body complexity as they are for providing insight and biological inspiration for robotics and artificial intelligence.",
      "section": "Introduction",
      "topic": "Organoid limitations and potential",
      "chunk_summary": "While organoids have advanced our understanding of tissue development and disease modeling, they are limited in their ability to create novel cell arrangements, exhibit motility, and interact with changing environments, hindering their application in studying basal cognition.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Creation of alternative biological forms and structures is the goal of the emerging field of biorobotics. So far, efforts in this field have somewhat coalesced around biohybrid designs, combining synthetic scaffolds or components alongside living cells and tissues. These systems often use muscle actuators to drive rigid artificial body parts, as in the case of a phototaxis-guided biohybrid stingray, walking and swimming micro-biohybrids propelled by skeletal and cardiac muscle tissue, and a macroscale sea turtle-like Aplysia biohybrid. This design approach capitalizes on the benefits of traditional robotics; synthetic components can be modeled quickly in simulation, adjusted, and fabricated with a high degree of precision. It also enables the creation of morphologies that would be difficult or impossible to produce with living tissues, including micrometer-thin sheets with high rigidity, thin filaments resistant to breaking, and sharp edges. However, these synthetic components also contain inherent limitations; they are not biodegradable, do not self-repair, and cannot respond to changes in their environment. Recent advances have begun to address some of these limitations by creating fully biological robots that can crawl through aqueous environments, collect debris in their immediate vicinity, quickly heal from mechanical lacerations, and respond to changes in their environment. Robots composed entirely of biological tissue are also completely self-powered, surviving 10 days without additional nutrients, and are fully biodegradable, harmlessly breaking down at their end of life.",
      "section": "Introduction",
      "topic": "Biorobotics and biohybrid designs",
      "chunk_summary": "Biorobotics, focusing on biohybrid designs combining synthetic and biological components, offers advantages in precision and morphology but faces limitations in biodegradability, self-repair, and environmental responsiveness, prompting the development of fully biological robots.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "The current study expands on these fully biological machines, documenting a bottom-up approach to produce synthetic living machines from cells of the frog Xenopus laevis. We hypothesized that when liberated from the rest of the animal, cells could self-organize into a functional morphology that was distinct from their genomically specified default. We report here that tissue explanted from wild-type frog embryos forms synthetic constructs with fascinating morphology and behavior that are different from those of normal tadpoles. These “xenobots” generate swimming motion through the beating of multiciliated cells present on their surface (repurposed machinery whose normal function is to distribute mucus and flow pathogens and other material off the skin). As opposed to imposing tissue placement and shape from the top down, the design method presented here uses whole explants from developing frog embryos. Although these explants, known as animal caps, have been used for decades to understand the early patterning events of epidermal and neural cell lineages, they have not been examined for behavioral capacity as proto-organisms or used to create living machines with specific functions.",
      "section": "Introduction",
      "topic": "Xenobot development and motility",
      "chunk_summary": "This study utilizes a bottom-up approach to create xenobots from frog embryo explants, which self-organize into motile constructs distinct from normal tadpoles, utilizing repurposed multiciliated cells for locomotion.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Here, we report the use of Xenopus animal cells for generating swimming automata that are capable of locomoting through a variety of environments. In addition to categorizing their life cycle, behavior, and regenerative capacity, we also document the ability to introduce simple read-write functionality via RNA-encoded photoconvertible proteins, serving as a proof of principle that experiences can be encoded as a molecular memory and retrieved at a later time. We use computational modeling to explain their multiscale behaviors and effects on their environment. These findings demonstrate that diverse behaviors can be elicited from living machines. Such constructs exhibit characteristic emergent multicellular morphologies, with useful behaviors exhibited by many organisms, such as robustness to damage, exploratory motile behavior, and a spontaneous drive to exhibit collective behavior. This may, in the future, make coaxing desired collective behaviors from xenobot swarms more straightforward than programming equivalent behaviors into swarms of microrobots. Together, these results contribute to an emerging field at the intersection of synthetic biology and developmental biology and represent a highly tractable method to produce simple biological machines.",
      "section": "Introduction",
      "topic": "Xenobot capabilities and future applications",
      "chunk_summary": "Xenobots exhibit diverse behaviors, including locomotion, molecular memory, and collective behavior, offering a tractable method for studying synthetic biology and developmental biology, with potential applications in robotics and biomedicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Previous reports used a top-down approach to impose shape, cell type, and contractile motion on a first generation of mobile living machines. In contrast, the current study used a bottom-up approach to ask whether cells removed from their normal developmental constraints would be able to self-organize into a different type of living form. Production began by harvesting stem cell tissue from the animal hemisphere, a region of undifferentiated presumptive ectoderm, from Neiuwkoop and Faber stage 9 X. laevis embryos. Tissue explants were then moved to a 0.75× Marc's modified Ringer's (MMR) solution (pH 7.8), allowed to heal for 1 hour at 20°C, and cultured at 14°C until experimentation began. Under these conditions, explants formed into spheres of tissue composed of 3026 ± 180 cells that differentiated over the course of 4 days into ciliated epithelium. Three days after formation, explants became mobile in aqueous solutions and capable of moving at rates exceeding 100 µm/s. Fully differentiated spheres ranged in size from an average of 487 ± 39 µm for the smallest cut explants to 602 ± 30 µm for the largest (n = 15 and 13, respectively).",
      "section": "Results",
      "topic": "Xenobot creation and initial motility",
      "chunk_summary": "Xenobots were created using a bottom-up approach by harvesting stem cell tissue from frog embryos, which self-organized into ciliated spheres capable of locomotion in aqueous solutions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "We observed motile behavior because the cells' native cilia, which normally move material past the animal surface, were repurposed for locomotion. Movement was driven by flow arising from multiciliated cells present on the surface of the construct (which are revealed by anti-acetylated tubulin immunohistochemistry). Further, this motion could be abolished by inhibiting multiciliated cell formation through overexpression of the Notch receptor intracellular domain (NotchICD), which drives the differentiating tissue to other epidermal cell fates. Multiciliated cells were also naturally present on the skin of the frog and likewise responded to the overexpression of NotchICD, although explants displayed a higher multiciliated cell density per area than age-matched tadpoles.",
      "section": "Results",
      "topic": "Cilia-driven locomotion",
      "chunk_summary": "Xenobot locomotion is driven by repurposed multiciliated cells, and inhibiting these cells through NotchICD overexpression abolishes movement, highlighting the role of cilia in their motility.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "The degree of behavioral complexity we observed is normally associated with a nervous system. Although made entirely of skin, we sought to confirm whether there might be any neurons in the xenobots. Using a pan-neuronal marker in immunohistochemistry, we showed that no neurons were present at the surface or internally in any of the individuals imaged (n = 24), indicating that their behavior is driven entirely by the signaling and functional dynamics of non-neural cells. The xenobots are thus a synthetic model for understanding preneural life forms and their capacities.",
      "section": "Results",
      "topic": "Absence of neurons",
      "chunk_summary": "Immunohistochemistry confirmed the absence of neurons in xenobots, indicating that their complex behavior is driven by non-neural cell signaling and dynamics, offering a model for studying preneural life forms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Explants have a life span of about 9 to 10 days after formation and do not require an external food source because they metabolize the maternally loaded yolk platelets present in all early embryonic Xenopus tissues. Although their spontaneous disintegration is a welcome safety feature for deploying xenobots, we sought methods to extend their working capacity by taking advantage of the cells' metabolic machinery. We found that their life span can be extended for timeframes exceeding 90 days if raised in a Xenopus-specific culture media. This ability to control their life span also availed us of the opportunity to characterize their unique “developmental sequence,” because their morphology is not like that of normal Xenopus embryos. We found that their pigmentation lightens with age, although their average velocity does not vary significantly across explant life span, and they eventually acquire a balloon-like, extended spheroid morphology. Doubling the size of xenobots significantly reduced their average velocity, likely due to a decreased surface-to-volume ratio. At the end of their life span, explants began shedding cells and deteriorated until the multiciliated cells no longer functioned and the tissue disintegrated. Together, these results demonstrate that embryonic explants from genomically normal Xenopus cells form motile living machines with distinct morphologies that are capable of aqueous locomotion via cilia.",
      "section": "Results",
      "topic": "Xenobot lifespan and morphology",
      "chunk_summary": "Xenobots have a lifespan of 9-10 days, extendable to 90 days with specific media, exhibiting unique morphological changes with age, including lightening pigmentation and a shift towards a balloon-like shape, while maintaining consistent velocity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Xenobot locomotion is provided via cilia actuators that produce polarized fluid flow, thus enabling the diverse behaviors observed as xenobots traverse their aqueous environment. We examined both cell-level and tissue-wide cilia polarization to begin to understand the structural aspects that guide xenobot motion. At the single-cell level, more than 100 individual cilia are present along the apical cell surface, which must coordinate to generate directional fluid movement. Within-cell polarity was visualized using fusion proteins that label separate components of the cilium machinery: CLAMP-green fluorescent protein (GFP), which identifies the rootlet, and centrin-red fluorescent protein (RFP), a marker for the basal body. Fluorescent microscopy of these two proteins demonstrated that individual cilia within a single multiciliated cell are highly aligned, an observation that matches previous reports of cilia polarity in Xenopus tadpole epidermis, the base construction material for an individual xenobot.",
      "section": "Results",
      "topic": "Cilia alignment and fluid flow",
      "chunk_summary": "Xenobot locomotion relies on polarized fluid flow generated by coordinated cilia actuators, with individual cilia within multiciliated cells exhibiting high alignment, consistent with Xenopus tadpole epidermis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Tissue-wide cilia flow must be measured across the entire spheroid as it moves through an aqueous environment, necessitating a larger-scale visualization approach. To examine how groups of multiciliated cells generate sufficient flow to move a xenobot, individuals were placed in an aqueous environment containing carmine dye particles. The flow generated by the xenobot was then measured and quantified through particle image velocimetry (PIV), a technique that produces displacement vectors based on particulate movement across an observation period. Xenobots with linear movement trajectories demonstrated bilateral flow across opposing lateral surfaces, whereas those that were idle or rotating along their central axis showed circular and/or disorganized flow patterns.",
      "section": "Results",
      "topic": "Tissue-wide cilia flow and PIV analysis",
      "chunk_summary": "Particle image velocimetry (PIV) analysis revealed that xenobots generate tissue-wide cilia flow, with linear movement exhibiting bilateral flow and idle/rotating xenobots showing circular/disorganized flow patterns.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "To quantitatively profile the different motile behaviors of xenobots, we analyzed 12 hours of xenobot movement recordings (n = 8 individuals, 345,592 unique positions) using a cross-entropy clustering algorithm that classified 30-s observation blocks into four discrete behavioral states: (i) linear/wide arcing movement, (ii) circular movement, (iii) an intermediate class between (i) and (ii), and (iv) inactive. These data were used to construct a state transition diagram, which indicates the probability with which a xenobot is likely to transition from one behavioral state to another. Idle and circling individuals overwhelmingly maintain their current behaviors (<5% chance to change movement states), whereas those moving linearly are more likely to change to another type of motion. This is not unexpected because linear motion cannot continue indefinitely-eventually, any xenobot reaches the edge of the arena where it must stop or turn. Together, these results indicate that individual xenobots display discrete movement patterns resulting from cilia alignment established early in their development. This behavioral characterization forms a baseline of spontaneous exploratory behavior upon which synthetic control circuitry can be imposed in future work.",
      "section": "Results",
      "topic": "Xenobot movement classification and state transitions",
      "chunk_summary": "Analysis of xenobot movement recordings identified four distinct behavioral states, with idle and circling xenobots maintaining their state while linear movers transition more frequently, providing a baseline for future synthetic control circuitry development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "A desired feature in biological and artificial machines is a robust ability to deal with unexpected damage arising from both normal wear and tear and external environmental insult. To examine the repair ability of xenobots, 5-day-old individuals were given severe mechanical lacerations with surgical forceps. Lacerations were performed with a single incision, opening a wound across about half of the diameter of the individual and spanning the entire width. Images were collected before damage; directly proceeding damage; 5, 10, and 15 min after damage; and 48 hours after injury. In all cases, individuals were capable of resolving the wound, closing the injury site, and reestablishing a spherical shape. Repair appeared to occur quickly, with most of the laceration closing within the first 5 min of observation. After insult, each xenobot was reared individually for an additional 48 hours to determine long-term survival. In no cases was mortality observed; all individuals (n = 15) persisted for the remainder of the experiment.",
      "section": "Results",
      "topic": "Xenobot self-repair",
      "chunk_summary": "Xenobots demonstrated robust self-repair capabilities, healing from severe mechanical lacerations within minutes and surviving for 48 hours post-injury without mortality.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "To quantify the degree to which the postrepair shape matched that of the individual before injury, the geometry of an injured xenobot was compared with its initial shape using Hausdorff distances-a calculation of the degree to which two metric spaces differ. Images were first binarized using edge detection software and then run through a Hausdorff distance software, comparing preinjury shapes to each of the subsequent images. Analysis revealed that all repair time points showed significant improvement compared with initial injury (repeated-measures ANOVA, P < 0.0001), with values remaining flat after the initial 5-min time point. A slight nonsignificant increase can be noted after 48 hours of repair; however, this is likely due to further aging and development (thus further changing xenobot shape compared with the preinjury time point) rather than a regression in repair. Together, these data demonstrate that xenobots have a robust ability to self-repair after injury and that, unlike Xenopus tadpoles that repair deformations back to a normal frog-like anatomy, they repair to their characteristic xenobot morphology, not to a frog embryo-specific shape.",
      "section": "Results",
      "topic": "Quantifying self-repair",
      "chunk_summary": "Hausdorff distance analysis quantified xenobot self-repair, showing significant improvement in shape matching pre-injury within 5 minutes, with slight changes after 48 hours attributed to aging rather than repair regression.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "In addition to exploring an aqueous environment, a valuable capability of a living machine would be the ability to store and recall experiences across the organism's life span. To develop a proof of principle for a generalizable read/write function in xenobots, mRNA encoding the fluorescent reporter EosFP was injected into each of four cells of a stage 3 embryo, before tissue excision. When expressed, this reporter emits strong green fluorescence, which is stable over the course of a xenobot life span. However, when exposed to 390-nm blue light, the backbone of the chromophore undergoes a permanent conformational change, shifting the emission wavelength to red. This switch serves as a “write” function of optical experience that can be “read” later by an observer through fluorescent detection. After expressing this construct in xenobots through mRNA microinjection, fluorescence was observed in the green channel but not the red channel before blue light exposure. Upon increasing duration exposure to 400-nm light, fluorescence in the green channel decreased, whereas that in the red channel increased, with total photoconversion occurring within 2 min. This red signal remained stable over the life span remaining of the xenobot, although green emission did reappear over time due to additional protein translation from the mRNA after the photoconversion period.",
      "section": "Results",
      "topic": "Molecular memory using EosFP",
      "chunk_summary": "Xenobots were engineered with a molecular memory function using the photoconvertible reporter EosFP, allowing recording of light exposure by shifting fluorescence from green to red upon exposure to blue light.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "To test the ability of individual xenobots to navigate varied environments, we constructed arenas of decreasing dimension ranging from completely open fields to restricted capillaries with a 580-nm inner diameter. In all cases, the xenobots were capable of locomoting through the space, although some individuals became challenged in narrow passages. In an open arena containing a debris field of variously sized carmine particles, movement was similar",
      "section": "Results",
      "topic": "Navigation in varied environments",
      "chunk_summary": "Xenobots successfully navigated diverse environments, from open fields to narrow capillaries, demonstrating their adaptability to different spatial constraints.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Here, we documented the creation of xenobots, synthetic living machines derived from amphibian embryonic explants, and their ability to spontaneously exhibit collective behavior. We also outline the potential to design such swarms in the future to exaggerate these behaviors. Compared with our previously reported design method [which produced contractile-driven motion through top-down implementation of shape and tissue placement], the xenobots reported here exhibit bottom-up emergent behaviors and generate movement through multiciliated cell propulsion. These swimming xenobots survive for up to 10 days in mild saline solution without additional energy sources and for multiple months if supplemented with cell culture medium. Movement first appeared 4 days after construction, and average velocity remained constant across the life span of the xenobot cohorts. Further, motion could be inhibited through the overexpression of NotchICD, which inhibits multiciliated cell development by driving precursors to other epidermal lineages. Together, this design method allows for the rapid generation of many mobile constructs with minimum top-down design from the investigator.",
      "section": "Discussion",
      "topic": "Xenobot creation and motility",
      "chunk_summary": "This study presents a bottom-up approach to creating xenobots, utilizing multiciliated cell propulsion for movement, with a lifespan of up to 10 days or months with supplementation, and minimal top-down design requirements.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Xenobot speed and behavior remained constant across their 10-day life span, pointing to their potential for maintaining desired swarm behavior. Movement tended toward circular rotation, although arcing and linear motion were also observed less frequently. An interesting future area of study would include the enhancement of planar cell polarity patterning, enforcing specific tissue-scale cilia alignment to drive user-specified motion types. Further, given their ability to self-locomote, xenobots can move through a variety of diverse environments from open fields to narrow capillaries. These features suggest several possible downstream applications that are difficult for traditional robots, from cleaning microfluidic chambers to environmental sensing and ecologically benign remediation in natural waterways.",
      "section": "Discussion",
      "topic": "Xenobot behavior and potential applications",
      "chunk_summary": "Xenobots maintain consistent speed and behavior, with potential for controlled swarm behavior through enhanced cilia alignment, and offer applications in microfluidics, environmental sensing, and bioremediation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "The ability to program rudimentary sensing and memory into xenobots was also demonstrated. Because xenobots can explore an aqueous environment, we designed a proof-of-principle system where an individual can record exposure to an environmental stimulus that can be read at a later time by an observer, using the photoconvertible reporter EosFP. After expressing the protein in xenobots through mRNA microinjection, individuals emitted strong fluorescence in green wavelengths. However, after exposure to 400-nm blue light, the reporter undergoes a permanent conformational change, shifting emission wavelengths from green to red. Using this feature, we were able to show that unsupervised xenobots could explore an environment containing an illuminated blue spot, and exposure to this light could subsequently be assessed using fluorescent microscopy. The general methodology of the approach could be readily adapted to a wide variety of scenarios, including increased/decreased sensitivity to stimuli, chemical/contaminant detection, bioaccumulation of target substances, release of compounds upon sensation of stimuli, multimodal recording, and nested if/then circuitry.",
      "section": "Discussion",
      "topic": "Sensing and memory capabilities",
      "chunk_summary": "The photoconvertible reporter EosFP enables rudimentary sensing and memory in xenobots, allowing recording and retrieval of environmental stimuli exposure, with potential for adaptation to various sensing scenarios.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Unlike current robots, in which robustness must be programmed, xenobots exhibit automatic self-repair after injury. When presented with lacerations, all individuals were able to heal the wound within 15 min, and in no cases did an individual perish as a result of the injury. Tadpoles also rapidly resolve injuries resulting from mechanical damage or transplantation, revealing that, like ciliary motion, emergent capabilities of cell groups can be deployed in different ways on very different body architectures. Further, contraction at the wound site is sufficient to close minor injuries, but the mechanism behind large-scale damage repair is unknown. The ability to self-repair remains an important feature of soft-bodied robots that is difficult to achieve using synthetic materials but emerges naturally from the biology of our constructs.",
      "section": "Discussion",
      "topic": "Self-repair capabilities",
      "chunk_summary": "Xenobots exhibit inherent self-repair capabilities, healing from lacerations within 15 minutes without mortality, highlighting the natural emergence of this feature in biological constructs compared to synthetic robots.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Although current xenobots do not contain specialized sense organs, they display many behaviors comparable to those observed in highly sensorized robots, including the aggregation of environmental debris. We found that xenobots can move through and push small amounts of debris, clearing regions of the arena while depositing piles of material elsewhere. To test whether this behavior could result purely from the physics of sensor-less locomoting bodies, we developed a GPU-based physics engine that could handle the computational demands of many interacting bodies. We developed a GPU-based physics engine that could handle the computational demands of many interacting",
      "section": "Discussion",
      "topic": "Debris aggregation and computational modeling",
      "chunk_summary": "Xenobots exhibit debris aggregation behavior similar to sensorized robots, prompting the development of a GPU-based physics engine to model the physics of sensor-less locomoting bodies and their interactions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "that collective function when physical copies of the best designs are constructed and deployed. This seems achievable, because sim2real transference was obtained with xenobots previously, for desired individual behavior.",
      "section": "Discussion",
      "topic": "Sim2real transference",
      "chunk_summary": "The feasibility of sim2real transference for desired collective behavior in xenobots is supported by previous success in achieving individual behavior transfer.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Last, fully biological robots differ from both robot swarms and modular robots in that they exhibit collective behavior and modularity on at least four scales. There is the xenobot swarm itself, but each individual xenobot is composed of thousands of cells, each of which is itself a complex and semiautonomous machine. Last, the intricate internal architecture of a cell houses myriad self-motile machines that build and maintain cellular integrity and function. Such multiscale structure poses unique future challenges and opportunities for altering collective function at each and all of these scales.",
      "section": "Discussion",
      "topic": "Multiscale modularity",
      "chunk_summary": "Fully biological robots, like xenobots, exhibit multiscale modularity, from the swarm level down to intracellular machinery, presenting unique challenges and opportunities for manipulating collective function at different scales.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Together, these in vitro and in silico results provide a pipeline to move between the physical and the virtual world, where results in one environment can inform the other. For example, modeling may allow rapid testing of many parameters that would be impossible biologically because of the time and effort involved. Alternatively, biological experiments can provide baselines and constraints to existing models, refining them with values that are translatable to real-world scenarios for a range of downstream applications.",
      "section": "Discussion",
      "topic": "In vitro and in silico synergy",
      "chunk_summary": "The combination of in vitro and in silico approaches provides a synergistic pipeline for studying xenobots, allowing rapid parameter testing through modeling and refining models with biological data for real-world applications.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "The computational modeling of unexpected, emergent properties at multiple scales and the apparent plasticity of cells with wild-type genomes to cooperate toward the construction of various functional body architectures offer a very potent synergy. Future work to better predict and control of the structure and function of synthetic living machines could be influential to several fields. Basic evolutionary developmental biology and basal cognition can use this model to understand self-assembly of body forms and functional controllers. Moreover, existing toolkits of synthetic biology, bioelectrical signaling, and computation via cell networks offer an extremely rich space of possible living machines with useful functions including biomedicine, environmental remediation, and exploration.",
      "section": "Discussion",
      "topic": "Future directions and applications",
      "chunk_summary": "Future research on predicting and controlling synthetic living machines, leveraging computational modeling and cellular plasticity, holds potential for advancing evolutionary developmental biology, basal cognition, biomedicine, environmental remediation, and exploration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "We here survey the stages of the biological construction process, computational design of simulated xenobots to exhibit a representative collective behavior, and analysis of the distinct behaviors exhibited by a swarm of xenobots performing this behavior.",
      "section": "Materials and Methods",
      "topic": "Overview of methods",
      "chunk_summary": "This section outlines the methods used for constructing xenobots, computationally designing simulated xenobots for collective behavior, and analyzing the distinct behaviors exhibited by xenobot swarms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "All experiments were conducted using fertilized X. laevis embryos as donor tissue. Wild-type embryos were collected 30 min after fertilization and reared in 0.1× MMR solution (pH 7.8) at 14°C before microinjection or animal cap dissection. Experimental procedures using animals for experimental purposes were approved by the Institutional Animal Care and Use Committee and Tufts University Department of Laboratory Animal Medicine under protocol number M2020-35.",
      "section": "Materials and Methods",
      "topic": "Animal husbandry",
      "chunk_summary": "Fertilized X. laevis embryos were used as donor tissue, reared in MMR solution at 14°C before microinjection or dissection, with ethical approval obtained for animal procedures.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "Xenopus animal cap explants were performed using standard methods. Briefly, fertilized embryos were raised at 14°C in 0.1× MMR (pH 7.8), until Neiuwkoop and Faber stage 9. The vitelline membrane of each embryo was removed with surgical forceps before being transferred to a 1% agarose-lined petri dish containing 0.75× MMR for excision. Surgical forceps were then used to remove a circular mass of tissue from the animal-most region of each blastula embryo, after which the remainder of the embryo was removed from the dish. Each explant was then inverted and allowed to heal for 30 min to 1 hour in 0.75× MMR, allowing the tissue to ball up into a spherical mass. After healing, all the explants from each treatment were transferred to fresh 1% agarose-covered dishes containing 10 ml of 0.75× MMR and gentamicin (5 ng/µl) and cultured at 14°C until ready for use. Media was replaced three times a week to clean out cellular debris and any possible contamination.",
      "section": "Materials and Methods",
      "topic": "Explant culture",
      "chunk_summary": "Xenopus animal cap explants were cultured in MMR solution, excised using surgical forceps, allowed to heal, and then transferred to agarose-covered dishes with MMR and gentamicin for further culturing at 14°C.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    },
    {
      "text": "In experiments using the K+ inhibitor/Ca2+ activator barium chloride, xenobots were exposed to a 2.0 mM solution in 0.75× MMR beginning 3 to 4 hours after excision/healing and kept in the solutions throughout the remainder of the study. All pharmaceuticals were stored as stocks at 4°C, and working solutions were refreshed every 3 days.",
      "section": "Materials and Methods",
      "topic": "Barium chloride treatment",
      "chunk_summary": "Xenobots were exposed to a 2.0 mM barium chloride solution in MMR for experiments involving K+ inhibition and Ca2+ activation, with solutions refreshed every 3 days.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_541624.pdf",
      "original_filename": "pdf_20250803_124126_541624_extracted_text.txt",
      "authors": "[\"Douglas Blackiston\", \"Emma Lederer\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Science Robotics",
      "doi": "10.1126/scirobotics.abf1571"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:12:21.931037"
}