{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_655011_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_655011.pdf",
    "file_size": 216880,
    "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
    "journal": "J Clin Exp Oncol",
    "doi": "10.4172/2324-9110.S1.002",
    "year": "2013",
    "title": "Endogenous Voltage Potentials and the Microenvironment: Bioelectric Signals that Reveal, Induce and Normalize Cancer",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Cancer may be a disease of geometry: a misregulation of the field of information that orchestrates individual cells' activities towards normal anatomy. Recent work identified molecular mechanisms underlying a novel system of developmental control: bioelectric gradients. Endogenous spatio-temporal differences in resting potential of non-neural cells provide instructive cues for cell regulation and complex patterning during embryogenesis and regeneration. It is now appreciated that these cues are an important layer of the dysregulation of cell: cell interactions that leads to cancer. Abnormal depolarization of resting potential (Vmem) is a convenient marker for neoplasia and activates a metastatic phenotype in genetically-normal cells in vivo. Moreover, oncogene expression depolarizes cells that form tumor-like structures, but is unable to form tumors if this depolarization is artificially prevented by misexpression of hyperpolarizing ion channels. Vmem triggers metastatic behaviors at considerable distance, mediated by transcriptional and epigenetic effects of electrically-modulated flows of serotonin and butyrate. While in vivo data on voltages in carcinogenesis comes mainly from the amphibian model, unbiased genetic screens and network profiling in rodents and human tissues reveal several ion channel proteins as bona fide oncogene and promising targets for cancer drug development. However, we propose that a focus on specific channel genes is just the tip of the iceberg. Bioelectric state is determined by post-translational gating of ion channels, not only from genetically-specified complements of ion translocators. A better model is a statistical dynamics view of spatial Vmem gradients. Cancer may not originate at the single cell level, since gap junctional coupling results in multi-cellular physiological networks with multiple stable attractors in bioelectrical state space. New medical applications await a detailed understanding of the mechanisms by which organ target morphology stored in real-time patterns of ion flows is perceived or mis-perceived by cells. Mastery of somatic voltage gradients will lead to cancer normalization or rebooting strategies, such as those that occur in regenerating and embryonic organs, resulting in transformative advances in basic biology and oncology.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in cancer",
      "chunk_summary": "Bioelectric gradients, particularly Vmem, play a crucial role in cancer development and metastasis, offering potential for new diagnostic and therapeutic approaches.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Ideas in cancer biology comprise two complementary paradigms. The mainstream view is that cancer cells are irreversibly damaged: they have accumulated genetic or epigenetic damage and are fundamentally a different kind of cell. On this view (the somatic mutation model), cancer cells have acquired cell-autonomous properties that underlie unlimited proliferation and metastasis. Contrasting with this view is the idea that cells exhibit neoplastic behavior and form tumors due to a change of interactions with their environment. This view of cancer is focused on context-non-cell-autonomous signaling that activates cellular misbehavior in the host. The latter class of models ranges from simple growth suppressive molecules (morphostats) secreted by healthy tissue and averaging effects of cell neighbors that stabilize stochastic gene expression to suppression of tumorigenesis by tissue-level organization to global models of whole-body morphogenetic information fields. While the mutation-centered paradigm has dominated work in this field for decades, increased attention is now focused on cancer as a progressive loss of the organization capacity of the environment over the heterogeneous behavior of isolated cells. Interestingly, “no cancer exhibits any trait which cannot be found in some normal tissue as the expression of normal genomic activity; no cancer grows faster than an embryo nor is any cancer cell more invasive than a macrophage nor are cancer cell lines more immortal than are germ lines. The only distinction is that, in the cancer, the expression or lack of expression of many traits may be inappropriate for the tissue in which the cancer occurs.\" This is a view of cancer as fundamentally a developmental disorder of cell regulation.",
      "section": "Introduction",
      "topic": "Cancer paradigms",
      "chunk_summary": "Two contrasting paradigms exist in cancer biology: the somatic mutation model focusing on cell-autonomous properties and the contextual view emphasizing environmental interactions and loss of organization.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Large-scale shape, or the correct geometric arrangement of organs and tissues in an organism, is a key concept in biological growth and development. To achieve optimal health, organisms strive to maintain shape at all levels, from the single cell to the whole organism. Cancer can be seen as an error of geometry, because tumor cells grow, migrate, and function without regard for the orderly structure within which they occur. This is seen most acutely in teratomas - embryonic tumors that display extensive differentiation of a number of tissues combined with a complete absence of orderly organization of the whole. The idea that cancer is a developmental disease is an old one. Needham and Waddington speculated that cancers represented an escape from the control of the morphogenetic field. On this view, tumors form when cells stop obeying the normal patterning cues of the body: \"cancer as part of an inexorable process in which the organism falls behind in its ceaseless effort to maintain order\".",
      "section": "Introduction",
      "topic": "Cancer as a developmental disorder",
      "chunk_summary": "Cancer can be viewed as an error of geometry, a developmental disorder where cells disregard normal patterning cues and morphogenetic field control.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Understanding cancer as a reversible physiological state of a multi-cellular dynamical system (as opposed to damage within single cancer stem cells) has significant medical implications because it suggests specific prevention and detection strategies focused on modulating the physiological interrelationships among many cells instead of looking for DNA markers in single cancer stem cells. A mechanistic dissection of these pathways may give rise to strategies that reboot or normalize cancer, in contrast to current approaches that all seek to kill tumors and thus risk a compensatory proliferation response by rogue cells that still remain. Thus, biologists are beginning to explore the idea that cancer is not a genetic disease of specific loci but rather a kind of attractor in a multi-dimensional transcriptional space describing cell states: “The topology of the attractor is the 'invisible hand' driving the system functions into coherent behavioral states: they are self-organizing structures and can capture the gene expression profiles associated with cell fates.\" Huang et al. also point out an interesting paradox: while many studies seek to \"determine which gene is mutated to explain an incremental malignant trait, no one doubts that normal cells as distinct as a mature neuron vs. a blood or epithelial stem cell share the exact same genome! No mutations are invoked to explain the remarkable phenotypes during cell lineages in development\", and indeed aneuploidy is routinely present in normal brain, testes, and liver, but does not usually result in cancer.",
      "section": "Introduction",
      "topic": "Cancer as a systems-level property",
      "chunk_summary": "Cancer can be understood as a reversible physiological state of a multi-cellular system, a dynamic attractor in transcriptional space, rather than solely a genetic disease.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "A complete picture of cancer no doubt involves both an understanding of DNA damage and cell signaling dynamics, although considerable controversy exists as to the most appropriate level of organization at which to search for the origin and cure of cancer (ranging from genes, to stem cells, to tissues, to entire body plan organizing fields). Here we focus on bioelectrical information-exchanging processes occurring within and among cell groups in the suppression and progression of cancer, followed by an in-depth discussion of the importance of context and cell: cell signaling to the cancer problem in general. Our hypothesis is that while ion channels are increasingly revealed as important oncogenes, a focus on specific channel genes is just the tip of the iceberg because bioelectric cell states result from post-translational gating of ion channels and pumps, not only from genetically-specified complements of ion translocators. A more fruitful model of cancer and its reprogramming may be a statistical dynamics view of spatial gradients of resting potential as a systems-level property of multi-cellular physiological networks of cells linked by gap junctions.",
      "section": "Introduction",
      "topic": "Bioelectricity and cancer",
      "chunk_summary": "Bioelectrical signaling, particularly the post-translational gating of ion channels and pumps, plays a crucial, often overlooked, role in cancer development and progression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "It has long been known that bioelectrical signals, or spatio-temporally patterned ion flows in non-excitable cells, are important determinants of cell behavior. Steady-state endogenous ion currents, resting potentials (voltage gradients), and electric fields are produced by the activity of ion channel and pump proteins across cell membranes and their slow dynamics are distinct from the rapid action potentials of nerve and muscle. While related biophysical phenomena include transepithelial electric fields, ultraweak photon emission, and coherent AC electromagnetic fields, here we focus on distributions of Vmem or membrane potential. The many interesting studies of applied field effects are discussed in several excellent recent reviews. Bioelectric properties of cells and the electrical states of cells in the microenvironment are known to control several key behaviors of relevance to cancer. For example, electric fields generated by ion pumping across epithelia serve as migration cues for cellular galvanotaxis - an important guidance modality for cell movement within the host. Cell shape changes, such as increased arborization, are also driven by endogenous electric fields and changes in Vmem. Together, migration and shape properties are key elements of successful metastasis.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Voltage gradients and cell behavior",
      "chunk_summary": "Bioelectrical signals, including resting potentials and electric fields, influence cell behavior, particularly migration and shape changes relevant to metastasis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Moreover, resting potential established by ion channel and pump proteins is important for determination of differentiation state and proliferation; generally, a depolarized state is indicative of plastic, undifferentiated cells (e.g., stem cells), while differentiation is caused by increase of negative Vmem. Functional control of cell state by changes in Vmem has been observed in many kinds of stem and progenitor cells, including adult human mesenchymal stem cell which can be kept stem-like despite the presence of chemical differentiation factors by forced depolarization, and in induced pluripotentent stem cells. Even mature CNS neurons can be made to re-enter mitosis by sustained depolarization revealing the power of transmembrane potential to regulate proliferative potential in adult somatic cells. Importantly, the molecular mechanisms by which cell-autonomous and non-autonomous bioelectric events control downstream processes are now beginning to be fleshed out. Electric fields are transduced to cell migration machinery via Ca2+-dependent mechanisms. A cell with a negative membrane potential, when exposed to an electric field, becomes more hyperpolarized near the anode, allowing the passive inflow of Ca2+ through voltage-gated calcium channels. An increase in Ca2+ in the anodal side of the membrane results in increased polymerization/depolymerization of actin, contraction of actomyosin, and decreased adhesion; collectively, the anodal side contracts and is propelled towards the cathode. Inositol-phospholipid signaling, PI(3)Κγ, and cdc42/rho have been especially implicated in setting the directionality of cytoskeleton-mediated migration polarity in several cell types.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Vmem and cell differentiation/proliferation",
      "chunk_summary": "Resting potential (Vmem) plays a key role in cell differentiation and proliferation, with depolarization associated with undifferentiated states and hyperpolarization with differentiation, and its influence is mediated by Ca2+-dependent mechanisms and inositol-phospholipid signaling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Changes in Vmem of cells, such as cancer-associated depolarization, can trigger transcriptional changes by 1) regulating the movement of morphogens such as serotonin, calcium, and inositol triphosphate through gap junctions, 2) controlling the import/export of small signaling molecules such as serotonin and butyrate across membrane exchangers, and 3) modulating the activity level of phosphatases such as PTEN. Together, these transduction mechanisms convert an essentially biophysical state change into secondary messenger events that impact on transcriptional and epigenetic regulation of loci such as NODAL which are important for the cancer phenotype. While bioelectric cues feed into the same molecular-genetic pathways that are known to regulate normal and neoplastic cell behaviors, they form a pathway that functions alongside biochemical gradients, but with significantly different spatial dynamics, to coordinate normal tissue morphology.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Vmem and transcriptional changes",
      "chunk_summary": "Changes in Vmem, like cancer-associated depolarization, trigger transcriptional changes by regulating morphogen movement, controlling signaling molecule transport, and modulating phosphatase activity, ultimately impacting cancer-related genes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Disruption of the electrical gradients, or the mechanisms by which they are perceived by cells, are one way that complex anatomical order is subverted during carcinogenesis. Recent development of state-of-the-art tools for the detection and experimental manipulation of biophysical signals in multicellular patterning contexts has revealed how distributions of voltage gradients mediate positional information, organ identity of large cell groups, and initiation signals for complex developmental modules such as tail or limb regeneration. Using a combination of fluorescent voltage-reporter dyes to characterize spatial Vmem distributions and functional studies using targeted misexpression of a panel of well-characterized ion transporters to specifically modify those gradients in vivo, instructive signaling roles of transmembrane voltage gradients have been identified in embryogenesis and regeneration, adding to the list of such roles identified in earlier work using functional physiology.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Vmem gradients and patterning",
      "chunk_summary": "Disruption of bioelectric gradients contributes to cancer development, while experimental manipulation of these gradients reveals their role in positional information, organ identity, and regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "During early frog development, the redistribution of maternal potassium channels and proton pumps in early blastomeres results in a Vmem difference across gap junction-coupled cells. The resulting voltage gradient redistributes pre-nervous serotonin to the right side, which then interacts with a cytoplasmic receptor that binds histone deacetylase and shuts off Nodal expression on the right side of the embryo. Later, during craniofacial patterning, the position of the eyes and other elements of the face is determined by a regionalization of naïve ectoderm into distinct domains of hyperpolarized cells. These voltage gradients regulate the expression of genes like Frizzled, and artificially altering this pattern by misexpression of specific ion channels and pumps is sufficient to perturb normal craniofacial anatomy and to reprogram tissues far away from the head to form properly-patterned eyes. Importantly, in such cases, as in the cancer phenotypes discussed below, it is really the Vmem that is the necessary and sufficient factor for inducing specific shape change – it does not matter which ion translocator protein is involved, or what ion species is used: a given voltage change, no matter how it is produced, activates specific downstream events.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Vmem in embryogenesis",
      "chunk_summary": "Vmem gradients play a crucial role in early frog development, influencing left-right asymmetry, craniofacial patterning, and eye development, with Vmem itself being the key factor regardless of the specific ion channels involved.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "During regeneration of flatworms, the patterning activity of adult stem cells (neoblasts) is regulated by gap junctional connectivity and a set of proton and potassium flows. By regulation of apoptotic remodeling and downstream activity of genes such as Wnt11, the physiological gradient determines the anatomy of the organs built after injury. In vertebrates, where electric fields were long ago implicated in limb regeneration, recent experiments showed that driving proton and sodium fluxes can initiate complete tail or limb regeneration in a range of non-regenerative conditions. The mechanisms involve guidance of innervation into the stump, activation of blastema genes such as MSX1, Notch, Delta, BMP2, and BMP4, and induction of cell proliferation in the wound mesenchyme. Indeed, a number of recent molecular studies using unbiased approaches have identified a range of ion channels, gap junctions, and ion pumps in: morphogenesis of the trachea, development of skin pigmentation pattern, regeneration of the zebrafish fin, development of mammalian face, growth of the cerebellum, and formation of the skeletal, cardiac, and urogenital systems. Thus in addition to experiments directly studying bioelectricity in amphibian, avian, and planarian systems, data from genetic models such as Drosophila also identifies channels such as Kir2.1 as important regulators of Dpp signaling and wing patterning.",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Bioelectricity in regeneration",
      "chunk_summary": "Bioelectric signals, including proton and potassium flows, regulate regeneration in flatworms and vertebrates, influencing stem cell activity, blastema gene activation, and organ patterning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "With respect to wound healing, inhibition of which is known to be a tumor promoting agent, elegant molecular genetics experiments have now revealed some of the elements underlying endogenous electric field-mediated cell migrations. Epithelial wound closure involves Integrin Beta-4 (ITGB4), Cyclic AMP, betaphosphatidylinositol-3-OH kinase-y (PI(3)Ky) and phosphatase and tensin homolog (PTEN). Having seen that endogenous electric fields and Vmem gradients play an instructive role in normal patterning, what is the evidence that dysregulation of bioelectrical communication can underlie the cancer phenotype?",
      "section": "Bioelectricity as an instructive component of microenvironment",
      "topic": "Wound healing and cancer",
      "chunk_summary": "Endogenous electric fields play a role in wound healing, and their dysregulation can contribute to cancer, with molecular mechanisms involving ITGB4, cAMP, PI(3)Ky, and PTEN.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "The view that cancer is a developmental disorder predicts that molecular mechanisms known to be important mediators of the morphogenetic field would be involved in tumorigenesis. Indeed, there is mounting evidence that the bioelectric cues that establish normal pattern can go awry and result in cancerous growth. The function of ion channels is involved in the self-sufficiency in growth signals, insensitivity to anti-growth signals, evasion of programmed cell death, limitless replicative potential, sustained angiogenesis, and tissue invasion and metastasis. Ion channels, pumps, and gap junctions are now recognized as oncogenes, predictive markers, and an important set of targets for new cancer drugs that's seek to modulate cell behavior by tweaking electrical controls of proliferation or metastatic behavior. Importantly however, oncochannel misregulation occurs not only through mutations in channel genes but also by changes in the rich network of events that implement post-translational gating of wild-type ion channels.",
      "section": "Bioelectric gradients in cancer at the cell level",
      "topic": "Ion channels as oncogenes",
      "chunk_summary": "Ion channels, pumps, and gap junctions are implicated in cancer development and progression, serving as oncogenes and potential drug targets, with their misregulation occurring through mutations and post-translational gating changes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Tumor cells differ from untransformed cells in terms of the type of ion channels and pumps they express and in the resulting membrane potential of the cells. Some channel levels are thus used as markers, such as the K2P channel TREK-1 and the sodium channel NaV in prostate cancer, and the TRPM1 channel in melanoma. Tumor cells' membrane voltage is often determined by a different transporter than that of normal cells and it has been suggested that this gives the cells a selective advantage. For example, hepatocellular carcinoma up-regulates the V-ATPase, which is then localized to the plasma membrane. The function of ion translocators, such as voltage-gated K+ channels and Cl channels, controls the proliferation rate of a number of cells that often form tumors or leukemia. ERG is particularly involved in cell growth signals, and is implicated in transformation of prostate epithelium. Also implicated are 2-pore channels such as KCNK9, and voltage-gated sodium channels, being definitive oncogenes – necessary and sufficient for a transformed phenotype. Transfection of the EAG K+ channel confers a transformed phenotype in mammalian cells, and hEAG1 channel expression is regulated by p53 (via miR-34 and E2F1). In human breast cancer cells, K+ current controls progression through the cell cycle; activation of an ATP-sensitive potassium channel is required for breast cancer cells to undergo the G1/G0-S transition. Metastatic potential correlates with voltage-gated inward sodium current and it has been suggested that some sodium channels may be oncofetal genes, encoding signals that are active during the rapid and autonomous growth of tumors and embryos.",
      "section": "Bioelectric gradients in cancer at the cell level",
      "topic": "Ion channel expression in cancer cells",
      "chunk_summary": "Tumor cells exhibit distinct ion channel and pump expression patterns compared to normal cells, with altered membrane potential providing a selective advantage and specific ion channels serving as markers and oncogenes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Migration of cells including B-16 melanoma is dependent on K+ channels. The voltage-gated sodium channels (VGSCs) potentiate breast cancer metastasis, and indeed the involvement of NaV in the galvanotaxis that allows prostate and breast cancer cells to move across vessel lumens is one of the leading stories on ion channels in cancer. Highly up-regulated activities of NaV confers on cancer cells directional motility and invasive characteristics via Ca2+ and pH-sensitive cytoskeletal remodeling processes which facilitate metastasis. Certain channelopathies result in syndromes associated with cancer such as the lung cancer seen in Lambert-Eaton syndrome, and the tumors present in Beckwith-Wiedemann syndrome, which is caused by abnormal imprinting of a voltage-gated potassium channel. As will be discussed below, Vmem induces cancer-like cell states; while a complete picture of the process remains to be worked out in mammalian cells, a few entry-points have been identified. For example, KID-1, a kinase induced by depolarization, is a member of the Pim family of proto-oncogenes.",
      "section": "Bioelectric gradients in cancer at the cell level",
      "topic": "Ion channels and metastasis",
      "chunk_summary": "Ion channels, particularly voltage-gated sodium channels (VGSCs), play a crucial role in cancer cell migration and metastasis, with NaV involvement in galvanotaxis being a prominent example.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "Voltage control functions together with the more commonly-studied signals such as growth factors and adhesion molecules. For example, adhesion to specific substrate molecules (mediated by integrin) causes a 20 mV hyperpolarization of resting potential in murine neuroblastoma cells; the hyperpolarization is due to Kir channels and works through a G protein; this hyperpolarization is gone after 1 hour and is necessary for neurite outgrowth. Proton pump blockers such as concanamycin and bafilomycin are known anti-tumor agents and repression of pancreatic tumor cells occurs after selective blockade of IK-type channels. The involvement of neurotransmitters in cancer could also be explained by a voltage-dependent mechanism. For example, GABA is a tumor suppressor and GABAA and nAChR are ligand-gated ion channels often expressed in tumors.",
      "section": "Bioelectric gradients in cancer at the cell level",
      "topic": "Voltage control and other signaling pathways",
      "chunk_summary": "Voltage control interacts with growth factors, adhesion molecules, and neurotransmitters in cancer development, with examples like integrin-mediated hyperpolarization and GABA's tumor suppressor role.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "The involvement of ion channels in transformation, growth control, and metastasis has led to efforts to develop potassium, chloride, and sodium channel and pump modulators as clinical agents for ovarian, breast, and prostate cancer. Unbiased drug screens for inhibitors of cancer stem cells have identified salinomycin (a potassium ionophore) and tetraethylammonium (TEA, a potassium channel blocker) as anticancer drugs that target tumor initiating cells. For example, TEA was found to suppress colony formation in endometrial cancer cells while its withdrawal resulted in a significant enhancement of tumorigenesis. Which ion channels should be targeted by therapeutic drugs? In an important sense, focusing on the channel gene or protein may be missing the bigger picture. In the current literature, ion translocators are usually treated as single genes or proteins responsible for a specific cell behavior (metastasis, hyperproliferation, etc.) – a cell-level view that neglects the fact that numerous channels and pumps contribute to the Vmem gradients that mediate large-scale patterning cues. The true impact of bioelectricity in cancer will only occur when we understand and target the storage of patterning information in physiological networks that is misprocessed in cancer; such networks are dynamical systems with complex feedback between the post-translational gating of many different channel and pump proteins.",
      "section": "Bioelectric gradients in cancer at the cell level",
      "topic": "Ion channel modulators as cancer drugs",
      "chunk_summary": "Ion channel modulators are being developed as cancer drugs, but focusing on individual channels may overlook the broader role of Vmem gradients and physiological networks in cancer development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "It is now appreciated that the essence of cancer may not be in specific driver genes but in the dynamics of cells traversing state spaces and shifting between different attractors. While these state spaces are commonly thought of in terms of transcription (gene-regulatory networks), the data on bioelectricity in cancer suggests that another important concept may be the physiological state space. It has long been realized that cancer differs from normal cells by the relatively depolarized state of its cells. As far back as the 1930's, Burr was able to detect tumors based on voltmeter readings. What these classical data (and the molecular data summarized below) had in common is a focus on bioelectrical state of the cell rather than its genetics: a given resting potential level is contributed to by all of the ion channels and pumps in the cell. Thus, while Vmem relies on gene products, it is a complex function of all of them and cannot even in principle be reduced to genetics or transcriptional profiles because all of these translocator proteins are gated at the post-translational level. The dependence of voltage upon the activities of a myriad channels which are regulated by each other and additional physiological events (e.g., phosphorylation), and the ability of voltage change to induce specific outcomes (regardless of which ion channels are used to alter the Vmem of this cell), suggest a powerful paradigm borrowed from physics: statistical mechanics.",
      "section": "Resting potential: a statistical dynamics view",
      "topic": "Vmem as a systems property",
      "chunk_summary": "The essence of cancer may lie in the dynamics of cells in physiological state space, with Vmem, a systems property influenced by numerous ion channels and pumps, being a key factor rather than specific driver genes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "We propose that the right concept to describe the role of Vmem in cellular control is akin to \"pressure\" in physics. Pressure is a systems property – it is created by the contribution of individual molecules' motions, but tracking any individual molecule in an attempt to understand or manipulate what the system will do would be missing the point entirely. There is no \"driver particle” in a gas under pressure any more than there is anything special about a particle that happens to be at the \"center of gravity\" of a complex object. Pressure is a concept that exists at a higher level of organization than individual molecules, but is causal in the sense that appropriate measurement and control of pressure as such is sufficient to efficiently predict and rationally alter the behavior of systems. We propose that a statistical mechanics view of Vmem is the right level to understand its involvement in cancer. Focusing on the details of specific channel genes obscures the “necessary and sufficient causal state\" for inducing or suppressing cancer (e.g., depolarized Vmem, see below). Specific channels may dominate the Vmem in specific cell types, and in those cell types serve as convenient and simple genes to be targeted. However, the general situation is that one can often use any well-characterized channel or pump to make the necessary (and functionally sufficient) changes in Vmem. True, databases like Gene Expression Omnibus and Oncomine are revealing many associations between ion channels and cancer, and specific network analyses do implicate ion channels in processes such as invasiveness. We argue that this is only the tip of the iceberg – an immense under-estimate of the true importance of voltage in oncology, because most of the physiological changes are occurring at the post-translational gating level, and thus are utterly invisible to the mRNA or protein profiling that is so extensively used today.",
      "section": "Resting potential: a statistical dynamics view",
      "topic": "Statistical mechanics view of Vmem",
      "chunk_summary": "A statistical mechanics view of Vmem, analogous to \"pressure\" in physics, is proposed as the appropriate level of analysis for understanding its role in cancer, emphasizing Vmem as a systems property rather than focusing on individual channel genes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "This was seen for example in the regeneration and left-right asymmetry field, where any number of appropriate gain-of-function channel and pump constructs could be used to induce specific anatomical outcomes such as randomization of the asymmetric organs' laterality or the regrowth of a tail. Focusing on individual channels as “genes for regeneration” is missing the point that the necessary and sufficient factor is often a voltage state, such as the narrow range of Vmem that induces eye formation in any region of the Xenopus larva. With increasingly detailed profiling data, the picture is going to only become more complicated unless we define the distinct physiological states that are responsible for inducing specific cell behaviors such as transformation or metastasis and formulate models at that level of biological organization. This in turn will enable us to rationally design reagents (e.g., select specific gain-of-function channels or pharmacological cocktails) to control Vmem appropriately in vivo.",
      "section": "Resting potential: a statistical dynamics view",
      "topic": "Vmem and regeneration",
      "chunk_summary": "Focusing on individual channel genes overlooks the importance of Vmem as a key regulator of regeneration, as demonstrated by experiments where various channels induce similar anatomical outcomes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "But, if distinct Vmem levels are transduced by various second-messenger mechanisms into transcriptional and epigenetic responses, why not simply focus on those downstream endpoints directly? This is the situation with every complex regulatory network – any node event (transcriptional or biophysical) has an upstream cause and a downstream effect. The trick is to find \"key nodes” – components of the functional network that are convenient to manipulate because they offer optimal control over complex downstream events. This is seen for example in the regeneration field, where a single hour's treatment of a non-regenerative tail blastema is sufficient to induce the entire 8-day regeneration program of this complex appendage (containing spinal cord). Bioelectric states appear to be powerful master regulators that trigger complex downstream cascades (self-limiting and self-organizing patterning modules) without the need to micromanage the process. Importantly, recent data reveal that Vmem is a similarly potent control node in the genetic and biophysical networks that underlie cancer.",
      "section": "Resting potential: a statistical dynamics view",
      "topic": "Vmem as a key regulatory node",
      "chunk_summary": "Vmem acts as a potent control node in cancer-related networks, triggering complex downstream cascades without the need for micromanagement, similar to its role in regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "A variety of bioelectric properties have been used as detection modalities for tumors; these capitalize on cancer cells' distinct electrical impedance or ion content. Zeta potential is also associated with cancer; for example asbestos fibers and sheets of positively-charged materials (but not powders of the same material) induce tumors, probably by acting as a capacitor for bioelectric potential, the positive side corresponding to the electron sink existing at a wound. In this section, we focus on depolarized Vmem, which has been suggested to correspond to the cancer state. One way to probe the physiology of the effects of canonical mammalian oncogenes (Glil, Xrel3 and KRASG12D) and a mutant tumor suppressors (p53Trp248) in vivo is to misexpress them in Xenopus and zebrafish embryos, which induces tumor like structures (ITLS). ITLS's thus form as a result of genetic interference with signaling pathways altered in several cancer types including basal cell carcinoma, lung cancer, leukemia, melanoma, and rhabdomysarcoma. Examination of injected animals using fluorescence reporters of Vmem revealed unique depolarization of tumors (and increased sodium content) compared to healthy surrounding tissues. Moreover, depolarization foci are present in oncogene-expressing, preneoplastic cells that are yet to undergo transformation or show any morphological phenotype. Such depolarized foci, while present in only 19–30% of oncogene-injected embryos (depending on oncogene used), predict tumor formation with 50–56% success rate (15-21% false negatives). For comparison, prostate specific antigen (PSA) level in the serum, when used as a biomarker for prostate cancer, has ~29% predictive value. An added advantage of Vmem as a biomarker is that it is associated with tumors of diverse molecular origin, suggesting a general role for Vmem change as an early indicator of tumorigenesis.",
      "section": "Bioelectrical regulation of cancer in vivo",
      "topic": "Vmem as a cancer biomarker",
      "chunk_summary": "Depolarized Vmem is a promising biomarker for cancer detection, showing higher predictive value than PSA in some cases and being associated with tumors of diverse origins.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    },
    {
      "text": "The next major areas of opportunity for bioelectric detection of cancer are four-fold. First, a more specific physiological signature needs to be developed (to distinguish tumor cells from adult stem cells – another depolarized population) and appropriate voltage-sensitive dye technology implemented as a diagnostic tool to visualize areas of pre-cancer on patients as well as observe tumor margins during surgery. In addition to visualization, a better characterization of bioelectric state could be used to guide drug delivery vehicles such as nanoparticles. Second, this strategy needs to be validated in a mammalian model system, and in a range of well-characterized human tumor cell lines. Third, it is critical to begin to tackle the long-range aspects of biological disturbance introduced by cancer. While body-wide morphogenetic fields and the role that Vmem distributions play in these are only beginning to be understood, it is imperative to establish molecular models in which to investigate the fact that transplanted or chemically-induced tumors can be detected by aberrant voltmeter readings taken at locations far away from the tumor. Lastly, modern work on bioelectricity in non-excitable cells has not yet addressed the information encoded in time-dependent changes in Vmem. For example, fibroblasts expressing Ras-oncogene respond to the drug bradykinin with Vmem oscillations, while control cells exhibit a single transient hyperpolarization. In human carcinoma cells, fluctuations of membrane potential are triggered by EGF and persist for long periods of time after EGF application. The mechanisms and significance of the temporal Vmem changes for cancer initiation and progression remain to be discovered.",
      "section": "Bioelectrical regulation of cancer in vivo",
      "topic": "Future directions for bioelectric cancer detection",
      "chunk_summary": "Future research should focus on developing more specific bioelectric signatures, validating detection strategies in mammalian models and human cell lines, investigating long-range bioelectrical disturbances, and exploring the role of time-dependent Vmem changes in cancer.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_655011.pdf",
      "original_filename": "pdf_20250803_124126_655011_extracted_text.txt",
      "authors": "[\"Brook Chernet\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "J Clin Exp Oncol",
      "doi": "10.4172/2324-9110.S1.002"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:35:04.766270"
}