{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_485393_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_485393.pdf",
    "file_size": 17843,
    "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
    "journal": "Journal of Cell Death",
    "doi": "10.4137/JCD.S14368",
    "year": "2014",
    "title": "Optogenetic Control of Apoptosis in Targeted Tissues of Xenopus laevis Embryos",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "KillerRed (KR) is a fluorescent protein that, upon activation with green light, releases reactive oxygen species (ROS), triggering apoptosis in the expressing cell. This property allows for precise spatiotemporal control of cell death, minimizing nonspecific effects associated with mechanical or chemical damage techniques. This optogenetic control is invaluable for regeneration/repair studies, particularly in Xenopus laevis, where apoptosis plays a key role. This paper describes a method where membrane-bound KR, introduced via mRNA microinjection, can be activated with green light to induce apoptosis in specific organs and tissues, focusing on the developing eye and pronephric kidney.",
      "section": "Abstract",
      "topic": "Optogenetic control of apoptosis",
      "chunk_summary": "KillerRed enables precise, light-activated cell death, valuable for regeneration studies in Xenopus laevis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Optogenetics, the use of light to control cellular processes, has advanced significantly, enabling control of various cellular functions, from membrane potential to enzymatic function and gene transcription. The discovery of genetically encoded photosensitizers like KillerRed (KR) and miniSOG has further expanded the optogenetic toolkit, allowing for photoinducible cell death with high spatial and temporal specificity. Applications range from tumor phototherapy to cell cycle control, with potential in developmental biology and regeneration research.",
      "section": "Introduction",
      "topic": "Optogenetics and KillerRed",
      "chunk_summary": "Optogenetics, particularly with KillerRed, allows for precise control of cell death, with applications in various fields including regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Programmed cell death is essential for organismal development, playing a role in tissue sculpting, organ removal, and cell number control. In Xenopus laevis, a model organism for embryonic development, complex cell death dynamics occur throughout development and metamorphosis. While methods for inducing cell death exist, replicating the natural dynamics requires precise timing and cell-specific targeting. Optogenetic systems like KR offer this level of control and have broader applications beyond development.",
      "section": "Introduction",
      "topic": "Cell death in development",
      "chunk_summary": "Programmed cell death is crucial for development, and optogenetic tools like KillerRed offer precise control for studying these processes in Xenopus.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "The mechanisms of tissue repair and regeneration have been a long-standing question in biology. Xenopus laevis serves as a model system for regeneration studies in various tissues and organs, including the eye, kidney, tail, and limb. Studying regeneration requires damaging or removing cells, often with high specificity to limit off-target effects. Light-induced cell death methods, like KR, offer advantages over traditional techniques by providing greater spatiotemporal specificity and enabling studies of damage at a smaller scale, such as apoptosis in cardiomyopathy.",
      "section": "Introduction",
      "topic": "Regeneration and repair",
      "chunk_summary": "Xenopus is a model for regeneration studies, and optogenetic tools like KillerRed offer precise damage induction for these studies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "KillerRed (KR) is a dimeric red fluorescent protein that, upon excitation with green light, releases reactive oxygen species (ROS), leading to apoptosis. This can occur through direct activation of apoptotic pathways by mitochondrial KR or oxidation of phospholipids by membrane-bound KR. KR targeted to the nucleus can induce DNA breaks and halt the cell cycle. KR has been used in various applications, including protein inactivation, mitochondrial death induction, tissue ablation, cell division blockage, and tumor photosensitization.",
      "section": "Introduction",
      "topic": "KillerRed mechanism and applications",
      "chunk_summary": "KillerRed induces apoptosis through ROS release, with applications ranging from protein inactivation to tumor photosensitization.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "This study developed a method for targeted tissue ablation in X. laevis tadpoles using photoinduced cell death. Membrane-bound KR mRNA is microinjected into embryos, and tadpoles expressing KR in the region of interest are exposed to green light under a fluorescent microscope to induce apoptosis. This process results in morphological and histological changes in the target tissues, including organ ablation.",
      "section": "Introduction",
      "topic": "Targeted tissue ablation in Xenopus",
      "chunk_summary": "This study uses KillerRed to induce targeted tissue ablation in Xenopus tadpoles via photoinduced apoptosis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "The pCS2-NXE + mem-KR plasmid was linearized and used for mem-KR mRNA synthesis using the Ambion mMESSAGE mMACHINE SP6 kit. The mRNA was diluted in nuclease-free water for injection. Xenopus laevis eggs were fertilized in vitro, dejellied, and raised in 0.1× MMR. Embryos were staged according to Nieuwkoop and Faber.",
      "section": "Methods",
      "topic": "mRNA synthesis and embryo preparation",
      "chunk_summary": "KillerRed mRNA was synthesized and Xenopus embryos were prepared for microinjection.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Embryos were injected with mem-KR mRNA at cleavage stages using a microinjector. A fate map was used to target injection locations for later KR expression. Embryos were raised in a dark environment until the desired stage.",
      "section": "Methods",
      "topic": "KillerRed expression in embryos",
      "chunk_summary": "KillerRed mRNA was microinjected into Xenopus embryos at specific locations based on a fate map.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Tadpoles expressing KR in the region of interest were selected using a fluorescent microscope. They were immobilized and exposed to green light through a 40× objective until photobleaching occurred (approximately five minutes). After exposure, tadpoles were raised until changes were visible, then euthanized, fixed, and stored. Remaining KR protein was photobleached.",
      "section": "Methods",
      "topic": "KillerRed activation",
      "chunk_summary": "KillerRed was activated in selected tadpoles by green light exposure under a fluorescent microscope.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Immunohistochemistry and in situ hybridization were performed on whole-mount tadpoles as described by Caine and McLaughlin.",
      "section": "Methods",
      "topic": "Immunohistochemistry and in situ hybridization",
      "chunk_summary": "Standard immunohistochemistry and in situ hybridization techniques were used.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "This protocol induces apoptosis in X. laevis tissues with high spatial and temporal regulation. The eye and pronephric kidney serve as example targets. KR activation was confirmed by photobleaching in illuminated regions, correlating with cytotoxicity. Five minutes of light exposure resulted in approximately 75% reduction in KR brightness. ROS production, measured with dihydroethidium, was limited to the illuminated region.",
      "section": "Results and Discussion",
      "topic": "KillerRed activation and ROS production",
      "chunk_summary": "KillerRed activation, confirmed by photobleaching and ROS production, is spatially restricted to the illuminated region.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Increased active Caspase-3 expression, a marker of apoptosis, was observed in targeted tissues 1–5 hours after light exposure. Apoptosis was limited to the illuminated region. Morphological and molecular phenotypes consistent with cell death were observed in the eye (ablation of pigment) and pronephros (expression of proximal tubule markers) 24 hours post-exposure. No increase in apoptosis or tissue ablation was observed from light alone in tissues not expressing KR.",
      "section": "Results and Discussion",
      "topic": "Apoptosis and tissue disruption",
      "chunk_summary": "KillerRed photoactivation induced apoptosis and tissue disruption specifically in the targeted regions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "KR-expressing cells can undergo increased apoptosis even without light activation (\"leakiness\"), requiring mRNA concentration titration for each target tissue to minimize nonspecific effects. Too low mRNA concentration reduced phenotype incidence after light activation. Optimal concentrations were 26 ng/µL for the eye and 18 ng/µL for the pronephros. Concentrations at or above 40 ng/µL reduced embryo viability.",
      "section": "Results and Discussion",
      "topic": "mRNA concentration optimization",
      "chunk_summary": "Optimizing mRNA concentration is crucial to balance KillerRed's leakiness and effective photoactivation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Compared to mechanical damage or chemical exposures, KR-induced damage offers greater specificity. Spatial specificity is controlled by limiting KR expression location (e.g., targeted injections) and light exposure area. Spatial resolution depends on microscope magnification.  Multiple exposures may be needed for larger targets. KR's application for tissue ablation in Xenopus is novel, offering an alternative to traditional methods in regeneration studies. Unlike generalized damage models, KR allows studying specific effects of oxidative damage and apoptosis.",
      "section": "Discussion",
      "topic": "Advantages of KillerRed for tissue ablation",
      "chunk_summary": "KillerRed offers greater specificity for tissue ablation compared to traditional methods, enabling targeted studies of oxidative damage and apoptosis in Xenopus.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "While KR-mediated tissue ablation has been shown in zebrafish using transgenic organisms, this method uses KR mRNA and is adapted for Xenopus.  KR can be used to study the specific effects of oxidative damage and apoptosis, which play a key role in Xenopus tissue regeneration. Similar tissue ablation has been shown in invertebrates using miniSOG, which generates singlet oxygen, while KR primarily uses superoxides. This method of targeted apoptosis induction in Xenopus tissues using KR is expected to be a useful protocol in developmental biology, regeneration, and repair.",
      "section": "Discussion",
      "topic": "KillerRed in Xenopus regeneration studies",
      "chunk_summary": "This KillerRed method provides a novel approach for targeted apoptosis induction in Xenopus, valuable for regeneration and repair studies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Extensive photobleaching of KillerRed occurs within the first five minutes of light exposure. A tadpole with KillerRed in the eye was exposed to green light for nine minutes, with images taken every minute. While brightness continues to diminish with longer exposure, the most significant photobleaching happens within the first five minutes.",
      "section": "Appendix",
      "topic": "KillerRed photobleaching kinetics",
      "chunk_summary": "KillerRed photobleaching is most extensive within the first five minutes of light exposure.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    },
    {
      "text": "Titration of mRNA concentration is necessary for proper penetrance of phenotype. Effects of specific (with light) and nonspecific (no light) KillerRed activation are shown for varying mRNA concentrations. Lower concentrations reduce the incidence of the ablated eye phenotype upon photoactivation, while higher concentrations increase nonspecific damage even without photoactivation.",
      "section": "Appendix",
      "topic": "mRNA concentration optimization",
      "chunk_summary": "Optimizing mRNA concentration is crucial for balancing specific photoactivation and minimizing nonspecific KillerRed damage.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_485393.pdf",
      "original_filename": "pdf_20250803_124125_485393_extracted_text.txt",
      "authors": "[\"Kyle Jewhurst\", \"Michael Levin\", \"Kelly A. McLaughlin\"]",
      "year": "2014",
      "journal": "Journal of Cell Death",
      "doi": "10.4137/JCD.S14368"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:35:55.898733"
}