{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_021034_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_021034.pdf",
    "file_size": 18550,
    "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
    "journal": "Chemistry & Biology",
    "doi": "10.1016/j.chembiol.2010.11.012",
    "year": "2011",
    "title": "A Chemical Genetics Approach Reveals H,K-ATPase-Mediated Membrane Voltage Is Required for Planarian Head Regeneration",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Biophysical signaling is required for both embryonic polarity and regenerative outgrowth. Exploiting endogenous ion transport for regenerative therapies will require direct regulation of membrane voltage. Here, we develop a pharmacological method to target ion transporters, uncovering a role for membrane voltage as a key regulator of anterior polarity in regenerating planaria. Utilizing the highly specific inhibitor, SCH-28080, our data reveal that H+,K+-ATPase-mediated membrane depolarization is essential for anterior gene expression and brain induction. H+,K+-ATPase-independent manipulation of membrane potential with ivermectin confirms that depolarization drives head formation, even at posterior-facing wounds. Using this chemical genetics approach, we demonstrate that membrane voltage controls head-versus-tail identity during planarian regeneration. Our data suggest well-characterized drugs (already approved for human use) might be exploited to control adult stem cell-driven pattern formation during the regeneration of complex structures.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "Membrane voltage, regulated by H+,K+-ATPase, is crucial for anterior polarity during planarian regeneration, and pharmacological manipulation of this voltage can control head formation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "Developing regenerative therapies for limb injuries and organ replacement requires understanding the processes that induce stem cell proliferation and new tissue growth, as well as the machinery that aligns new tissues with the original polarity. Planarians are well-suited for such investigations due to their ability to regenerate any lost tissue, complex CNS, defined adult stem cell population, clear A/P polarity, and extensive history of regenerative analyses. They also share more genes with vertebrates than Drosophila or C. elegans. While transgenesis remains to be perfected, planarians are exceptional for pharmacological studies. Chemical genetics (CG) is a powerful tool for probing biophysical processes like long-term membrane voltage gradients and ion flows, which are essential for regenerative outgrowth, regulating cell proliferation, differentiation, and migration. Biophysical regulation of polarity and regeneration is of particular interest due to the potential for translating existing drugs into therapies. However, the role of biophysical signals in influencing polarity and mediating in vivo stem cell behavior is not fully understood.",
      "section": "Introduction",
      "topic": "Planarian model system",
      "chunk_summary": "Planarians are an excellent model for studying regeneration due to their regenerative abilities and genetic similarity to vertebrates, and chemical genetics offers a powerful tool for investigating biophysical signaling in this context.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "Using CG, we investigated the role of biophysical signaling during adult stem cell-mediated regeneration in planarians. We identified H,K-ATPase as a candidate for regulating regenerative A/P polarity. This P2C class plasma membrane ATPase, known for regulating stomach pH, is also important in other tissues. While electroneutral, it can work with K+ efflux channels to control membrane voltage, as seen in the mammalian gut, inner ear, and Xenopus embryonic left/right patterning. Planarians have multiple H,K-ATPase genes, making single gene knockdowns with RNAi less informative due to functional redundancies. RNAi against one nongastric H,K-ATPase alpha subunit in D. japonica had no effect. While RNAi of multiple genes is possible, it's not practical for inhibiting larger numbers. A pharmacological approach was ideal for loss-of-function studies and gain-of-function approaches to explore biophysical modulation of regenerative patterning. We chose D. japonica due to the asexual strain of S. mediterranea's lower chemical tolerance and D. japonica's larger size for complex amputation assays. Our experiments revealed membrane voltage as a new regulator of anterior polarity. Our data show H,K-ATPase activity is required for depolarization of the anterior blastema, anterior gene expression, and head formation. H,K-ATPase-independent modulation of membrane potential demonstrated that depolarization itself is sufficient to drive ectopic anterior regeneration, highlighting membrane voltage as a key initiator of head formation.",
      "section": "Introduction",
      "topic": "H,K-ATPase and regeneration",
      "chunk_summary": "Chemical genetics identified H,K-ATPase as a regulator of anterior polarity in planarian regeneration, and its activity is required for head formation through membrane depolarization.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "SCH-28080 (SCH), a specific, potent, and reversible inhibitor of H,K-ATPase, was identified in a chemical genetics screen. It does not inhibit Na,K-ATPase and blocks invertebrate H,K-ATPases. Previous research showed that 70 µM SCH resulted in abnormal or deficient anterior regeneration, specifically in eye formation, while other pharmacological blockers had no effect. Two other H,K-ATPase inhibitors induced similar anterior defects, suggesting H,K-ATPase activity is required for normal head regeneration. At a lower concentration (18 µM), SCH-treated fragments regenerate normally but do not form head structures. pH analyses confirm SCH-treated fragments are more acidic, suggesting H,K-ATPase activity has been targeted.  Modulating extracellular medium pH did not affect regenerative polarity. SCH had no effect on intact worms, ruling out toxicity or stem cell maintenance inhibition. Transverse worm fragments were amputated to assay both head and tail regeneration. SCH-treated regenerates formed anterior blastemas, indicating H,K-ATPase activity is not required for stem cell proliferation or wound healing. SCH treatment did not induce lesions or necrosis. H,K-ATPase inhibition during the first 72 hr blocked head structure regeneration in posterior fragments. Exposure yielded some cyclopic animals, while most lacked anterior structures, producing a \"headless\" phenotype. Even after 2 months, H,K-ATPase-inhibited worms remained headless. Shorter treatment resulted in a dose-response effect, with 24 hr treatment having no effect. H,K-ATPase activity is required for normal anterior morphogenesis, but patterning mechanisms can recover unless inhibition is maintained past a critical point. We focused our analyses on pharynx fragments, which are most affected by H,K-ATPase inhibition.",
      "section": "Results",
      "topic": "H,K-ATPase inhibition and head regeneration",
      "chunk_summary": "Inhibiting H,K-ATPase with SCH-28080 prevents head regeneration in planarians, demonstrating its essential role in anterior morphogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "While some headless worms had one pointed and one rounded end, most had two pointed ends, suggesting a two-tailed phenotype. Molecular analyses revealed headless worms had a single posterior end, with the second end neither posterior nor anterior. The double-branched posterior morphology of the gastrovascular (GV) tract was present, but the single-branched anterior morphology was not. The two posterior GV branches connected around the pharynx but didn't extend anteriorly. The GV tract ectopically extended into the \"anterior\" margin. Headless worms lacked cephalic ganglia and therefore had no brain. The ventral nerve cords ectopically connected, producing a single nerve cord looped around the pharynx, which retained its A/P polarity. The pharynx didn't recenter or shrink. Headless worms had neoblasts up to their \"anterior\" margin. Despite lacking anterior structures, there was no duplication of posterior markers. H,K-ATPase inhibition prevented optical nerve and photosensitive cell formation, confirming SCH blocks eye formation. Headless worms also failed to induce anterior genes. We conclude headless worms regenerate tail but fail to regenerate head. H,K-ATPase activity is required for anterior gene expression and head morphogenesis, without affecting posterior genes or reversing blastema polarity.",
      "section": "Results",
      "topic": "Headless phenotype analysis",
      "chunk_summary": "Analysis of headless planarians revealed a single posterior end, absence of anterior structures, and lack of anterior gene expression, indicating H,K-ATPase is crucial for head formation but not tail regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "Despite having a complete pharynx, H,K-ATPase-inhibited regenerates did not eat, consistent with a requirement for brain to feed. While they moved when touched, they otherwise remained stationary, unlike controls. Quantitative behavioral analyses using a computer vision system showed H,K-ATPase-inhibited regenerates lost exploratory behavior. At 2 weeks, control pharynx fragments explored roughly 27% of the dish, while H,K-ATPase-inhibited fragments explored 0%. Regenerates lacking mature brains (24 hr untreated fragments) moved significantly more than 2-week-old H,K-ATPase-inhibited regenerates. This suggests H,K-ATPase-inhibited worms don't process neural inputs to coordinate exploratory behavior, which controls can by 24 hr, highlighting an early role for H,K-ATPase activity during brain regeneration. These data suggest H,K-ATPase activity is an initial step in regenerating anterior structures, during or prior to anterior blastema patterning. To position ion transport relative to known pathways, we investigated Wnt signaling, which regulates A/P polarity. Inhibiting nuclear β-catenin signaling causes ectopic posterior head formation, producing two-headed worms. However, H,K-ATPase inhibition prevents this, suggesting H,K-ATPase activity is necessary to initiate ectopic anterior signals.",
      "section": "Results",
      "topic": "Behavioral and molecular analysis",
      "chunk_summary": "H,K-ATPase-inhibited planarians exhibit impaired exploratory behavior and lack of anterior neural function, and H,K-ATPase activity is necessary for Wnt-driven ectopic head formation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "Unlike posterior fragments, prepharyngeal fragments regenerate heads despite SCH exposure, although eye development is delayed.  The presence of anterior signals in this region might compensate for lost H,K-ATPase activity. Increasing amounts of prepharyngeal tissue were amputated to compare regeneration responses to SCH treatment. As more anterior tissue is removed, regenerates are more affected by H,K-ATPase inhibition, suggesting anterior tissue rescues anterior morphogenesis. To determine the anterior CNS's involvement, whole worms were cut sagittally either through the midline (anterior CNS in both halves) or offset (most anterior CNS in the larger \"half\"). When brain tissue is present, head formation occurs despite H,K-ATPase inhibition. However, without the CNS, H,K-ATPase inhibition blocks head regeneration, resulting in headless worms. Prepharyngeal transverse fragments are SCH resistant, but those excluding the ventral nerve cords become susceptible.  The anterior CNS, not just anterior tissue, can rescue H,K-ATPase inhibition.",
      "section": "Results",
      "topic": "Anterior signaling rescue",
      "chunk_summary": "The presence of anterior CNS tissue can rescue head regeneration in H,K-ATPase-inhibited planarians, suggesting anterior signaling overrides the inhibitory effect.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    },
    {
      "text": "These results suggest anterior signaling drives head regeneration independent of H,K-ATPase activity. Reinitiating regeneration, which would resupply such signaling, should also rescue head formation. Headless regenerates were wounded at the \"anterior\" end without further SCH exposure. Wound healing alone did not restore head structures. However, an unpigmented blastema did rescue head structures. Smaller wounds with tiny blastemas developed cyclopia, while large blastemas regenerated full heads, perhaps reflecting the difference between localized and broader anterior gene expression. Wound healing alone is insufficient to initiate anterior morphogenesis, but anterior signals are provided by the new blastema. This suggests a functional difference between wound healing (tissue expansion) and true regeneration (blastema formation initiates patterning and remodeling). The ability to restore head structures comes from regeneration-specific signaling, as the first eye arose within the blastema. This rescue is not from indiscriminate regeneration, as tail wounds never promoted head regeneration. Only blastema formation in the headless region's anterior end resulted in head regeneration.  \"Nonhead\" tissue can form anterior structures with the correct signals. H,K-ATPase activity is not involved in initial anterior polarity determination, as blastemas in the headless region still form head structures. Anterior signals' sufficiency to rescue head regeneration is consistent with H,K-ATPase activity being required for anterior gene expression upstream of anterior morphogenetic patterning.",
      "section": "Results",
      "topic": "Blastema and regeneration rescue",
      "chunk_summary": "Inducing blastema formation in headless planarians rescues head regeneration, indicating that H,K-ATPase acts upstream of anterior signaling and that anterior signals are sufficient for head formation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_021034.pdf",
      "original_filename": "pdf_20250803_124126_021034_extracted_text.txt",
      "authors": "[\"Wendy S. Beane\", \"Junji Morokuma\", \"Dany S. Adams\", \"Michael Levin\"]",
      "year": "2011",
      "journal": "Chemistry & Biology",
      "doi": "10.1016/j.chembiol.2010.11.012"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:13:02.672332"
}