{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124127_026890_extracted_text.txt",
    "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124127_026890.pdf",
    "file_size": 36689,
    "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
    "journal": "Oncotarget",
    "doi": null,
    "year": "2014",
    "title": "Transmembrane voltage potential of somatic cells controls oncogene-mediated tumorigenesis at long-range",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "The microenvironment, including bioelectric signals, plays a crucial role in cancer. This study investigates the impact of distant cell resting potentials on oncogene-dependent tumorigenesis in Xenopus laevis tadpoles. Using human oncogenes like KRAS, tumor-like structures (ITLS) were induced, exhibiting characteristics of human tumors such as overproliferation, increased nuclear size, hypoxia, acidity, and leukocyte attraction. Remote misexpression of hyperpolarizing ion channels significantly reduced ITLS incidence. Hyperpolarization via native CLIC1 chloride channels also suppressed tumorigenesis, suggesting a potential treatment modality. HDAC1 is implicated as the mechanism by which resting potential changes affect cell behavior, potentially linking host cell resting potentials, butyrate produced by native bacteria, and oncogene-driven tumorigenesis.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in cancer",
      "chunk_summary": "Distant cell resting potentials influence oncogene-dependent tumorigenesis in Xenopus, with hyperpolarization suppressing tumor formation via CLIC1 and HDAC1.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Embryonic development and tissue maintenance rely on signals that orchestrate cell activities. Cancer disrupts this control, allowing cells to escape morphogenetic regulation. Healthy neighboring cells contribute to stabilizing aberrant cell behavior and controlling tumorigenesis. Patterning environments, like embryos and regenerating limbs, can normalize and reprogram tumors. Endogenous bioelectric signaling among all cell types is a component of the microenvironment and mediates pattern formation. Bioelectrical processes, including extracellular electric fields and transmembrane resting potentials, regulate cell activities relevant to cancer, such as proliferation, differentiation, migration, and apoptosis. Tumor electrical properties differ from healthy tissue, and hyperpolarization can prevent tumor formation. Ion channels are not just markers but also components of a long-range system for patterning control. Disrupting bioelectric gradients can activate a cancer phenotype without carcinogen exposure or DNA damage.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in development",
      "chunk_summary": "Bioelectric signaling, a component of the microenvironment, plays a crucial role in development and tissue maintenance, and its disruption can contribute to cancer.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "This study investigates the role of remote Vmem modulation in oncogene-induced carcinogenesis. Using human oncogenes in Xenopus laevis embryos, tumor-like structures (ITLS) were induced. The study explores how distant hyperpolarization affects ITLS formation and the underlying mechanisms. This research aims to understand the microenvironment and long-range aspects of aberrant growth control by developmental patterning mechanisms, with implications for cancer prevention and treatment.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in cancer",
      "chunk_summary": "This study investigates the role of remote Vmem modulation in oncogene-induced carcinogenesis in Xenopus, aiming to understand the microenvironment and long-range aspects of aberrant growth control.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Induced tumor-like structures (ITLS) in Xenopus laevis embryos, driven by human oncogenes like Xrel3 and KRASG12D, exhibit key similarities to human tumors. ITLS show increased proliferation, particularly in the G2/S/M phases, as revealed by FUCCI analysis. They also exhibit hypoxia, confirmed by pimonidazole staining, and disorganized growth patterns with larger mesodermal cells, consistent with neoplasia.  Nuclear size is increased in ITLS, and the intracellular environment is more acidic.  Furthermore, ITLS attract leukocytes, indicating an immune response. These characteristics validate the Xenopus model for studying human cancer.",
      "section": "Results",
      "topic": "ITLS characterization",
      "chunk_summary": "ITLS in Xenopus exhibit characteristics of human tumors, including increased proliferation, hypoxia, disorganized growth, increased nuclear size, acidity, and leukocyte attraction.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Remote hyperpolarization suppresses ITLS formation. Co-injecting Xrel3-tdTomato and Kv1.5-GFP3 in separate blastomeres of Xenopus embryos resulted in reduced ITLS incidence despite the presence of Xrel3 protein. Kv1.5-induced hyperpolarization suppressed Xrel3 and Gli1 ITLS formation. High chloride treatment, which hyperpolarizes cells, also decreased KRASG12D ITLS incidence. These findings demonstrate a long-range signal initiated by hyperpolarization that influences tumorigenesis, and suggest that ITLS suppression can be achieved by modulating Vmem through endogenous channels.",
      "section": "Results",
      "topic": "Long-range hyperpolarization",
      "chunk_summary": "Remote hyperpolarization, induced by Kv1.5 or high chloride, suppresses ITLS formation in Xenopus, indicating a long-range influence on tumorigenesis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Chloride-dependent ITLS suppression is mediated by CLIC1. An inverse drug screen with chloride channel blockers showed that IAA abolished chloride-dependent ITLS suppression.  Co-injection of wildtype CLIC1-2A-GFP3 with KRASG12D-tdTomato in high chloride further suppressed ITLS formation, while co-injection of dominant-negative CLIC1C24S-2A-tdTomato blocked the suppression. These results implicate CLIC1 in mediating hyperpolarization-induced ITLS suppression.",
      "section": "Results",
      "topic": "CLIC1 and hyperpolarization",
      "chunk_summary": "CLIC1 is identified as the channel responsible for chloride-dependent ITLS suppression, with IAA blocking the effect and dominant-negative CLIC1 abolishing the suppression.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Hyperpolarization inhibits tumorigenesis via HDAC1-dependent mechanisms. A pharmacological suppression screen and molecular-genetic loss-of-function experiments targeting various Vmem transduction pathways revealed that blocking HDAC1 activity had the most significant effect on CLIC1-mediated tumor suppression. Non-local introduction of dominant-negative HDAC1 increased ITLS formation, suggesting a role for HDAC1 in controlling cell behavior at a distance.",
      "section": "Results",
      "topic": "HDAC1 and Vmem",
      "chunk_summary": "HDAC1 inhibition is identified as the key mechanism by which hyperpolarization suppresses tumorigenesis, with dominant-negative HDAC1 increasing ITLS formation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Butyrate, an HDAC inhibitor, is implicated in Vmem-mediated tumor control.  Novobiocin, an antibiotic against gram-positive bacteria, and a cocktail of antibiotics targeting gram-positive bacteria significantly increased ITLS formation. These results suggest that butyrate derived from gram-positive bacteria plays a role in Vmem-mediated tumor suppression.",
      "section": "Results",
      "topic": "Butyrate and bacteria",
      "chunk_summary": "Butyrate from gram-positive bacteria is implicated in Vmem-mediated tumor control, with antibiotics targeting these bacteria increasing ITLS formation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Bioelectric properties, including electric fields and resting membrane potentials, control cell behaviors relevant to cancer. This study demonstrates that remote cell resting potentials influence tumor formation in vivo.  The induced tumor-like structures (ITLS) in Xenopus exhibit characteristics of human tumors, validating the model's relevance. This research highlights the importance of bioelectric signals in cancer and their potential as therapeutic targets.",
      "section": "Discussion",
      "topic": "Bioelectric signaling in cancer",
      "chunk_summary": "Bioelectric properties, particularly remote cell resting potentials, play a crucial role in tumor formation, as demonstrated in a Xenopus model exhibiting human tumor characteristics.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "This study demonstrates the long-range control of tumorigenesis by Vmem.  Modulating distant cell resting potentials impacts tumor formation.  Hyperpolarization suppresses ITLS formation, regardless of the oncogene used, even when the hyperpolarized cells are distant from the oncogene-expressing cells.  This suggests that bioelectric signaling plays a crucial role in host-cancer interactions and that Vmem is a powerful regulator of these processes.",
      "section": "Discussion",
      "topic": "Long-range Vmem control",
      "chunk_summary": "Vmem exerts long-range control over tumorigenesis, with remote hyperpolarization suppressing tumor formation regardless of the oncogene involved.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "CLIC1 is a native target for suppressing tumorigenesis through hyperpolarization.  Manipulating native ion channels, rather than introducing heterologous channels, offers a potential therapeutic approach.  High chloride levels reduce ITLS incidence without additional channel misexpression.  CLIC1 is implicated in mediating this effect, with dominant-negative CLIC1 blocking the suppression.  This suggests that modulating Vmem through native channels like CLIC1 could be a viable strategy for cancer treatment.",
      "section": "Discussion",
      "topic": "CLIC1 as therapeutic target",
      "chunk_summary": "CLIC1 is a native channel that can be targeted for tumor suppression through hyperpolarization, offering a potential therapeutic approach without gene therapy.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "HDAC1 inhibition is the mechanism by which hyperpolarization transduces into cell responses affecting tumorigenesis.  Blocking HDAC1 activity disrupts the suppressive effect of hyperpolarization, increasing ITLS formation.  Butyrate, derived from gram-positive bacteria, is implicated in this process.  Antibiotics targeting these bacteria increase ITLS incidence, suggesting a link between the microbiome, butyrate, and Vmem-mediated tumor control.",
      "section": "Discussion",
      "topic": "HDAC1 and butyrate",
      "chunk_summary": "HDAC1 inhibition is the key mechanism by which hyperpolarization suppresses tumorigenesis, with butyrate from gram-positive bacteria playing a role in this process.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "A proposed model links Vmem, butyrate, and HDAC1 in tumorigenesis. Hyperpolarized cells create a positively charged surface environment that reduces the viability of butyrate-producing bacteria. This skews bacterial distribution away from hyperpolarized cells and towards depolarized, oncogene-expressing cells. Butyrate availability at these sites leads to HDAC inhibition, promoting cell cycle arrest and reducing proliferation. This model highlights a novel long-range pathway regulating tumorigenesis, with implications for future research and therapeutic development.",
      "section": "Discussion",
      "topic": "Model of Vmem and tumorigenesis",
      "chunk_summary": "A model is proposed linking Vmem, butyrate, and HDAC1, where hyperpolarization reduces bacterial viability, leading to decreased butyrate availability and HDAC inhibition at tumor sites.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Xenopus laevis embryos were obtained through in vitro fertilization and housed according to standard protocols. Microinjection of mRNAs encoding various constructs, including oncogenes, ion channels, and fluorescent markers, was performed at specific stages. Drug treatments, including chloride channel blockers and antibiotics, were administered at indicated concentrations and durations. Immunohistochemistry was used for spatial analysis.",
      "section": "Materials and Methods",
      "topic": "Experimental procedures",
      "chunk_summary": "Standard Xenopus laevis embryo handling, microinjection of mRNAs, drug treatments, and immunohistochemistry were performed.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_026890.pdf",
      "original_filename": "pdf_20250803_124127_026890_extracted_text.txt",
      "authors": "[\"Brook T. Chernet\", \"Michael Levin\"]",
      "year": "2014",
      "journal": "Oncotarget",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-05T13:28:49.164387"
}