{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_238467_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_238467.pdf",
    "file_size": 34221,
    "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
    "journal": "Int J Dev Biol",
    "doi": "10.1387/ijdb.140215ml",
    "year": "2023",
    "title": "Left-right patterning in Xenopus conjoined twin embryos requires serotonin signaling and gap junction adams",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "A number of processes operating during the first cell cleavages enable the left-right (LR) axis to be consistently oriented during Xenopus laevis development. Prior work showed that secondary organizers induced in frog embryos after cleavage stages (i.e. conjoined twins arising from ectopic induced primary axes) correctly pattern their own LR axis only when a primary (early) organizer is also present. This instructive effect confirms the unique LR patterning functions that occur during early embryogenesis, but leaves open the question: which mechanisms that operate during early stages are also involved in the orientation of later-induced organizers? We sought to distinguish the two phases of LR patterning in secondary organizers (LR patterning of the primary twin and the later transfer of this information to the secondary twin) by perturbing only the latter process. Here, we used reagents that do not affect primary LR patterning at the time secondary organizers form to inhibit each of 4 mechanisms in the induced twin. Using pharmacological, molecular-genetic, and photo-chemical tools, we show that serotonergic and gap-junctional signaling, but not proton or potassium flows, are required for the secondary organizer to appropriately pattern its LR axis in a multicellular context. We also show that consistently-asymmetric gene expression begins prior to ciliary flow. Together, our data highlight the importance of physiological signaling in the propagation of cleavage-derived LR orientation to multicellular cell fields.",
      "section": "Abstract",
      "topic": "Left-Right Patterning in Conjoined Twins",
      "chunk_summary": "Early left-right (LR) patterning mechanisms are essential for the correct orientation of later-induced organizers in Xenopus conjoined twins, specifically involving serotonergic and gap-junctional signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "After fertilization, one of the key milestones of embryogenesis is the establishment of the primary body axes. Developmental biologists have long been intrigued by the mechanisms responsible for orienting the left-right (LR) axis, which is defined with respect to the anterior-posterior and dorsal-ventral axes. Although the vast majority of vertebrate species display LR-symmetrical external body plans, these animals have consistent asymmetries in the position and shape of the internal organs including the heart, stomach, gall bladder, spleen, and brain. Birth defects that disrupt LR patterning affect about 1 in 6000 live births, but are often accompanied by severe medical consequences, particularly when LR placement of individual organs in the body is randomized, a condition referred to as heterotaxia.",
      "section": "Introduction",
      "topic": "Left-Right Asymmetry in Vertebrates",
      "chunk_summary": "The establishment of the left-right (LR) axis is crucial for vertebrate development, and defects in LR patterning can lead to heterotaxia, a condition with severe medical consequences.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "The establishment and orientation of the LR axis requires 3 distinct steps that take place at progressively later stages of development: symmetry breaking, when the two sides of the embryo first become different and the nascent LR axis is consistently aligned with respect to the other 2 body axes; the conversion of these asymmetries to LR-biased expression of genes such as the Nodal-Lefty-Pitx cassette; and the translation of this asymmetric gene expression into asymmetric morphology and position of organs. Although the last two phases are fairly well understood and are generally considered not controversial, there remain many questions about the earliest steps in symmetry breaking.",
      "section": "Introduction",
      "topic": "Stages of LR Axis Development",
      "chunk_summary": "Left-right (LR) axis development involves three steps: symmetry breaking, asymmetric gene expression, and asymmetric morphology, with the earliest steps of symmetry breaking being the least understood.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "In Xenopus embryos, LR asymmetries are observed during early cleavage stages due to the presence of a consistently biased, chiral cytoskeleton. The chiral cytoskeleton (and possibly differential chromatid segregation) drives the asymmetric distribution of proteins including K+ channels and H+ pumps, which become more strongly localized to the ventral right blastomere. The biased localization of these ion transporters establishes consistent LR differences in the pH and transmembrane voltage on the left and right sides of the embryo. The asymmetric efflux of positively charged ions establishes a bioelectrical gradient, with the ventral right blastomere more negatively charged; this gradient drives further asymmetric distribution of small charged molecules such as serotonin (5-HT) via a series of open gap junctions connecting across a circumferential path throughout the dorsal portion of the embryo. Serotonin's accumulation in the cells to the right of the ventral gap-junctional boundary epigenetically represses the expression of the nodal homolog Xnr-1 via a Mad3-HDAC1 receptor complex, resulting in the lack of expression of this gene on the right side of the body. Ciliary motion during late gastrula and early neurula stages also feeds into the expression of laterality genes.",
      "section": "Introduction",
      "topic": "Early LR Asymmetry Mechanisms in Xenopus",
      "chunk_summary": "In Xenopus, a chiral cytoskeleton drives asymmetric ion transporter localization, creating a bioelectric gradient that influences serotonin distribution and ultimately represses Xnr-1 expression on the right side.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Although many aspects of the intracellular asymmetry pathway have been demonstrated to be conserved in other species including chick, snails, Drosophila, zebrafish, and even single mammalian cells, the Xenopus embryo has an advantage in that the earliest steps in the LR pathway normally occur when there are only a small number of blastomeres present, and these blastomeres are in direct contact with each other. Can these same mechanisms operate to establish LR asymmetry in embryos with vastly different body plans, including in embryos that orient the LR axis when hundreds or thousands of cells are present? The Xenopus conjoined twin model offers an experimental system where the molecular genetic tools useful in identifying early determinants in the LR pathway are available, but where a more complex body plan can be probed. Conjoined twins can be induced by introducing molecular elements of Spemann's organizer, such as the transcription factor XSiamois, to the developing embryo at a position 180 degrees across from the native organizer. Twins induced by this method only form after the mid-blastula transition, when zygotic transcription commences, enabling the induced secondary twin model to provide information about the mechanisms orienting a new primary axis when each cell is only a small portion of the whole body – a much different topology than the holoblastic cleavage of the original frog embryo.",
      "section": "Introduction",
      "topic": "Conjoined Twin Model for LR Asymmetry",
      "chunk_summary": "The Xenopus conjoined twin model allows for the study of LR asymmetry in a more complex body plan, where organizers arise de novo in a multicellular context.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Numerous studies have used the conjoined twin to probe late mechanisms for establishing LR asymmetry. Prior work revealed that organizers induced past the first few cleavages can only orient the LR axis correctly when an original axis (the primary twin) is already present elsewhere in the embryo. This is the \\\"big brother effect\\\", in which late-induced twins must pick up LR orientation information from original organizers. Planar cell polarity and apical basal polarity proteins are required for this instructive process. The need for an organizer that had the benefit of early cleavage mechanisms for their LR determination to enable a later organizer to properly orient itself highlights the importance of early cleavage events, which are essential for correct LR orientation.",
      "section": "Introduction",
      "topic": "Big Brother Effect in Conjoined Twins",
      "chunk_summary": "The \"big brother effect\" in conjoined twins demonstrates that late-induced organizers require LR orientation information from primary organizers, highlighting the importance of early cleavage events.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "It is not known how many of the mechanisms by which early chiral information is converted into multicellular asymmetric gene expression are operational during late organizer induction. Here, we have used the conjoined twin model to determine whether the mechanisms that operate during early cleavage stages also participate in orienting the LR axis when an organizer arises de-novo in a multi-cellular field. Our results, using reagents that do not affect asymmetry processes in a primary organizer at the time at which the secondary twin is forming, reveal that some, but not all, of these mechanisms are indeed required to orient the LR axis in the context of thousands of cells. Moreover, we report that transcriptional asymmetries are established prior to the initiation of ciliary flow, confirming the unique functions of the earliest stages of development for LR asymmetry.",
      "section": "Introduction",
      "topic": "Research Objectives and Findings",
      "chunk_summary": "This study uses the conjoined twin model to investigate which early LR patterning mechanisms are also involved in late organizer induction, finding that gap junctional communication and serotonin signaling are essential.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Chemical agents disrupt LR patterning in singletons early, but not late Inverse drug screens (and the subsequent gene-specific validations) have previously implicated K+ channels, H+ pumps, gap junctional communication (GJC) and serotonin (5-HT) in the early orientation of the LR axis in Xenopus. We first tested reagents that target these mechanisms in singleton embryos, to confirm which ones randomized asymmetry when used early (exposure starting at 1-cell) but did not disrupt LR patterning when exposures start at blastula stage (stage 8). We specifically wanted to identify reagents that are effective early but not later, so that we could use them to probe the mechanisms of secondary organizer LR patterning without concerns that they would interfere with any laterality functions of the primary organizer. We identified treatments for all four targets (K+ channels, H⁺ pumps, GJC and 5-HT signaling) that disrupted LR patterning in singletons when used early, but not later. These reagents were then used to determine whether their targets were also utilized in LR patterning of a secondary organizer occurring in the context of an existing blastula.",
      "section": "Results",
      "topic": "Chemical Disruption of LR Patterning",
      "chunk_summary": "Reagents targeting K+ channels, H+ pumps, gap junctional communication (GJC), and serotonin (5-HT) disrupt LR patterning in singleton embryos when applied early but not late in development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Disrupting H+ or K+ signaling does not affect LR patterning in conjoined twins Singleton embryos incubated at pH 4.0 starting from the 1-cell stage have randomized LR patterning because such low extracellular pH interferes with the normal proton efflux from right side cells; however, incubations in pH 4.0 medium that start at stage 8 have no effect on LR patterning in singletons, confirming this procedure as targeting only very early phases of LR asymmetry. To test the impact of altered H⁺ signaling on LR patterning in conjoined twins, embryos were injected with XSiamois and then incubated in 0.1x MMR, pH 4.0 starting from stage 8. We found no effect of low pH MMR on the incidence of heterotaxia in the induced twin, suggesting that H+ efflux is not necessary for proper LR orientation of a primary axis initiated at later stages. Similarly, singleton embryos incubated in 4–40 mM BaCl have randomized LR axes when treatments start at the 1-cell stage (due to blockade of potassium channels), but normal LR development when exposures begin at stage 8. To test the effects of altered K+ signaling on LR patterning in conjoined twins, twins were induced by XSiamois and embryos were treated with BaCl starting from stage 8. Altered LR patterning was not observed in the induced twin axes, indicating that K+ signaling is also not required for LR patterning of primary axes induced at later stages. We conclude that the process by which secondary organizers derive LR information utilizes neither K+ nor proton effluxes.",
      "section": "Results",
      "topic": "H+ and K+ Signaling in Conjoined Twins",
      "chunk_summary": "Disrupting H+ or K+ signaling, which randomizes LR patterning in early singleton embryos, has no effect on LR patterning in conjoined twins, indicating these signals are not required for later organizer induction.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Pharmacological and molecular genetic loss-of-function assays implicate GJC in LR patterning in late-induced organizers We next examined the role of gap junctional communication. Singleton embryos treated with lindane (a gap junction blocker) starting from the 1-cell stage exhibited randomized LR patterning, but incubations that started at stage 8 had no effect on LR patterning in singletons. To test the role of GJC in LR patterning of conjoined twins, embryos were injected with XSiamois to induce left-sided twins and then incubated in lindane starting from stage 8. In contrast to what was observed for treatments targeting H+ and K+ signaling, disruption of GJC via treatment with lindane induced heterotaxia in 30% of the induced twins. To confirm this pharmacological result with a gene-specific molecular reagent, embryos were injected with XSiamois and H7 mRNA, a dominant negative form of a chimeric connexin that efficiently disrupts GJC in Xenopus. When H7 mRNA was introduced into two distinct blastomeres anywhere in the top two tiers of the animal pole, 31% of induced twins that were produced from these treatments exhibited randomized heart situs. To determine whether proper GJC was needed in the blastomeres that would contribute to the primary organizer, H7 was targeted only to two dorsal blastomeres. Again, the induced twins had randomized LR axes. These results indicate that GJC is required to achieve proper LR patterning in conjoined twins, suggesting that connexin-mediated communication plays a role in the orientation of the LR axis of late-induced organizers.",
      "section": "Results",
      "topic": "Gap Junctional Communication in Conjoined Twins",
      "chunk_summary": "Disrupting gap junctional communication (GJC) with lindane or dominant-negative connexin (H7) induces heterotaxia in conjoined twins, demonstrating the importance of GJC in late organizer LR patterning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Disruption of 5-HT signaling alters LR patterning in conjoined twins Singleton embryos treated with 10 µM tropisetron, a 5-HT receptor 3 antagonist, had randomized LR patterning when exposures started at the 1-cell stage but not when exposures started at stage 8. To test the effect of altered 5-HT signaling on LR patterning in conjoined twins, embryos were injected with XSiamois and then incubated in 10 µM tropisetron starting from stage 8. The induced twins exposed to the drug exhibited significant increases in inverted heart situs compared to twins that were not exposed to tropisetron. Similarly, singleton embryos treated with 15 μΜ fluoxetine, a selective 5-HT reuptake inhibitor that alters the amount of available intracellular 5-HT, had randomized LR asymmetry only when exposures occurred early. When induced conjoined twins were exposed to fluoxetine starting from stage 8, there was a significant increase in heterotaxia. These results implicate serotonergic signaling specifically in the LR patterning of late-induced organizers. To verify these pharmacological loss-of-function results with molecular genetic specificity, 8- or 16-cell embryos were co-injected with XSiamois and mRNA encoding amine binding protein (ABP), a protein that binds, sequesters and inactivates 5-HT. When 5-HT signaling was specifically reduced in the blastomeres that contributed to the induced twin, heterotaxia was observed. These results validate the pharmacological data, and indicate that 5-HT signaling is required for proper orientation of the LR axis in the complex body plan of the conjoined twin.",
      "section": "Results",
      "topic": "Serotonin Signaling in Conjoined Twins",
      "chunk_summary": "Disrupting serotonin (5-HT) signaling with tropisetron, fluoxetine, or amine binding protein (ABP) leads to heterotaxia in conjoined twins, indicating a crucial role for 5-HT in late organizer LR patterning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "To better probe the spatial and temporal role of 5-HT in LR patterning in conjoined twins, we employed a caged 5-HT molecule, BHQ-O-5HT, which releases 5-HT after molecular uncaging via exposure to light. Releasing 5-HT from BHQ-O-5HT at the 32-cell stage randomizes the LR axis in singleton embryos, but uncaging at stage 8 has no significant effect on the LR axis of singletons, confirming this as a reagent that can be used to specifically target the instructive phase of organizer patterning. To further probe the temporal role of 5-HT in LR patterning of late-induced organizers, BHQ-O-5HT was injected into the apical-most point of the 1-cell embryo, followed by injection with XSiamois at the 8- or 16-cell stage to induce conjoined twins. When BHQ-O-5HT was activated at the 32-cell stage, LR defects were observed in conjoined twins, similar to what was observed in singletons. When 5-HT was photochemically released beginning at stage 8, relatively high rates of heterotaxia were observed in conjoined twins, a contrast to the normal LR axes typical of singletons treated in the same way. A second subset of embryos was co-injected with BHQ-O-5HT and XSiamois, limiting the localization of the caged 5-HT molecule to the cells that would contribute to the induced twin. When 5-HT was released at either 32-cell or at stage 8, significant levels of heterotaxia were observed in the induced twin. Even uncaging as late as stage 10 was able to randomize LR patterning in conjoined twins. In summary, results using this novel reagent provided temporal control to probe the role of 5-HT throughout the embryo or in just those blastomeres that contributed to the induced twin. This caged 5-HT molecule revealed a role for 5-HT in orienting the LR axis of the late-induced conjoined twin, and specifically implicate this molecule during late stages as the induced twin begins to develop with the onset of zygotic transcription.",
      "section": "Results",
      "topic": "Caged Serotonin Experiments",
      "chunk_summary": "Experiments using caged serotonin (BHQ-O-5HT) demonstrate a specific instructive role for 5-HT in late organizer LR patterning, even as late as stage 10, highlighting its importance during the onset of zygotic transcription.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Identification of novel LR-biased transcripts in the developing embryo Our data demonstrate that GJC and 5-HT play a role in the LR specification of conjoined twins. Prior results indicated that serotonergic signaling through intracellular (gap-junctional) paths impinged on asymmetric Nodal transcription through epigenetic repression mediated by the Mad3-HDAC1 complex. However, many hours separate the activity of the serotonin/GJC system from the eventual left-sided expression of Nodal. What transcriptional events may underlie LR patterning downstream of serotonergic signaling but prior to late steps such as ciliary function and Nodal expression? To identify mRNAs that are asymmetrically expressed during this developmental period (i.e. after cleavage stages but prior to the onset of ciliary flow), we performed a preliminary microarray analysis comparing gene expression levels between the (pooled, N=50) right and left sides of stage 13 Xenopus embryos (prior to GRP function which begins at stages 14-15). Out of approximately 29,000 transcripts represented in the array, about 1.3% were known genes with a significant bias. We identified 33 genes with at least a 2-fold higher expression level on the left side of the embryo, 314 with at least a 2-fold higher expression level on the right side of the embryo, 6 transcripts which were detectable only on the left side, and 48 transcripts which were detectable only on the right side. While functional roles for these targets in LR asymmetry remain to be tested, the data reveal clear asymmetries in transcriptomic profile of the L and R sides before ciliary flow begins. It should be noted that the data contain novel targets, as well as those implicated by prior work in the LR asymmetry field in a number of species, such as Sonic hedgehog, collagen, and dynein. While microarray measurements are inherently more sensitive than the non-quantitative chromogenic in situ hybridization that is often used to look for asymmetric gene expression, we did examine the expression of one gene of interest, the most highly-expressed Left-only mRNA (collagen9A2) by whole mount in situ hybridization (WISH) analysis at stage 12 and 13. This transcript was also of particular interest because collagen is known to be regulated by both serotonergic signaling and gap junction-mediated signaling. The WISH results corroborated the microarray data, revealing expression only on the left side of the embryo (n=14) or with an extremely strong left bias (n=4). As a negative control we also used an anti-sense probe for XSlug, a gene that was not identified as left-right biased in in the microarray, and saw the expected symmetric expression in all embryos (n=36). Taken together, these results identify a number of additional candidate targets to be functionally tested downstream of the serotonergic and gap junctional communication system in Xenopus, and reveal that asymmetric transcription already exists prior to ciliary flow.",
      "section": "Results",
      "topic": "LR-Biased Transcripts",
      "chunk_summary": "Microarray analysis identified numerous LR-biased transcripts in stage 13 Xenopus embryos, including collagen9A2, suggesting asymmetric transcription precedes ciliary flow and is influenced by serotonin and gap junctional communication.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Xenopus has proven to be a valuable model to understand the mechanisms responsible for orienting the LR axis due to the plethora of molecular-genetic reagents available, their ease of use for pharmaceutical exposures, the availability of large numbers of embryos, and their well-characterized cell lineages. In fact, a large number of studies using pharmacological and molecular genetic loss-of-function reagents have helped to elucidate the steps involved in orienting the LR axis in this species. Although much of the work in Xenopus has focused on early mechanisms, the conjoined twin model offers a unique opportunity to examine the mechanisms involved in orienting the LR axis when an organizer arises de novo in a multicellular context.",
      "section": "Discussion",
      "topic": "Xenopus as a Model for LR Asymmetry",
      "chunk_summary": "Xenopus, with its available molecular tools and well-characterized development, is a valuable model for studying LR asymmetry, particularly using the conjoined twin model to investigate late organizer induction.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Our goal was to identify which mechanisms that are used in early LR patterning can also be used by late organizers induced in a multi-cellular context. To achieve this, we used perturbations that affect the patterning of the 2nd organizer after stage 8 (blastula) but specifically do not affect LR patterning processes in the primary embryo at this time-point. Our results using pharmacological and molecular-genetic reagents revealed that proton and potassium transport are dispensable, but GJC and 5-HT are both necessary for LR patterning in conjoined twins. Importantly, heart situs in the primary twin was randomized to a similar degree in all treatment groups (data not shown); Nascone & Mercola reported this same phenomenon in their original experiments of conjoined twins, and determined that this was due to the late action of leaky morphogens from the induced twin.",
      "section": "Discussion",
      "topic": "Mechanisms of Late Organizer LR Patterning",
      "chunk_summary": "This study identified GJC and 5-HT signaling as essential for late organizer LR patterning in conjoined twins, while proton and potassium transport were found to be dispensable.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Our results also reveal a novel instructive role for 5-HT during late axis specification. It was recently suggested that 5-HT has permissive roles in the formation of ciliated tissues during GRP formation, acting as a competence factor rather than having an instructive role during orientation of the LR axis. This hypothesis is contradicted by the observation that misexpression of 5-HT on the right side induces heterotaxia. Here, we have used caged serotonin molecules to show that abnormal expression of 5-HT as late as stage 10 randomized LR patterning in conjoined twins. Randomized LR axes were observed when reagents were targeted to the entire embryo (1-cell injection of caged 5-HT), to the primary twin (dorsal injections of H7), or to the induced twin (ventral injections of caged 5-HT and ventral injections of ABP), consistent with the need for embryo-wide transfer of serotonin-mediated instructive information during late LR patterning.",
      "section": "Discussion",
      "topic": "Instructive Role of Serotonin",
      "chunk_summary": "Contrary to previous suggestions, this study demonstrates an instructive role for 5-HT in late LR axis specification, with caged serotonin experiments showing that abnormal 5-HT expression randomizes LR patterning even at late stages.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Our current and previous work implicates a number of physiological pathways involved in the establishment of the LR axis, both in wild type embryos and in induced twins. In regulating the cell behavior that gives rise to asymmetric organogenesis, these pathways must affect gene expression. As a first step in identifying transcriptional targets functioning earlier than Nodal (in addition to the epigenetic silencing previously characterized), and to test our hypothesis that asymmetric transcription begins prior to appearance of the ciliated node, we performed a microarray analysis comparing the right and left halves of stage 13 embryos and identified 401 transcripts exhibiting a lateralized expression bias. As noted previously for asymmetric maternal proteins, the lateralized transcripts were much more heavily associated with the right side. Overall, these genes represent a number of diverse families, many of which have not been previously implicated in the specification of LR asymmetry. In situ hybridization for collagen9a2, a transcript identified as expressed on the left side only by the genechip, corroborated the microarray data, showed strongly left biased expression in all of the embryos examined. This result is exciting, as both GJC and 5-HT have been shown to affect collagen synthesis in other model systems. Moreover, collagen is already implicated in LR patterning of structures in C. elegans and chick, confirming the deep conservation of LR mechanisms among diverse phyla that was recently shown using tubulin modifications. While future studies will probe the functional roles of these asymmetric transcripts in the causal chain leading from asymmetric physiology to left-sided genes such as Nodal, our results are consistent with prior studies indicating that molecular asymmetry is established very early during development and is not limited to maternal protein.",
      "section": "Discussion",
      "topic": "Asymmetric Gene Expression and LR Patterning",
      "chunk_summary": "Microarray analysis revealed numerous lateralized transcripts, including collagen9a2, supporting the hypothesis that asymmetric gene expression, influenced by physiological pathways like GJC and 5-HT signaling, begins early in LR patterning, before ciliary flow.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "We have used the conjoined twin model to examine the mechanisms involved in orienting the LR axis in a late-induced organizer. The data reveal that both GJC and 5-HT signaling are required for this instructive influence, but that potassium and proton efflux is not, and that a number of interesting genes are asymmetrically transcribed during these timepoints, prior to initiation of ciliary flow. Our previous studies of conjoined twins revealed a role for polarity proteins, including apical-basal and planar cell polarity proteins, in the orientation of the LR axis. We propose a model whereby the polarity proteins align the cells in the blastoderm, enabling signaling molecules, including 5-HT, to pass through a series of open gap junctions from the primary to the secondary organizer.",
      "section": "Conclusion",
      "topic": "Model of LR Patterning in Conjoined Twins",
      "chunk_summary": "GJC, 5-HT signaling, and polarity proteins play crucial roles in orienting the LR axis in late-induced conjoined twin organizers, with a proposed model involving polarity protein alignment facilitating 5-HT transfer through gap junctions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Xenopus laevis embryos were collected and fertilized in vitro following standard protocols. Embryos were maintained in 0.1x Modified Marc's Ringers (MMR) pH 7.8 at 14-20°C in laboratory incubators and staged according to Nieuwkoop and Faber (1967). All experiments were approved by the Animal Care and Use Committee at Tufts University and were conducted according to the Guidelines for the Care and Use for Laboratory Animals.",
      "section": "Materials and Methods",
      "topic": "Animal Rearing",
      "chunk_summary": "Xenopus laevis embryos were raised and maintained under standard laboratory conditions following ethical guidelines.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "At Nieuwkoop and Faber stage 13, embryos were bisected into right and left halves with a scalpel, transferred into separate Eppendorf micro-centrifuge tubes, and immediately frozen at -80°C. A total of 50 embryos, resulting from a combination of eggs from three mothers, were pooled for analysis. Only embryos with completely normal external development were used. RNA extraction and microarray analysis were performed by the Beth Israel Deaconess Medical Center Genomics Core using a GeneChip Xenopus laevis genome 2.0 array (Affymetrix, Santa Clara, CA) following the standard Affymetrix protocol. Following expression analysis, a database was built from all resulting transcription levels comparing the right and left embryo samples. From this database, individual genes were removed if reported expression levels were not above those of background levels for the genechip, as were any genes which did not show at least a 2-fold increase vs. that of the opposite side.",
      "section": "Materials and Methods",
      "topic": "Microarray Analysis",
      "chunk_summary": "Microarray analysis was performed on stage 13 embryos to compare gene expression levels between the right and left sides, using strict criteria for identifying differentially expressed genes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "For induction of conjoined twins, XSiamois mRNA was injected into a left ventral vegetal blastomere at the 8- or 16-cell stage. Only twins with two fully developed hearts and mostly complete heads were used in these experiments. Incomplete twins, including those with microcephaly and abnormal notochord extension, were assessed separately to ensure that slight anterior-posterior or dorsal-ventral defects that could not be detected in the complete twins were not confounding results. No differences were observed in complete versus incomplete twins for any treatment. A number of additional molecular constructs were used in these experiments including amine binding protein (ABP), a protein that binds, sequesters and inactivates 5-HT, and H7, a dominant negative form of a chimeric connexin that disrupts GJC in Xenopus. For all microinjections of mRNA constructs, capped synthetic mRNAs were dissolved in water containing a lineage tracer and injected into embryos in 3% Ficoll using standard methods (50–100 msec pulses with borosilicate glass needles calibrated for a bubble pressure of 50–70 kPa in water). Volumes of 2–7 nl were injected per blastomere for all constructs. Injections were performed at the specified stage and were typically targeted to specific blastomeres. All injections were tested in at least 3 different mothers on at least 2 different days. The Xenopus oocyte is a standard model for expressing exogenous proteins (such as ion channels) via mRNA microinjection. To verify that our in vitro transcribed mRNA was intact and resulted in the production of functional proteins, in a small subset of experiments, mRNA encoding β-galactosidase (β-gal) was co-injected with other mRNAs in embryos where twins were induced. Embryos were fixed at gastrula or neurula stages, washed, and stained with X-gal (Roche Applied Sciences, Indianapolis, IN) at 37°C. β-gal was observed in gastrula and neurula stages with different expression patterns depending on where injections were localized.",
      "section": "Materials and Methods",
      "topic": "Microinjection of Molecular Constructs",
      "chunk_summary": "Conjoined twins were induced by XSiamois mRNA injection, and other molecular constructs like ABP and H7 were used to manipulate specific pathways. mRNA injections were validated using β-galactosidase staining.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Xenopus embryos were treated with chemical reagents that have previously been demonstrated to affect LR patterning. Embryos were split into three batches: untreated controls, early treatments, and late treatments. Early treatment embryos were exposed to a single chemical from 1-cell through neurula stages (Nieuwkoop & Faber stages 19-22). Late treatment embryos were maintained in 0.1x MMR until stage 8, when they were transferred to fresh solutions containing a single chemical. These embryos were maintained in the chemical until neurula stages, then washed repeatedly in 0.1x MMR and housed in clean 0.1x MMR until stage 45. Concentrations previously identified as effective were tested, as well as higher and lower concentrations, to determine the most effective concentration at disrupting LR patterning without excessive toxicity (determined by mortality and other defects not related to LR patterning.) Only concentrations with toxicity <20% were used in these experiments.",
      "section": "Materials and Methods",
      "topic": "Drug and Chemical Treatment",
      "chunk_summary": "Chemical treatments were applied to Xenopus embryos at early and late stages to assess their effects on LR patterning, with careful consideration of toxicity and effective concentrations.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "Following the injection of XSiamois at the 8- or 16-cell stage, embryos were maintained in 0.1x MMR until stage 8, and then transferred to fresh solutions containing effective concentrations of each chemical. Embryos were incubated in the chemical until neurula stages, then washed repeatedly in 0.1x MMR and maintained in clean 0.1x MMR until stage 45. Concentrations are indicated in Table 1. All drugs/chemicals were tested in at least 2 different batches with embryos from at least 3 different mothers.",
      "section": "Materials and Methods",
      "topic": "Drug and Chemical Treatment of Conjoined Twins",
      "chunk_summary": "Conjoined twins were treated with chemicals after XSiamois injection, following a similar protocol as singleton embryos, to assess the impact on LR patterning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    },
    {
      "text": "One group of embryos was injected with approximately 50 ng BHQ-O-5HT at the 1-cell stage, and a subset of this group was injected with XSiamois mRNA at the 8- to 16-cell stage. A second group of embryos was co-injected with approximately 50 ng BHQ-O-5HT and XSiamois mRNA at the 8- to 16-cell stage. All injections were performed under dark conditions and embryos were housed in 0.1x MMR in the dark. Embryos injected with BHQ-O-5HT were exposed to a broad spectrum lamp for one hour starting at the 32-cell stage, stage 8 or at stage 10 to uncage the molecule and release 5-HT; these embryos were then returned to the dark for the remainder of the experiment.",
      "section": "Materials and Methods",
      "topic": "Caged Serotonin Experiments",
      "chunk_summary": "Caged serotonin (BHQ-O-5HT) was injected into embryos and uncaged at specific stages using light exposure to study the temporal effects of 5-HT release on LR patterning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_238467.pdf",
      "original_filename": "pdf_20250803_124125_238467_extracted_text.txt",
      "authors": "[\"Laura N. Vandenberg\", \"Douglas J. Blackiston\", \"Adam C. Rea\", \"Timothy M. Dore\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140215ml"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:29:33.708667"
}