{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_132206_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_132206.pdf",
    "file_size": 165430,
    "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "The Hijacker’s Guide to biological systems: Manipulation by self-defecting or foreign agents",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Biological systems, from molecules to organisms, utilize hierarchical regulatory networks for structure and function maintenance. This paper explores how foreign agents (pathogens, parasites, trophoblasts) and self-defecting agents (cancer cells) manipulate these networks, exploiting host plasticity to reshape morphology, function, and behavior. Intruders breach barriers, mimic host signals, alter immune defenses, and disrupt homeostatic setpoints, redirecting metabolic flows and overriding neural, immune, and endocrine signaling. These conserved manipulation strategies transform stable structures into flexible substrates, remodeling host tissues and creating niches for survival. Understanding these exploitation routes clarifies self-organization and identity maintenance principles, informing therapeutic strategies for restoring normal tissue states and opening new avenues for regenerative medicine and tissue engineering.",
      "section": "Abstract",
      "topic": "Biological System Manipulation",
      "chunk_summary": "Foreign and self-defecting agents manipulate host regulatory networks, exploiting plasticity to reshape system-level properties and establish favorable niches.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological manipulation by internal or external agents is widespread in nature, spanning immunology, host-pathogen interactions, oncology, and evolutionary ecology. This paper focuses on living agents (bacteria, archaea, eukaryotes, viruses) and how they manipulate each other's form and function. Living matter's dynamic, multiscale organization, with nested self-regulating systems, makes it susceptible to manipulation. The hacker metaphor applies as agents subvert default control paths at all levels, from molecular \"hardware\" to cellular \"social engineering.\"  We examine scenarios where an intruder invades and alters a host's environment for its advantage, excluding mutualistic symbioses. Agents must balance resource extraction with maintaining their identity through barriers, homeostasis, and regulatory networks. Understanding how intruders override these mechanisms provides insights into biological principles and therapeutic strategies.",
      "section": "Introduction",
      "topic": "Biological System Manipulation",
      "chunk_summary": "Biological manipulation is widespread, with agents exploiting host vulnerabilities at multiple scales, requiring an understanding of how intruders override host safeguards.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Intruders can be foreign (heterologous transplants, pathogens, invasive species) or self-defecting (cancer cells). Self-defecting agents deviate from cooperative regulatory networks essential for homeostasis. Studying biological manipulation offers a unique perspective on morphology and development. Cells and tissues, unlike passive materials, have a multi-scale architecture of distributed competencies.  Harnessing cellular materials for medicine and bioengineering requires understanding signals meaningful to host tissues and how to communicate desired changes through bioelectric, biochemical, and biomechanical interfaces. We examine how agents exploit host plasticity to alter structure, enhancing our understanding of biological processes, disease pathology, and informing therapeutic interventions, cellular reprogramming, tissue remodeling, regeneration, and bioengineered constructs.",
      "section": "Introduction",
      "topic": "Biological System Manipulation",
      "chunk_summary": "Studying biological manipulation provides insights into how agents exploit host plasticity, informing therapeutic strategies and bioengineering applications.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological systems are hierarchically organized, with smaller units nested within larger structures. Each level has sensing, decision-making, and self-maintenance capacities, integrated with higher-order control. This multiscale arrangement enables distributed information processing for adaptation. Nested agents interact through containment (physical boundaries regulating material and information flow), communication (spanning temporal and spatial scales, from membrane potential changes to hormones and mechanical forces), and control (nested feedback loops enabling complex responses). These signaling modalities create nested feedback loops, enabling complex responses like immune activation or developmental transitions.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Multilevel Information Processing",
      "chunk_summary": "Biological systems' hierarchical organization enables distributed information processing through containment, communication, and control across scales.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological coherence, the coordinated behavior enabling higher-order organization, depends on network motifs creating robust regulatory systems. Tissue-level coherence arises from shared signaling, cell-cell communication, and mechanical integration. Organ-level coherence emerges from tissue cooperation, exemplified by the heart's synchronized contractile system. Organismal-level coherence manifests in integrated physiological responses, like exercise adaptations. This multilevel coherence relies on communication systems (gap junctions, endocrine and neural signals, nanotubes) for continuous monitoring and dynamic adjustment. Coherent systems are resilient, with components compensating for failures. Intruders exploit these networks by mimicking signals, disrupting hubs, or inserting new pathways, co-opting coherence-sustaining processes.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Coordinated Multimodal Networks",
      "chunk_summary": "Biological coherence relies on network motifs and multilevel communication, enabling resilience but also creating vulnerabilities exploited by intruders.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Homeostasis, the dynamic maintenance of internal conditions, is fundamental to physiology. It involves controlling variables like temperature and pH through regulatory loops at all levels. Homeostatic loops involve detection, information processing relative to a setpoint, error minimization response, and feedback cycles. Living systems balance trade-offs, prioritizing and integrating demands for adaptable homeostasis. Mechanisms include negative and positive feedback, feedforward, oscillatory, and structural mechanisms operating across timescales. Homeostasis operates at different levels, from cell membrane regulation to organism-wide responses like dehydration mitigation, balancing stability and adaptability through variable tolerance ranges, hierarchical control, redundant pathways, and adaptive reset points.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Dynamic Homeostasis and Stability",
      "chunk_summary": "Homeostasis, a dynamic process balancing stability and adaptability, involves multi-level regulatory loops and diverse mechanisms operating across timescales.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological systems maintain identity despite component turnover, operating at multiple levels.  Cells maintain identity through gene expression, protein production, and membrane integrity, with Vmem as a resource and information carrier. Tissues maintain identity through cell arrangement, ECM, and signaling networks, reinforced by cell-cell junctions. Organs maintain identity through spatial organization and functional integration of cell populations. Organisms maintain identity through neural, endocrine, and immune system interplay, distinguishing self from non-self. Higher levels have broader perspectives and emergent capabilities, creating opportunities and vulnerabilities for manipulation.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Maintenance of Identity",
      "chunk_summary": "Biological systems maintain identity through dynamic processes at multiple levels, from cellular Vmem to organismal immune surveillance.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Immune surveillance exemplifies identity maintenance across levels. Cells recognize PAMPs with PRRs, while MHC presentation distinguishes self from non-self at higher levels. Stressed cells, expressing abnormal proteins and DAMPs, are targeted for elimination, preventing dysfunction and neoplasia.  Immune plasticity is crucial, with immunological memory enabling faster responses to previously encountered pathogens. This system-level memory persists beyond individual cell lifespans. Self-reactive immune cells (Tx cells) may perform interoceptive functions, monitoring tissue states and enabling controlled plasticity. Plasticity allows both homeostatic maintenance and profound adaptations, establishing new functional baselines in response to severe challenges.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Immune Surveillance and Plasticity",
      "chunk_summary": "Immune surveillance, with mechanisms like PAMP/DAMP recognition and MHC presentation, maintains self-identity and enables controlled plasticity, crucial for homeostasis and adaptation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological systems exhibit modular architecture, with cells maintaining core identity while exhibiting controlled plasticity. This modularity allows for stability and adaptability. Cell identity emerges through hierarchical transcriptional programs, with core identity maintained by lineage-specific factors, supplemented by tissue-specific and demand-responsive modules.  Identity persists through dynamic replacement, preserving organizational patterns and information flows. Stem cells rebuild tissues based on pre-existing cues, while damaged cells release signals guiding regeneration. This ensures tissue architecture and function remain constant. Neural systems illustrate this, with long-term memory persisting despite protein turnover, maintained by interactions like PKMζ and KIBRA anchoring synaptic strength.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Modularity and Identity",
      "chunk_summary": "Biological systems' modular architecture allows for both stability and adaptability, with identity persisting through dynamic replacement guided by pre-existing cues and information flows.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Living systems are composed of dynamic agents making context-sensitive decisions, learning, allocating resources, and solving problems. Biological subsystems function within problem spaces to achieve adaptable homeostatic setpoints. Evolution repurposed regulatory mechanisms for navigating diverse problem spaces (metabolic, physiological, transcriptional, anatomical) before the specialized nervous system emerged. Integrated systems, including the human body, represent collective intelligence, with informational and regulatory networks synchronizing components to achieve emergent outcomes. Morphogenesis demonstrates targeted plasticity, reaching consistent goal states despite variations in conditions, driven by cellular regulatory networks.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Modularity and Top-Down Control",
      "chunk_summary": "Biological systems exhibit collective intelligence, with subsystems functioning within problem spaces to achieve adaptable homeostatic setpoints, demonstrating targeted plasticity in morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Morphogenesis, the formation of a complex body, is an adaptive self-organization process achieving species-specific target morphologies despite variable conditions. It demonstrates targeted plasticity, reaching consistent goal states despite variations in genome copy number, cell number, and other factors. Examples include animals adapting to ectopic eyes and newts preserving morphology despite polyploidy. Morphogenesis can be modulated by top-down signals from parasites, neighboring tissues, and bioengineering interventions. This susceptibility arises from its hierarchical network of information-processing agents coordinating cellular and tissue behavior. Even subcellular networks adapt to novel challenges. This regulatory architecture provides modularity, evolvability, and adaptability but is vulnerable to co-option.",
      "section": "Hierarchical organisation in living systems",
      "topic": "Morphogenesis and Plasticity",
      "chunk_summary": "Morphogenesis exhibits targeted plasticity, achieving consistent outcomes despite variations, and is susceptible to top-down modulation due to its hierarchical information-processing architecture.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Biological manipulation involves bypassing host safeguards while minimizing detection, exploiting core processes and blurring self/non-self boundaries. Manipulators utilize existing networks and cellular plasticity.  Mimicry involves producing or appropriating host molecules and structures to evade detection. Examples include cancer cells adopting platelet-like signatures, rove beetles acquiring ant hydrocarbons, and vaccinia virus mimicking a host NF-kB inhibitor. Trophoblast cells exemplify integrated mimicry, manipulating maternal tissues without rejection through endothelial and structural mimicry, activating endothelial transcription factors and producing proteins like VE-cadherin.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Mimicry",
      "chunk_summary": "Biological manipulators employ mimicry, imitating host molecules and structures to evade detection and integrate into host processes, exemplified by cancer cells, rove beetles, and trophoblast cells.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Direct interference involves disrupting host systems through molecular interactions. Pseudomonas syringae injects effectors to block immune receptors, while HCMV's US28 protein acts as a constitutively active GPCR, dysregulating host cells. Epigenetic reprogramming induces heritable changes, with cancer cells reprogramming stromal cells and viruses silencing tumor suppressor genes. Signal molecule degradation and physical barrier disruption are also employed. Streptococcus pyogenes cleaves host proteins, while Plasmodium falciparum restructures erythrocyte membranes, and cancer cells degrade the ECM. Direct disruption is often combined with immunosuppression and mimicry to avoid detection.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Direct Interference",
      "chunk_summary": "Manipulators use direct interference, disrupting host systems through molecular interactions, epigenetic reprogramming, signal degradation, and barrier disruption, often combined with other tactics to avoid detection.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Homeostatic reset involves overriding normal limits. Homeostatic systems maintain parameters through negative feedback loops. Extreme deviations trigger inflammation, a physiological 'circuit breaker' suspending regulatory constraints and enabling tissue remodeling and reprogramming.  Manipulators exploit this, establishing new setpoints. Trophoblast cells initiate inflammation during implantation, overriding vascular homeostasis and then transitioning to an immunomodulatory role. Multiple pathways initiate inflammation, including membrane potential changes, calcium waves, metabolic stress, and mechanical disruption. Cancer cells leverage inflammation to override tissue homeostasis, establishing altered metabolic and immune setpoints and creating a supportive niche.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Homeostatic Reset",
      "chunk_summary": "Manipulators override homeostatic controls by inducing inflammation, a 'circuit breaker' suspending normal regulation and allowing new setpoints to be established, exemplified by trophoblast cells and cancer.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The evolutionary arms race has driven complex regulatory network development. Hosts evolve overlapping control mechanisms, while manipulators bypass these barriers. This co-evolution has shaped control architectures, from redundant signaling to neural circuits. Differentiating self-initiated actions from external influences was crucial for self-regulation and agency evolution. Immune evasion and suppression are key. PRRs form the first line of defense. Mycobacterium tuberculosis modifies surface lipids and interferes with receptor signaling. Adaptive immune barriers are overcome by Trypanosomes' antigenic variation and cancer cells' reprogramming of macrophages, MHC downregulation, and immunosuppressive factor release. Trophoblast cells demonstrate immune tolerance through HLA-G expression, PDL1/PDL2 expression, and immunosuppressive factor secretion.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Immune Evasion and Suppression",
      "chunk_summary": "The co-evolution of hosts and manipulators has driven complex immune evasion strategies, from PRR evasion to adaptive immune reprogramming and immune tolerance mechanisms.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The neural system is a prime target for manipulation due to its integrative role. The jewel wasp injects venom into the cockroach's central complex, inducing paralysis and hypokinesia. Sacculina carcini establishes a parallel regulatory system, modulating neural signaling and host behavior. Ophiocordyceps unilateralis infiltrates ant tissues, overriding the circadian clock and controlling movements. Toxoplasma gondii manipulates host behavior through dopamine elevation, potentially increasing predation risk. Cancers manipulate neural systems for survival, secreting neurotrophic factors and responding to neuropeptides. Neural hijackers exploit existing neurotransmitters and circuit nodes, bridging neural signals with other systemic networks.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Neural System Manipulation",
      "chunk_summary": "Neural systems are manipulated through various strategies, including venom injection, parallel regulatory systems, circadian clock override, and neurotransmitter exploitation, affecting host behavior and physiology.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The endocrine system is targeted due to its role in coordinating organism-wide responses. Manipulators produce hormone analogues, alter production and reception, or hijack developmental programs. Wolbachia feminizes isopods by suppressing AGH. Pseudomonas syringae synthesizes coronatine, mimicking JA-Ile and compromising plant defenses.  The trophoblast secretes hormones reprogramming maternal physiology, increasing fetal glucose, enhancing blood flow, and modifying immune responses. It elevates estrogen and progesterone, fostering maternal care. Placental CRH creates a positive feedback loop, timing labor onset. Endocrine manipulation's effectiveness stems from hormones amplifying signals, leveraging feedback loops, and integrating with other regulatory systems.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Endocrine System Manipulation",
      "chunk_summary": "Endocrine manipulation involves altering hormone signaling to reprogram host physiology, exemplified by Wolbachia, Pseudomonas syringae, and the trophoblast's influence on maternal systems.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The metabolic system is targeted for its role in resource allocation. Manipulators override nutrient sensing, reprogram metabolic networks, and establish privileged access. Cancer cells activate mTOR signaling and suppress AMPK, enabling growth under nutrient-limited conditions. Toxoplasma gondii reprograms host cell metabolism, altering oxidative states and mitochondrial function. Striga hermonthica establishes vascular connections for direct nutrient access, while trophoblasts remodel maternal arteries for enhanced blood flow. Metabolic manipulations often operate in tandem with modifications to other regulatory networks, ensuring stable resource redirection.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Metabolic System Manipulation",
      "chunk_summary": "Metabolic manipulation involves overriding nutrient sensing, reprogramming metabolic networks, and establishing privileged resource access, exemplified by cancer cells, Toxoplasma gondii, and Striga hermonthica.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Manipulators exploit developmental plasticity by reactivating silenced programs or hijacking active pathways. Phytoplasmas' SAP54 protein interferes with floral development, transforming flowers into leaf-like structures. The trophoblast reactivates developmental programs in maternal arteries, enabling vessel remodeling. Cancer cells revive EMT programs for invasiveness and reactivate neural crest-associated programs for migration. Developmental manipulation involves coordinated activation of multiple pathways, suggesting potential therapeutic strategies in regenerative medicine and cancer interventions.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Developmental Reactivation",
      "chunk_summary": "Manipulators exploit developmental plasticity by reactivating silenced programs or hijacking active pathways, exemplified by phytoplasmas, the trophoblast, and cancer cells.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Manipulators coordinate interventions across multiple networks, overwhelming compensatory responses. Cotesia congregata exemplifies multi-level manipulation in caterpillars, injecting eggs, venom, teratocytes, and a bracovirus. The bracovirus suppresses the immune response and arrests pupation. Venom synergizes with the bracovirus. Larvae feed on haemolymph and induce a cytokine storm, triggering sickness behavior and altering host behavior. Teratocytes manipulate host development, modulate the immune system, and alter metabolism. This multi-component strategy achieves precise temporal control, converting the caterpillar into a 'nursery'.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Integration: Multi-System Attack",
      "chunk_summary": "Successful manipulators, like the wasp Cotesia congregata, employ integrated multi-system attacks, coordinating interventions across immune, neuroendocrine, metabolic, and developmental networks for precise control.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Plant gall formation by insects demonstrates morphogenetic competency. Aphids transform plant tissues into galls providing shelter and nutrition.  They deliver effectors inducing cell proliferation and reprogramming gene expression. They upregulate nutrient transport genes and suppress photosynthetic pathways, creating a feeding site.  They secrete effectors altering plant developmental programs, like the BICYCLE protein family. Gall formation requires sustained defense suppression. Galls display specialized architectures regulating internal conditions. The consistent morphology within each aphid species demonstrates precise multi-system manipulation.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Integration: Multi-System Attack",
      "chunk_summary": "Aphid-induced gall formation exemplifies integrated manipulation, involving targeted reprogramming of plant gene expression, nutrient redirection, defense suppression, and specialized architecture creation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Successful biological manipulation involves six essential steps: 1) Breach and anchor: Intruders bypass barriers, like Plasmodium falciparum breaching erythrocyte membranes or manipulators degrading basement membranes. 2) Disguise as self: Manipulators mimic host components to evade surveillance, like cancer cells adopting osteoblast-like phenotypes. 3) Shatter homeostatic controls: Manipulators disrupt homeostasis, inducing inflammation and resetting setpoints. 4) Seize communication: Manipulators disrupt, mimic, or establish new communication channels, rewiring pathways, hijacking control nodes, or modifying feedback loops. 5) Engineer physical space: Manipulators remodel the ECM and tissue architecture, creating supportive niches. 6) Establish long-term control: Manipulators implement lasting changes, including epigenetic modifications or genome integration.",
      "section": "Mechanisms of biological hijacking",
      "topic": "Unified Model of Hijacking Principles",
      "chunk_summary": "Biological hijacking involves six steps: breaching barriers, disguising as self, shattering homeostasis, seizing communication, engineering physical space, and establishing long-term control.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Insights from biological manipulation can guide engineered interventions to steer diseased tissues towards healthier states. The first step involves breaking persistent pathological states by creating defined windows of plasticity, mirroring natural developmental transitions. Moderate acute inflammation can prompt setpoint re-evaluation without extensive damage.  Once destabilized, tissues must be steered towards desirable endpoints during the brief window of plasticity. Reprogramming requires carefully timed signals guiding cells into the desired identity, potentially achieved through sensing modules, inducible circuits, or timed-release vehicles. Manipulating the ECM, cell-cell communication, and metabolic flows consolidates these transitions.",
      "section": "Engineered interventions inspired by natural manipulation",
      "topic": "Engineered Interventions",
      "chunk_summary": "Engineered interventions can leverage natural manipulation principles, starting with inducing transient plasticity through controlled disruption and then guiding tissues towards desired endpoints with carefully timed signals.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The final step is establishing new regulatory baselines that persist after initial triggers are withdrawn. This involves epigenetic modulation, adjusting long-range signaling, or reconfiguring resource flows to stabilize altered tissue identities and immune profiles.  Successful manipulators coordinate interventions across multiple levels, harnessing plasticity to re-evaluate setpoints. Engineered interventions could mimic this, inducing local inflammation, reprogramming cell identity, and re-establishing vascular or neural patterns.  Research should focus on developing tools for each stage, including responsive gene circuits, dynamic scaffolds, controlled spatial and temporal interventions, robust sensors, and tools for editing chromatin states.",
      "section": "Engineered interventions inspired by natural manipulation",
      "topic": "Engineered Interventions",
      "chunk_summary": "Engineered interventions should aim for lasting internal reconfiguration by establishing new regulatory baselines, mimicking natural manipulators' multi-level coordination and utilizing tools like responsive gene circuits and dynamic scaffolds.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Comprehensive data sets capturing biological complexity are needed to identify targets and reprogramming strategies. Spatial and temporal maps of gene expression, epigenetic profiles, electrical activity, proteomes, mechanical features, and cell-cell signaling are crucial. Single-cell and spatial transcriptomics, advanced proteomics and metabolomics, and in vivo imaging are vital. Machine learning and computational modeling can integrate these data, identifying regulatory constraints, potential pathways, and how alterations at one scale affect higher-level organization. Predictive models simulating tissue responses enable intervention design with minimal trial and error. Developing mechanistic models and quantitative predictions is essential to guide experimental validation.",
      "section": "Engineered interventions inspired by natural manipulation",
      "topic": "Data and Modeling",
      "chunk_summary": "Comprehensive data sets and computational modeling are crucial for identifying intervention targets and developing predictive models to guide engineered interventions and experimental validation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Hierarchical regulatory networks maintaining homeostasis have intrinsic vulnerabilities exploited by self-defecting and foreign agents. Intruders hijack conserved signaling pathways through mimicry, interference, and feedback loop reprogramming. Transient plasticity induction is critical, with manipulators perturbing setpoints to establish self-reinforcing states. Interactions among immune, neural, endocrine, and metabolic systems are central to disruption and reprogramming.  Understanding biological manipulation provides a blueprint for engineered interventions, inducing transient plasticity, rewiring networks, and resetting setpoints to reverse pathology, restore regeneration, and re-establish stable tissue function.",
      "section": "Conclusions",
      "topic": "Biological Manipulation and Engineered Interventions",
      "chunk_summary": "Understanding how intruders exploit vulnerabilities in hierarchical regulatory networks, induce plasticity, and reprogram systems provides a blueprint for engineered interventions to restore healthy tissue function.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "M.L. acknowledges support from Eugene Jhong and Grant 62212 from the John Templeton Foundation. The opinions expressed are those of the author and do not reflect the views of the John Templeton Foundation.",
      "section": "Acknowledgements",
      "topic": "Funding",
      "chunk_summary": "Michael Levin acknowledges funding support and clarifies that the views expressed are his own.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "E.V.S. and M.L. co-developed the idea, conducted the literature search, and co-led the writing. All authors contributed to revisions and approved the final manuscript.",
      "section": "Author contributions",
      "topic": "Authorship",
      "chunk_summary": "Evgeniya Shmeleva and Michael Levin co-developed the idea, conducted research, and led the writing, with all authors contributing to revisions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This section lists the references cited throughout the paper, providing details on the sources used to support the arguments and findings presented.",
      "section": "References",
      "topic": "Citations",
      "chunk_summary": "The references section lists the sources cited in the paper.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_132206.pdf",
      "original_filename": "pdf_20250803_124126_132206_extracted_text.txt",
      "authors": "[\"Evgenia V. Shmeleva\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:14:38.885258"
}