{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_091928_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_091928.pdf",
    "file_size": 41942,
    "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
    "journal": "Philosophical Transactions B",
    "doi": "10.1098/rstb.2019.0750",
    "year": "2021",
    "title": "Refaming cognition: getting down to biological basics",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "The cognitive sciences should adopt the approach of other life sciences by starting with the simplest organisms displaying the phenomenon of interest, identifying principles from observed patterns, and scaling up to more complex organisms to observe similarities and differences. This approach, called basal cognition, recognizes the deep evolutionary inheritance of cognitive behavior in both unicellular and multicellular organisms.  This theme issue aims to demonstrate that a biologically realistic recognition of this inheritance will make currently incomprehensible data more understandable. Evidence suggests that cognitive concepts like sensing, memory, learning, communication, and decision-making apply non-metaphorically to bacteria, indicating similar behavior in unicellular eukaryotes and a molecular infrastructure for capacities typically associated with brains predating neurons and central nervous systems.",
      "section": "Introduction",
      "topic": "Basal Cognition Approach",
      "chunk_summary": "The cognitive sciences should study cognition by starting with simple organisms and scaling up, recognizing the deep evolutionary inheritance of cognitive behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "Recent advances in neurobiology and neuroscience, including sophisticated imaging techniques, genetic manipulation, and CRISPR, have provided detailed information about brain activity. However, understanding how brain activity generates behavior remains a challenge.  Even with the complete connectome of C. elegans, the mechanism of behavior generation is still unknown. The US Brain Initiative and its partners aim to develop tools for understanding real-time decision-making behavior, but new models and theories applicable to a wider range of cognitive agents, including aneural organisms and synthetic forms, are needed. Studying simpler organisms is crucial for developing these new theories.",
      "section": "Introduction",
      "topic": "Limitations of Current Neuroscience",
      "chunk_summary": "Despite advances in neuroscience, understanding the link between brain activity and behavior remains a challenge, requiring new models and theories from simpler organisms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "In 1980, Koshland argued for studying bacterial behavior, particularly chemotaxis, as simple models for neuronal properties and mechanisms.  However, it wasn't until MacKinnon's work on potassium ion channels in bacteria that the significance of ion channels in prokaryotes became clear.  MacKinnon's research, which led to a Nobel Prize, revealed the surprising similarity between bacterial and fruit fly potassium channels.  S端el's research on Bacillus subtilis biofilms further validated Koshland's proposal, demonstrating that potassium ion channels facilitate long-distance communication in biofilms, similar to their role in neurons.",
      "section": "Ion channels: a proof-of-concept case study",
      "topic": "Ion Channels in Bacteria",
      "chunk_summary": "Research on bacterial potassium ion channels, notably by MacKinnon and S端el, revealed their role in long-distance communication, similar to their function in neurons.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "S端el's research on Bacillus subtilis biofilms revealed complex behaviors mediated by ion channels. Nutrient-deprived cells in the biofilm interior send bioelectrical distress signals to peripheral cells, causing them to stop feeding and allowing nutrients to diffuse inward. This creates oscillations between peripheral growth and stasis, resolving the conflict between peripheral cells providing protection and interior cells needing nutrients.  Furthermore, electrical signaling enables separate biofilms to synchronize growth dynamics and share scarce nutrients by switching between in-phase and anti-phase oscillations, effectively time-sharing resources and increasing growth under nutrient-limited conditions.",
      "section": "Ion channels: a proof-of-concept case study",
      "topic": "Biofilm Communication and Cooperation",
      "chunk_summary": "B. subtilis biofilms use electrical signaling for intercellular communication, coordinating nutrient sharing and resolving conflicts between cell populations.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "S端el's group discovered that metabolic stress in B. subtilis biofilms is transmitted via potassium waves, regulating membrane potential similar to neurons in the mammalian brain. This behavior resembles cortical spreading depression, suggesting a possible evolutionary link between electrical signaling in bacterial biofilms and information processing in mammalian brains.  Additionally, they found that biofilm cells can form ion channel-mediated memories, even encoding complex patterns like a logo, with light-exposed cells responding in anti-phase to unexposed cells. This memory persists for hours and is robust to ionic perturbations, suggesting a parallel between bacterial and neuronal memory encoding through membrane potential changes.",
      "section": "Ion channels: a proof-of-concept case study",
      "topic": "Memory and Information Processing in Biofilms",
      "chunk_summary": "B. subtilis biofilms exhibit memory formation through membrane potential changes, analogous to neuronal memory, and transmit metabolic stress via potassium waves, similar to mammalian brains.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "The discovery of memory encoding in B. subtilis biofilms has implications for biological computing. Light exposure can reliably encode information into living matter, and the anti-phase response enables a clear \"on\" or \"off\" signal like digital memory. This suggests new membrane potential-based approaches in synthetic biology and a bacterial paradigm for memory-capable biological systems. The delayed recognition of the similarities between ion channel function in bacteria and neurons, due to disciplinary silos, highlights the importance of shifting perspectives and recognizing the potential of simpler organisms as models for complex processes.",
      "section": "Ion channels: a proof-of-concept case study",
      "topic": "Biological Computing and Synthetic Biology",
      "chunk_summary": "The memory capabilities of B. subtilis biofilms offer potential for biological computing and synthetic biology, demonstrating the importance of studying simpler organisms.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "Darwin's theory of evolution provided a foundation for a cognitive theory based on the gradation of mental powers and capacities from simpler to more complex organisms.  Inspired by Darwin, 19th-century scientists studied microbial behavior, with Binet claiming that most psychical faculties attributed to animals also belonged to microorganisms. Early 20th-century comparative psychology textbooks started with amoeba and progressed to mammals, including humans. However, this research declined due to limitations in imaging technology, World War I, the rise of behaviorism, and the vitalism debate.",
      "section": "Reviving a dormant Darwinian program",
      "topic": "Darwinian Perspective on Cognition",
      "chunk_summary": "Darwin's evolutionary theory inspired early research on microbial behavior and a comparative approach to psychology, recognizing a gradation of cognitive abilities across species.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "The Cognitive Revolution of the late 20th century was slow to embrace a biological perspective, with the prevailing view that cognition requires a nervous system. However, the Human Genome Project, comparative genomics, and advanced imaging tools have forced reassessments of cognition and the CNS.  Research on planaria revealed that a significant portion of nervous system-related genes are shared with organisms lacking nervous systems, like Arabidopsis and yeast, suggesting these genes predate the nervous system and were later recruited for its development.  This finding highlights the importance of expanding the range of organisms studied for cognitive processes.",
      "section": "Reviving a dormant Darwinian program",
      "topic": "Evolution of Nervous Systems and Cognition",
      "chunk_summary": "The discovery of nervous system-related genes in organisms without nervous systems suggests these genes predate the nervous system and were later co-opted, challenging the view that cognition requires a nervous system.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    },
    {
      "text": "New findings in diverse fields like microbiology, zoology, botany, biophysics, and others reveal interesting behavior in aneural organisms and tissues.  However, without a connecting framework, this research remains isolated within specialist fields. Basal cognition research aims to develop this framework, bringing together disparate sectors of life sciences to address fundamental questions in biology beyond just the cognitive sciences.  This approach could lead to novel applications, such as training tissues for regenerative medicine, by extending cognitive science tools to unconventional embodiments.",
      "section": "Reviving a dormant Darwinian program",
      "topic": "Basal Cognition as a Unifying Framework",
      "chunk_summary": "Basal cognition research provides a unifying framework for connecting diverse research areas studying behavior in various organisms, potentially leading to novel applications like tissue training for regenerative medicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_091928.pdf",
      "original_filename": "pdf_20250803_124126_091928_extracted_text.txt",
      "authors": "[\"Pamela Lyon\", \"Fred Arendt\", \"Michael Levin\"]",
      "year": "2021",
      "journal": "Philosophical Transactions B",
      "doi": "10.1098/rstb.2019.0750"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:08:10.139388"
}