{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_788638_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_788638.pdf",
    "file_size": 34001,
    "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
    "journal": "Life Metabolism",
    "doi": "10.1093/lifemeta/load031",
    "year": "2024",
    "title": "The energetics of cellular life transitions",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Major life transitions are always difficult because change costs energy. Recent findings have demonstrated how mitochondrial oxidative phosphorylation (OxPhos) defects increase the energetic cost of living and that excessive integrated stress response (ISR) signaling may prevent cellular identity transitions during development. In this perspective, we discuss general bioenergetic principles of life transitions and the costly molecular processes involved in reprogramming the cellular hardware/software as cells shift identity. The energetic cost of cellular differentiation has not been directly quantified, representing a gap in knowledge. We propose that the ISR is an energetic checkpoint evolved to (i) prevent OxPhos-deficient cells from engaging in excessively costly transitions and (ii) allow ISR-positive cells to recruit systemic energetic resources by signaling via GDF15 and the brain.",
      "section": "Abstract",
      "topic": "Bioenergetics of life transitions",
      "chunk_summary": "Life transitions are energetically costly, and the integrated stress response (ISR) may act as a checkpoint to prevent OxPhos-deficient cells from undergoing excessively costly transitions while allowing ISR-positive cells to recruit systemic resources.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Life transitions and identity changes are always difficult. This principle applies across levels of complexity: molecules rearrange or break down via endergonic chemical reactions, pluripotent cells transition from a stem-like state into a terminally differentiated identity, and complex conscious organisms are forced to transition from one developmental life stage to another. The difficulty with transitions likely emerges from the activation energy barriers that must be overcome to achieve change. In the same way that many enzymes require activation energy (e.g., ATP, NAD(P)H, and others) to power the molecular transition of substrate A into product B, the human mind and body require inputting energy to power all meaningful life transitions. For instance, major life transitions such as moving into a new home or changing one's social relationship(s) all come with some degree of uncontrollability, leading to psychobiological stress. The neuroendocrine stress responses engendered by the resulting uncomfortable psychological states consume considerable amounts of energy. As a result, major life and organismal transitions must be energetically costly.",
      "section": "Introduction",
      "topic": "Energetic cost of transitions",
      "chunk_summary": "Life transitions across all levels of complexity require energy input to overcome activation energy barriers, similar to enzymatic reactions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "The most energetically costly period of human life—where whole-body energy expenditure normalized per unit of body mass is the highest—is between ages 1 and 15. This period is replete with changes as the infant develops an identity as a child and later transitions into adolescence and adulthood. Over this critical life stage, the body undergoes phases of rapid growth and biomass accumulation, as well as pruning and establishing billions of neural connections. In parallel, major psychobiological changes must occur as personality and the ego or \\\"I\\\" develop, occurring alongside life-defining anatomical, physiological, and hormonal changes. Interestingly, this costly developmental transition through adolescence is marked by the highest risk of onset for mental health disorders. The individual vulnerability around this period of high energy demand suggests that competing demands for limited energetic resources could interfere with developmental processes, resilience, and health. Below, we focus our discussion on life transitions at the cellular level. Similar to human life transitions, cellular maturation and identity changes operate under the same principles and face similar challenges. But, cellular transitions occur at a scale amenable to the scientific scalpel of molecular biology and the precise mechanistic dissection it affords. Thus, understanding the energetic principles that guide these processes may yield new insights into the energetic forces and molecular pathways that monitor and constrain differentiation.",
      "section": "Introduction",
      "topic": "Human development and energy",
      "chunk_summary": "The period between ages 1 and 15 is the most energetically demanding in human life, coinciding with significant developmental transitions and increased vulnerability to mental health disorders.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "One of the hallmarks of multicellular organisms is that the activity of individual cells is harnessed toward broader organismal goals. This includes creating complex anatomical structures and morphologies (i.e., morphospace). Starting from the fertilized egg, all descendants of that cell must differentiate, migrate, and cooperate with each other to eventually reach the possible region with configurations that correspond to the normal species-specific anatomy. Yet, after differentiation, cells keep changing and adapting in response to environmental cues. They are constantly actively monitoring their state, computing errors from their final position and function, and working to reduce those errors. These energy-consuming actions require reprogrammability.",
      "section": "Introduction",
      "topic": "Cellular transitions and reprogrammability",
      "chunk_summary": "Multicellular organisms require cells to differentiate, adapt, and reprogram in response to environmental cues, which are energy-consuming processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "While genomes encode the specific hardware that each cell has access to (via the proteins specified by the DNA sequence and chromatin state), the behavior of each cell and the cell collective is driven by the physiological software that supervenes on the hardware. Note that the hardware-software analogy used here and in synthetic bioengineering and evolutionary developmental biology refers not to the anthropomorphic origin of some (but no longer all) software but rather refers to the fact that the exact same hardware (genomically determined cellular components) can give rise to numerous different outcomes. Just like the same physical computer hardware can run or execute vastly different software (text processing, video streaming, etc.). A cell's hardware includes the proteins encoded by the sequences of its genome that are epigenetically \\\"open\\\" and active or \\\"closed\\\" and repressed, plus the complex set of organelles, proteins, and molecules it contains at any given time. The cell's software includes the program(s) executed by the hardware, which comprise biomechanical, bioelectrical, and transcriptional dynamics.",
      "section": "Introduction",
      "topic": "Cellular hardware and software",
      "chunk_summary": "Cellular behavior is driven by physiological \"software\" acting on genomic \"hardware,\" allowing for diverse outcomes from the same components.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "On the scale of individual cells, differentiation from stem cells to specific fates involves decisions that shape the hardware and the subsequent activity and responses, which is seen in transcriptional, translational, and biophysical states. For example, each active gene comes at a substantial energetic cost. The hardware of a differentiating cell is altered by actively repressing and silencing specific genes, while others are opened and transcribed. This gives rise to new proteins that must be energetically synthesized (4 ATP molecules per amino acid), while others are actively degraded or secreted. The cell's software is also reprogrammed by increasing or decreasing the resting plasma membrane potential, tweaking connections to surrounding cells, migrating, reconfiguring cytoplasmic constituents, and other non-random changes. Thus, as cell fate transitions change a cell's molecular identity—as well as its role within the organism—it requires widespread energy input to reprogram both the cellular hardware and software. As a result, reprogramming and cell fate transitions may represent one of the most stressful and energetically costly events that a cell has to go through.",
      "section": "Results",
      "topic": "Cellular differentiation and energy cost",
      "chunk_summary": "Cellular differentiation involves energetically costly reprogramming of both cellular \"hardware\" (gene expression, protein synthesis) and \"software\" (biophysical states, cell communication).",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "As introduced above, stress responses necessarily cost energy. The term \\\"stress\\\" refers to any type of response that catalyzes change within a complex system, such as a transition from state Y to Z (e.g., resting to activated). Stress is often caused by external \\\"stressors\\\" that force a cell or organism to adapt and change its state. But stress is also triggered by internal processes, like a developmental trajectory that requires a cell to shift identity or by the accumulation of damage during aging. Importantly, the costs of stress and other processes are generally cumulative. This means that the energy required to power hardware/software reprogramming during cellular transitions must come on top of what is required at baseline to prevent entropy and sustain life. Thus, while a developing cell naturally expends energy to maintain integrity, it also must deploy energetically expensive molecular processes required to shift its identity toward its terminal state, adding to the energetic cost of life.",
      "section": "Discussion",
      "topic": "Stress and energy allocation",
      "chunk_summary": "Stress responses are energetically costly and add to the baseline energy requirements of cells, particularly during developmental transitions.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "But, living systems possess a finite capacity to transform energy. The interplay of limited energetic capacity with the competing demands of molecular processes leads to energy constraints both within cells and organisms. The limited energy budget means that not all cellular or physiological systems can be turned on at the same time. Moreover, some transformations are also not compatible and must be separated in time (e.g., catabolic and anabolic pathways). Therefore, by necessity and to preserve efficiency in a given physiological context, one state must be dominant over other ones. Consequently, an evolutionarily-driven hierarchy of energy needs dictates which molecular system is prioritized over another one. For example, cells must prioritize the maintenance of vital membrane potential through ion pumps, and of protein synthesis by ribosomes, over the more acutely dispensable DNA and RNA synthesis by polymerases. Similarly, at the scale of the mammalian body, blood flow to the so-called \\\"vital\\\" organs such as the brain, heart, liver, and kidneys is prioritized over digestive and connective tissues, particularly in times of (real or perceived) stress. Energy is a vital resource, distributed sparingly and economically between and within living cells.",
      "section": "Discussion",
      "topic": "Energy constraints and prioritization",
      "chunk_summary": "Limited energy capacity leads to prioritization of essential cellular processes over less critical ones, driven by an evolutionarily determined hierarchy of needs.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Aerobic mammalian cells derive most of their usable energy from the oxidative phosphorylation (OxPhos) system within mitochondria. The OxPhos system pulls and reacts hydrocarbon-derived electrons with oxygen to build a transmembrane charge that powers ATP synthesis. For this reason, mitochondria naturally play a permissive role in sustaining life and enabling all psychobiological life transitions. By producing ATP on demand—that is, when ATP is hydrolyzed into ADP and inorganic phosphate—mitochondria essentially \\\"keep the lights on\\\", enabling life's vital operations. But an important question is whether beyond its permissive role, energy transformation by mitochondrial OxPhos also plays an instructive role in shaping major cellular transitions, including differentiation from a stem-like precursor cell type to a terminally differentiated state.",
      "section": "Discussion",
      "topic": "Mitochondria and energy in cell fate transitions",
      "chunk_summary": "Mitochondria play a permissive role in sustaining life through OxPhos, but their instructive role in cellular transitions remains a key question.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "It is well recognized that by controlling apoptosis, mitochondria dictate the ultimate death transition. We also know that terminal cell differentiation across cell lineages and contexts acutely depends on and is even temporally controlled by mitochondrial redox and metabolite signaling, fusion-fission dynamics, and energetics. Thus, mitochondria unequivocally play an instructive role in contributing to fuel and regulate stressful cellular identity transitions. However, one major outstanding question has persisted around the molecular mechanisms through which mitochondrial OxPhos defects are transduced to the nucleus, via so-called \\\"retrograde signaling\\\". We recently reported that primary human fibroblasts with OxPhos defects—which exhibit nuclear stress responses—expend up to twice as much energy to stay alive under resting conditions. OxPhos defects increase the cost of living, or energy expenditure, likely through multiple cellular, tissue-level, and physiological stress response mechanisms that promote hypermetabolism. Similarly, glucocorticoid signaling alone (which is not intrinsically damaging) in primary fibroblasts also induces an \\\"anticipatory\\\" stress response that increases cellular energy expenditure by ~60%. Based on the economy of cellular energy outlined above, the cost of stress responses may expectedly conflict with the energetic requirements of differentiation, as observed in patient-derived induced pluripotent stem cells where OxPhos defects interfered with cellular differentiation. How are the competing energetic demands of responding to intrinsically stressful OxPhos defects reconciled with the energetic requirements of cell fate transition? Might energetic stress responses and cell fate transitions be incompatible? If they are incompatible, might this explain developmental failure and pathogenesis in animal models of OxPhos defects and patients with mitochondrial diseases?",
      "section": "Discussion",
      "topic": "Mitochondrial OxPhos defects and stress response",
      "chunk_summary": "Mitochondrial OxPhos defects increase the energetic cost of living and trigger stress responses, potentially conflicting with the energy demands of cell fate transitions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Recent research combining cell-type-specific genetic mitochondrial lesions, small-molecule inhibitors, and single-cell resolution mapping of cellular states in mice sheds light on the intersection of mitochondrial OxPhos defects and developmental cell fate transition. In the study by Han et al., pulmonary alveolar cells with a defect in the mitochondrial OxPhos complex I subunit NADH dehydrogenase (ubiquinone) iron-sulfur protein 2 (Ndufs2) failed to transition toward their terminal identity, ultimately leading to respiratory failure and death. Importantly, transitioning cells employ a molecular mechanism acting as a checkpoint that inhibits a specific cell fate transition required for survival. This work raises several significant questions discussed below.",
      "section": "Discussion",
      "topic": "ISR in mouse lung development",
      "chunk_summary": "A study on mouse lung development revealed that OxPhos defects can prevent cell fate transitions, leading to respiratory failure and death, highlighting the role of a molecular checkpoint mechanism.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "In a healthy lung, a population of partially committed alveolar epithelial stem cells (AT2) transitions to alveolar epithelial type 1 (AT1) cells, which transfer oxygen from the air and carbon dioxide from the blood to support respiration. Perturbing mitochondrial OxPhos complex I in this cell lineage prevented AT2 cells from acquiring their terminal AT1 identity. Importantly, complex I deficiency did not prevent cellular transition by promoting stemness but rather by triggering a shift toward a \\\"transitional\\\" state somewhere between the AT2 and AT1 cellular states. The differentiation failure was neither driven by forced quiescence nor senescence, as OxPhos-deficient lungs had increased expression of the proliferation marker Ki67, although the transitional cell population was mildly positive for the senescence marker cyclin-dependent kinase inhibitor p21 (Cdkn1a). As transitional states involve extensive hardware and software remodeling, the \\\"identity crisis\\\" of transitional cells must bear substantial energetic costs to the cell. However, reliable data quantifying the energetic costs of cell fate transitions appear to be lacking in the literature, representing a major gap in knowledge. Nevertheless, cells naturally strive to acquire energetically \\\"stable\\\" or optimal states. Under physiological conditions, driven by energy constraints, very few cells exist in such \\\"unstable\\\" and likely costly transitional states. This is confirmed by single-cell RNA sequencing datasets where transitional cells are rare (<1%) occurrences. Nevertheless, both in developing lung tissue and in injured lungs, naturally occurring transitional cells upregulate a key transcriptional stress pathway called the integrated stress response (ISR). Thus, during normal development, transitional cells show evidence of stress in general and activation of ISR in particular.",
      "section": "Results",
      "topic": "ISR and cell fate transitions in lung development",
      "chunk_summary": "OxPhos defects in lung epithelial cells prevent terminal differentiation by trapping cells in an energetically costly \"transitional\" state, characterized by ISR activation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "The ISR, sometimes referred to as the mitochondrial ISR (ISRmt), is an evolutionarily conserved intracellular signaling network triggered in response to several environmental and cell-intrinsic stressors, including but not limited to nutrient deprivation, infections, misfolded proteins, and oxidative stresses. Upon stress signaling, phosphorylation of the translation initiation factor 2 (eIF2) signals through CHOP [CCAAT/enhancer binding protein (C/EBP) homology protein] (Ddit3) and activating transcription factors Atf4 and Atf5 to upregulate the expression of several downstream genes. Other stress signal transduction cascades may also converge on the ISR. The epistatic network of relationships among ISR genes is still being uncovered in different species and cell types.",
      "section": "Discussion",
      "topic": "Mitochondrial ISR",
      "chunk_summary": "The ISR is an evolutionarily conserved stress response pathway activated by various stressors, involving eIF2 phosphorylation and downstream gene regulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "One of the best-described ISR targets, growth differentiation factor 15 (GDF15), is transcribed and secreted into the extracellular space, making its way into the bloodstream to exert broad systemic signaling effects. GDF15 concentration is elevated in the blood of patients with OxPhos defects, in the media of cultured cells with genetic or pharmacological OxPhos defects, as well as under other metabolically challenging situations including pregnancy and starvation—making GDF15 a putative general marker of \\\"energetic stress\\\". Another ISR target, fibroblast growth factor 21 (FGF21), is also systemically upregulated in human and animal mitochondrial OxPhos defects, where it contributes to systemic ISR signaling. The ISR-GDF15 axis appears to act as a metabolic stress signaling network, which among other roles may exist to inform the brain of energetic/redox stress among somatic tissues. Yet, the factors by which mitochondrial OxPhos defects engage the ISR in vivo, in different tissues and cell types, remain to be fully elucidated. In mice, the ISR is triggered in affected tissues by mitochondrial OxPhos defects. However, different OxPhos defects can trigger the ISR through different mechanisms. In addition, non-OxPhos mitochondrial stressors can also induce the ISR, including misfolded proteins in the mitochondrial matrix and iron deficiency via the mitochondrial death ligand signal enhancer 1 (DELE1), indicating that several triggers and molecular pathways act upstream of the mitochondrial ISR.",
      "section": "Discussion",
      "topic": "GDF15 and systemic ISR signaling",
      "chunk_summary": "GDF15, a target of the ISR, acts as a systemic marker of energetic stress, potentially signaling to the brain about metabolic challenges in peripheral tissues.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "In the recent study of the developing mouse lung, deleting Ndufs2 in transitional epithelial cells triggered robust ISR activation, monitored by the expression of ~120 genes including Gdf15. Most of these genes were induced at levels above the expression levels naturally induced in healthy transitional lung epithelial cells, suggesting that the OxPhos defects tapped into the same pathway. However, in this case, the OxPhos defects amplified this pathway to a point where the ISR became maladaptive or pathological. Both genetic and pharmacological OxPhos defects reliably activate Gdf15 expression in mammalian cells, including in primary human fibroblasts. Interestingly, pathological ISR activation in the developing lung was not driven by ATP deficiency. Rather, it was triggered by reductive stress, reflected by an increased NADH/NAD+ ratio, which is a natural consequence of mitochondrial complex I deficiency. With normal OxPhos function, NADH donates its electron to complex I, oxidizing it back to NAD+. It was previously shown in myoblasts that oxidizing cytosolic NADH to NAD+ is sufficient to prevent ISR activation in complex I-deficient cells. Recent work also confirmed that selectively inducing NADH reductive stress, without OxPhos deficiency, is sufficient to activate the ISR. Han et al. extended these findings to the in vivo developing lung as they demonstrated that alleviating reductive stress by enzymatically oxidizing NADH prevented pathological alveolar ISR activation, thereby normalizing lung development. Complex I-deficient mice protected from cytoplasmic reductive stress by overexpression of the yeast NADH dehydrogenase Ndi1 developed normally for up to 25 months. In the context of monitoring costly cellular transitions, the NADH/NAD+ ratio is naturally a major driving force. The cellular energy landscape required to sustain stressful and costly transitions involves not only the phosphorylation potential (ATP/ADP/AMP) that powers several enzymatic reactions but also the redox potential (NADH/NAD+) that powers and regulates perhaps an equal, if not larger, number of molecular transitions. The central dependence of so many reactions on NAD(P)H/NAD(P)+ ratio may account for why it has evolved—perhaps preferentially in some cell types as a sufficient and perhaps most potent trigger of the ISR.",
      "section": "Results",
      "topic": "Reductive stress and ISR activation",
      "chunk_summary": "Reductive stress, indicated by an increased NADH/NAD+ ratio, is a key trigger of ISR activation in the context of OxPhos defects, and alleviating this stress can normalize lung development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Whereas some of the triggers of the ISR are relatively well defined in some contexts, what have remained less well established are the functional consequences of the ISR. Why did the ISR evolve? And what role does the ISR play in normal development and physiology, and in the pathophysiology of primary mitochondrial disorders and other diseases? Below, we summarize three possible, non-mutually exclusive interpretations.",
      "section": "Discussion",
      "topic": "Physiological roles of ISR",
      "chunk_summary": "The functional consequences of ISR activation and its role in normal physiology and disease remain to be fully elucidated.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "The first and simplest interpretation is that the ISR is mostly activated under pathological conditions, playing little role in normal physiology. Several in vitro and in vivo studies have shown that primary disease-causing mitochondrial OxPhos defects activate the ISR, establishing that the ISR is active in non-homeostatic metabolic environments. Upregulated under pathological conditions, the ISR places affected cells into a pro-survival state, likely as an attempt to re-establish cellular homeostasis. Non-essential and costly cellular processes are put on hold (e.g., initial ISR-dependent inhibition of translation), while pro-survival essential processes are upregulated. Direct support for the view that the ISR is \\\"pathological\\\" comes from the demonstration that inhibiting the ISR in the presence of the OxPhos complex I defects increases survival. In lung epithelial cells, ISR activation contributes to pathophysiology and mortality. By serving as an inflexible cellular checkpoint, ISR activation in OxPhos-deficient developing alveolar epithelial cells appears to prevent the transition of AT2 cells into AT1 cells, without which the lung is not functional, and animals are not viable.",
      "section": "Discussion",
      "topic": "ISR as pathology",
      "chunk_summary": "One interpretation is that ISR activation is primarily a pathological response to non-homeostatic conditions, promoting cell survival but potentially hindering essential developmental transitions.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "A second related developmental proposition is that robust ISR activation evolved to prevent energetically compromised cells from engaging in excessively costly cell fate transitions. Initiating an energetically challenging transition without the assurance that sufficient resources are present could result in cell death, compromising animal survival. This is supported by the complete inhibition of AT2-to-AT1 transition in ISR-induced Ndufs2 knockout cells. Normal developmental or regenerative transitions induce the ISR, but at lower levels that do not inhibit AT2-to-AT1 transitions. In this case, the ISR may be triggered to prevent costly cellular commitment that could be fatal, and therefore detrimental to the organism. This dual role of ISR upregulation in cellular differentiation was also demonstrated in a model of a rare genetic skeletal disorder, in which endoplasmic reticulum (ER) stress upregulated the ISR in hypertrophic chondrocytes. Also, in this model, ISR-positive cells survived but transitioned back into a \\\"juvenile\\\" state. Importantly, Atf4 was also expressed during normal (embryonic) development in differentiating chondrocytes. Inhibiting the ISR rescued skeletal abnormalities but had no impact on normal development of healthy (wild-type) mice. These findings suggest that the ISR may be normally upregulated by default during development, possibly as a way of heightening the cell's sensitivity to potential energetic stress. Supporting this view, other studies suggest that the ISR is activated preceding energetically demanding cellular expansion in activated T lymphocytes. Iron deficiency can also trigger the ISR. Whether stressors other than OxPhos also trigger the ISR to inhibit cell fate transitions remains unclear. More work is needed to understand the role of ISR activation during normal cellular differentiation and embryonic development.",
      "section": "Discussion",
      "topic": "ISR as developmental checkpoint",
      "chunk_summary": "Another interpretation posits that ISR acts as a developmental checkpoint, preventing energetically compromised cells from undergoing potentially fatal cell fate transitions.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Let us remember that all mammalian nuclear programs and signaling pathways, including the ISR, must have evolved to optimize the fitness of the organism. The organism, not single cells, is the ultimate unit of natural selection. Therefore, we likely will approach the most accurate physiological interpretation of the ISR if we manage to understand its effects beyond the confine of the cell, in the context of the organism. The third potential interpretation is that the ISR is a cellular-level sensor evolved to inform the organism of somatic energetic stress. In animals, ISR-mediated GDF15 secretion from affected tissues, including skeletal muscles and adipocytes appears to contribute to accelerating physiological processes, increasing whole-body energy expenditure. OxPhos-deficient cells produce GDF15 that elevates the rate of energy transformation across the whole organism and likely plays other roles related to energy balance. Intuitively, cells with energy production defects would be expected to adopt or deploy energy conservation strategies. However, as noted above, mitochondrial OxPhos defects increase energy expenditure to produce a state of cellular hypermetabolism. In fact, OxPhos defects cause hyperactive physiology at multiple levels: OxPhos-deficient individuals secrete more catecholamines, have higher resting heart rate, grow more capillaries around OxPhos-deficient myofibers, and produce exaggerated cardiovascular and ventilatory responses to mild physical challenges. Collectively, we can understand these hyperkinetic responses as mechanisms that cooperate to increase energy delivery to OxPhos-deficient, ISR-positive cells, which behave and signal as if energy starved.",
      "section": "Discussion",
      "topic": "ISR as brain-body signaling",
      "chunk_summary": "A third interpretation suggests that ISR acts as a cellular sensor, informing the organism about somatic energetic stress through GDF15 secretion and triggering systemic responses to increase energy availability.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Based on these facts, we reason that the physiological purpose of these ISR-driven hyperactive systems is to ensure the availability of energy resources (oxygen, carbon substrates) to all cells within the organism. The brain plays a major role in ensuring that cells and organs cooperate toward the same goal—the survival of the organism. Thus, the brain naturally harbors the cognate GDF15 receptor GFRAL (GDNF family receptor α-like), allowing it to sense circulating GDF15, a major endocrine output of the ISR. In mice, GDF15 also appears to recruit the glucose-releasing and hyperglycemia-promoting hormone corticosterone, further mobilizing energetic resources to fuel energy-starved ISR-positive and GDF15-secreting cells and tissues. Thus, cells may use the ISR gene program and its secreted products to call in additional energetic resources from surrounding cells and organs to support them through challenging transitional times. But in OxPhos-deficient cells, the ISR appears permanently activated, the chronicity of which likely contributes to the pathological effects of the ISR. The true function of the ISR is likely a dynamic combination of these propositions, expressed differently depending on the developmental context, cell type, stress exposure, and metabolic state of the organism.",
      "section": "Discussion",
      "topic": "Brain's role in ISR signaling",
      "chunk_summary": "The brain, through its GDF15 receptor GFRAL, senses systemic energetic stress and mobilizes resources to support energy-starved cells, but chronic ISR activation in OxPhos-deficient cells can be pathological.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Life transitions are inherently \\\"stressful\\\" because they cost energy. OxPhos defects appear to increase the cost of life in cells, animals, and people. This likely occurs because cells that contain OxPhos-deficient mitochondria must bend their metabolism and behaviors out of shape, forced to induce and utilize less optimal metabolic strategies to survive. But in turn, the costly compensations that actively push them away from their optimal bioenergetic state require activating compensatory stress response pathways. These include but are not limited to the ISR. The ISR itself triggers costly genetic programs leading to metabokine protein synthesis, secretion, cell-cell signaling, and even somato-cognitive (i.e., body-brain) signaling that conveys systemic energetic distress to the brain. Recent research shows that in the context of mitochondrial complex I-related OxPhos defects, the ISR can interfere with and prevent stressful cell fate transitions in mouse lung epithelial cells, resulting in death. Building on previous and recent work, the new findings cement the notion that reductive stress (elevated NADH/NAD+ ratio) is a necessary and sufficient ISR trigger in this in vivo context. Importantly, we also learn that normal developmental cell fate transitions involve ISR activation, suggesting that the ISR is a physiologically meaningful rheostat of stress signaling induced as part of normal, albeit challenging, cellular life transitions.",
      "section": "Conclusion",
      "topic": "ISR and energetic cost of life transitions",
      "chunk_summary": "OxPhos defects increase the energetic cost of life and trigger compensatory stress responses, including ISR, which can interfere with cell fate transitions but also plays a role in normal development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Each cell must operate as an information processing system monitoring its capacity to engage in costly life transitions. The new single-cell molecular details around ISR biology, interpreted through the lens of an economy of energy, suggests that the ISR is a central circuit of the cellular and mitochondrial information processing system that weighs bioenergetic demand and supply. But several questions arise. Does the ISR play the same \\\"checkpoint\\\" role in all cell types, across species? At the scale of an individual, do stressful and energetically costly lifespan psychobiological transitions also trigger the ISR or other energy monitoring pathways to steer the organism toward the most optimal path to adaptation? Can our understanding of ISR biology be harnessed to assist cells and individuals in reaching their full developmental and health potential? Mitochondrial stress signaling is a burgeoning field replete with inspiring questions heavy with health implications. Addressing these questions across scales of complexity—from organelle to organism—requires that we integrate molecular energy sensing mechanisms within the brain-body and psychobiological systems that shape development and aging trajectories. Increasingly precise technologies and versatile approaches to probe stress responses across time and space make this a particularly exciting time for biology. Our ability to leverage new technologies informed by bioenergetic principles promises to produce increasingly more accurate models of health and development.",
      "section": "Conclusion",
      "topic": "Future directions in ISR research",
      "chunk_summary": "Further research is needed to understand the role of ISR as a bioenergetic checkpoint across different cell types and organisms, and its potential for improving health and development.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "The authors are grateful to the members of the Mitochondrial Psychobiology Laboratory for stimulating discussions, and to Brett Kaufman for comments on this manuscript. The author's research was supported by grants from the NIH (R01MH119336, R01MH122706, R01AG066828, and RF1AG076821), the Wharton Fund, and the Baszucki Brain Research Fund to M.P. M.L. gratefully acknowledges support from the Templeton World Charity Foundation (TWCF0606) and the Bill and Melinda Gates Foundation.",
      "section": "Acknowledgements",
      "topic": "Funding and acknowledgements",
      "chunk_summary": "The authors acknowledge funding support and contributions from various individuals and organizations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "A.S.M. and M.P. drafted the manuscript. M.L. revised and edited the manuscript.",
      "section": "Author contributions",
      "topic": "Authorship",
      "chunk_summary": "The authors' contributions to the manuscript are outlined.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "The authors declare that no conflict of interest exists.",
      "section": "Conflict of interest",
      "topic": "Conflict of interest",
      "chunk_summary": "The authors declare no conflict of interest.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    },
    {
      "text": "Wang C, Tan Z, Niu B et al. Inhibiting the integrated stress response pathway prevents aberrant chondrocyte differentiation thereby alleviating chondrodysplasia. eLife 2018;7:e37673. Scheu S, Stetson DB, Reinhardt RL et al. Activation of the integrated stress response during T helper cell differentiation. Nat Immunol 2006;7:644–51. Chen JJ, Zhang S. Heme-regulated eIF2α kinase in erythropoiesis and hemoglobinopathies. Blood 2019;134:1697–707. Ost M, Igual Gil C, Coleman V et al. Muscle-derived GDF15 drives diurnal anorexia and systemic metabolic remodeling during mitochondrial stress. EMBO Rep 2020;21:e48804. Miyake M, Zhang J, Yasue A et al. Integrated stress response regulates GDF15 secretion from adipocytes, preferentially suppresses appetite for a high-fat diet and improves obesity. iScience 2021;24:103448. Choi MJ, Jung SB, Lee SE et al. An adipocyte-specific defect in oxidative phosphorylation increases systemic energy expenditure and protects against diet-induced obesity in mouse models. Diabetologia 2020;63:837–52. Taivassalo T, Ayyad K, Haller RG. Increased capillaries in mitochondrial myopathy: implications for the regulation of oxygen delivery. Brain 2012;135:53–61. Taivassalo T, Jensen TD, Kennaway N et al. The spectrum of exercise tolerance in mitochondrial myopathies: a study of 40 patients. Brain 2003;126:413–23. Mullican SE, Lin-Schmidt X, Chin CN et al. GFRAL is the receptor for GDF15 and the ligand promotes weight loss in mice and nonhuman primates. Nat Med 2017;23:1150–7. Cimino I, Kim H, Tung YCL et al. Activation of the hypothalamic-pituitary-adrenal axis by exogenous and endogenous GDF15. Proc Natl Acad Sci 2021;118:e2106868118. Yang H, Pegoraro AF, Han Y et al. Configurational fingerprints of multicellular living systems. Proc Natl Acad Sci USA 2021;118:e2109168118. Picard M, Shirihai OS. Mitochondrial signal transduction. Cell Metab 2022;34:1620–53.",
      "section": "References",
      "topic": "Citations",
      "chunk_summary": "References cited throughout the paper are listed.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_788638.pdf",
      "original_filename": "pdf_20250803_124126_788638_extracted_text.txt",
      "authors": "[\"Anna S. Monzel\", \"Michael Levin\", \"Martin Picard\"]",
      "year": "2024",
      "journal": "Life Metabolism",
      "doi": "10.1093/lifemeta/load031"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:26:11.152785"
}