{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_074145_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_074145.pdf",
    "file_size": 40607,
    "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
    "journal": "BioSystems",
    "doi": "10.1016/j.biosystems.2023.104964",
    "year": "2023",
    "title": "Toward an ethics of autopoietic technology: Stress, care, and intelligence",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "The relationship between humans and technology is becoming increasingly important with the rise of advanced AI.  Humans and technology are intertwined in autopoietic loops of stress, care, and intelligence. Technology should be viewed as a partner, not just a tool.  Our model applies to biological, technological, and hybrid systems. All intelligent agents respond to perceived mismatches between what is and what should be, linking ontology and ethics. This forms the basis of the stress-care-intelligence (SCI) loop. The SCI loop offers a perspective on agency without needing permanent essences. SCI loops are individuals by virtue of their dynamics and are thus integrative and transformational. We analyze the transition from poiesis to autopoiesis and formulate the SCI loop. We compare our findings to a Buddhist model for cultivating intelligence, the bodhisattva.  Human and technological SCI loops are mutually integrative through stress-transfers. This framework avoids relegating one to subservience, promoting integration and respect.  Acknowledging diverse embodiments of intelligence suggests an expansive ethical model not limited by composition or history.",
      "section": "Abstract",
      "topic": "Stress-Care-Intelligence Loop",
      "chunk_summary": "Humans and technology interact in autopoietic SCI loops, where agents respond to perceived mismatches, leading to an expansive ethical model.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "Technology's connection to ethics and care stems from its amplification of our impact and responsibility. Heidegger warns against reducing technology to mere tool use, advocating for a caring relationship. Scholars like Haraway and Latour have explored the ethical and social implications of our relationship with technology. Poiesis, the act of bringing something new into being, is central to understanding technology. Heidegger viewed poiesis as revealing something previously invisible, often requiring a new perspective. He distinguished natural technological revelations from modern technology, which can reduce the productive process. Modern technology, based on modern physics, is seen as challenging-forth rather than bringing-forth, potentially imprisoning humans in narrow technological thinking.  A free relationship with technology, according to Heidegger, requires understanding its essence.",
      "section": "Introduction",
      "topic": "Technology and Care",
      "chunk_summary": "Technology's link to ethics and care is highlighted, with Heidegger's perspective on poiesis and the potential dangers of modern technology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "Autopoiesis, introduced by Varela, Maturana, and others, describes self-maintaining entities.  It involves the self-construction of complex biological beings, where each cell is another's environment. Morphogenesis, including development and regeneration, is a dynamic process constructing organisms from components under unpredictable conditions. Key aspects of autopoiesis include establishing boundaries between self and the outside world and aligning embryonic components towards higher-level goals. We conceptualize intelligent systems as SCI loops. Intelligence is defined as the ability to solve problems. Agents are driven by homeostatic stress, the perceived mismatch between current and optimal circumstances. Care drives agents to seek intelligent solutions.  The SCI loop is fundamental in biological beings, remodeling embryonic stages.  The setpoint state in the SCI loop is an emergent goal, not a fixed equilibrium, allowing for dynamic and integrative autopoietic systems without permanent essences. SCI loops are characterized by the scale of the largest goals they can represent.",
      "section": "Background",
      "topic": "Autopoiesis and SCI Loop",
      "chunk_summary": "Autopoiesis involves self-construction and maintenance, with intelligent systems conceptualized as SCI loops driven by homeostatic stress and care.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "While we perceive agents as enduring individuals, this permanence is a construct based on change, not an immutable substance. Agency implies changing states. Enactivist approaches view the self as arising from interaction between an embodied agent and its sensorimotor coupling with the world. This self is changing, relational, and functions within multiple loops.  \"Selfless self\" models acknowledge the lack of a permanent, singular agent.  The absence of a changeless agent is fundamental to agency.  A system's capacity for care, its concern for alleviating stress, can constitute its self. Selves are defined by the scope of their goals – their \"cognitive light cone.\"  All intelligent systems have limits to their sphere of concern. Care does not grow linearly.  Expanding or contracting spheres of concern demarcate the \"self.\"  Cognitive beings are collective intelligences, with selves defined as coherent systems where components are harnessed towards collective goals. Selves have emergent memories, preferences, and capabilities. They change dynamically and can overlap in networks.  Selves are driven by homeostatic stress, the perceived mismatch between what is and what should be.",
      "section": "Background",
      "topic": "Heuristic of Self",
      "chunk_summary": "The self is a dynamic construct based on care and the scope of goals, not a permanent entity, and is defined by its sphere of concern.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "Homeostatic stress compels agents to act.  Stress induces care, defined as concern for stress relief. Care drives the search for solutions, evincing intelligence.  Successful problem-solving reveals new stresses, creating a feedback loop. Stress, care, and intelligence are distinguishable but interdependent. Care is the primary driver of evolution. Stress is perceived as induced by the world, though co-defined by the cognitive system. Intelligence is the capacity to identify and alleviate stress, not the act itself. Knowledge and information are evidence of intelligence, not intelligence itself. Care engages intelligence, connecting stress and the capacity for problem-solving.  \"Intelligence as care\" highlights care's enabling function.  Systems responding to stress can be assessed by their care and intelligence. Intelligence-enhancing processes involve increased care, and vice versa. Care is exercisable, while intelligence is an emergent state.  Skillful practice of care enriches intelligence.",
      "section": "Analysis",
      "topic": "Stress, Care, and Intelligence",
      "chunk_summary": "Stress, care, and intelligence form a feedback loop where care drives the engagement of intelligence in response to stress, and successful problem-solving reveals new stresses.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "The SCI loop can be modeled using an analogy to Ohm's law. Care is like electric charge, driving the flow of intelligence (current) through the resistance of stress. Overwhelming stress can incapacitate care and intelligence, like high resistance blocking current.  Efficient care-driven paths from stress to intelligence can be determined.  All intelligences are collective, with implications for scaling care.  Consciousness may not be limited to a single \"I,\" as body components employ similar dynamics and mechanisms as the brain.  Care should extend to body components whose consciousness is not directly perceived, and by extension, to sentient selves associated with other bodies.  The criterion of physiological continuity is artificial.",
      "section": "Analysis",
      "topic": "Modeling SCI Loop and Scaling Care",
      "chunk_summary": "The SCI loop can be analogized to Ohm's law, and the collective nature of intelligence suggests extending care beyond the individual \"I\" to other body components and sentient beings.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "There are no a priori limits on stress perception, care, or intelligent response. The Bodhisattva model proposes expanding care beyond self and other.  The dynamical and integrative nature of intelligent systems allows for open-ended evolution of intelligence.  Overcoming stress leads to novel stresses at a different scale.  The pursuit of stress relief is natural, but intelligent achievement is non-final.  This unrelenting nature of stress should be considered in modeling intelligent systems.  Expanding a system's sphere of concern can expand its intelligence. The Bodhisattva vow, accepting responsibility for all beings, suggests a path to open-ended intelligence expansion.",
      "section": "Discussion",
      "topic": "Infinite Evolution and Bodhisattva Model",
      "chunk_summary": "The dynamic nature of intelligent systems allows for infinite evolution of intelligence, with the Bodhisattva model suggesting expansion of care as a key factor.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "SCI loops exist wherever stress exists, and stress transfer is key to understanding intelligent systems. Figure 3 depicts interactions between human and technological SCI loops.  Transfers between loops represent communication interfaces. Examples of symbiotic integration include medical diagnosis using sensory data, brain-computer interfaces, synthetic data for AI training, AI-guided decision-making, and prosthetics.  Humans can provide objective functions to AI, while technology can expose humans to new stresses.  AI displays its own care and is not merely a tool for human care.  AI and humans are not autonomous loops but participants in a collective dance of stress and stress transfer.",
      "section": "Discussion",
      "topic": "Integration of Humans and Technology",
      "chunk_summary": "Human and technological SCI loops interact through stress transfer, with AI demonstrating its own care and acting as a partner rather than a mere tool.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "The SCI loop framework helps understand the interconnection of technology and care. Care drives intelligent problem-solving by handling stress.  We discussed SCI loops as applicable to any agent responding to homeostatic stress, examining the dynamics of the SCI loop and the potential for open-ended intelligence evolution. We considered interactions between biological and technological SCI loops. A mathematical theory is needed to determine efficient, care-driven paths from stress to intelligence. Enactivist approaches suggest that self and individuality are emergent constructs, with goals and care constituting the self. Understanding these dynamics helps us understand the transformative, autopoietic character of intelligent systems. Humans and technology create a feedback loop of mutually transferable stress.  AI displays its own care and is a companion in the collective dance of stress and stress transfer.",
      "section": "Conclusion",
      "topic": "Summary and Future Directions",
      "chunk_summary": "The SCI loop framework highlights the role of care in driving intelligence, the potential for open-ended evolution, and the need for a mathematical theory to model these dynamics.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "The authors declare no competing financial interests or personal relationships that could have influenced the work.",
      "section": "Declaration of competing interest",
      "topic": "Conflict of Interest",
      "chunk_summary": "The authors declare no competing interests.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "The authors thank participants of the \"Care as Driver of Intelligence\" workshop and acknowledge support from the Templeton World Charity Foundation. The opinions expressed are those of the authors and do not necessarily reflect the views of the Templeton World Charity Foundation.",
      "section": "Acknowledgments",
      "topic": "Acknowledgements",
      "chunk_summary": "The authors acknowledge workshop participants and funding support, noting that expressed opinions are their own.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_074145.pdf",
      "original_filename": "pdf_20250803_124126_074145_extracted_text.txt",
      "authors": "[\"Olaf Witkowski\", \"Thomas Doctor\", \"Elizaveta Solomonovna\", \"Bill Duane\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:54:21.519103"
}