{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/pdf_20250803_124125_270122_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_270122.pdf",
    "file_size": 98347,
    "authors": "Unknown",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "pdf_20250803_124125_270122",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "What is the latent space of possible functional morphologies that cells, with a wild-type genome, can be coaxed to construct? This question drives at the heart of fundamental issues in evolutionary, developmental, cell, and synthetic biology, and has been taken up by a rapidly growing field focusing on building new kinds of active living structures: biobots. This emerging multidisciplinary effort to control the behavior of cellular collectives has garnered much excitement for two main reasons. First, it offers the possibility of using engineering to reach outcomes that are too complex to micromanage directly, and hence promises to revolutionize efforts to produce complex tissues for clinical applications in regenerative medicine and beyond. Second, increased control over the morphology and behavior of cellular collectives by leveraging morphogenetic tissue plasticity could enable the development of self-constructing living structures by design with predictable and programmable functional properties and numerous practical uses, greatly extending the current abilities of traditional fabrication practices in diverse fields as robotics, architecture, sustainable construction, and even space exploration.",
      "section": "Introduction",
      "topic": "Biobots and morphogenetic plasticity",
      "chunk_summary": "The field of biobots aims to control cellular collectives to create complex tissues and self-constructing living structures with programmable functions, impacting regenerative medicine and various engineering fields.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "In the last decade, interest in developing biological structures de novo has seen a rapid surge. Among these efforts, a subset of functional biogenic assemblies gave rise to a special class of motile synthetic structures dubbed biobots. Early examples of biobots are hybrids between biological cells and inert chemical substances supporting them, such as gels or 3D-printed scaffolds. These assemblies incorporated living cells ranging from bacteria to diverse mammalian tissues such as nerve, muscle, and neuromuscular junctions (NMJs), as well as engineered cell lines with programmable features, all carefully crafted into diverse 3D scaffolds designed to harness and amplify the innate functionality of biological cells.",
      "section": "Introduction",
      "topic": "Early biobot development",
      "chunk_summary": "Early biobots were created by combining living cells with inert scaffolds to harness and amplify cellular functions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A different approach resulted in Xenobots, the first fully-biological biobots created by sculpting or molding amphibian embryonic cells into multicellular structures that can spontaneously locomote without external pacing. But it was not known how general these phenomena are, whether this kind of plasticity extended to mammals, or what the throughput of this technology can be. Thus, we sought to address whether the capacity of genetically unaltered cells to generate a self-propelled, multicellular living structure in this way is unique to amphibian embryonic cells, and whether such a living structure can be built without needing to be individually sculpted or molded, but instead coaxed to self-construct from an initial seed cell, resulting in a high-throughput process wherein large numbers of biobots can be grown in parallel.",
      "section": "Introduction",
      "topic": "Xenobots and research motivation",
      "chunk_summary": "Xenobots, the first fully biological biobots, raised questions about the generality of cellular plasticity and the scalability of biobot construction, motivating research on self-constructing mammalian biobots.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Here, we introduce novel, multicellular, fully biological, self-constructing, motile living structures created out of human lung epithelium. We refer to them as Anthrobots, in light of their human origin and potential as a biorobotics platform. We quantified their emergent natural, baseline properties as an essential background characterization of their native capacities which will serve as targets for future efforts to reprogram form and function for useful purposes. Anthrobots self-construct in vitro, via a fully scalable method that requires no external form-giving machinery, manual sculpting, or embryonic tissues and produces swarms of biobots in parallel. They move via cilia-driven propulsion, living for 45–60 days. We quantitatively characterized the range of movement and morphological types, showing that their behaviors are strongly correlated with specific features of their anatomy. The ability of adult, somatic, human cells to form a novel functional anatomy, with unique behaviors, reveals that this plasticity is not restricted to amphibian or embryonic cell properties, and is a fundamental feature of wild-type cells that requires no direct genetic manipulation to unlock. Furthermore, we found that Anthrobots exhibit a highly surprising behavior given their origin as static airway epithelium: they can move across scratches in (human) neuronal monolayers and induce gap closures across these scratches. Numerous in vitro and in vivo uses of such functional living structures can be envisioned, especially because they can now be made from the patient's own cells.",
      "section": "Introduction",
      "topic": "Anthrobots and their capabilities",
      "chunk_summary": "Anthrobots, self-constructing biobots made from human lung epithelium, demonstrate the plasticity of adult human cells to form novel functional anatomies and exhibit surprising behaviors like moving across and closing gaps in neuronal monolayers.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "We developed the Anthrobots by leveraging normal human bronchial epithelial (NHBE) cells' native tissue plasticity and unlocked a novel morphology, which is not apparent from the reliable, default developmental patterning of airway epithelium, in order to fulfil target functional and structural needs of creating a self-constructing, multi-cellular, 3D, motile living structure of human-origin. Airway organoids with apical out tissue organization, yielding ciliated spheroids anatomically similar to the Anthrobots, have very recently been shown using different protocols, each starting from individual normal bronchial epithelial cells isolated from airway epithelium extracts. Apical out spheroids made out of intact airway epithelium extracts have also been produced. Each one of these three protocols is optimized for different priorities such as ease of organoid access during its development, structural uniformity in final products, and ability to easily modulate resulting organoid size. The common denominator between these parallel advances is that they are characterized as organotypic cultures exclusively, enabling scientists to investigate lung anatomy, function, and pathology. Beyond native tissue recapitulation, these constructs' abilities as functional assemblies, range of behavioral and morphological patterns, as well as functional correlations between these patterns have yet to be explored.",
      "section": "Introduction",
      "topic": "Development and comparison of Anthrobot protocols",
      "chunk_summary": "The Anthrobot protocol leverages NHBE cell plasticity to create cilia-out spheroids, differing from previous airway organoid protocols in its focus on functional assembly, behavior, and morphology, rather than just tissue recapitulation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "These three methods, plus the one detailed in this paper, constitute convergent but distinct technical approaches toward producing the novel morphology of cilia-out spheroids derived from human airway epithelium. These four protocols for creating cilia-covered NHBE-derived spheroids differ in their apical orientation from the earlier established approaches for creating traditional airway organoids where cilia develop as lining the lumen. Boecking & Walentek grow airway organoids as embedded in a collagen-rich matrix (as opposed to the traditional Matrigel approach) and also cultures them in air-liquid-interface (ALI) inserts, which have traditionally been used with NHBEs for 2D differentiation into airway epithelium, enabling ease of access to the airway organoids during their developmental course. After this initial ALI culture period of 14 days, the mature airway organoids are dissolved from the collagen matrix and re-plated into a fresh same matrix of similar composition (to remove catabolites) for another 14 days. It is in this second 14 day period that cilia localization on the surface is accomplished by administering R-Spondin-2 (RSPO2) and Noggin into the matrix. Accordingly, this Boecking & Walentek method consists of two consecutive 2-week periods of matrix-embedded growth and differentiation: first period without and the second period with RSPO2&Noggin.",
      "section": "Introduction",
      "topic": "Comparison of cilia-out spheroid protocols",
      "chunk_summary": "Four distinct protocols, including the Anthrobot method, produce cilia-out spheroids from NHBEs, differing in apical orientation from traditional airway organoids and utilizing various matrices and growth factors.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The method introduced in our paper is most similar to the Boecking & Walentek method in that the initial proliferation of individual NHBEs into spheroids with cilia-lined lumen is accomplished by culturing them as embedded in a gel-based matrix. However, in our method, upon dissolution of spheroids from matrix at the end of this 14 day period, the cilia-in spheroids are not plated back into the matrix, and instead, the cilia localization into the spheroid cortex is achieved by culturing these spheroids in low-adhesive environments. Accordingly, cilia localization is observed within one week, making our method a faster (20 days between single cell to cilia-coated spheroid as opposed to 28), less laborious (single matrix dissolution, as opposed to two), and potentially higher-throughput (since each time matrix is dissolved, a certain percentage of spheroids are lost with it, as is also reported by Boecking & Walentek). The remaining two cilia-out protocols (Stroulios and Wijesekara) are in contrast not leveraging the self-construction ability of NHBEs, and instead form spheroids by means of cell aggregation in U-bottom wells without the presence of a matrix, which in turn provide them with higher regularity of spheroid size (given each spheroid self-assembles with a similar number of constituent cells).",
      "section": "Introduction",
      "topic": "Advantages of the Anthrobot method",
      "chunk_summary": "The Anthrobot method is faster, less laborious, and potentially higher-throughput than the Boecking & Walentek method for creating cilia-out spheroids, achieving cilia localization in low-adhesive environments without re-plating, unlike Stroulios and Wijesekara methods which rely on cell aggregation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The Stroulios et al method aggregates single cells in low-adhesive micro aggregation chambers first, then transfers them into regular wells for differentiation in matrix-free liquid environment with bronchial epithelial differentiation medium, achieving uniformity in organoid morphology and size. Similarly, the Wijesekara et al method also first aggregates individual cells into spheroids, and then either transforms them into a matrix environment for differentiation, or keeps them in the liquid environment with bronchial epithelial differentiation medium, both approaches yielding apical-out spheroids with the ability to control the resulting ciliated spheroid size by modulating the initial aggregate size. In summary, our method facilitates differentiation as embedded in extracellular matrix, enabling spheroids to self-construct, a feature the other two methods Stroulios and Wijesekara lack; though in turn they achieve higher spheroid regularity and control over spheroid size. The major difference between our method and the Boecking & Walentek method is that upon extraction of apical-in spheroids from Matrigel, we simply culture the spheroids in a non-adhesive environment and achieve polarity reversal and motility within a few days. However, the Boecking & Walentek method replates the spheroids into the Matrigel for another two weeks, during which period they administer RSPO2&Noggin in order to facilitate polarity reversal, and at the end of this period they dissolve the Matrigel again to finally harvest the apical out spheroids. We believe our method provides a simple, rapid, scalable, and high-throughput protocol that harnesses biological cells' ability to build themselves into multicellular complex structures. Despite their differences in methods, goals, and characterization metrics, these four novel protocols taken together help explore the space of possible morphologies of NHBEs and unravel the morphogenetic potential of human airway epithelium; they are thus significant steps for mapping the morphogenetic plasticity landscape of non-embryonic wild-type cells.",
      "section": "Introduction",
      "topic": "Comparison of cilia-out spheroid protocols",
      "chunk_summary": "The Anthrobot method, unlike Stroulios and Wijesekara, allows for self-construction in a matrix, while differing from Boecking & Walentek by achieving polarity reversal and motility in a non-adhesive environment without re-plating, offering a simpler and faster approach to exploring NHBE morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To explore the self-organizing plasticity of morphogenesis without genomic change, we chose a cellular substrate in which such outcomes would be most surprising: adult, somatic, human airway tissues. To study and steer the in vitro morphogenesis of novel 3D tissues with motile appendages, we developed a novel protocol (Figure 1A) that builds upon the existing ability of human bronchial epithelial progenitor cells to form multicellular spheroids (Figure 1a.1) with cilia-lined lumina (i.e., apical-in configuration). We modified this process by manipulating the culture environment such that it now yields cilia-coated (i.e., apical-out) spheroids, which exhibit spontaneous locomotive ability.",
      "section": "Results",
      "topic": "Anthrobot production from human airway tissues",
      "chunk_summary": "A novel protocol was developed to create self-motile, cilia-coated (apical-out) spheroids from adult human airway tissues, modifying the existing process for generating apical-in spheroids.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A key step in their construction, in order to obtain significant translocation, is the induction of cilia to face outward. Given that cilia naturally localize into the lumen due to the basal cells' interaction with the surrounding high-viscosity matrix, we hypothesized that changing the culture environment to a lower viscosity level (e.g., water-based media instead of gel-based matrix) may trigger the basal layer cells to migrate inward and allow the apical layer to take their place on the spheroid cortex. Thus, to trigger apicobasal polarity switching, we first grew airway organoids embedded in Matrigel as reported previously (Figure 1a.2), which does not yield either ciliated or motile spheroids. We have then proceeded to dissolve the surrounding matrix while keeping the spheroids intact and transferred them into a low-adhesive environment (Figure 1a.3) and induced them with retinoic acid on a bidaily basis while performing media changes every 3 days. (Matrigel's elastic modulus is 450 Pa whereas water based liquid media's elastic modulus in this low-adhesive environment is 2*10⁻⁹ Pa). This new approach has enabled the originally apical-in spheroids (that show no motility on day 0 as shown on Figure 1b.1) to became motile by day 7 (Figure 1b.2), featuring highly motile ciliary appendages on the spheroid surface. A high-resolution high-speed capture of ciliary movement in Anthrobots (supplemental video 1) show that they deploy a similar propelling strategy observed in multiciliate motile organisms.",
      "section": "Results",
      "topic": "Inducing outward-facing cilia and motility",
      "chunk_summary": "Transferring apical-in spheroids from a high-viscosity matrix to a low-adhesive environment with retinoic acid induced apicobasal polarity switching, resulting in outward-facing cilia and motility by day 7.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "We next examined two aspects of the microenvironment as possible control parameters for properties of Anthrobot self-assembly. First, we tested the role of matrix viscosity, which is known in other bioengineering contexts to impact diverse cell properties, from secretory profile to mechanical attributes. We observed that culture environments with higher viscosity levels than the protocol baseline result in decreased motility (Figure S2, Supporting Information) and size (Figure S3, Supporting Information), suggesting that low-viscosity environments better facilitate the growth of functional bots as well as yield larger bots. Second, we examined cell seeding density as a factor for motility (Figure S4, Supporting Information) and size (Figure S5, Supporting Information). We set up three separate conditions: one with the default seeding density in Matrigel (x = 30 000 cells mL⁻¹), one with double this density (2x = 60 000 cells mL⁻¹), and one with half this default density (x/2 = 15 000 cells mL⁻¹). After growing the bots under these three conditions for two weeks, while keeping all other protocol aspects constant, we dissolved the mature spheroids from the matrices and measured their size immediately. We then continued culturing the bots per usual maintenance protocol and measured their motility in a binary fashion (i.e., displacing mover or not) during the period where bots show peak motility (between days 9–20) on a bidaily basis. In both experiments, we observed significant differences in the resulting bot sizes and motility (on particular days) among different seeding density conditions, though the effect of introducing additional cells was not linear at any time point tested. These results show that the size and time course of maturation of motile bots could be modulated by altering the concentration of cells in the Anthrobot differentiation culture, suggesting initial cell seeding density to be a tractable control knob for Anthrobot morphology and function.",
      "section": "Results",
      "topic": "Microenvironmental control of Anthrobot self-assembly",
      "chunk_summary": "Matrix viscosity and cell seeding density influence Anthrobot self-assembly, with lower viscosity promoting larger and more motile bots, and varying seeding densities affecting bot size and motility dynamics.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_270122.pdf",
      "original_filename": "pdf_20250803_124125_270122_extracted_text.txt",
      "authors": "Unknown",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-11T13:53:20.659617"
}