{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_975989_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_975989.pdf",
    "file_size": 148172,
    "authors": "[\"Michael Levin\", \"Richard Watson\"]",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Machines All the Way Up and Cognition All the Way Down: Updating the machine metaphor in biology",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Cell and developmental biology showcase collective intelligence and adaptive plasticity, yet molecular mechanisms are often interpreted using a machine metaphor. This creates a perceived conflict between mechanistic explanations and the goal-driven nature of living agents, leading to a debate between mechanist and organicist views. This paper argues for a \"cognition all the way down\" approach, proposing that organizational layers between genotype and phenotype exhibit problem-solving intelligence. It explores the limitations of current machine metaphors and suggests new ways to map formal concepts of machine and data to biology, aiming to unify evolutionary and developmental biology.",
      "section": "Abstract",
      "topic": "Cognition in biological systems",
      "chunk_summary": "The paper advocates for a \"cognition all the way down\" approach in biology, challenging traditional machine metaphors and highlighting the problem-solving intelligence of biological systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Despite advancements in molecular biology, predicting anatomical structure from genomic data remains a challenge. This gap hinders progress in regenerative medicine, where controlling large-scale form and function is crucial. The ultimate goal is an \"Anatomical Compiler\" to guide cells towards desired structures. This requires addressing fundamental questions in cell and developmental biology, particularly how molecular events scale up to create intelligent, adaptive agents. The paper argues that morphogenesis, as a collective intelligence solving problems in anatomical space, offers a valuable model system for understanding this scaling process.",
      "section": "Introduction",
      "topic": "Limitations of current biological models",
      "chunk_summary": "Predicting anatomical structure from genomic data is a major challenge, hindering regenerative medicine and requiring a deeper understanding of how molecular events scale up to create intelligent agents.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Two main paradigms dominate cell and developmental biology: mechanicism and organicism.  Mechanicism, the more popular view, sees life as a machine with dumb parts following local rules, often using concepts like cellular automata and emergence. While acknowledging the power of computational models, the authors argue that this bottom-up approach fails to explain the goal-driven nature of living agents. Organicists, on the other hand, emphasize the gulf between machines and the flexibility and self-grounding of living organisms, resisting the mechanization of life.",
      "section": "Introduction",
      "topic": "Mechanicism vs. Organicism",
      "chunk_summary": "The paper contrasts the dominant mechanistic view of life as a machine with the organicist perspective emphasizing the unique qualities of living organisms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The cognitive lens emphasizes a level in the system that represents beliefs, memories, and goals. However, it's limited by assuming only one level of intelligence at the top and natural selection as the sole programmer. This preserves a dualism between cognition and dumb parts, failing to resolve the agency-body problem. It also leads to debates about whether a system is mechanical or an agent, and doesn't explain the causal relationship between an agent's intentions and its physical substrate. The authors argue for \"cognition all the way down,\" where every level of organization exploits the agential nature of its components.",
      "section": "Introduction",
      "topic": "Limitations of the cognitive lens",
      "chunk_summary": "The traditional cognitive lens, while useful, is limited by its dualistic framing and the assumption of a single level of intelligence, necessitating a \"cognition all the way down\" approach.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The authors approach the problem from a naturalistic, anti-mysterianist perspective, emphasizing a broad view of explanations and a lack of privileged level of causation. They advocate for pluralism (polycomputing view), operationalism (formal analysis finds interaction protocols), and pragmatism (utility of views lies in their ability to drive research and enable new capabilities).  They define metaphors as tools evaluated by their empirical fecundity and ability to facilitate novel discovery, not by compatibility with prior categories.  All metaphors are wrong, but technology reflects successful conceptual gains, making it worthwhile to test concepts across fields.",
      "section": "Overview of our approach",
      "topic": "Philosophical approach",
      "chunk_summary": "The authors' philosophical approach is naturalistic, pluralistic, operationalist, and pragmatic, emphasizing the empirical fecundity of metaphors and their ability to drive research.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Cell and developmental biology study problem-solving competencies of molecular patterns, including the ability to navigate problem spaces and make errors. This agential material has agendas and competencies at multiple levels, from cells perceiving stimuli and learning to molecular networks exhibiting various forms of learning. It operates in multiple problem spaces, including gene expression, physiological states, and anatomical configurations. Life functions as a multiscale competency architecture with active agendas at each level, integrated towards larger-scale goals.",
      "section": "Agential material of life - a tour",
      "topic": "Multiscale competency architecture of life",
      "chunk_summary": "Living systems exhibit a multiscale competency architecture with problem-solving abilities at various levels, from cells to molecular networks.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A key feature of cell and developmental biology is the ability to build bodies, navigating anatomical morphospace reliably. This includes embryogenesis, regeneration, and metamorphosis. These processes exhibit pattern homeostasis, achieving reliable outcomes despite starting points.  Neither final shape nor regenerative ability can be predicted from genetic information alone. This is because form arises from closed-loop control with context-sensitive feedbacks, not a hardwired open-loop process. Examples include limb regeneration in axolotls and craniofacial remodeling in Xenopus laevis, demonstrating anatomical homeostasis and error correction.",
      "section": "The directiveness of organic activities: cybernetic properties of cellular collectives",
      "topic": "Anatomical morphospace navigation",
      "chunk_summary": "Morphogenesis is a closed-loop process driven by context-sensitive feedbacks, enabling reliable navigation of anatomical morphospace and error correction, not solely determined by genetic information.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Morphogenesis can be framed as the behavior of a collective intelligence navigating anatomical morphospace towards a target morphology. This goes beyond mere reliability and includes intelligent aspects like re-writable memory, as seen in planarian regeneration. Planaria can be reprogrammed to a 2-headed form via gap junctional communication, demonstrating bioelectrical memory storage. They can also store counterfactuals, latent bioelectrical patterns that influence future regeneration.  Deer antler regeneration exhibits trophic memory, storing information about damage location for months to guide future growth. These examples challenge the assumption that morphological memories are solely genetic.",
      "section": "The collective intelligence of morphogenesis",
      "topic": "Morphogenetic memory",
      "chunk_summary": "Morphogenesis exhibits intelligent features like re-writable memory, demonstrated by planarian head number reprogramming and deer antler trophic memory, challenging the genetic-centric view of morphological memory.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Morphogenetic systems also exhibit creative problem-solving, as seen in newt kidney tubule formation.  Polyploid newts with large cells adjust by using fewer cells or even a single cell bending to create the tubule, demonstrating the ability to achieve the same goal by different means.  Novel morphogenetic behaviors can be induced by external signals, like parasites prompting gall formation in plants, or by releasing cells from native instructive signals.  Liberated frog epithelial cells self-assemble into Xenobots with novel behaviors, while human tracheal cells form Anthrobots that repair neural tissues and become epigenetically younger. These examples highlight the plasticity of morphological shape and behavior.",
      "section": "The collective intelligence of morphogenesis",
      "topic": "Creative problem-solving in morphogenesis",
      "chunk_summary": "Morphogenetic systems demonstrate creative problem-solving by adapting to perturbations and achieving goals through different means, as seen in newt kidney tubule formation, gall formation, Xenobots, and Anthrobots.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric networks play a crucial role in morphogenesis, going beyond mere biophysics. All cells express ion channels and gap junctions, forming excitable media for bioelectric patterns. These patterns regulate cell behavior and contribute to organ size and location.  Crucially, bioelectric patterns serve as memory, storing anatomical setpoints. This contrasts with open-loop models of morphogenesis, offering a target for interventions.  Manipulating bioelectric prepatterns can induce ectopic eye formation or limb regeneration. Computational methods can guide ion channel activation to improve morphogenesis precision.",
      "section": "The bioelectric layer of developmental information",
      "topic": "Bioelectric patterns in morphogenesis",
      "chunk_summary": "Bioelectric patterns serve as memory, storing anatomical setpoints and enabling top-down control of morphogenesis, offering a target for interventions like inducing ectopic organs or improving precision.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The bioelectric layer implements key aspects of agential material: storing re-writable setpoints, providing top-down control, and enabling independence from genetic hardware.  Examples include reprogramming planarian head number, normalizing tumors, and repairing birth defects by altering bioelectric circuits, not the genome.  Genetically normal cells can form structures of other species, highlighting the insufficiency of genetic information alone.  Bioelectricity acts as cognitive glue, enabling coordination towards a whole, similar to its role in bacterial biofilms and neural networks.  It establishes an excitable medium for information patterns to interact and compete, as seen in the interplay between eye induction and normalization signals.",
      "section": "The bioelectric layer of developmental information",
      "topic": "Bioelectricity as cognitive glue",
      "chunk_summary": "Bioelectricity acts as cognitive glue, enabling re-writable memory, top-down control, and independence from genetic hardware, illustrated by examples of reprogramming, normalization, and repair through bioelectric manipulation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Cognitive models are important for understanding cellular networks. Cells exhibit learning and problem-solving, as seen in planaria adapting to barium exposure by developing barium-insensitive heads.  They rapidly identify and deploy transcriptional changes to resolve novel stressors, suggesting an informed problem-solving process.  Even biochemical substrates exhibit learning, with gene-regulatory networks capable of Pavlovian conditioning.  Living material comprises a multiscale competency architecture, with problem-solving at each level. Causal emergence analysis quantifies this, showing increased integration in gene regulatory networks during learning.",
      "section": "Below the cell level: cognition all the way down",
      "topic": "Learning and problem-solving in cells and below",
      "chunk_summary": "Cognitive abilities extend below the cellular level, with cells demonstrating learning and problem-solving, and even biochemical substrates exhibiting learning capacities like Pavlovian conditioning.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The computationalist approach, seeing life as a computer, offers advantages over simplistic machine metaphors. It incorporates software/hardware separation, program/data duality, multiple levels of abstraction, substrate independence, and top-down causes like algorithms and learning.  The software/hardware distinction explains how the same components can serve different functions, challenging the one-component-one-function assumption. Program/data duality is seen in DNA's role as both instructions and data. Multiple levels of abstraction are evident in biological organization, while substrate independence is demonstrated by multiple realizability of biological functions.",
      "section": "The machine metaphor: computationalist models of life and mind",
      "topic": "Computationalist approach to biology",
      "chunk_summary": "The computationalist approach, viewing life as a computer, offers valuable concepts like software/hardware separation, program/data duality, and substrate independence, providing a more nuanced understanding of biological systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Algorithms represent top-down causes, explaining how developmental programs orchestrate cell behavior.  Learning in computational systems, even without explicit programming, is analogous to biological adaptation.  However, computationalism has weaknesses. It seems artificial, lacking a natural basis for intelligence.  It also retains a dualistic view of bottom-up mechanisms vs. top-down agency, leading to debates about the role of agency in biology.  The mind-body problem persists, making it difficult to determine whether biological events are driven by physical necessity or agency.",
      "section": "The machine metaphor: computationalist models of life and mind",
      "topic": "Limitations of computationalism",
      "chunk_summary": "While computationalism offers valuable insights, it struggles with the artificial nature of computational intelligence and the dualism between bottom-up mechanisms and top-down agency, leading to unresolved questions about the role of agency in biology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Cognitivism naturalizes computational intelligence by applying computational concepts to cognitive science.  These principles extend beyond brains to all levels of biological organization.  Connectionist models, with simple computational units, can implement learning in various biological substrates.  Hebbian learning, a simple yet powerful principle, can be demonstrated in non-neural systems, enabling associative memories and adaptive problem-solving without a programmer or natural selection.  However, cognitivism still struggles with the dualistic framing of bottom-up vs. top-down causation, and the proximal vs. ultimate distinction in evolutionary biology.",
      "section": "From Computationalism to cognitivism",
      "topic": "Cognitivism as naturalized intelligence",
      "chunk_summary": "Cognitivism naturalizes computational intelligence by extending its principles to all levels of biology, with connectionist models and Hebbian learning demonstrating the potential for learning without explicit programming, but still faces challenges with dualistic thinking.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Recent computational architectures like Neural Cellular Automata and VAEs have extended the Central Dogma, viewing morphogenesis as a hierarchical decoding process.  These models see the genome as compressed latent variables, enabling generative processes that leverage modularity and evolvability.  However, these formalisms need expansion: recognizing multiple mappings of data/machine concepts, resolving the dualistic framing of causation, and addressing the incompatibility between deductive and creative processes.  The authors propose confabulatory computing as a foundation for living intelligence, emphasizing the creative interpretation of information.",
      "section": "From Computationalism to cognitivism",
      "topic": "Need for expanded computational models",
      "chunk_summary": "Recent computational models offer valuable insights into morphogenesis as a hierarchical decoding process, but require expansion to address multiple data/machine mappings, dualistic causation, and the role of creative processes, leading to the proposal of confabulatory computing.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Confabulatory computing, or \"making it up as you go along,\" describes the improvisational nature of biological sense-making.  Unlike computational devices focused on data fidelity, living systems prioritize saliency.  They face the paradox of change, needing to adapt while maintaining identity.  Biology commits to unreliable material, maximizing plasticity and the ability to make the best of available affordances.  This explains the observed plasticity in morphogenesis: it's a fundamental approach to dealing with uncertainty, not a special mechanism for injuries.  This requirement to actively interpret information applies across scales, from genomic interpretation to cognitive processes.",
      "section": "Confabulatory computing as the foundation for living intelligence",
      "topic": "Confabulatory computing and biological sense-making",
      "chunk_summary": "Confabulatory computing, prioritizing saliency over fidelity, describes the improvisational nature of biological sense-making, explaining the plasticity of living systems as a fundamental approach to dealing with an unreliable material and uncertain environments.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Living systems don't over-train on evolutionary priors; the genome provides affordances, not instructions.  Examples like Xenobots and Anthrobots demonstrate transcriptional plasticity despite unchanged genetics.  Cognitive systems also face the challenge of interpreting memory engrams, not merely reading them out.  Memories must be reinterpreted in the current context, as seen in caterpillar memories persisting in butterflies despite brain remodeling.  This process of generalization and remapping is analogous to evolution's selection of information for the next generation.  The bow-tie architecture, with compression and interpretation, allows sparse signals to trigger complex outcomes.",
      "section": "Confabulatory computing as the foundation for living intelligence",
      "topic": "Creative interpretation of information",
      "chunk_summary": "Living systems creatively interpret information, from genomic affordances to memory engrams, demonstrating a bow-tie architecture of compression and context-sensitive interpretation that enables sparse signals to trigger complex outcomes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The freedom of agency involves interpreting messages and revising self- and world-models. Memories are actively constructed, and recall can alter them.  This process can involve internal and external materials, similar to niche construction at multiple scales.  Living systems are active sense-making agents, treating information as prompts.  The bow-tie architecture, with compression and interpretation, is seen in both biology and emerging computer technology.  Multiple subsystems simultaneously observe and interpret these embodiments of memories, a concept formalized as polycomputing.  This architecture explains the whole-part relationship and unifies the challenges of constructing bodies and minds.",
      "section": "Confabulatory computing as the foundation for living intelligence",
      "topic": "Polycomputing and the bow-tie architecture",
      "chunk_summary": "Living systems utilize a bow-tie architecture of information compression and creative interpretation, with multiple subsystems simultaneously observing and interpreting information, a concept known as polycomputing, unifying the challenges of constructing bodies and minds.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Creative interpretation is central to cognition all the way down, unifying plasticity in brain-based and morphogenetic behaviors.  Living systems solve problems at multiple scales, requiring higher levels to distort option landscapes for their parts.  The compression/decompression relationship between levels involves confabulation and mechanistic necessity.  Confabulation is the rule, not the exception, with no precise storage and recall, only dynamic improvisation.  This applies to both cognitive memories and developmental processes, which are seen as extensions of each other.  The action/perception loop creates objects as internal correlations, with creativity as a key parameter influencing plasticity and robustness.",
      "section": "Confabulatory computing as the foundation for living intelligence",
      "topic": "Confabulation and the whole-part relationship",
      "chunk_summary": "Creative interpretation, involving confabulation and dynamic improvisation, is central to cognition at all levels, with the compression/decompression relationship between levels shaping option landscapes and driving problem-solving.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Life consists of extended cognitive beings with no permanent self, but with creative powers shaping patterns for persistence and growth.  The commitment to an unreliable substrate necessitates creative interpretation of genetic information, hiding information from selection and creating a positive feedback loop where evolution targets interpretation machinery.  This cycle, at the root of the symmetry between life and mind, is the origin of conventional intelligence.  Understanding the processes guiding living systems through the latent space of possible meanings is a major research direction.  The creative interpretation of information unifies the plasticity of brain-based and morphogenetic behaviors.",
      "section": "Confabulatory computing as the foundation for living intelligence",
      "topic": "Creative interpretation and the origin of intelligence",
      "chunk_summary": "Life's commitment to an unreliable substrate necessitates creative interpretation, driving a feedback loop where evolution targets interpretation machinery, leading to the origin of conventional intelligence and unifying the plasticity of brain-based and morphogenetic behaviors.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Conceptual frameworks in biology are crucial, impacting experimental design and progress. The agential material of life requires a \"cognition all the way down\" approach, recognizing cognition as a defining feature. Future theoretical work should explore and unify paradigms from cognitive science, game theory, evolutionary theory, physics, information theory, and computer science.  A key challenge is developing formalisms for creative interpretation of memories by biological systems, paralleling efforts in cognitive science to understand intelligence and creativity. Empirical work should broaden understanding of learning and problem-solving in various biological systems, exploiting new tools for manipulating biointerfaces.",
      "section": "Future Outlook",
      "topic": "Future research directions",
      "chunk_summary": "Future research should focus on developing formalisms for creative interpretation of memories and exploring the learning and problem-solving capacities of various biological systems, integrating paradigms from multiple disciplines.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Future empirical work should focus on three main areas: resetting system boundaries by manipulating cognitive glue dynamics, modifying pattern memories to alter homeodynamic setpoints, and interrogating systems to leverage the \"wisdom of the body\" for solving complex problems. AI tools can serve as translator interfaces, facilitating communication between clinicians and the intelligence of tissues and organs.  Robot scientist platforms should be extended to understand the mapping between informational stimuli and emergent form and function.  Further research should develop triggers and top-down prompts as alternatives to molecular micromanagement, and broaden understanding of the agents driving outcomes in cell and developmental biology, including information and energy patterns.",
      "section": "Future Outlook",
      "topic": "Empirical research opportunities",
      "chunk_summary": "Future empirical work should focus on manipulating cognitive glue dynamics, modifying pattern memories, and leveraging the \"wisdom of the body,\" with AI and robot scientist platforms playing key roles in understanding the mapping between stimuli and emergent form and function.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Beyond material components, energy and information patterns should become targets of intervention and analysis.  These patterns, representing the \"physics\" of various spaces, are also affordances exploited by life, similar to morphological computation exploiting the 3D world.  These patterns may exhibit agency, modifying their environment and interacting with each other.  Phenomena like morphogenesis and aging can be modeled as cells whose activities create patterns, or as patterns whose interactions result in biochemical and anatomical changes.  Physiological and cognitive patterns are thus targets for intervention and potential drivers of order.  The self-assembly of morphogenesis is the solidification of a persistent form resulting from creative problem-solving dynamics.",
      "section": "Future Outlook",
      "topic": "Agents driving biological outcomes",
      "chunk_summary": "Future research should consider energy and information patterns as agents driving biological outcomes, exploiting affordances and potentially exhibiting agency, with morphogenesis and aging as examples of their influence.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "When we perceive \"one embryo,\" we're observing the collective alignment of active subunits towards a journey through anatomical morphospace. Information patterns, serving as memory setpoints, implement the dynamic Ship of Theseus of the body. Morphogenesis is the solidification of a persistent form through self-reinforcing, creative problem-solving. A scale-free theory of intelligence will have broad implications. Cell and developmental biology will provide a model system for understanding unconventional collective intelligence, while cognitive science will contribute transformative frameworks for basic research and applications in regenerative medicine and bioengineering.",
      "section": "Future Outlook",
      "topic": "Scale-free theory of intelligence",
      "chunk_summary": "A scale-free theory of intelligence, recognizing the collective alignment of active subunits and the creative problem-solving dynamics of morphogenesis, will have transformative implications for biology and regenerative medicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Planarian flatworms can be reprogrammed to a two-headed form without genetic modification.  Transient ionophore treatment alters the bioelectric prepattern, leading to two-headed regeneration even with normal anterior gene expression and initial anatomy. This demonstrates that the body can store different target morphologies without genetic changes. Images from [40].",
      "section": "Figure 2",
      "topic": "Planarian Reprogramming",
      "chunk_summary": "Planaria can be reprogrammed to a two-headed form by altering bioelectric patterns, demonstrating non-genetic storage of target morphology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Two-headed planaria continue regenerating with two heads in subsequent rounds, showing stable storage of the altered morphology without further treatment. This demonstrates a new lineage of body plans without mutation.  The two-headed form is reversible. Images from [39].",
      "section": "Figure 2",
      "topic": "Planarian Reprogramming",
      "chunk_summary": "The two-headed form in planaria is heritable through regeneration, demonstrating stable, non-genetic inheritance of altered morphology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Deer antlers exhibit trophic memory, where injury location influences future antler growth. An injury heals with a callus, but the following year a new tine grows at the same spot. This long-term memory challenges conventional models of feed-forward development. Images from [42].",
      "section": "Figure 2",
      "topic": "Trophic Memory",
      "chunk_summary": "Deer antlers demonstrate trophic memory, where injury location influences future growth, challenging traditional developmental models.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Plant morphogenesis is typically reliable, but parasites can induce novel structures called galls. The complexity of the gall reflects the complexity of the parasite. This highlights the plasticity of plant development. Image in D' from [147].",
      "section": "Figure 2",
      "topic": "Gall Formation",
      "chunk_summary": "Parasites can induce novel structures called galls in plants, demonstrating the plasticity of plant morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Embryogenesis and cancer involve changes in the scale of pattern memory. Embryogenesis scales up from single-cell setpoints to anatomical patterns, while cancer represents a scaling down.  Bioelectric states can indicate abnormal cell behavior in tumors, and restoring normal bioelectric connections can normalize tissue despite oncogene expression. Images from [148].",
      "section": "Figure 2",
      "topic": "Cancer and Scale of Pattern Memory",
      "chunk_summary": "Embryogenesis and cancer represent changes in the scale of pattern memory, with bioelectric states playing a role in tumor development and normalization.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Frog embryonic epithelial cells, when liberated from the embryo, self-assemble into Xenobots, exhibiting novel behaviors including kinematic self-replication.  Xenobots collect loose skin cells into spheres that develop into the next generation. Images from Xenbase [149] and Douglas Blackiston [105, 106, 150].",
      "section": "Figure 3",
      "topic": "Xenobots",
      "chunk_summary": "Liberated frog cells form Xenobots, exhibiting novel behaviors including kinematic self-replication.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Human tracheal epithelial cells, when removed from the organism, form Anthrobots, self-motile structures with distinct morphotypes and behaviors.  Anthrobots repair wounds in neural tissues and exhibit epigenetic rejuvenation.  They differentially express thousands of genes compared to their origin tissue. Images from [47] and [48].",
      "section": "Figure 3",
      "topic": "Anthrobots",
      "chunk_summary": "Liberated human tracheal cells form Anthrobots, which repair neural tissues and exhibit epigenetic rejuvenation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric circuits, formed by ion channels and gap junctions, are conserved in neural and non-neural cells. Research programs aim to decode electrophysiological dynamics to understand cognitive content in both neuroscience and morphogenesis. Image courtesy of Jeremy Guay.",
      "section": "Figure 4",
      "topic": "Bioelectric Circuits",
      "chunk_summary": "Bioelectric circuits are conserved across cell types, and research aims to decode their cognitive content in both neural and non-neural contexts.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric prepatterns in frog embryos determine the future position of facial features.  These patterns can be manipulated to induce ectopic eye formation, even in gut cells, demonstrating their sufficiency in encoding form. Images from [61] and Dany S. Adams.",
      "section": "Figure 4",
      "topic": "Bioelectric Patterning",
      "chunk_summary": "Bioelectric prepatterns determine facial feature positions and can induce ectopic eye formation, demonstrating their role in encoding form.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric patterns propagate information through tissues.  Manipulating these patterns can induce ectopic eyes, with non-injected cells participating in the new structure.  The dynamic nature of these patterns is revealed by gene expression analysis, showing competition between different morphogenetic plans. Images from [151] and [63].",
      "section": "Figure 4",
      "topic": "Bioelectric Pattern Propagation",
      "chunk_summary": "Bioelectric patterns propagate information and can induce ectopic organs, with dynamic competition between different morphogenetic plans.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Intelligence exists on a continuum, with major transitions in agency. Morphogenesis involves both feedforward emergence and goal-directed feedback loops. Basal cognition, including learning, exists below the cell level in molecular pathways. Life exhibits a multiscale competency architecture, with problem-solving at each level. Evolution has pivoted navigational competencies across different problem spaces. Images courtesy of Jeremy Guay.",
      "section": "Figure 5",
      "topic": "Multiscale Competency Architecture",
      "chunk_summary": "Life exhibits a multiscale competency architecture with problem-solving abilities at various levels, from molecular pathways to whole organisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Organisms only have access to present information in their body and environment. Memory engrams are messages from past selves, requiring interpretation.  A bow-tie architecture forces compression and generalization of past instances into memory, which are then creatively interpreted. This dynamic applies to evolution and morphogenesis, where the genome is a generative prompt interpreted by cellular intelligence.  Tadpoles with ectopic eyes on their tails can still see, demonstrating plasticity and robustness. Images from [153].",
      "section": "Figure 6",
      "topic": "Memory and Interpretation",
      "chunk_summary": "Organisms interpret memory engrams from past selves, using a bow-tie architecture of compression and interpretation, which also applies to the interpretation of the genome during development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric signaling via potassium channels is a mechanism for craniofacial dysmorphogenesis in Andersen-Tawil Syndrome [62]. Transmembrane voltage potential controls embryonic eye patterning in Xenopus laevis [63]. HCN2 channel activation can rescue brain defects by enforcing endogenous voltage pre-patterns [65, 66]. Endogenous gradients of resting potential pattern embryonic neural tissue via Notch signaling [69]. Gap junctional blockade can induce different species-specific head anatomies in flatworms [70].",
      "section": "References",
      "topic": "Bioelectric Signaling and Development",
      "chunk_summary": "References highlight the role of bioelectric signaling in craniofacial development, eye patterning, brain defects, and head anatomy.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_975989.pdf",
      "original_filename": "pdf_20250803_124126_975989_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Richard Watson\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:54:19.824684"
}