{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_428850_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_428850.pdf",
    "file_size": 42102,
    "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
    "journal": "Interface Focus",
    "doi": "10.1098/rsfs.2016.0055",
    "year": "2016",
    "title": "Top-down models in biology: explanation and control of complex living systems above the molecular level",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Most biological phenomena are complex—they depend on the interplay of many factors and show adaptive self-organization under selection pressure. One of the most salient examples is the regulation of body anatomy. A single fertilized egg gives rise to a cell mass that reliably self-assembles into the complex three-dimensional structure of a body. Crucially, however, bioscience needs to understand more than the feedforward progressive emergence of a stereotypical pattern. Some animals have the remarkable ability to compensate for huge external perturbations during embryogenesis, and as adults can regenerate amputated limbs or heads, remodel whole organs into other organs if grafted to ectopic locations, and reprogramme-induced tumours into normal structures. These capabilities reveal that biological structures implement closed-loop controls that pursue shape homeostasis at many levels, from individual cells to the entire body plan.",
      "section": "Introduction",
      "topic": "Pattern regulation",
      "chunk_summary": "Biological systems, particularly anatomical development and regeneration, exhibit complex self-organization and closed-loop control of shape homeostasis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Biologists work towards two main goals: understanding the system to make predictions and inferring manipulations that lead to desired changes. The former is the province of developmental and evolutionary biology, whereas the latter is a requirement for regenerative medicine. Consider the phenomenon of trophic memory in deer antlers. Every year, some species of deer regenerate a specific branching pattern of antlers. However, if an injury is made to the bone at a specific location, an ectopic tine will be formed for the next few years in that same location within the three-dimensional structure that is regenerated by the growth plate at the scalp. This requires the system to remember the location of the damage, store the information for months and act on it during local cell growth decisions made during regeneration so as to produce a precisely modified structure. What kind of model could explain the pattern memory and suggest experimental stimuli to rationally edit the branching pattern towards a desired configuration? Related problems of forming and accessing memories, and using them to make decisions and take actions, are widely studied in neuroscience. We suggest that these parallels are not just analogies, but should be taken seriously: methods developed within computational and systems neuroscience to study memory, decision and action functions can be beneficial to study equivalent problems in biology and regenerative medicine.",
      "section": "Introduction",
      "topic": "Trophic memory and regeneration",
      "chunk_summary": "The phenomenon of trophic memory in deer antlers highlights the need for models that explain pattern memory and guide experimental manipulations for regenerative medicine, drawing parallels with neuroscience research on memory, decision, and action.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "The current paradigm in biology and regenerative medicine assumes that models are best specified in terms of molecules. Gene regulatory networks and protein interaction networks are sought as the best explanations. This has motivated the use of a mainly bottom-up modelling approach, which focuses on the behaviour of individual molecular components and their local interactions. The companion concept is that of emergence, and it is thought that future developments in complexity science can explain the appearance of large-scale order, resulting from the events described by molecular models. This approach has had considerable success in some areas. However, it has been argued that an exclusive focus on the molecular level (versus higher levels, such as those which refer to tissue geometry, or even lower levels, such as quantum mechanical events) is unnecessarily limiting. It is not known whether bottom-up strategies can optimally explain large-scale properties such as self-repairing anatomy, or whether they best facilitate interventions strategies for rationally altering systems-level properties. However, it has been observed that a number of biological systems seem to use highly diverse underlying molecular mechanisms to reach the same high-level (e.g. topological) goal state, suggesting a kind of 'implementation independence' principle that focuses attention on the global state as a homeostatic target for cellular and molecular activities.",
      "section": "Introduction",
      "topic": "Bottom-up vs. Top-down models",
      "chunk_summary": "While bottom-up molecular models have been successful, a focus solely on the molecular level may be limiting for understanding large-scale properties like self-repair, suggesting the need for top-down models that consider global states and implementation independence.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Top-down models, which have been very effectively exploited in sciences such as physics, computer science and computational neuroscience, present a complementary strategy. Top-down approaches focus on system-wide states as causal actors in models and on the computational (or optimality) principles governing global system dynamics. For example, while motor control (neuro)dynamics stem from the interactive behaviour of millions of neurons, one can also describe the neural motor system in terms of a (kind of) feedback control system, which controls a 'plant' (the body) and steers movement by minimizing 'cost functions' (e.g. realizes trajectories that have minimum jerk). This view emerged because the inception of cognitive science and cybernetics, and might apply more generally not only to the motor system, but also to behaviour and cognition. Formal tools such as optimal feedback control, Bayesian decision theory and the free energy principle are routinely used in computational neuroscience to explain most cognitive functions, from motor control to multimodal integration, memory, cognitive planning and social interaction. Related normative approaches derived (for example) from machine learning, artificial intelligence or reinforcement learning are widely used to explain several aspects of neuronal architecture such as receptive fields, neuronal coding and dopamine function by appealing to optimality principles and rational analysis. Despite starting in a top-down manner from optimality principles, these approaches make contact with data—as optimality principles generate testable predictions—and have guided empirical research in many fields, becoming dominant in some of them, such as computational motor control and neuroeconomics.",
      "section": "Introduction",
      "topic": "Top-down models",
      "chunk_summary": "Top-down models, focusing on system-wide states and optimality principles, offer a complementary approach to understanding complex systems, as demonstrated in fields like computational neuroscience and motor control.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Many biological functions, such as pattern homeostasis, are readily viewed in terms of systems that seek to acquire and maintain specific large-scale states. A central example is dynamic anatomical re-configuration; pattern homeostasis, as seen in highly regenerative animals, is difficult to explain or control via molecular-level models. This is because the global control metrics (e.g. 'number of fingers') that trigger and regulate subsequent remodelling are not defined at the level of individuals cells or molecules; indeed, large-scale anatomical goal states can activate multiple distinct mechanistic pathways to satisfy the homeostatic process (a kind of implementation independence). These global metrics can be conceptualized as order parameters in dynamical systems or as controlled variables (or set points) in cybernetic and control-theoretic models. We argue that top-down control models provide a valuable complement to the toolkit of cell biologists, evolutionary biologists, bioengineers and workers in regenerative medicine because they provide a mechanistic roadmap for optimal explanation and control of some complex systems.",
      "section": "Introduction",
      "topic": "Top-down control in biology",
      "chunk_summary": "Top-down control models, focusing on global metrics and implementation independence, offer a valuable complement to molecular-level models for understanding and controlling complex biological processes like pattern homeostasis and regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "The main goal of this article is to introduce, motivate and demystify top-down approaches for biologists and to enable deep concepts from other fields to impact the most critical open questions of systems biology. Least-action principles are one example of top-down principles that fundamentally transformed understanding in basic physics, and it has been in use for centuries in that field. Perhaps the most representative example of a top-down approach in biology is the theory of evolution by natural selection. The theory is not necessarily tied to one specific mechanism—and indeed some of the underlying mechanisms such as genes were only discussed much later—but it provided a context to understand many (if not all) biological phenomena across the field, from molecular biology to genetics and physiology, and to formulate detailed process models. One reason why top-down approaches have not been popular in modern biology (with exceptions, see below) is that they apparently embed a 'dangerous' notion of teleology, directedness, purpose or finalism. After all, evolutionary theory rejects the idea that processes are 'directed' towards some 'final goal' or 'final cause'—it rejects 'finalistic' thinking and the idea that there is 'purpose' beyond biology. However, three points are in order.",
      "section": "Introduction",
      "topic": "Top-down models and teleology",
      "chunk_summary": "This article aims to introduce top-down approaches in biology, addressing concerns about teleology by highlighting the mechanistic nature of goal-directedness and the empirical success of top-down models in other fields like physics and evolutionary biology.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "First, top-down models do not entail a problematic kind of teleology. Goal directedness is not 'magical thinking', but can be mapped to specific mechanistic models of homeostasis that are already widely used in many fields. For example, feedback systems that are popular in control theory and cybernetics do encode a desired state (or set point), but this is not the kind of 'final cause' that biologists should be worried about. It has nothing to do with claims of a purpose to the trajectory of evolution, and it does not imply claims of first-person consciousness. A set point can be as simple as a desired 'plant' state in motor control (e.g. my finger pressing a button), a desired interoceptive state in homeostasis (e.g. satiation) or a desired temperature for a thermostat. The ontological status of these set points is innocuous with respect to issues of 'evolutionary thinking versus finalisms', and it is an empirical question whether animals use internally represented goal states with various levels of complexity (from 'my finger pressing a button' to 'my face on the cover of Time magazine') to guide their decisions, as opposed to simpler (e.g. stimulus–response mechanisms)—or both. Often, living organisms or machine learning algorithms can learn goals or set points of a system experience, so it cannot be assumed that they are innate. Our discussion of top-down controls explicates goal directedness via (extended) homeostatic mechanisms within existing organisms, thus offering specific hypotheses on how they may acquire increasingly more complex and distal goals.",
      "section": "Introduction",
      "topic": "Goal-directedness and homeostasis",
      "chunk_summary": "Top-down models do not imply problematic teleology; goal-directedness can be explained mechanistically through homeostasis and feedback systems with set points, without invoking final causes or consciousness.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Second, one might imagine that teleological thinking would offer a misguided view of causation; after all, it is commonly assumed that causation in biological phenomena should be from the parts (micro) to the whole (macro), for example, from cells to organisms. However, issues of causality are heavily discussed in philosophy, neuroscience, social science and many other fields. Purely bottom-up views are increasingly challenged by theories of micro–macro interactions—i.e. the idea that causality goes in both directions, and that efficient causality can be ascribed to multiple levels of description of a system. For brevity, we do not discuss the philosophical issues of top-down causation here, referring the reader to many recent above-cited discussions. Our view is that empirical success in facilitating understanding and control is of paramount importance, overriding a priori commitments to particular levels of explanation.",
      "section": "Introduction",
      "topic": "Causality in biological systems",
      "chunk_summary": "The traditional bottom-up view of causation is challenged by theories of micro-macro interactions, suggesting that causality can operate in both directions and at multiple levels, prioritizing empirical success over a priori commitments to specific levels of explanation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Third, although several researchers in computational and systems neuroscience have proposed that formal tools such as feedback control, Bayesian decision theory and error minimization are literally implemented in the brain (e.g. the Bayesian brain hypothesis), one can also use the same concepts in a purely descriptive-and-predictive way, without committing to the ontological status of their constructs (e.g. the construct of set point). In other words, scientists can describe biological systems 'as-if' they had purpose (in the cybernetic sense), using an operational approach that only appeals to the explanatory power of the theory and the constructs. For example, the notion of (minimization of) a free energy gradient, which originated in thermodynamics, can be used to study biological systems such as cell movement or brain dynamics. In this perspective, top-down models may be seen as formal tools that enlarge a scientist's methodological toolbox and might potentially increase predictive power of theories. In a similar vein, Dennett has proposed that when we want to explain the behaviour of our conspecifics we use an 'intentional stance'—we describe others as having goals and intentions—because this stance gives greater predictive power compared to (say) trying to predict another's behaviour in terms of the laws of mechanics. The 'intentional stance' is preferred for its predictive power, irrespective of the fact that humans have or do not have real goals or intentions. Here, in other words, is a pragmatic criterion of success (in prediction and control) that should guide the adoption of an intentional stance. The same criterion of success might motivate the choice of modelling any given biological system as a system that has purpose (and can be modelled in terms of feedback control) versus a system is composed of interacting parts (and can be modelled by differential equations that describe these parts separately), or a mixture of both.",
      "section": "Introduction",
      "topic": "Intentional stance and predictive power",
      "chunk_summary": "Top-down models can be used descriptively without committing to the ontological status of their constructs, adopting an \"intentional stance\" that prioritizes predictive power and control, similar to Dennett's approach in explaining human behavior.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "In other words, one can avoid philosophical issues about ontological reductionism, formulating the success criterion of biological explanations in empirical, unambiguous terms, which appeal to pragmatic criteria such as predictive power, controllability (of experimental manipulations) and causal explanation. If one considers predictive power, the best model is the one that allows the most efficient prediction and control of large-scale pattern formation. In this perspective, only the outcome matters—the ability to induce desired, predictable changes in large-scale shape, regardless of whether the model is formulated in terms of genes, information, topological concepts or anything else. In this, we hold to an empirical criterion of success, looking for whatever class of approaches offers the best results for regulating shape in regenerative and synthetic bioengineering approaches. One can also consider a more broadly causal explanation (and the achievement of higher levels of generality) as a criterion for success—it is in this perspective that Popper argued that scientific discovery goes 'from the known to the unknown'. To achieve this, some models appeal to latent (or hidden) states that describe or hypothesize underlying regularities that are not directly observable in the data stream but need to be inferred. For example, in object perception, one can assume that the visible input stream (e.g. the stimulation of the retina) is a function of a mixture of two latent causes, the identity of the object and its location (and/or pose). One can use methods such as Bayesian inference to infer probabilistically the latter from the former. Deep neural networks and Bayesian non-parametric methods are widely used in machine learning and computational neuroscience to infer latent states of this kind directly from data.",
      "section": "Introduction",
      "topic": "Criteria for model success",
      "chunk_summary": "The success of biological models should be judged based on empirical criteria like predictive power, controllability, and causal explanation, prioritizing the ability to induce desired changes in large-scale shape and considering latent states for inferring underlying regularities.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    },
    {
      "text": "Being able to formulate a scientific theory without necessarily committing to the ontological status of its entities has contributed to the success of mature sciences. Some examples are the principle of least action, which can be regarded as fundamental in physics as it explains a range of physical phenomena and the principle of least effort, which is popular in many sciences, from ecology to communication. The principle of least action, which is related to free energy minimization, which we discuss below, describes a physical system as following a path (of least effort) in an abstract 'configuration space'. It can be used to obtain equations of motion for that system without necessarily assuming the ontological reality of the 'path' or any finalism in the 'final state'. Is the same approach possible and/or useful in biology? For example, if one focuses on the domain of patterning and growth, the question would be: can we design top-down models that describe (and permit to reprogramme) anatomical structure at the level of large-scale shape specification (e.g. body morphologies) rather than micromanaging single cells or molecular signalling pathways? Would such models be useful and effective?",
      "section": "Introduction",
      "topic": "Least action principle and biological systems",
      "chunk_summary": "The success of principles like least action in physics, which avoids ontological commitments, raises the question of whether similar top-down models focusing on large-scale shape specification could be useful in biology.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_428850.pdf",
      "original_filename": "pdf_20250803_124125_428850_extracted_text.txt",
      "authors": "[\"Giovanni Pezzulo\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Interface Focus",
      "doi": "10.1098/rsfs.2016.0055"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:16:02.312880"
}