{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_212954_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_212954.pdf",
    "file_size": 139111,
    "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Embryos Assist Each Other’s Morphogenesis: calcium and ATP signaling mechanisms in collective resistance to teratogens",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "We investigated the possibility that instructive influences for normal embryonic development are provided not only at the level of cells within the embryo, but also via interactions between embryos. To explore this, we challenged groups of embryos with disruptors of normal development while varying group size. We observed that embryos are much more sensitive to a diverse set of chemical and molecular-biological perturbations (thioridazine, nicotine, forskolin, and dominant-negative kir6.1 ion channel expression) when exposed and allowed to develop alone or in small groups, than in large groups. As the number of embryos in an exposed cohort increased, while per-embryo exposure was kept constant, the rate of survival increased and incidence of defects decreased, reaching an optimal effect at a cohort size of 300. This inter-embryo assistance effect was found to be mediated by short-range diffusible signals, and involves the P2 ATP receptor. RNA-seq analysis revealed a small set of transcripts specific for teratogen response in large groups but not small ones. We provide a computational model that explains the resulting dynamics as a set of diffusing information exchanges between embryonic agents who alter their environmental sampling as a function of stress. We also describe and quantify a wave of intracellular calcium following injury that propagates not only within, but between embryos, identifying one potential inter-embryo signaling mechanism. Our data emphasize that morphogenesis is a collective phenomenon not only at the level of cells but also of whole bodies, and that cohort size is a crucial variable in studies of ecotoxicology, teratogenesis, and developmental plasticity.",
      "section": "Abstract",
      "topic": "Cross-Embryo Morphogenetic Assistance (CEMA)",
      "chunk_summary": "Embryos in larger groups exhibit increased resistance to teratogens, mediated by diffusible signals involving the P2 ATP receptor and calcium signaling, suggesting a collective morphogenetic assistance effect.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "During embryogenesis, a complex anatomical form is constructed via the interactions of numerous cells. A key question concerns the origin of information guiding morphogenesis, with implications for evolution, regenerative medicine, and bioengineering.  While the genome and environment are recognized as vertical information sources, we explore the possibility of horizontal information propagation between embryos, a \"wisdom of the crowd\" effect.  This concept challenges the traditional view of the embryo as a self-contained unit of development and considers the potential for instructive lateral interactions.  Prior studies have shown extra-genomic influences on development, including inter-conspecific interactions affecting progeny characteristics in rats and cardio-respiratory impacts in preterm infants through skin-to-skin contact.  Beneficial lateral interactions have been observed postnatally (Allee effect) and at the cellular level, where groups of cells exhibit resistance to transformation and cancer.  Wounding in Xenopus embryos induces calcium waves and ATP signaling for wound closure, but inter-individual information transfer remains unexplored.",
      "section": "Introduction",
      "topic": "Morphogenesis and Lateral Interactions",
      "chunk_summary": "This study investigates the hypothesis of horizontal information transfer between embryos during morphogenesis, challenging the traditional focus on vertical information from the genome and environment.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Several studies have reported beneficial lateral interactions in various biological systems, from social amoebas to metazoan cells in culture.  In mesenchymal cells in vitro, low population seeding impacts differentiation potentials, cell fates, and tumor growth rates.  Groups of cells demonstrate resistance to transformation and cancer, exhibiting collective dynamics that promote adaptive outcomes.  For example, culturing multiple ovarian follicles enhances survival and growth through paracrine signaling.  In Xenopus embryos, wounding triggers calcium waves within the organism, facilitating cell coordination and wound closure. ATP, a ligand involved in cell contractility, plays a role in coordinating long-range contraction responses after injury.  However, the transfer of such information between individuals or distinct tissues and organs has not been fully explored.",
      "section": "Introduction",
      "topic": "Beneficial Lateral Interactions",
      "chunk_summary": "This section highlights examples of beneficial lateral interactions in various biological systems, emphasizing the role of collective dynamics in cell behavior and wound healing.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study investigates the hypothesis that embryos can interact across distances in their medium, providing beneficial information that assists morphogenesis.  The primary assay used was resistance to teratogens, where groups of Xenopus laevis embryos were exposed to developmental disruptors.  The study examined whether larger groups exhibit greater resistance compared to smaller groups.  The findings reveal that collective development is more stable against morphological perturbations, and a computational model explains this collective stability through local interactions.  Experiments indicate that this effect is mediated by a short-range chemical signal involving calcium and P2 receptor signaling.  While no significant transcriptional changes were observed at stage 25, a small group of changes were implicated by stage 35.  The study also reports a mechanical injury-triggered wave that propagates not only within but also between embryos, suggesting a potential communication mechanism.  Transcriptomic profiling identified a set of genes differentially expressed in small versus large groups, providing a signature of the collective response to teratogen challenge.",
      "section": "Introduction",
      "topic": "Cross-Embryo Morphogenetic Assistance (CEMA)",
      "chunk_summary": "This study investigates the protective effect of group size in Xenopus embryos against teratogens, revealing a role for inter-embryo communication mediated by chemical signals, calcium signaling, and transcriptional changes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To investigate the influence of group size on embryonic development, we tested whether it affected the ability of embryos to resist teratogenic influences. Embryos from the same clutch were divided into different group sizes, while maintaining constant teratogen concentration per embryo by scaling media volume. We started with thioridazine, a chemical targeting dopamine pathways. Xenopus laevis embryos were raised in identical conditions but at different group sizes and exposed to 90 µM thioridazine.  Media and dish size were scaled proportionally.  Analysis showed no significant difference in thioridazine concentration between groups of varying sizes, ruling out drug degradation as a confounder.  Following 18-hour exposure (stages 12.5-25), survival increased with group size, with 0% survival in singlets and groups of 5, increasing to 98% in groups of 300.  Thioridazine caused developmental abnormalities, including rectangular head shape, misshapen eyes, and hyperpigmentation.  Larger groups had significantly fewer defects.  Hyperpigmentation was quantitatively validated by absorbance measurements, and square head shape was quantified by morphometric analysis.  We concluded that larger group size protects against thioridazine-induced death and defects, a phenomenon termed the Cross-Embryo Morphogenetic Assistance (CEMA) effect.",
      "section": "Results",
      "topic": "Thioridazine and Group Size",
      "chunk_summary": "Larger groups of Xenopus embryos showed increased survival and fewer defects when exposed to thioridazine, demonstrating the CEMA effect.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To determine if the CEMA effect extends beyond thioridazine, we tested other teratogens with different targets and a non-pharmacological method. Forskolin, targeting adenylate cyclase, caused hyperpigmentation in smaller groups (n=25, n=50), but significantly less in larger groups (n=300). Nicotine exposure resulted in brain defects in smaller groups (n=10, n=25), with decreasing incidence in larger groups (up to n=125). Microinjection of dominant-negative Kir6.1 mRNA, disrupting bioelectric signaling, caused craniofacial defects but no significant difference in survival between groups.  However, larger groups showed significantly fewer defects. These results demonstrate that the protective effect of larger group size is not specific to a single pathway or teratogen, suggesting CEMA is a general developmental stability mechanism.",
      "section": "Results",
      "topic": "CEMA with Other Teratogens",
      "chunk_summary": "The CEMA effect was observed with forskolin, nicotine, and dominant-negative Kir6.1 mRNA, indicating it is a general mechanism protecting against diverse developmental disruptors.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To investigate whether CEMA operates across genetically diverse populations, we mixed wild-type and albino Xenopus laevis strains and exposed them to thioridazine.  Groups of 150 wild-type or albino embryos showed similar defect rates, which were significantly reduced in groups of 300.  Mixed groups of 150 wild-type and 150 albino embryos also showed reduced defects, similar to the 300 homogenous groups.  This indicates that CEMA does not require genetic homogeneity.",
      "section": "Results",
      "topic": "CEMA in Mixed Strains",
      "chunk_summary": "CEMA was observed in mixed groups of wild-type and albino Xenopus embryos, indicating the effect is not limited to genetically homogenous populations.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "We investigated whether unperturbed embryos could contribute to CEMA by mixing thioridazine-exposed wild-type embryos with untreated albino embryos.  Treated wild-type embryos in larger groups (300) showed reduced defects compared to smaller groups (150).  However, mixed groups (150 treated + 150 untreated) showed no significant difference in defect rates compared to the smaller treated group.  This suggests that only perturbed individuals contribute to the CEMA effect.",
      "section": "Results",
      "topic": "Role of Unperturbed Embryos",
      "chunk_summary": "Mixing treated and untreated embryos showed that unperturbed individuals do not contribute to the protective CEMA effect.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A computational model was developed to understand the inter-embryonic signaling in CEMA. An agent-based approach using elementary cellular automata (ECA) was employed, where each ECA represented an embryo.  ECAs were placed on a 2D grid and assigned a health value.  Teratogen exposure was modeled as noise, reducing the embryo's health.  Exposed embryos broadcast their health value to neighbors, and healthier embryos responded with a supportive signal.  The model incorporated a weighting mechanism where healthier embryos weighted their own signal more, while unhealthier embryos weighted their neighbors' input more.  Simulations showed that inter-embryo communication was essential for normal development in the presence of noise, and larger groups were more effective, mirroring the experimental data.  This demonstrates that collective dynamics can stabilize morphogenesis against perturbations through local signaling.",
      "section": "Results",
      "topic": "Computational Model of CEMA",
      "chunk_summary": "An agent-based computational model demonstrated that inter-embryo communication, as modeled by local interactions between ECAs, is essential for robust development in the presence of noise, with larger groups exhibiting greater stability.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "RNA sequencing was performed to investigate the transcriptional basis of CEMA. Xenopus embryos from large (300) and small (100) groups, treated or untreated with thioridazine, were analyzed at stages 25 and 35. At stage 25, no significant gene expression differences were found between groups, suggesting CEMA mechanisms hadn't yet impacted transcription. However, at stage 35, transcriptional separation was observed. In control groups, 32 genes were differentially expressed between large and small groups, indicating sensitivity to cohort size even without stress. In thioridazine-exposed groups, 19 genes were differentially expressed, showing that cohort size modifies the transcriptional response to teratogens.  These findings demonstrate that distinct transcriptional signatures exist for developing in a large group and for responding to a teratogen in a large group.",
      "section": "Results",
      "topic": "RNAseq Analysis of CEMA",
      "chunk_summary": "RNA sequencing revealed transcriptional changes associated with CEMA, detectable at stage 35, with distinct signatures for large group development and teratogen response in large groups.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Pathway analysis of the differentially expressed genes at stage 35 revealed over-representation of genes related to nucleosome activity, signaling receptor binding, translation, and ribosomal pathways in larger control groups, while genes related to extracellular matrix, glycolytic, and mitochondrial processes decreased. In thioridazine-exposed embryos, genes associated with signaling pathways (caveolae, nuclear steroid receptors) increased in larger groups, while genes involved in membrane transport decreased. These findings suggest that transcriptional programs are sensitive to cohort size and that regulation of signaling and transport genes is a signature of group resistance to teratogens.",
      "section": "Results",
      "topic": "Pathway Analysis of CEMA",
      "chunk_summary": "Pathway analysis of differentially expressed genes revealed changes in nucleosome activity, signaling, translation, and membrane transport pathways associated with CEMA.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To identify the communication modality in CEMA, we used 3D-printed separation devices to physically separate embryos while sharing media.  Separating embryos drastically reduced survival compared to unseparated groups, suggesting a short-range chemical signal.  Increasing diffusion through windowed wells improved survival but remained lower than unseparated groups.  Blocking visual cues had no significant effect.  These results point to a short-range chemical signal as the primary medium of inter-embryo influence.",
      "section": "Results",
      "topic": "CEMA Communication Modality",
      "chunk_summary": "Experiments using physical separation devices indicated that CEMA is mediated by a short-range diffusible chemical signal, not physical contact or visual cues.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Focusing on ATP as a potential signaling molecule, we used suramin, a purinergic receptor antagonist, to block ATP signaling. Suramin blocked the protective effect of large groups against thioridazine, rendering them as susceptible as singletons.  Suramin alone had minimal effect.  Further experiments with BAPTA (calcium chelator), thapsigargin (calcium store depletor), and PPADS (P2 receptor blocker) showed that intracellular calcium stores and P2 receptors are involved in CEMA.  Measuring extracellular ATP levels revealed higher concentrations in treated large groups compared to small groups, supporting an ATP-based mechanism.",
      "section": "Results",
      "topic": "ATP and Calcium Signaling in CEMA",
      "chunk_summary": "Blocking ATP signaling with suramin abolished the CEMA effect, and further experiments implicated intracellular calcium stores and P2 receptors, suggesting ATP and calcium signaling mediate CEMA.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To visualize inter-embryo communication, we used GCAMP6S, a fluorescent calcium reporter, and a mechanical injury assay.  Mechanical injury induced calcium waves within the injured embryo, which propagated to adjacent uninjured embryos sharing the same media.  The wave often started at the point closest to the injured embryo but wasn't always consistent.  Wave speeds were measured within and between embryos.  Kymographs visualized calcium dynamics, showing increased activity in uninjured embryos after injury.  Suramin attenuated inter-embryo wave propagation but not intra-embryo waves, suggesting ATP signaling is involved in inter-embryo communication.  Applying ATP bolus increased calcium activity in uninjured embryos, but with different dynamics than mechanical injury, suggesting more complex signaling is involved.  These findings suggest that diffusible molecules, potentially including ATP, mediate long-range signaling of tissue damage between embryos.",
      "section": "Results",
      "topic": "Calcium Waves and Injury Signaling",
      "chunk_summary": "Mechanical injury induced calcium waves that propagated between embryos, and suramin blocked this inter-embryo propagation, implicating ATP signaling in injury communication.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study investigated the hypothesis that embryonic outcomes are influenced by collective computation, with inter-embryo influence contributing to stability.  The results demonstrate that increasing cohort size mitigates the effects of various teratogens, including thioridazine, nicotine, and forskolin.  Larger cohorts exhibited increased survival and decreased incidence of defects, termed the Cross-Embryo Morphogenetic Assistance (CEMA) effect.  This effect was observed across diverse disruptors and even in control conditions, supporting the idea that robustness in morphogenesis is partly due to lateral interactions between conspecifics.  This phenomenon has parallels in other biological systems, such as quorum sensing in bacteria, clutch hatching synchronization in birds, and body color changes in locusts.  The findings suggest a multi-scale dynamic in morphogenetic homeostasis, where interactions between cells and between embryos contribute to developmental stability.",
      "section": "Discussion",
      "topic": "CEMA and Collective Computation",
      "chunk_summary": "This study demonstrates the CEMA effect, where larger cohorts of embryos exhibit increased resistance to teratogens, suggesting a role for collective computation in developmental robustness.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The study also investigated the mechanism of inter-embryo communication in CEMA.  Experiments using physical separation devices revealed that CEMA requires adjacency but not physical contact, implicating diffusible chemicals as the signaling mechanism.  Blocking visual cues had no significant impact.  Previous studies have linked ATP release and calcium waves to damage responses.  This study showed that depleting calcium stores or blocking P2 receptors eliminates the CEMA effect, and that mechanical injury induces calcium waves that propagate between embryos.  Suramin, a P2 receptor antagonist, blocked both the inter-embryo calcium wave and the CEMA effect, suggesting a common ATP signaling mechanism.  While applying ATP bolus elicited a calcium response, the dynamics differed from mechanical injury, suggesting more complex signaling is involved.  These findings implicate ATP and calcium signaling in inter-embryo communication during CEMA.",
      "section": "Discussion",
      "topic": "Molecular Mechanisms of CEMA",
      "chunk_summary": "The study identified diffusible chemicals, particularly ATP and calcium signaling, as key mediators of the CEMA effect, with mechanical injury inducing inter-embryo calcium waves.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The study also explored the transcriptional signature of CEMA using RNA sequencing.  Changes in gene expression were detectable between stages 25 and 35, involving a small number of genes responding specifically to cohort size, not just the teratogen.  Several genes were downregulated, and three were upregulated, including V-ATPase, known for its role in morphogenesis.  Gene set enrichment analysis revealed increased expression of genes associated with signaling pathways in larger groups, while genes involved in membrane transport decreased.  These changes distinguish the transcriptional response to a challenge in a large cohort versus simply the size of the developmental clutch.",
      "section": "Discussion",
      "topic": "Transcriptional Signature of CEMA",
      "chunk_summary": "RNA sequencing revealed a transcriptional signature of CEMA, with changes in genes related to signaling and membrane transport, specifically responding to cohort size and not just the teratogen.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The data suggest a model for inter-embryo signaling involving ATP and calcium.  Under normal conditions, extracellular ATP is low.  Injury induces an internal calcium wave and increased ATP release.  ATP from injured embryos binds to P2 receptors on neighboring embryos, triggering a secondary calcium response.  Thapsigargin, which depletes intracellular calcium stores, blocks this response, suggesting P2 receptor binding leads to calcium release from intracellular stores.  This model provides a mechanistic explanation for the observed inter-embryo communication following injury.",
      "section": "Discussion",
      "topic": "Model of Inter-Embryo Signaling",
      "chunk_summary": "A model is proposed where injury induces calcium waves and ATP release, with ATP binding to P2 receptors on neighboring embryos, triggering a secondary calcium response dependent on intracellular calcium stores.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A computational model using agent-based cellular automata was developed to understand the collective dynamics underlying CEMA.  The model emphasized anatomical homeostasis and resistance to noise.  Affected embryos seek signaling information from others in the cohort, reflecting the idea that stress propagation is important for collective problem-solving.  The model reinforces the importance of inter-embryonic signaling in CEMA, with local interactions sufficient to overcome noise and support normal development.  However, open questions remain regarding the number of agents needed for collective behavior and the precise nature of inter-embryonic signaling.  Future work will address these questions and refine the model to incorporate factors like death signaling and more realistic initial embryonic configurations.",
      "section": "Discussion",
      "topic": "Computational Model and Collective Dynamics",
      "chunk_summary": "A computational model highlighted the role of local interactions and stress propagation in CEMA, but further refinement is needed to address open questions about collective dynamics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Several open questions remain, including how CEMA operates in the wild and its limits across injury types.  Future work will investigate CEMA in other systems, particularly mammals, and explore connections to Allee effects and horizontal transfer of influence via exosomes or transplanted tissues.  Evolutionary implications related to group selection and the information flows determining embryonic outcomes will also be investigated.  The study challenges the assumption that external factors are solely due to inanimate environment, competition, or harmful biotic agents, highlighting the importance of beneficial cross-embryo communication.",
      "section": "Discussion",
      "topic": "Future Directions and Implications",
      "chunk_summary": "Future research will explore CEMA in other systems, its evolutionary implications, and its potential connections to other forms of horizontal information transfer.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The discovery of CEMA has practical implications for developmental toxicity studies.  Current assays may underestimate teratogenic potential due to unwitting CEMA effects, as they are rarely conducted on singletons.  Stating cohort size in assays and re-evaluating previous studies with varying group sizes is crucial.  Understanding CEMA could also improve biomedicine by potentially triggering the protective response therapeutically.  Beneficial cross-embryo communication is an exciting phenomenon with potential for addressing birth defects and other morphogenetic disorders.",
      "section": "Discussion",
      "topic": "Practical Implications of CEMA",
      "chunk_summary": "CEMA has implications for developmental toxicity studies and potential therapeutic applications in biomedicine.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This work was supported by the Emerald Gate Charitable Trust, the NIH (S100D032203), and the Army Research Office/DARPA (W911NF-19-2-0027). The views and conclusions contained in this document are those of the authors and should not be interpreted as representing the official policies, either expressed or implied, of the Army Research Office/DARPA or the U.S. Government. The U.S. Government is authorized to reproduce and distribute reprints for Government purposes notwithstanding any copyright notation herein.",
      "section": "Acknowledgements",
      "topic": "Funding and Disclaimer",
      "chunk_summary": "The study acknowledges funding sources and provides a standard disclaimer regarding the views expressed.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Xenopus laevis tadpoles were reared in 0.1x MMR, pH 7.8, using standard procedures and staged according to Nieuwkoop and Faber. Embryos were raised at 14°C, fed Sierra Micron powdered diet, and media changes were performed three times a week. Tadpoles were raised in dishes sized according to cohort size. Thioridazine was dissolved in water, aliquoted, and frozen. Neurula stage embryos were treated with 90 µM thioridazine from NF stage 12.5 to 26 at 18°C, then returned to 14°C. Forskolin was dissolved in DMSO, aliquoted, and frozen. Stage 10 embryos were exposed to 5 µM forskolin at 14°C. Nicotine exposure (0.1mg/mL) occurred from stage 11 to 35 at 18°C, followed by rinsing and return to 14°C. Suramin was dissolved in DMSO, aliquoted, and frozen. Exposure (100 µM) occurred at NF stage 12.5-26 at 18°C, then returned to 14°C. Calcium wave experiments used NF stage 10-12 embryos exposed to 100 µM suramin for 30 minutes prior to treatment at 18°C.",
      "section": "Materials and Methods",
      "topic": "Animal Husbandry and Pharmacological Exposures",
      "chunk_summary": "This section details the animal husbandry procedures and pharmacological exposure protocols for Xenopus laevis embryos.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Morphometric analysis was performed on tadpoles imaged with a Nikon SMZ1500 microscope. Landmarks were based on reproducibility, and ImageJ was used to measure head width and angle.  mRNA for dominant-negative Kir6.1 and GCAMP6S was synthesized and microinjected into embryos.  Embryos were injected at the 2-cell stage (Kir6.1) or 4-cell stage (GCAMP6S) and transferred to recovery media.  Calcium imaging was performed on GCAMP6S-injected embryos using a ZEISS microscope.  Spontaneous activity was recorded for 10 minutes, followed by mechanical injury and 20 minutes of post-injury recording.  Image stacks were processed in Fiji, and calcium signals were normalized to spontaneous activity.  Wave speeds were calculated within and between embryos.",
      "section": "Materials and Methods",
      "topic": "Morphometrics, Microinjection, and Calcium Imaging",
      "chunk_summary": "This section describes the methods for morphometric analysis, mRNA microinjection, and calcium imaging in Xenopus embryos.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The computational model was implemented in MATLAB. Each ECA consisted of 149 cells with a runtime of Ncells/2.  ECAs followed the GKL rule to solve the majority problem, with an initial configuration of 60% 1s and 40% 0s.  Embryo groups were simulated in square configurations.  Health values were initialized at 1, and noise (teratogen exposure) reduced health by a parameterized percentage.  Affected embryos updated their health based on weighted input from neighbors.  Supportive signaling from neighbors also influenced health updates, with weights proportional to health status.  Embryos followed the GKL rule if health was above 0.5, otherwise a random update rule.  Noise and health decrease parameters were optimized to fit experimental data.  Simulations were run 20 times, and confidence intervals were calculated.",
      "section": "Materials and Methods",
      "topic": "Computational Model Details",
      "chunk_summary": "This section provides details on the implementation and parameterization of the computational model used to simulate CEMA.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "For the RNA extraction, embryos were sacrificed at stage 35. Samples of 15 pooled tadpoles were collected in triplicate. RNA was extracted using TRIzol, and quality and quantity were assessed using a NanoDrop.  For RNA sequencing, RNA was sent to the Tufts Genomic Core for quality assessment and library preparation using Illumina Stranded Total RNA with Ribo-Zero Plus. Sequencing was performed on Illumina HiSeq 2500. Raw reads were processed using fastp, aligned to the Xenopus laevis rRNA and genome using Bowtie2 and STAR, respectively. Gene expression was estimated using RSEM, and low expressing genes were filtered. Counts were normalized by TMM and Voom transformed. Surrogate variables were identified and adjusted for, along with batch effects. PCA and differential expression analysis were performed using limma. Pathway analysis was conducted using clusterProfiler.",
      "section": "Materials and Methods",
      "topic": "RNA Extraction and Sequencing",
      "chunk_summary": "This section describes the procedures for RNA extraction, rRNA depletion, RNA sequencing, and subsequent bioinformatics analysis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Statistical analyses were performed using Prism 9. Biological replicates (N=3-6) were conducted with n>50 embryos per treatment. Data were analyzed using non-parametric t-tests or ANOVA.",
      "section": "Materials and Methods",
      "topic": "Statistical Analysis",
      "chunk_summary": "Statistical analyses were performed using Prism 9, with non-parametric t-tests or ANOVA used to analyze data from biological replicates.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_212954.pdf",
      "original_filename": "pdf_20250803_124125_212954_extracted_text.txt",
      "authors": "[\"Tung, A.\", \"Sperry, M.\", \"Clawson, W.\", \"Pavluri, A.\", \"Bulatao, S.\", \"Yue, M.\", \"Flores, R. M.\", \"Pai, V.\", \"McMillen, P.\", \"Kuchling, F.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:24:05.325503"
}