{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_756831_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_756831.pdf",
    "file_size": 35462,
    "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
    "journal": "Development",
    "doi": "10.1242/dev.077917",
    "year": "2012",
    "title": "Transmembrane voltage potential controls embryonic eye patterning in Xenopus laevis",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "Uncovering the molecular mechanisms of eye development is crucial for understanding the embryonic morphogenesis of complex structures, as well as for the establishment of novel biomedical approaches to address birth defects and injuries of the visual system. Here, we characterize change in transmembrane voltage potential (Vmem) as a novel biophysical signal for eye induction in Xenopus laevis. During normal embryogenesis, a striking hyperpolarization demarcates a specific cluster of cells in the anterior neural field. Depolarizing the dorsal lineages in which these cells reside results in malformed eyes. Manipulating Vmem of non-eye cells induces well-formed ectopic eyes that are morphologically and histologically similar to endogenous eyes. Remarkably, such ectopic eyes can be induced far outside the anterior neural field. A Ca2+ channel-dependent pathway transduces the Vmem signal and regulates patterning of eye field transcription factors. These data reveal a new, instructive role for membrane voltage during embryogenesis and demonstrate that Vmem is a crucial upstream signal in eye development. Learning to control bioelectric initiators of organogenesis offers significant insight into birth defects that affect the eye and might have significant implications for regenerative approaches to ocular diseases.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in eye development",
      "chunk_summary": "Transmembrane voltage potential (Vmem) acts as a biophysical signal for eye induction in Xenopus laevis, with hyperpolarization demarcating eye field cells and manipulation of Vmem inducing ectopic eyes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Embryonic eye development offers the opportunity to understand the genetic and biophysical mechanisms that drive the self-assembly of complex biological structures. Eye tissue formation begins with the regionalization of anterior neural plate into an \\\"eye field\\\". The eye field is further resolved into bilateral eye primordia by the dynamic expression of EFTFs. However, relatively little is known about the regulation of EFTF bilateral refinement. EFTFs are not induced until neurulation and are not exclusively involved in eye development; Pax6 and Rx1 play important roles in brain development, neuronal migration and other processes. This suggests the existence of as yet uncharacterized additional instructive signal(s) that drive certain embryonic cells specifically toward eye formation. Could eyes be induced by an even more minimal set of signals? And, could eye formation be induced in vivo at locations far from the anterior neural field? The identification and characterization of such signals would have tremendous potential for therapeutic applications, as well as shedding light on endogenous mechanisms of lineage restriction and morphogenetic control.",
      "section": "Introduction",
      "topic": "Eye development and open questions",
      "chunk_summary": "While eye development begins with eye field regionalization driven by EFTFs, the precise signals regulating bilateral refinement and the potential for inducing eyes with minimal signals remain open questions.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Endogenous steady-state ion currents, voltage gradients and electric fields produced by ion channels and pumps in all cells (not just excitable neurons and muscle) are crucial regulators of patterning. They control cell migration, proliferation and differentiation in a wide variety of systems. Although epithelial electric fields have been implicated in adult eye wound healing, the roles of ion flows in eye development have not been explored. In Xenopus laevis, we have uncovered an endogenous role for plasma membrane voltage gradients during eye development, and show that artificially induced changes in transmembrane potential (Vmem) are sufficient to induce well-formed eyes outside of the anterior neural field. Thus, Vmem is an important endogenous component of the eye induction cascade and presents a tractable control point for the therapeutic induction of visual system tissues.",
      "section": "Introduction",
      "topic": "Bioelectricity in development and regeneration",
      "chunk_summary": "Endogenous bioelectric signals regulate patterning processes, and this study reveals a role for Vmem in Xenopus laevis eye development, suggesting its potential as a control point for therapeutic induction of visual system tissues.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Xenopus laevis embryos were fertilized in vitro according to standard protocols in 0.1× Marc's Modified Ringer's (MMR). Intracellular ion concentrations in Xenopus are known. Xenopus embryos were housed at 14-18°C and staged according to Faber and Nieuwkoop. Capped synthetic mRNAs generated using mMessage mMachine (Ambion) were resuspended in water and injected (3 nl per blastomere) into embryos in 3% Ficoll. All experiments were approved by the Tufts University Animal Research Committee in accordance with the Guide for Care and Use of Laboratory Animals.",
      "section": "Materials and Methods",
      "topic": "Animal husbandry and mRNA injection",
      "chunk_summary": "Standard protocols were used for Xenopus laevis embryo fertilization, housing, staging, and mRNA injection, with ethical approvals obtained.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Fresh CC2-DMPE (Molecular Probes) stocks (1 mg/ml in DMSO) were diluted 1:1000 in 0.1× MMR to 0.2 µM. Embryos were soaked in CC2-DMPE dye for 1.5 hours followed by five washes in 0.1× MMR. Embryos in 0.1× MMR were imaged using 405 nm excitation and 460 nm emission on a Nikon AZ100 microscope with an Andor Luca digital CCD camera and NIS-Elements software.",
      "section": "Materials and Methods",
      "topic": "Voltage imaging",
      "chunk_summary": "Embryos were stained with CC2-DMPE voltage-sensitive dye and imaged using a Nikon AZ100 microscope with specific excitation and emission wavelengths.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "To document real-time changes in Vmem during eye development, we used the voltage-sensitive dye CC2-DMPE to detect hyperpolarization in the Xenopus embryo in vivo. A physiological screen for bioelectric patterns during craniofacial development revealed that, starting at stage 17/18, normal embryos exhibit two small areas in the anterior neural field that are bilaterally positioned and hyperpolarized relative to their neighbors. Whole-cell electrophysiological recordings of Vmem from these areas and from the neighboring tissues on the flank of the same embryo revealed that the CC2-DMPE-demarcated domains were hyperpolarized relative to neighboring tissues by ~10 mV (also confirming the ability of the CC2-DMPE dye to detect cells with hyperpolarized Vmem). Other regions of the embryo also exhibit interesting distributions of Vmem; these are described elsewhere and will be investigated in subsequent work. Vmem collapses upon cell death and thus cannot be imaged simultaneously with in situ hybridization. We imaged the hyperpolarized Vmem signal using CC2-DMPE at stage 17/18 and immediately fixed the embryos for in situ hybridization analysis of the EFTFs Otx2, Rx1 and Pax6. The relatively broad anterior expression of EFTFs appeared to overlap with the hyperpolarized cells.",
      "section": "Results",
      "topic": "Hyperpolarization in anterior neural field",
      "chunk_summary": "Bilateral hyperpolarized cell clusters in the anterior neural field were observed during Xenopus eye development, coinciding with the expression of EFTFs.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "To determine whether hyperpolarization is functionally required for eye development, we performed a loss-of-function experiment by depolarizing Vmem of the relevant cells. We used the constitutively conductive EXP1 cation channel and the glycine-gated chloride channel (GlyR), which can be permanently activated by the specific GlyR opener Ivermectin (IVM). The use of two different molecular reagents (channels that share no sequence or structural homology and have in common only their effect on membrane potential) specifically tested the role of Vmem per se, independent of possible other functions of a particular channel protein or ion species. In standard 0.1× MMR medium, these channels work to depolarize cells. Embryos were injected with GlyR or EXP1 mRNA in the dorsal two cells of the four-cell embryo and were stained with CC2-DMPE dye at stage 19. GlyR-injected embryos were treated with the channel opener IVM from stage 17 to 23 to enable the efflux of chloride that depolarizes GlyR-expressing cells. In contrast to uninjected embryos, which show distinct bilaterally hyperpolarized cell clusters, GlyR and EXP1 misexpression strongly reduced or disrupted the hyperpolarization pattern in the injected embryos. This confirmed that our reagents produce the expected loss-of-function effect on the hyperpolarization pattern. We saw no signs of general toxicity or ill-health from ion channel mRNAs, which were titrated to the lowest levels needed to produce eye phenotypes: dorsoanterior index, midline patterning, overall growth rate and proportion, and behavior were all normal, ruling out simple toxicity as a cause of eye malformation. Consistent with existing evidence of Vmem changes being associated with specific tissue outcomes, we occasionally observed additional interesting patterning phenotypes involving other organs, which will be characterized in subsequent studies.",
      "section": "Results",
      "topic": "Depolarization disrupts eye development",
      "chunk_summary": "Depolarizing the anterior neural field cells using EXP1 or GlyR channels disrupted the hyperpolarization pattern and resulted in malformed eyes, confirming the functional requirement of hyperpolarization for eye development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "To determine whether the observed hyperpolarization is required for normal eye development, GlyR or EXP1 mRNA was injected into the dorsal blastomeres at the four-cell stage and the embryos scored for eye development at stage 42. Uninjected, lacZ-injected, GlyR-injected and IVM-treated embryos served as controls. Control embryos had intact, fully closed, well-formed eyes. By contrast, expression of GlyR plus IVM treatment, or expression of EXP1 mRNA, caused a high incidence of disrupted endogenous eye formation (48% and 46%, respectively). Phenotypes included incomplete eye formation, small or absent eyes, fusion to the brain and pigmented optic nerves. Although bioelectric events can exert effects at long range, the position of the bilateral hyperpolarized regions suggested a local role. We examined the effects of inducing depolarization elsewhere in the embryo. Injection of GlyR mRNA plus IVM treatment or of EXP1 mRNA into the two ventral blastomeres (which make a minor contribution, if any, to eye fate lineages) caused no significant effect on eye development. To allow a direct comparison of the injected and uninjected sides of the same embryo and to further test the effective range of influence of hyperpolarization, only one side (one dorsal cell at the four-cell stage) of the embryo was targeted by depolarizing channel mRNA (GlyR plus IVM) while leaving the contralateral side as an internal control. The mRNA was mixed with a lineage tracer (lacZ mRNA); eye defects occurred only in regions that had been targeted by the depolarizing mRNA, whereas normal eye development occurred on the uninjected region of the same embryo. Taken together, these results demonstrate that the bilateral hyperpolarized cell clusters in the anterior neural field are an important, specific component of normal eye development and that this signal works in a local fashion.",
      "section": "Results",
      "topic": "Localized effect of hyperpolarization",
      "chunk_summary": "Targeted depolarization of dorsal blastomeres resulted in eye defects, while depolarization of ventral blastomeres had no effect, indicating a localized role for hyperpolarization in eye development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Confocal images of sections through endogenous and ectopic eyes immunostained for retinal differentiation markers (Glutamine synthetase, Islet-1, XAP2, and Calbindin) showed similar differentiated retinal cell populations. Co-immunostaining for rods, Muller cells, amacrine cells, and nuclei revealed similar organization of differentiated retinal cell populations in both endogenous and ectopic eyes. In situ hybridization of control embryos and embryos injected with DNKir6.1p mRNA for eye development markers Otx2, Pax6, and Rx1 showed ectopic expression of Pax6 and Rx1 in injected embryos, but no ectopic Otx2 expression. The Vmem signal functions in defining the pattern of these canonical EFTFs. Analysis of the timing of the bilateral hyperpolarization signal, the bilateral regionalization of Rx1/Pax6 expression to eye domains, and the ability of dominant-negative Pax6 to disturb the normal hyperpolarization pattern, all suggest a feedback loop between the biophysical and transcriptional signals. Cross-talk between Pax6 and the Vmem signal might result in a dynamic bilateral regionalization of the eye field, similar to the role of progressive depolarization in the differentiation of human mesenchymal stem cells. Consistent with the hyperpolarization-induced expression of eye genes such as Pax6 and Rx1, eye tissue and indeed complete eyes can be formed by just one ion channel mRNA that modulates Vmem. Although often only patches of individual tissue (RPE or lens) are formed, complete whole eyes can be produced that have the tissue layers and anatomical structure of native eyes. The same phenotype resulted from induced flows of different ion species and could be manipulated by direct control of ionic gradients precisely as predicted by the Goldman equation. These data reveal that eye induction is mediated by changes in Vmem itself - a physiological parameter that is not necessarily tied to any one gene product, much as substrate geometry is now known to be a physical parameter controlling cell behavior. This is a desirable property from the perspective of developing biomedical applications because interventions (e.g. small-molecule drug cocktails designed to control Vmem in key cell groups) are not dependent on any one protein but can take advantage of convenient channels or pumps expressed in the host.",
      "section": "Results",
      "topic": "Ectopic eye induction and Vmem",
      "chunk_summary": "Manipulating Vmem can induce ectopic eyes with similar characteristics to endogenous eyes, suggesting Vmem as a sufficient signal for eye formation, potentially through a feedback loop with EFTFs like Pax6 and Rx1.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "The Vmem eye induction signal is transduced via Ca2+ influx, as shown by experiments using Fluoxetine, Lindane, and Verapamil.  The percentage of ectopic eye tissue formation was significantly reduced in the presence of Verapamil, a calcium channel blocker.",
      "section": "Results",
      "topic": "Calcium signaling in eye induction",
      "chunk_summary": "Calcium influx plays a role in transducing the Vmem signal for eye induction.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Morphogenetic roles for Vmem have been demonstrated in various systems. Having screened for bioelectrical pre-pattern during the development of Xenopus embryos, we observed a bilateral, distinctly hyperpolarized cluster of cells in the anterior neural field and show that this hyperpolarization is required for normal eye development. Eye defects were induced by two independent means of depolarizing anterior neural field cells: misexpression of a depolarizing cation channel (EXP1) or of a chloride channel (GlyR). In the latter case, modulation of [Cl⁻]ex allowed control of the magnitude of the effect (in accordance with the Goldman equation). The ability to disrupt eye development using distinct constructs that mediate the flux of different ions (sodium, potassium or chloride) and have in common only their effect on Vmem strongly supports the Vmem signal as a factor necessary for normal eye development. Molecular analysis revealed that perturbing the endogenous Vmem signal altered the endogenous expression pattern of Rx1 and Pax6. Additionally, manipulating the Vmem of non-eye cells induces de novo Rx1 and Pax6 expression. These results suggest that bioelectric cues are upstream regulators of these key transcription factors in eye development.",
      "section": "Discussion",
      "topic": "Vmem and eye development",
      "chunk_summary": "Vmem plays a necessary role in eye development, as demonstrated by depolarization experiments and the observed alteration of Rx1 and Pax6 expression patterns upon Vmem perturbation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "The ability to induce ectopic eyes by misexpression of ion channels is consistent with the idea that Vmem is not only necessary but also sufficient to induce eye formation. The induction of ectopic eyes by misexpression of DNKir6.1p demonstrates that depolarization is sufficient to induce ectopic eyes. The fact that ectopic eyes were induced by a variety of ion channels (DNKir6.1p, DNKir6.1-ER, TRPM7, ENaC and Nav1.5) that share no sequence or structural homology but do control Vmem, suggests that the key instructive signal is indeed carried by Vmem per se, and not by an ion-specific or ion-independent (e.g. scaffolding) role of our channel constructs. Moreover, the fact that ectopic eyes were induced by both depolarizing and hyperpolarizing conditions (DNKir6.1p and Nav1.5, respectively) suggests that the absolute value of Vmem is not the key instructive signal. Rather, it is the perturbation of the endogenous Vmem pattern that is sufficient to induce ectopic eyes. This is consistent with the observation that ectopic eyes were induced by both dorsal and ventral injections of DNKir6.1p, which would be expected to have opposite effects on the endogenous Vmem gradient.",
      "section": "Discussion",
      "topic": "Vmem sufficiency for eye induction",
      "chunk_summary": "The induction of ectopic eyes by various ion channels suggests that Vmem, rather than specific ion fluxes, is sufficient for eye formation, with perturbation of the endogenous Vmem pattern being the key trigger.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Our results suggest that the bioelectric signal is transduced via Ca²⁺ influx. This is consistent with the role of Ca²⁺ as a second messenger in a variety of signaling pathways, including those involved in eye development. However, the specific downstream targets of Ca²⁺ signaling in eye induction remain to be identified. The ability to induce ectopic eyes by modulating Vmem has important implications for regenerative medicine. The fact that ectopic eyes can be induced in non-eye tissues suggests that Vmem could be used to reprogram cells to an eye fate. This could be useful for treating eye diseases such as macular degeneration, which is currently incurable. Our results suggest that Vmem plays a crucial role in eye development. This bioelectric signal is necessary for the normal patterning of eye development genes and is sufficient to induce ectopic eyes. These findings have important implications for our understanding of eye development and for the development of new therapies for eye diseases.",
      "section": "Discussion",
      "topic": "Ca2+ signaling and regenerative implications",
      "chunk_summary": "Ca2+ influx likely transduces the bioelectric signal, and the ability to induce ectopic eyes via Vmem modulation holds promise for regenerative medicine, particularly for treating eye diseases.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Our data show that the bilateral hyperpolarizing Vmem signal in the anterior neural field plays a crucial role in regionalization of EFTF expression and thus eye development. Upon perturbation of the bilateral Vmem signal, a major proportion of the malformed eye phenotypes (74%) represent failure of eye field separation (e.g. eyes fused to brain, eyes fused along midline, and eyes with pigmented optic nerve/stalk). We propose a hypothetical model in which feedback between Vmem and Pax6 establishes a stable, bilaterally regionalized pattern of Pax6 and other EFTF expression. Conversely, induction of an appropriate Vmem signal in non-eye cells results in ectopic induction and maintenance of EFTFs, driving the formation of ectopic eye tissues, perhaps by establishing the same stable feedback loop. Neural tissue and Otx2 expression are thought to be crucial for eye induction. The ability to form ectopic eyes without induction of additional primary axes or central nervous system tissue (lack of ectopic Otx2) is very interesting and suggests a more direct (downstream) linkage of Vmem to eye-specific cascades. Indeed, bioelectrically induced eyes can be formed on the gut or within lateral mesoderm – non-neural tissues outside the known competence lineage for eyes. Similarly, patches of lens/retina readily form in the tail. By contrast, Pax6 alone is incapable of initiating an eye field in regions outside the competent neurectoderm, suggesting that additional factors might also be involved in positive-feedback interactions with Vmem. However, Vmem is able to initiate not only Pax6 expression but also the conditions that make tissues competent to form eyes upon Pax6 transcription.",
      "section": "Discussion",
      "topic": "Model of Vmem and Pax6 interaction",
      "chunk_summary": "A model is proposed where Vmem and Pax6 interact in a feedback loop to establish bilateral eye field regionalization, and Vmem can induce ectopic eyes even in non-neural tissues, expanding the understanding of eye competence lineages.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Temporally and spatially restricted hyperpolarization has previously been shown to drive cellular fate. Moreover, specific cellular responses to windows of Vmem have also been documented. Our data suggest the presence of a narrow hyperpolarization range that specifies the Vmem signal for eye induction. Cells that are normally more strongly hyperpolarized than the eye-specific Vmem values can be driven into this range by depolarizing channels, whereas cells that are normally depolarized will be pushed into this range by hyperpolarizing channels. Accordingly, both depolarizing (dominant-negative KATP) and hyperpolarizing (Kv1.5) channels are capable of inducing ectopic eyes. The consequences of changes in Vmem (by altering [Na⁺]ex) in Nav1.5-injected embryos also support the induction of ectopic eye tissues when cells are moved into a narrow range of Vmem. Together, these data suggest a specific range of Vmem values for eye induction – changes in Vmem to levels above or below this target range do not result in eye induction. Also in line with this model, depolarization of endogenous eye field cells represses or disrupts eye formation by driving the Vmem of these cells out of the 'normal' permissive range. The narrow range of eye-compatible Vmem values is in line with our observation that only a small subset of injected cells within any tadpole form ectopic eye tissues. In conclusion, we have characterized a Vmem-mediated signal that is necessary for patterning of Pax6 and Rx1 expression during normal eye development. This Vmem signal is also sufficient for induction of ectopic EFTF expression and eye formation. Vmem-induced ectopic eyes are formed in regions far outside the anterior neural tissues, which were conventionally thought to be the only region competent to form eyes. The discovery of bioelectrical signals that initiate the development of an organ as complex as the eye paves the way to important future work on the developmental and evolutionary roles of ion channel- and pump-derived gradients as mediators of patterning during embryogenesis. Moreover, the ability of changes in Vmem to initiate the formation of a complete vertebrate organ suggests a potential class of novel strategies for regenerative medicine and repair of birth defects.",
      "section": "Discussion",
      "topic": "Vmem range for eye induction",
      "chunk_summary": "A specific, narrow range of Vmem values is crucial for eye induction, with deviations from this range disrupting normal eye development or inducing ectopic eyes, highlighting the potential of Vmem manipulation for regenerative medicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "We thank Dr. Richard Harland for providing the Pax6 constructs. We also thank members of the Levin laboratory for helpful discussions. This work was supported by NIH grant EY019969. Deposited in GenBank/EMBL/DDBJ under accession numbers JQ064809, JQ064810, JQ064811.",
      "section": "Acknowledgements",
      "topic": "Acknowledgements and funding",
      "chunk_summary": "Acknowledgements are given to contributors and funding sources.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    },
    {
      "text": "Acampora et al. (1995), Adams et al. (2007), Bailey et al. (2004), Beane et al. (2011), Blackiston et al. (2011), Chow et al. (1999), Ficker et al. (2000), Fukumoto et al. (2005), Gehring and Ikeo (1999), Huang and Ingber (2006), Ingber (2006), Kurtz and Schrank (1955), Levin (2006), Levin (2009), Levin et al. (2002), Lupo et al. (2002), Marsh and Beams (1947), McCaig et al. (2009), Nakanishi and Okazawa (2006), Nichols (2006), Nieuwkoop and Faber (1967), Nishiyama et al. (2008), Schwappach et al. (2000), Shi and Borgens (1995), Sundelacruz et al. (2009), Vandenberg et al. (2011), Woodruff and Telfer (1980), Zaghloul et al. (2005), Zuber et al. (2003).",
      "section": "References",
      "topic": "References",
      "chunk_summary": "List of cited works related to eye development, bioelectricity, and regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_756831.pdf",
      "original_filename": "pdf_20250803_124125_756831_extracted_text.txt",
      "authors": "[\"Vaibhav P. Pai\", \"Sherry Aw\", \"Tal Shomrat\", \"Joan M. Lemire\", \"Michael Levin\"]",
      "year": "2012",
      "journal": "Development",
      "doi": "10.1242/dev.077917"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:34:57.273816"
}