{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_707451_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_707451.pdf",
    "file_size": 15222,
    "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
    "journal": "PLoS ONE",
    "doi": "10.1371/journal.pone.0024953",
    "year": "2011",
    "title": "Long-Distance Signals Are Required for Morphogenesis of the Regenerating Xenopus Tadpole Tail, as Shown by Femtosecond-Laser Ablation",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "With the goal of learning to induce regeneration in human beings as a treatment for tissue loss, research is being conducted into the molecular and physiological details of the regeneration process. The tail of Xenopus laevis tadpoles has recently emerged as an important model for these studies; we explored the role of the spinal cord during tadpole tail regeneration.",
      "section": "Abstract",
      "topic": "Tadpole tail regeneration",
      "chunk_summary": "Xenopus laevis tadpole tails serve as a valuable model for studying regeneration due to their regenerative capabilities and similarities to mammalian tissue renewal.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "Using ultrafast lasers to ablate cells, and Geometric Morphometrics to quantitatively analyze regenerate morphology, we explored the influence of different cell populations. For at least twenty-four hours after amputation (hpa), laser-induced damage to the dorsal midline affected the morphology of the regenerated tail; damage induced 48 hpa or later did not. Targeting different positions along the anterior-posterior (AP) axis caused different shape changes in the regenerate. Interestingly, damaging two positions affected regenerate morphology in a qualitatively different way than did damaging either position alone. Quantitative comparison of regenerate shapes provided strong evidence against a gradient and for the existence of position-specific morphogenetic information along the entire AP axis.",
      "section": "Abstract",
      "topic": "Laser ablation and morphometrics",
      "chunk_summary": "Laser ablation studies combined with morphometric analysis revealed that damage to the dorsal midline within 24 hpa affects tail regenerate morphology, with position-specific effects along the AP axis, suggesting the presence of localized morphogenetic information.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "We infer that there is a conduit of morphology-influencing information that requires a continuous dorsal midline, particularly an undamaged spinal cord. Contrary to expectation, this information is not in a gradient and it is not localized to the regeneration bud. We present a model of morphogenetic information flow from tissue undamaged by amputation and conclude that studies of information coming from far outside the amputation plane and regeneration bud will be critical for understanding regeneration and for translating fundamental understanding into biomedical approaches.",
      "section": "Abstract",
      "topic": "Morphogenetic information flow",
      "chunk_summary": "The study concludes that morphogenetic information, crucial for tail regeneration, flows through an undamaged spinal cord and is not localized to the regeneration bud, emphasizing the importance of long-distance signaling in regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "Tails of tadpoles of the Anuran Xenopus laevis are complicated appendages that have recently become an important model for the study of vertebrate regeneration [1,2,3,4,5,6,7]. The process is under investigation due to the tremendous biomedical potential of techniques that might induce limb and spinal cord regeneration in humans, since tadpole tails appear to regenerate by tissue renewal [8], as mammals do, and they offer the opportunity to study endogenous mechanisms of regeneration as well as to attempt improvement of regenerative ability during non-regenerative stages. We have previously explored the role of H+-flux during tail regeneration [9]; in that work evidence was presented for the presence of a patch of depolarized cells found anterior to the amputation plane, in an area called the shoulder, that is also characterized by the appearance of disorderly melanocytes, pigment cells known to be highly sensitive to the electrical properties of nearby cells [10,11]. A similar patch of depolarized cells has also been found in the shoulder region of regenerating Axolotl (Urodele) tails [12]. While most studies focus on the role of cells at or near the regeneration bud, (Fig. 1B) [13,14,15], the discovery of these more anterior depolarized cell patches, as well as other results, suggest that necessary signals come from further away ([16] unpublished observations). Indeed there are older experiments indicating the existence of regeneration-regulating signals that act over long distances and require the spinal cord including signals that come from as far away as the brain [17,18,19,20]. The requirement for an intact spinal cord has most recently been tested by surgical excision [4]. To learn more about the role of different cell populations and long-distance signaling during tail regeneration, we decided to do ablation studies.",
      "section": "Introduction",
      "topic": "Long-distance signaling in regeneration",
      "chunk_summary": "Xenopus laevis tadpole tails are a valuable model for studying regeneration, with evidence suggesting that long-distance signals, potentially originating from as far as the brain and requiring an intact spinal cord, play a crucial role in the process.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "Embryos were generated and gathered according to standard techniques [30] and in strict accordance with the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. The protocol was approved by the Institutional Animal Care and Use Committee, Tufts University (Permit Number: 2008-08). Amputation and laser treatment was performed under tricaine anesthesia, and all efforts were made to minimize suffering. At stage 39 to 40, animals were anesthetized with 1.5% tricaine and, once movement ceased, their tails were amputated using a fresh number 10 scalpel blade, between two-thirds and one-half of the distance from trunk to tail tip. The cuts were made perpendicular to the dorsal axis of the tail (Fig. 1A). After a few minutes, the tadpoles were returned to fresh 0.1× Modified Marc's Ringers (MMR) and transferred to the laser lab. Animals to be treated at 48 hpa were maintained in 0.1 × MMR at 22°C for 40 hours before transfer. For exposure to the laser, Xenopus embryos (ranging from 2-48 hpa) were placed in the glass depression of a 35 mm FluoroDish (World Precision Instruments; store.wpiinc.com) filled with ~0.5 ml 1.5% tricaine in 0.1× MMR. The animals were oriented sideways, to present a lateral view of the tail. They were then held in position by a cover slip and positioned so that the laser was aimed at a melanocyte. Between 1 and 20 insults were delivered, with the laser focused first on the middle of a melanocyte, with subsequent insults being delivered to the smaller pigmented areas that form as a result of the first insult breaking apart the melanocyte. Immediately following exposure, tadpoles were prepared for histology or returned to 0.1× MMR and maintained for 8-10 days at 22°C. Once control tails had regenerated, controls and treated tadpoles were anesthetized and photographed. Three regions, comprising subsets of seven areas of the tail, were targeted: (1) the regeneration bud (RB); (2) the shoulder, including the dorsal somite (dorsSom), shoulder spinal cord (shSC), notochord (noto), and ventral somite (ventSom); and (3) the spinal cord, including the anterior spinal cord (antSC), the posterior spinal cord (postSC) and the shSC (Fig. 1B).",
      "section": "Materials and Methods",
      "topic": "Experimental procedures",
      "chunk_summary": "This section details the experimental procedures, including Xenopus husbandry, tail amputation, laser exposure parameters, and targeted regions of the tail.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "The optical setup used for laser ablation of Xenopus tadpoles is shown in Fig. 1C and described in detail in [31]. Pulses with center wavelength of 810 nm, repetition rate 80 MHz, and pulse width of 120 fs, were generated from a Ti:sapphire oscillator (Spectra Physics: Tsunami). The average pulse power at the sample was varied between 100 mW-750 mW using a neutral density wheel. Included in the beam path was a shutter controller (Thorlabs: SC10) to limit the number of pulses incident on the specimen at one time. The pulses were focused onto the specimen using an inverted microscope (Olympus Microscopes: IX71). The focused beam was slightly elliptical with a measured (full width half max) spot size of 2.6 µm×3.4 µm after the 10x microscope objective. The petri dish holding the tadpole sat on top of a motorized x-y stage (Ludl Electronic Products) and its motion was monitored in real-time with a CCD camera. A custom computer interface (NI-LabVIEWTM) was designed to move the stage, control the shutter duration, and record the target location (Fig. 1D). The laser power and the shutter duration were varied to determine useful parameters, defined as settings that caused visible damage while minimizing the number of cavitations bubbles and any damage that caused bleeding or tissue loss through damaged skin. After varying the shutter open time from 10 ms to 1 s and power from 100 mW to 750 mW, we settled on a shutter duration (At = 200 ms) and average laser power (Pavg = 205 mW). We defined an insult as this dose of laser energy.",
      "section": "Laser Ablation",
      "topic": "Laser ablation setup and parameters",
      "chunk_summary": "This section describes the laser ablation setup and parameters used, including the laser source, microscope, stage control, and optimization of laser power and shutter duration to minimize collateral damage.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "To position the anesthetized tadpoles with a lateral view presented to the camera, they were gently held by a staple that had been bent so as to cover without crushing the tail. Tails were photographed using a Nikon AZ100 with attached QImaging CD camera controlled by QCapture. Landmarks were placed on digital images using ImageJ [32] (http://rsbweb.nih.gov/ij/). Nine landmarks were used to describe each tail (Fig. 1E, Supporting Information S1). The first two landmarks were placed over the spinal cord at the plane of amputation and at the distal most tip of the notochord. The other seven marks were semilandmarks: the third landmark was placed over the spinal cord halfway between the first two, as determined by eye. The other six landmarks were placed by successive iterations of the halfway placement. When the 209 useable images had each been marked, the x and y coordinates of the marks along with hpa, position of the target, number of insults, laser power, and position of the amputation plane were compiled in excel and imported into MorphoJ [29]. MorphoJ was used to perform the operations needed for morphometric analysis, including calculation of centroids, Procrustes fits and distances, Eigenvalues, and canonical variates. The program also performed the canonical variate analysis (CVA) and resampling (permutation) tests, with a = 0.05 (see Supporting Information S1). MorphoJ is freely available from http://www.flywings.org.uk/MorphoJ_page.htm.",
      "section": "Morphometrics",
      "topic": "Morphometric analysis",
      "chunk_summary": "This section details the morphometric analysis methods used to quantify and compare regenerate morphology, including landmark placement, data processing, and statistical analysis using MorphoJ.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "Immediately after treatment, or at other relevant time points, anesthetized tadpoles were fixed in MEMFA [30] overnight at 4°C then processed for paraffin sectioning. 8 µm sections were stained with haemotoxylin and eosin then photographed using an Olympus BX-61 compound microscope with an Orca AG CC2 camera. The microscope and camera were controlled by MetamorphTM. All sections from each sample were examined at 10x for laser damage i.e., loss or disruption of tissue for example between the axial tissues and the surrounding muscle in figure 2A. Note that this is not to be confused with spaces between intact tissues or skin discontinuities caused by tissue shrinkage during fixation.",
      "section": "Histology",
      "topic": "Histological analysis",
      "chunk_summary": "This section describes the histological analysis methods used to assess tissue damage caused by laser ablation, including tissue fixation, sectioning, staining, and microscopic examination.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "To characterize the nature of the wounds caused by different numbers of insults, we examined images of histological cross sections from tadpoles fixed immediately after laser exposure. In particular, we focused on tissue damage associated with targeting melanocytes located around the spinal cord, the area that showed the most pronounced changes in the shape of the regenerate. Figure 2A shows four consecutive sections around one target. Since each section is 8 µm, the total damage caused by this single insult was recorded as 16 µm. When multiple insults were delivered as shown in figures 2B and C, a larger area, up to ±50 µm was ablated. Typically, multiple insults of a melanocyte near the spinal cord led to damage of the spinal cord and dorsal muscle (Fig. 2B) while insults to other areas induced damage of the same magnitude (Fig. 2C). The notochord was never seen to be damaged in these sections (red stars in Figs. 2A-C, E). If the insult was delivered to a target where the tissue was very thin, for example near the tip of the tail, the damage could extend all the way through the tail (data not shown). We also noted that the extent of damage seems to be related to the size of the melanocyte. When larger melanocytes were ablated with a single insult, some of the nearby tissue was also compromised (Fig. 2A). On the other hand, with smaller melanocytes only the melanocyte itself was damaged by the insult (Fig. 2D-F). Importantly, we were able to damage internal cells without damaging other cells in the path of the light (Fig. 2F). We also found that as many as eight days later, the site of the wound could easily be identified by a nearby cluster of pigmented spots (arrowheads Fig. 2G), of unknown identity. These spots are below the surface and are strongly autofluorescent at ex = 488 (Fig. 2H). We sought to characterize the extent of damage resulting from different numbers of insults. Sections were obtained from three tadpole tails each having been targeted four times, once each with 1, 5, 15, and 20 insults. Figure 21 plots the total damage (quantified from the number of consecutive damaged sections) as a function of number of insults. We found no correlation between the extent of damage and the number of insults, just a range of sizes between 10 and 50 µm. However, when the damage size was divided by the number of insults, an inverse exponential relationship was found (r² = 0.91). That is, each subsequent insult to pigment from the same melanocyte caused progressively less damage. On average, 15 insults were sufficient to cause damage to the nearby tissue.",
      "section": "Results",
      "topic": "Tissue damage characterization",
      "chunk_summary": "Histological analysis revealed that laser ablation caused localized tissue damage, with the extent of damage related to melanocyte size and subsequent insults causing progressively less damage.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "We were interested to know whether laser ablation at different times after amputation would yield any differences in the regenerate. We therefore ablated cells during three different time periods, 4±3 hpa, 24±3 hpa, and 48±3 hpa. These experiments revealed that normal regeneration was sensitive to damage at 4 and 24 hpa. At 48 hpa, however, laser induced damage did not cause morphological abnormalities in the regenerate. The effect of timing was also examined separately for the three subsets of cell types (RB, shoulder, and spinal cord) with the same result, that is, sensitivity at 4 and 24 hours, but not at 48. Therefore, subsequent laser exposure was performed within the first 2-6 hpa unless otherwise stated.",
      "section": "Results",
      "topic": "Regeneration sensitivity to ablation timing",
      "chunk_summary": "Regeneration was sensitive to laser ablation within the first 24 hpa, but not at 48 hpa, suggesting a critical time window for the influence of the targeted cells on regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "When tails are amputated and then left undisturbed, regeneration creates a tail very like the tail of uncut controls (Fig. 3A). Likewise, laser damage to the spinal cord of an uncut tail has no effect on the further growth of the tail (Fig. 3B,C). Interestingly, damage to the RB did not cause a discernable change in the regenerate shape (Fig. 3D). Unlike the dorsSom, shSC, noto, and ventSom which usually contain melanocytes, the RB lacks melanocytes and is therefore transparent to our laser wavelength. However, it is possible, with the maximum power used, to ablate this region and still no change in the regenerate was observed. Because of our interest in the hyperpolarized cells of the shoulder region, which appear at approximately 6 hpa, we examined the effects of ablating different cell populations along the DV axis in the shoulder (Fig. 1A,B). When compared to the controls (Fig. 3A-C) targeted insults to the dorsSom (Fig. 3E) and ventSom (Fig. 3H) caused no observable shape differences of the regenerate. On the other hand, we observed that damage to the shSC caused a pronounced upward dorsal bend of the regenerated tail (Fig. 3F). Less obvious is a slight upward dorsal bend associated with targeted insults to the noto (Fig. 3G).",
      "section": "Results",
      "topic": "Effects of ablation on different cell populations",
      "chunk_summary": "Ablation of the regeneration bud had no effect on regenerate shape, while damage to the shoulder spinal cord caused a dorsal bend, indicating the importance of this region in tail morphogenesis.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    },
    {
      "text": "After finding that ablation of cells in the shSC caused morphological abnormalities in the regenerate, we decided to examine the effect of damage at different AP positions along the length of the spinal cord. We defined two broad areas of the spinal cord, anterior and posterior, where antSC was any position anterior to the midpoint between the amputation plane and the posterior extent of the gut, and postSC comprised positions posterior to the midpoint but anterior to the shoulder (Fig. 1B).",
      "section": "Results",
      "topic": "Ablation along the AP axis",
      "chunk_summary": "Following the observation that shoulder spinal cord ablation affects regeneration, the study investigated the effects of damage at different anterior-posterior positions along the spinal cord.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_707451.pdf",
      "original_filename": "pdf_20250803_124126_707451_extracted_text.txt",
      "authors": "[\"Jessica P. Monda\", \"Michael Levin\", \"Florenzo G. Omenetto\", \"Ryan D. Orendorff\", \"Mary Rose Branca\", \"Dany Spencer Adams\"]",
      "year": "2011",
      "journal": "PLoS ONE",
      "doi": "10.1371/journal.pone.0024953"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:48:27.196604"
}