{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_575153_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_575153.pdf",
    "file_size": 42465,
    "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Brains and Where Else? Mapping Theories of Consciousness to Unconventional Embodiments",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "It is commonly assumed that a useful theory of consciousness (ToC) will explain why consciousness is associated with brains. However, evolutionary biology, developmental bioelectricity, and synthetic bioengineering reveal pre-neural roots of brain mechanisms, suggesting minds may have preceded brains.  Most work in diverse intelligence emphasizes externally observable problem-solving in unconventional media like cells and tissues. This paper analyzes popular ToCs to determine if they specifically identify brains as the privileged substrate for inner perspective or if the features they emphasize occur elsewhere.  The analysis finds that most ToCs describe similar operations and functional principles, obscured by references to neural substrates, and that the focus on brains is driven by convention rather than theoretical content.",
      "section": "Abstract",
      "topic": "Consciousness beyond brains",
      "chunk_summary": "Theories of consciousness may not be brain-specific, and minds might exist in unconventional substrates.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "What processes enable physical objects like living bodies to form memories, make decisions, have inner perspectives, and navigate their environment? This question is crucial for understanding ourselves, ethics, social systems, and artificial intelligence (AI). Formalisms like Turing's and connectionism attempt to define what confers mind, assuming it occurs in brains.  This paper questions the neuron-centric view, exploring whether these formalisms are truly tied to neurons or applicable to other cell types. This is relevant because evolutionary developmental biology shows brains evolved gradually from other cells, and the molecular mechanisms for bioelectric networks are ancient and present in all cells.",
      "section": "Introduction",
      "topic": "Mind and embodiment",
      "chunk_summary": "The paper challenges the brain-centric view of mind, suggesting that the mechanisms for cognition might be present in other cell types.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The assumption that minds are tied to brains is challenged by evidence of memory, problem-solving, and decision-making in cells, tissues, and even slime molds.  The emerging field of diverse intelligence reveals that the focus on brains is a result of our evolutionary bias.  This paper explores the implications of this for theories of consciousness, asking whether the features emphasized by these theories occur elsewhere, potentially in engineered systems.  The analysis suggests that most ToCs rely on functional principles not specific to neuronal networks, implying their claims about consciousness could apply to a wider range of substrates.",
      "section": "Introduction",
      "topic": "Diverse intelligence",
      "chunk_summary": "Cognitive abilities are observed in non-neural systems, suggesting theories of consciousness should consider a wider range of substrates.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Theories of Consciousness (ToCs) offer explanatory power regarding the nature of experience. A useful ToC should reliably identify subjects with consciousness. However, the validity of a ToC is impacted by its ability to identify all true minds, not just a specific type.  Humans possess a theory of mind that underlies social and moral systems, but this theory is limited by our evolutionary firmware.  Mind-blindness, the failure to form a theory of mind, is a characteristic of some neuropathologies.  Humans may be insensitive to unconventional minds, similar to our insensitivity to parts of the electromagnetic spectrum.  Tools, like ToCs, are needed to overcome these limitations and expand our awareness of potential minds.",
      "section": "Theories of Consciousness: a tool to counter-act pervasive mind-blindness",
      "topic": "Theories of Consciousness",
      "chunk_summary": "Theories of consciousness are essential tools for identifying minds, but human theory of mind is limited and potentially mind-blind to unconventional forms of consciousness.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Neural correlates of consciousness (NCCs) are conserved relationships between human brain structure-function and self-reported experiences.  NCCs are used as indirect signs of consciousness, similar to how the presence of a black hole is inferred.  While NCCs are useful for identifying minimally conscious states in humans, their reliance on specific neural structures limits their generalizability to non-human subjects.  The predictive power of reverse inference, using NCCs to infer consciousness, decreases when applied across different species.  A ToC dependent on NCCs faces limitations in predicting consciousness in organisms with different neural organizations.",
      "section": "Why neural correlates fall short as consciousness criteria",
      "topic": "Neural correlates of consciousness",
      "chunk_summary": "Neural correlates of consciousness are useful within humans but lack generalizability to diverse organisms and unconventional substrates.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Developmental biology and evolutionary theory highlight the continuity of mechanisms from single cells to humans, suggesting the gradual appearance of consciousness.  Advances in bioengineering and AI challenge our mind-inferencing strategies, raising questions about consciousness in hybrid beings.  ToCs, as theories about where to expect inner perspective, can help identify unconventional manifestations of consciousness.  To achieve this, ToCs must be universalizable and account for minds beyond the human brain.",
      "section": "Why neural correlates fall short as consciousness criteria",
      "topic": "Evolution and development of consciousness",
      "chunk_summary": "The continuity of mechanisms from single cells to humans suggests a gradual emergence of consciousness, requiring ToCs to be universalizable to identify unconventional minds.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Reverse inference, using behavior to infer consciousness, is limited by the non-generalizability of specific nervous systems. While humans often infer animal sentience based on behavior, this approach is influenced by anthropomorphic biases.  The special status granted to some animals based on presumed subjectivity overlooks the cognitive capacities of aneural life forms, which constitute the vast majority of Earth's biomass.  If even a small subset of aneural life is conscious, NCCs will generate false negatives.  ToCs need to be applicable to a wider range of systems to avoid these errors.",
      "section": "Why neural correlates fall short as consciousness criteria",
      "topic": "Limitations of reverse inference",
      "chunk_summary": "Reverse inference based on behavior or NCCs is limited and potentially overlooks consciousness in aneural life, requiring more universal ToCs.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The emergence of neural-robotic hybrids challenged the dichotomy between living and non-living agents.  Disembodied brains were found to be dysfunctional but could be normalized with feedback.  Cultured neural networks in closed-loop systems can optimize outputs without external programming, demonstrating the plasticity of neural networks.  Cognitive functions once considered exclusive to humans are now extended to other systems.  The ethical implications of interacting with potentially conscious systems are highlighted, especially with the development of biobots, cyborgs, and minimal active matter systems.  ToCs will need to be applied to increasingly diverse systems with potential minds.",
      "section": "Neural tissues as non-exclusive specialists of cognitive function",
      "topic": "Neural-robotic hybrids",
      "chunk_summary": "Neural-robotic hybrids demonstrate the plasticity of neural networks and raise ethical questions about consciousness in diverse systems, requiring broader application of ToCs.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Neurons possess no exclusive capacity or function compared to other cells or even inorganic materials. Many living systems display electrochemical patterns homologous to neurons, including electromagnetic fields potentially important for consciousness.  Most cells regulate ion channels to maintain a polarized electrical state, and cardiomyocytes generate action potentials similar to neurons. Immune cells display learned responses and long-term memory. Neurotransmitters are expressed throughout the body and in plants. Plants exhibit anticipatory responses and decision-making.  Even simple organisms like paramecia and slime molds can be conditioned and solve problems without nervous tissues.",
      "section": "Neural tissues as non-exclusive specialists of cognitive function",
      "topic": "Cellular cognition",
      "chunk_summary": "Many cell types, not just neurons, exhibit cognitive functions like learning, memory, and decision-making, challenging the neuron-centric view of consciousness.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Dynamical properties of neurons are also seen in simpler systems. Phospholipid membranes display memcapacitive properties similar to long-term potentiation. Water at an interface generates negative potentials comparable to resting membrane potentials. Microtubules, present in all cells, play a role in cellular decision-making.  Branching patterns of neurites, plants, and blood vessels follow similar scaling laws. Even inorganic substrates like iron bars and silver nanowires display learning and memory-like properties.  These observations suggest that neither the composition nor dynamics of neurons are unique to mind generation.",
      "section": "Neural tissues as non-exclusive specialists of cognitive function",
      "topic": "Non-neural systems with neuron-like properties",
      "chunk_summary": "Even simple systems, including inorganic materials, exhibit properties similar to neurons, suggesting these properties are not exclusive to mind generation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "A universalizable Theory of Consciousness (ToC) should be substrate-independent, scale-invariant, and organization-invariant.  Divorcing cognitive properties from biological substrates raises questions about consciousness in unconventional spaces.  To map minds in these spaces, prominent ToCs were reviewed and neurocentric language replaced with generic terms.  This aneurocentric reformulation highlights the functional principles of each theory, enabling a comparative analysis of consciousness across diverse systems.",
      "section": "Theories of consciousness to map diverse embodied minds",
      "topic": "Universalizing ToCs",
      "chunk_summary": "To study consciousness in diverse systems, ToCs should be reformulated in substrate-independent terms, focusing on functional principles rather than specific biological implementations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Analyzing prominent ToCs in a substrate-independent manner reveals a handful of distinct concepts: predictive modeling, enactivism/ecological interactions, reentrancy/looped feedback, meta-representations, attentional gating/monitoring, emergence from computation, integration of information, and coarse-graining. While some ToCs are incompatible, many display conceptual overlap when viewed functionally.  Although specific brain regions and processes are necessary for human consciousness, extending ToCs to other minds requires generalizing and analyzing their biological details to test mappings onto functions of all cells.  Aneurocentric formulations of ToCs enable comparative analysis of consciousness across diverse systems.",
      "section": "Theories of consciousness to map diverse embodied minds",
      "topic": "Core concepts in ToCs",
      "chunk_summary": "A functional analysis of ToCs reveals a few core concepts applicable to diverse systems, enabling comparative study of consciousness beyond the human brain.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Behaviors indicating consciousness, such as learning, decision-making, and goal-directed activity, typically occur in 3D space. However, cells, tissues, and aneural organs exhibit these behaviors in other spaces like metabolic, physiological, transcriptional, and anatomical spaces. They formulate goals, solve problems, exhibit taxis, and align components towards large-scale goals.  The interesting properties of brains may have arisen from a gradual evolutionary pivot of fundamental capacities across problem spaces.  Research in basal cognition and diverse intelligence reveals competencies in unconventional spaces, suggesting the applicability of ToCs to these scenarios.  No existing ToC rules out aneural substrates, implying the possibility of inner experience in cells, tissues, organs, organoids, biobots, and hybrid architectures.",
      "section": "Implications of consciousness in agents living in unconventional spaces",
      "topic": "Unconventional spaces of consciousness",
      "chunk_summary": "Cognitive behaviors occur in unconventional spaces beyond 3D, suggesting the potential for consciousness in aneural systems and requiring consideration of ToCs in these contexts.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The perspective presented has implications for research.  Using neuroscience and behavioral science tools is already yielding discoveries in fields like regenerative medicine and bioengineering.  The next step is to apply metrics from causal information theory and Integrated Information Theory (IIT) to study information flows in non-neural agents.  This has begun with Xenobots and gene-regulatory networks, but other substrates like calcium and bioelectric signaling during morphogenesis and self-assembly remain to be tested.  Developing tools like the mirror test and Turing test for unconventional agents is also envisioned.",
      "section": "Developing research programmes",
      "topic": "Future research directions",
      "chunk_summary": "Future research should focus on applying information-theoretic metrics to non-neural agents and developing adapted cognitive tests for unconventional systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Embodiment is crucial for consciousness, involving engagement with an action space through a perception-action loop.  While 3D movement is one arena, \"disembodied\" organoids might display a \"locked-in syndrome,\" exhibiting active problem-solving in gene expression and physiological spaces.  Developing substrate-agnostic tools to detect and characterize these processes is necessary.  Combining neuroscience tools with virtual reality to visualize behavior in high-dimensional spaces can help overcome limitations in perceiving unconventional minds.",
      "section": "Developing research programmes",
      "topic": "Embodiment and unconventional minds",
      "chunk_summary": "Embodiment is crucial for consciousness, but it can manifest in unconventional spaces, requiring new tools to detect and characterize inner experience in systems like organoids.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "By loosening constraints on conscious embodiments, the science of consciousness gains access to diverse beings.  Studying these unconventional minds, which are evolutionarily related but alien in their organization, can expand our understanding of consciousness.  This will require moving beyond anthropocentric, brain-focused formalisms.  Recognizing potential consciousness in a wider range of living material will recalibrate ethical considerations regarding our relationship with these beings.",
      "section": "Developing research programmes",
      "topic": "Expanding the scope of consciousness research",
      "chunk_summary": "Expanding the scope of consciousness research to unconventional embodiments can challenge existing formalisms and raise new ethical questions about our relationship with potentially conscious beings.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The continuity thesis, suggesting a gradual scale-up of consciousness from single cells, should be the null hypothesis.  The high conservation of mechanisms across evolution implies a form of panpsychism, focusing on the scaling and transformation of embodied minds from physical dynamics.  Competing ideas need to justify discontinuities and explain the emergence of novel natural kinds.  The current state of research suggests consciousness may be common throughout the body, arising from the collective intelligence of cells working together through bioelectric networks.  Each human is a collective intelligence of neurons, and this principle might extend to other cellular collectives.",
      "section": "Conclusion",
      "topic": "Continuity of consciousness",
      "chunk_summary": "The continuity thesis and a form of panpsychism should be the starting point for understanding consciousness, suggesting its potential presence in cellular collectives throughout the body.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The objection that we don't feel our liver being conscious is addressed by pointing out that we don't feel each other being conscious either.  If the liver or its parts were conscious, that point-of-view would be different from our own integrated experience.  The paper concludes by emphasizing the need to understand collective intelligence in all its forms and how it enables intelligence to emerge.",
      "section": "Conclusion",
      "topic": "Collective intelligence and consciousness",
      "chunk_summary": "The lack of felt experience of other consciousnesses, including potentially within our own bodies, doesn't negate their existence, and understanding collective intelligence is key to understanding consciousness.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_575153.pdf",
      "original_filename": "pdf_20250803_124126_575153_extracted_text.txt",
      "authors": "[\"Nicolas Rouleau\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:12:25.681871"
}