{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_852931_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_852931.pdf",
    "file_size": 31853,
    "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
    "journal": "Unknown",
    "doi": null,
    "year": null,
    "title": "Topological constraints on self-organisation in locally interacting systems",
    "confidence_score": null,
    "document_type": "research_paper"
  },
  "chunks": [
    {
      "text": "All intelligence arises from collective behavior, requiring parts to align with system-level goals. Understanding the dynamics of problem-solving by aligned parts is crucial for life sciences and engineering. This paper examines systems on planar graphs with pairwise interactions, where spontaneous ordering represents self-organization, modeling cognitive processes. The paper explores necessary topological conditions for ordered phases, focusing on constraints on systems with local interactions to maintain order. By analyzing free energy scaling under domain wall formation in Potts models, autoregressive models, and hierarchical networks, the study reveals how interaction combinatorics influence spontaneous ordering. This analysis explains why multiscale biological systems achieve complex patterns while rudimentary language models struggle with long output sequences.",
      "section": "Abstract",
      "topic": "Collective intelligence and self-organization",
      "chunk_summary": "The paper investigates topological constraints on self-organization in systems with local interactions, explaining the difference in pattern formation capabilities between biological systems and language models.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Self-organization, observed in biological systems and technology, requires alignment of parts for complex structure and function. This autopoietic cognition raises questions about how self-organizing systems navigate configuration space towards target morphologies. Physics-inspired models like Hopfield networks, spin glasses, and energy-based/diffusion models are used in machine learning. Maintaining patterns out of equilibrium or producing sensible long-term data requires a \"condensed\" phase with long-range order. Biological systems exhibit remarkable large-scale organization, while language models have limited capabilities, despite spin systems modeling cellular morphogenesis. This paper explores thermodynamic bounds on the probability of systems occupying ordered phases, aiming to estimate self-organization capability. The central question is the functional distinction between language models and multicellular organisms, and whether generative AI can achieve long-range order.",
      "section": "Introduction",
      "topic": "Self-organization and long-range order",
      "chunk_summary": "The introduction contrasts the self-organizing capabilities of biological systems with the limitations of current language models, highlighting the importance of long-range order and the paper's focus on thermodynamic bounds.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Landau-Lifshitz's argument explains the lack of an ordered phase in the one-dimensional Ising model. A thermodynamically favorable state change decreases free energy (ΔF = ΔE - TAS). In a chain of N spins, forming a domain wall with perimeter P scales free energy change as -Tlog P, favoring domain wall formation for large P. This instability under thermal fluctuations prevents spontaneous magnetization. Peierls' argument for dimensions greater than one shows that internal energy change balances entropy change due to the number of interacting spins in an \"island.\" This paper focuses on the scaling relationship between energy and entropy.",
      "section": "Introduction",
      "topic": "Landau-Lifshitz and Peierls arguments",
      "chunk_summary": "The introduction summarizes Landau-Lifshitz's argument for the lack of ordered phase in 1D Ising model and contrasts it with Peierls' argument for higher dimensions, emphasizing the paper's focus on energy-entropy scaling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The paper outlines its structure: Section II presents the argument for a universality class of models and derives necessary conditions for ordered phases. Section III analyzes the one-dimensional Potts chain, generalizing Landau-Lifshitz's argument. Section IV maps autoregressive language models onto the one-dimensional framework, proving their inability to maintain long-range order. Section VI discusses implications and future directions. The conclusion highlights the topological limitations on long-range order in certain systems and suggests this as a fitness pressure for biological phenomena like stigmergy and embodiment. The key difference between biological systems and language models lies in their interaction topology.",
      "section": "Introduction",
      "topic": "Paper structure and key findings",
      "chunk_summary": "The introduction outlines the paper's structure and key findings, emphasizing the role of topology in differentiating the self-organizing capabilities of biological and language model systems.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This section presents the main argument for the existence of ordered phases in systems with local interactions. It considers a k-vertex graph with a k-by-k adjacency matrix G and an n-ary variable on each vertex, denoted as si, where i ∈ {1,..., k}. Interactions are described by a Hamiltonian H. A windowed Hamiltonian is defined as one where spin-spin interactions occur within a finite window w. A local Hamiltonian is a sum of windowed Hamiltonians with the same window length w. The methodology involves starting with an ordered configuration, creating a domain wall, estimating the energy gain, and analyzing free energy asymptotics as domain walls increase. The interaction between elements is represented by a graph Hamiltonian, assuming fixed edges in time due to an adiabatic approximation. A graph Hamiltonian is defined as H = H ◦ G, where ◦ is entry-wise multiplication and H contains coupling strengths.",
      "section": "The Main Argument",
      "topic": "Graph Hamiltonians and local interactions",
      "chunk_summary": "This section introduces the concept of windowed and local Hamiltonians, and describes the methodology for analyzing free energy scaling in systems with local interactions represented by graph Hamiltonians.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The section defines entropy and energy scaling in terms of domain wall perimeter P. Entropy gained scales as fS if ΔS = O(fS(P)). Energy gained scales as fE if ΔE = O(fE(P)). An ordered phase exists if O(fS) = O(fE). If O(f) = O(fS) = O(fE), then ΔF = limP→∞ O(f(P)) - T O(f(P)). As T approaches zero, ΔF becomes positive, making domain wall creation unfavorable. The number of stored patterns doesn't affect entropy scaling. If H is a graph Hamiltonian with m > 1 stored patterns, ΔS = log [(m - 1)B(P)] = log B(P) + log(m - 1). In the thermodynamic limit, the term related to barriers increases while the one related to patterns remains constant. Energy levels and window sizes don't affect the ability to converge to an ordered phase. If H = ∑u Hu and Emax, Emin are the greatest and least non-zero energy levels of Hu, then w1P Emin < ΔE < w2P Emax. In both cases, E = O(P), so asymptotics depend only on perimeter length.",
      "section": "The Main Argument",
      "topic": "Scaling of energy and entropy",
      "chunk_summary": "This section defines entropy and energy scaling with respect to domain wall perimeter and establishes the condition for the existence of an ordered phase based on these scaling relationships. It also demonstrates that the number of stored patterns, energy levels, and window sizes do not affect the convergence to an ordered phase.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The section presents a topological equivalence theorem: all local Hamiltonians on lattices with the same combinatorial structure have asymptotically equivalent free energies. This is proven by approximating any H with another Hamiltonian H0 such that their asymptotics are equivalent, implying F ~ F0 in the thermodynamic limit. If lattices have the same combinatorics (equal ni), then P = P0. The change in energy is computed by the new configuration's Hamiltonian, implying <H - H0>0 ~ 0. The probability of disorder is asymptotically the same in both systems, so free energy changes are also asymptotically equivalent. A corollary states that self-organization capacity in a system on graph G is equivalent to a nearest-neighbor Ising model on the same graph with two stored patterns: π¹ = (1, 1, 1, ..., 1) and π² = (-1, -1, -1, . . ., -1). The paper clarifies that it's the existence of a phase transition, not the specific transition, that is studied.",
      "section": "The Main Argument",
      "topic": "Topological equivalence theorem",
      "chunk_summary": "This section establishes the topological equivalence theorem, stating that local Hamiltonians on lattices with the same combinatorial structure have asymptotically equivalent free energies, and demonstrates the equivalence of self-organization capacity to a nearest-neighbor Ising model.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This section analyzes the one-dimensional Potts model, a variant of the Ising model with richer state vectors. A Potts chain C is a ℤ-indexed set of n-ary integer symbols si, where si ∈ {1,..., n}. It's shown that local Hamiltonians in one dimension don't converge to an ordered state due to domain wall formation. If ΔF = ΔE - TΔS < 0, domain wall formation is thermodynamically favorable. Any πa differs from another π by at least one spin change. In a sequence of length L, there are L - 1 possible domain wall locations, and m - 1 other patterns at each location. Thus, ΔS = log[(m - 1)(L - 1)]. Domain wall formation gives windowed Hamiltonians non-zero positive energy, bounded by wEmax. So, ΔF < wEmax - T log[(m - 1)(L - 1)]. For T > 0, as L increases, the right side becomes negative.",
      "section": "Stored Patterns in the Windowed Potts Model",
      "topic": "One-dimensional Potts model",
      "chunk_summary": "This section analyzes the one-dimensional Potts model and demonstrates that local Hamiltonians in one dimension do not converge to an ordered state due to the thermodynamic favorability of domain wall formation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This section analyzes autoregressive models and their limitations in maintaining long-range order. An autoregressive model estimates a conditional probability distribution of a sequence of observations given a history. An AR(w) model computes P(si|si-1,...si-w) as a probability vector over {1,..., n} by generating samples based on window states. Mw(si|si-1,...si-w) denotes the estimator outputting v for sequence {si-1,...si-w}. P(si = c) = Mw(si = c|si-1,...si-w) represents the c-th component of v. If u - w < 1, the window is empty, and conditioning on the empty set is equivalent to unconditional probability. A unique local Hamiltonian with window length w can be associated with any AR(w) model. The probability of the next spin being c is P(si = c) = Mw(si = c|si-1,...si-w). Assigning energy to each c with βE = -log P(si = c) + const, where the lowest energy state has zero energy, defines a windowed Hamiltonian Hu(su) = -log M(su|su-1,..., su-w) + const. The full local Hamiltonian is H = ∑u Hu(su).",
      "section": "Autoregressive Models",
      "topic": "Autoregressive models and local Hamiltonians",
      "chunk_summary": "This section defines autoregressive models and demonstrates how a unique local Hamiltonian can be associated with any AR(w) model, framing the generation of samples as sampling from a Boltzmann distribution.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Most language models are autoregressive, predicting the next token based on previous text. Transformers can be described as spin collectives. However, increasing context makes prediction computationally infeasible, limiting input to recent words. This causes the model to forget information outside the input window, constraining long-term coherence. The free energy is F = E - β-1S. Autoregressive models are one-dimensional systems with local Hamiltonians. Thus, they cannot converge to a single stored pattern for any finite β.",
      "section": "Autoregressive Models",
      "topic": "Limitations of autoregressive models",
      "chunk_summary": "This section highlights the limitations of autoregressive models in maintaining long-range order due to their limited context windows and proves their inability to converge to a single stored pattern.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This section investigates hierarchical interactions in multiscale systems, common in biology and physics. These systems exhibit complex patterns with local regularity and global irregularity, like tissues with different morphogenetic features. The section explores the interplay of free energy scaling at different hierarchy levels, quantifying when such patterns are possible. It shows that systems lacking hierarchical structure may have limited capacity for complex patterns. Assuming l > 1 independent cliques in G with ni > 2 vertices each, a macrostate is associated with each clique, representing its magnetization. The section argues for local order and global disorder in systems with cliques. Since clique properties are meaningful experimental variables, hierarchical organization can create interesting order phenomena. The goal is to show the existence of \"hierarchical behaviors\" with coherent phases within cliques but varying phases across cliques. Assuming uniform coupling constants J, Boltzmann's formula S = k log W denotes multiplicity W of a macrostate. A clique is positively/negatively magnetized if all spins are +1/-1. Starting with l positively magnetized cliques, if r flipped cliques represent a macrostate, multiplicity is the number of ways to arrange r cliques out of l, so S = k log (l choose r).",
      "section": "Large Hierarchical Systems on Graphs",
      "topic": "Hierarchical interactions and cliques",
      "chunk_summary": "This section introduces the concept of hierarchical interactions and cliques, arguing for the possibility of local order and global disorder in such systems and setting up the analysis of free energy scaling in hierarchical structures.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The section explores conditions for individual clique magnetization changes. Flipping r cliques takes energy ∑γ=1r 2Jniγ and has entropy log (l choose r). The free energy change is ΔF = ∑γ=1r 2Jniγ - T log (l choose r), scaling as ΔF ~ O(r) - T O(r log l - r log r + r). If T > 1/(log l - log r + 1), then ΔF < 0, favoring clique flips. Fixing such a T, flipping a single spin in an ni-clique takes energy 2J. If 2J > T log ni, there's no domain wall within the clique. There exists a non-empty critical temperature range for hierarchical behavior. From 2J/log ni > T > 2J ∑γ=1r niγ / (r log l - r log r + r), and r nmax > ∑γ=1r niγ and 1 > 1/log ni, it follows that 2J/log nmax > T > 1/log nmax * 2Jrnmax/(r log l - r log r + r), leading to 1 > T > 1/log nmax * 1/(log l - log r + 1) * nmax. The inequality is satisfied for l/nmax > r/e. When cliques form cliques, the argument can be applied recursively.",
      "section": "Large Hierarchical Systems on Graphs",
      "topic": "Clique magnetization and hierarchical behavior",
      "chunk_summary": "This section analyzes the conditions for magnetization changes in individual cliques within a hierarchical structure and demonstrates the existence of a critical temperature range for hierarchical behavior, where local order can coexist with global disorder.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Hierarchical systems exhibit hybridized behaviors with local order and global disorder, reflecting multiscale phenomena in biology and physics, where coherence exists at one level (e.g., tissues in an organ) and non-uniformity at another (e.g., different organs).",
      "section": "Large Hierarchical Systems on Graphs",
      "topic": "Multiscale phenomena and hierarchical behavior",
      "chunk_summary": "This section concludes that hierarchical systems can exhibit hybridized behaviors with local order and global disorder, mirroring multiscale phenomena observed in biology and physics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This paper developed a scaling argument extending Peierls' argument to analyze spontaneous order in systems with local interactions. Biological systems exploit hierarchical structures for self-organization and problem-solving in various spaces, including anatomical, physiological, gene expression, and behavioral. Recent discussions focus on the dynamics enabling evolved, engineered, and hybrid systems to achieve large-scale goals, a defining feature of \"life.\" In contrast, current natural language processing algorithms lack the topology for self-organization, explaining their limited coherence. The key difference lies in the interaction topology. Understanding topology's role in self-organization can lead to new architectures for natural language processing and biologically-inspired computing, emulating biological self-organization.",
      "section": "Conclusions and Future Directions",
      "topic": "Topology and self-organization",
      "chunk_summary": "This section summarizes the paper's key contribution, the scaling argument for analyzing spontaneous order, and highlights the topological differences between biological systems and language models in their self-organizing capabilities.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The limitations of autoregressive language models resemble formal thought disorder in schizophrenia, where tangential speech or derailment occurs. Therapeutic approaches involve refining articulated thought, suggesting that environmental interaction enforces coherence. This implies that an embodied world model, extending the system through environmental interactions, can maintain coherence, explaining the emergence of stigmergy and extracellular signaling in biology. The assumption of free energy minimization is discussed, noting that some systems have long equilibration times, like spin glasses. Studying phase transitions in glassy systems is challenging, even for simpler models like Hopfield networks or the Edwards-Anderson model. Future work will provide similar estimates constraining phases with frozen disorder based on lattice topology.",
      "section": "Conclusions and Future Directions",
      "topic": "Future directions and spin glasses",
      "chunk_summary": "This section discusses the implications of the findings for understanding formal thought disorder and suggests future research directions, including the study of spin glasses and systems with frozen disorder.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_852931.pdf",
      "original_filename": "pdf_20250803_124126_852931_extracted_text.txt",
      "authors": "[\"Dalton A R Sakthivadivel\", \"Francesco Sacco\", \"Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:45:39.172435"
}