{
  "chunk_id": "1qRIetbuoH4_chunk_001",
  "text": "So birth defects, regeneration after traumatic injury would be possible. Cancer could be reprogrammed, aging, degenerative disease, and not only biomedical kind of problems, but also synthetic biomorphology. So not just reprogramming individual cells, but actually programming a large scale shape and structure and also actually non neuromor AI would become possible. And so all of these things boil down to one problem. How do we communicate our morphological goals to a group of cells? And here I have to do disclosures because I'm involved in three different spinoffs from my lab, which I'm happy to talk about afterwards. So morphosuticals, Astonishing labs and Fauna systems.",
  "token_count": 106,
  "sentence_count": 7,
  "start_sentence": 1,
  "end_sentence": 7,
  "start_time_ms": 37730,
  "end_time_ms": 78870,
  "start_time_seconds": 37.73,
  "end_time_seconds": 78.87,
  "primary_topics": [
    "Cellular Reprogramming",
    "Regeneration after Traumatic Injury",
    "Bioelectricity in Aging and Degenerative Diseases",
    "Synthetic Biomorphology",
    "Non-Neuromor AI"
  ],
  "secondary_topics": [
    "Birth Defects",
    "Cancer Reprogramming",
    "Large Scale Shape and Structure Programming",
    "Morphological Goals Communication",
    "Spinoff Companies"
  ],
  "key_terms": [
    "Birth Defects",
    "Regeneration",
    "Cancer",
    "Aging",
    "Degenerative Disease",
    "Synthetic Biomorphology",
    "Non-Neuromor AI",
    "Morphosuticals",
    "Astonishing labs",
    "Fauna systems"
  ],
  "content_summary": "The speaker, Michael Levin, discusses the potential of cellular reprogramming in addressing issues like birth defects, regeneration after injury, cancer, aging, and degenerative diseases. He also explores the possibilities of synthetic biomorphology and non-neuromor AI, and mentions his involvement in three spinoff companies.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}