{
  "chunk_id": "1qRIetbuoH4_chunk_012",
  "text": "But the key is that rewiring them physically is not the only game in town. We also have the opportunity because their intelligence is higher than a simple hardwired clockworks. We have the opportunity to communicate with them, to reset their set points and to have various other kinds of interesting interactions with them. So the thing to recall is that fundamentally we are all collective intelligences. There's no such thing as an indivisible kind of some sort of indivisible diamond of intelligence. We are all made of parts and the parts that we are made of are individual cells. Now, here's a cell this happens to be a free living organism known as a lacrimaria. One cell, there's no brain, there's no nervous system. This thing is incredibly competent at very local, tiny little goals, metabolic, physiological and other kinds of states. You can see it here feeding in the environment. Anybody who's into soft robotics should be drooling at this. We don't have anything remotely like this level of control. And again, just one cell, and it is made of molecular networks that also have all kinds of competencies.",
  "token_count": 191,
  "sentence_count": 13,
  "start_sentence": 12,
  "end_sentence": 24,
  "start_time_ms": 566250,
  "end_time_ms": 628670,
  "start_time_seconds": 566.25,
  "end_time_seconds": 628.67,
  "primary_topics": [
    "Cellular Intelligence",
    "Bioelectricity",
    "Cellular Interactions",
    "Cellular Competencies"
  ],
  "secondary_topics": [
    "Soft Robotics",
    "Physiological States",
    "Metabolic States",
    "Molecular Networks",
    "Rewiring Cells",
    "Collective Intelligences"
  ],
  "key_terms": [
    "Set Points",
    "Free Living Organism",
    "Lacrimaria",
    "Nervous System",
    "Hardwired Clockworks"
  ],
  "content_summary": "The speaker discusses the concept of cellular intelligence, emphasizing that cells are not just physically rewired but can also be communicated with and reset. The speaker uses the example of a single-celled organism, Lacrimaria, to illustrate the complexity and competency of cells, even without a brain or nervous system.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}