{
  "chunk_id": "1qRIetbuoH4_chunk_014",
  "text": "This is one example of regulative development. Here's another example, creature like this, this is an axolotl. And these guys regenerate their legs, their eyes, their jaws, their portions of their heart and brain, their ovaries, spinal cord and so on. What they do is, if you amputate and in fact they bite each other's legs off all the time. So this is a natural experiment that keeps happening. You can amputate anywhere along this line and the cells will very rapidly build exactly what's needed and then they stop. Now, this is the most amazing part of this whole process, right, is that, is that not only does it regenerate no matter where you cut it from, it makes exactly what's needed, no more, no less, but that it ever stops. How does it know when to stop? It stops when a correct salamander arm has been completed.",
  "token_count": 149,
  "sentence_count": 10,
  "start_sentence": 14,
  "end_sentence": 23,
  "start_time_ms": 710460,
  "end_time_ms": 755070,
  "start_time_seconds": 710.46,
  "end_time_seconds": 755.07,
  "primary_topics": [
    "Regulative Development",
    "Axolotl Regeneration",
    "Bioelectricity in Regeneration"
  ],
  "secondary_topics": [
    "Amputation in Axolotls",
    "Regeneration of Specific Organs",
    "Cellular Activity during Regeneration",
    "Regenerative Limitations",
    "Regenerative Precision"
  ],
  "key_terms": [
    "Regulative Development",
    "Axolotl",
    "Regeneration",
    "Amputation",
    "Cellular Activity",
    "Regenerative Limitations",
    "Regenerative Precision"
  ],
  "content_summary": "The speaker discusses the concept of regulative development, using the axolotl as an example. The axolotl's ability to regenerate various body parts, including limbs and organs, is highlighted. The speaker also ponders on the precision and limitations of this regenerative process, particularly how it knows when to stop.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}