{
  "chunk_id": "1qRIetbuoH4_chunk_031",
  "text": "This is a collaboration between Josh Vongaard at the University of Vermont and myself. Doug Blackiston is the biologist who does this work in my group. Sam Friedman was Josh's student who does the programming. What you see here is this thing swimming. This is a piece of, this is this, this, this proto organism self assembled from cells taken, scraped off of an early embryo. These are just skin again. There's no neurons here, there's no brain. This is what the skin will do when left to its own devices when, when, when freed basically from the instructive influence of the other cells. And you can see what happens here. They can move in circles, they can patrol back and forth like this. These are all spontaneous behaviors. They have collective behaviors. They can interact with each other, they can sort of go on these longer journeys. There's great individuality here among them. And what you're looking at is the answer to the question, what would skin cells do if given a chance to reboot their multicellularity taken away from these other cells?",
  "token_count": 184,
  "sentence_count": 15,
  "start_sentence": 31,
  "end_sentence": 45,
  "start_time_ms": 1459960,
  "end_time_ms": 1518640,
  "start_time_seconds": 1459.96,
  "end_time_seconds": 1518.64,
  "primary_topics": [
    "Developmental Biology",
    "Bioelectricity",
    "Cellular Behavior",
    "Multicellularity",
    "Self-assembly"
  ],
  "secondary_topics": [
    "Cellular Interactions",
    "Spontaneous Behaviors",
    "Cellular Individuality",
    "Proto Organism",
    "Embryonic Development",
    "Skin Cells",
    "Neurons"
  ],
  "key_terms": [
    "Proto organism",
    "Self-assembly",
    "Embryo",
    "Neurons",
    "Spontaneous behaviors",
    "Multicellularity",
    "Skin cells"
  ],
  "content_summary": "The presentation discusses a study of a proto organism self-assembled from skin cells scraped off an early embryo. The cells exhibit spontaneous behaviors and individuality, demonstrating what skin cells would do if given a chance to reboot their multicellularity away from other cells.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}