{
  "chunk_id": "1qRIetbuoH4_chunk_009",
  "text": "This is an intractable inverse problem. And so figuring out what you would have to change on the molecular genetic level to make large scale changes and repairs is extremely difficult. It'll be possible for some cases, but it needs to be complemented with a top down approach. Now here's where we are today. We're very good as a community in manipulating molecules and cells. And there are amazing kinds of advances all the time in terms of synthetic biology and protein engineering and things like this. We're actually still a very long way away from control of large scale form and function. Injuries, cancer, birth defects, these things are largely yet not addressable. I think that's because we are still fundamentally in molecular medicine somewhere here.",
  "token_count": 127,
  "sentence_count": 9,
  "start_sentence": 9,
  "end_sentence": 17,
  "start_time_ms": 385190,
  "end_time_ms": 431260,
  "start_time_seconds": 385.19,
  "end_time_seconds": 431.26,
  "primary_topics": [
    "Intractable inverse problem",
    "Molecular genetic level changes",
    "Large scale changes and repairs",
    "Top down approach",
    "Molecular medicine"
  ],
  "secondary_topics": [
    "Synthetic biology",
    "Protein engineering",
    "Control of large scale form and function",
    "Injuries",
    "Cancer",
    "Birth defects"
  ],
  "key_terms": [
    "Intractable inverse problem",
    "Molecular genetic level",
    "Top down approach",
    "Synthetic biology",
    "Protein engineering",
    "Molecular medicine"
  ],
  "content_summary": "The speaker discusses the challenges of making large scale changes and repairs at the molecular genetic level, highlighting the need for a top-down approach. Despite advances in synthetic biology and protein engineering, controlling large scale form and function, and addressing issues like injuries, cancer, and birth defects remain significant challenges.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}