{
  "chunk_id": "1qRIetbuoH4_chunk_013",
  "text": "For example, the gene regulatory circuits and pathways inside cells are capable of at least six different kinds of learning, including associative conditioning. This is all without changing their structure at all. This is not about rewiring GRNs with gene regulatory networks through experience. This is in situ, exactly how they are. They're capable of learning. So this multi scale architecture of competency, meaning that we are made of cells that used to be independent organisms and didn't drop all their intelligence when they joined together, means that we have lots of different competencies in morphogenetic space. So, for example, when you take an early embryo, let's say a human embryo, and you cut it into halves or quarters, you don't get two half bodies, you get two perfectly normal monozygotic twins, because each half can recognize that the other half is missing, rebuild what it needs. In fact, you can think of embryonic development as a regeneration of the entire body from just one cell. There's this ability of different systems. Here's the normal embryo, here's the embryo cut in half, and so on. The ability of different systems to navigate this space, to reach the ensemble of goal states that we associate with normal target morphology or normal anatomy for that species. And in fact, in many cases, going around avoiding various local maxima that would trap a less intelligent system.",
  "token_count": 233,
  "sentence_count": 14,
  "start_sentence": 13,
  "end_sentence": 26,
  "start_time_ms": 628670,
  "end_time_ms": 709580,
  "start_time_seconds": 628.67,
  "end_time_seconds": 709.58,
  "primary_topics": [
    "Gene Regulatory Circuits and Pathways",
    "Cellular Learning",
    "Morphogenetic Space",
    "Embryonic Development",
    "Regeneration"
  ],
  "secondary_topics": [
    "Associative Conditioning",
    "Multi-Scale Architecture of Competency",
    "Cellular Intelligence",
    "Embryo Manipulation",
    "Target Morphology",
    "Species-Specific Anatomy",
    "Navigation of Morphogenetic Space",
    "Avoidance of Local Maxima"
  ],
  "key_terms": [
    "Gene Regulatory Networks (GRNs)",
    "In situ",
    "Monozygotic Twins",
    "Regeneration",
    "Morphology",
    "Anatomy",
    "Local Maxima"
  ],
  "content_summary": "The presentation discusses the ability of gene regulatory circuits and pathways within cells to learn without changing their structure. It also explores the concept of morphogenetic space and the ability of cells and systems to navigate this space. The speaker uses the example of an embryo being able to regenerate into two normal monozygotic twins when cut in half to illustrate these concepts.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}