{
  "chunk_id": "1qRIetbuoH4_chunk_029",
  "text": "This is not about micromanaging what the stem cells do. It is about convincing the cells at the very beginning that they're going to go down the regenerative route and not the scarring route. And that's it. After that, you don't touch it again. We are now this is our efforts through morphaceuticals again. David Kaplan and I are co founders and what we're using is that we're now in mammals and we're attempting to do this in mice right now with a bioreactor that controls the wound environment. And then it's got a payload of drugs that try to convince the cells that they need to regenerate. There are also applications to cancer. I showed you this picture a minute ago. Once you start thinking about this as these electrical networks as a way of creating a larger scale system that can pursue large goals like building nice organs instead of little tiny amoeba level goals of proliferate and migrate, then what we can do is we can artificially reconnect these cells. When the oncogene tells them to disconnect, we can force them to be in the Right. Electrical state. You see here, the oncogene is labeled in red.",
  "token_count": 200,
  "sentence_count": 14,
  "start_sentence": 29,
  "end_sentence": 42,
  "start_time_ms": 1359200,
  "end_time_ms": 1420940,
  "start_time_seconds": 1359.2,
  "end_time_seconds": 1420.94,
  "primary_topics": [
    "Stem cell manipulation",
    "Regenerative biology",
    "Bioelectricity in tissue regeneration",
    "Cancer treatment"
  ],
  "secondary_topics": [
    "Morphaceuticals",
    "Bioreactor use in tissue regeneration",
    "Electrical networks in cells",
    "Oncogene influence on cell behavior",
    "Drug delivery systems"
  ],
  "key_terms": [
    "Stem cells",
    "Regenerative route",
    "Scarring route",
    "Morphaceuticals",
    "Bioreactor",
    "Oncogene",
    "Electrical state"
  ],
  "content_summary": "The presentation discusses the use of bioelectricity to guide stem cells towards regeneration rather than scarring. The speaker also mentions the application of this concept in cancer treatment, where oncogenes can be manipulated to change the electrical state of cells.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}