{
  "chunk_id": "1qRIetbuoH4_chunk_022",
  "text": "So we can do inner ears. This is all in the frog model. Right now I'm showing you inner ears. We can induce hearts, ectopic beating hearts. We can induce forebrain. So here's where the forebrain normally stops. In this tapo here we've made this extra large forebrain, we can make extra limbs. So here's our five and, and six legged frogs. And we can make some structures that don't even belong on this animal, like fins. And there's a whole story that I don't have time to tell you today about changing the actual shape of an animal to a different species without changing the genome. And we have several stories about that. One of the amazing things about this is that these changes can be permanent because we're dealing with a tissue level intelligence that has memory. When we take this flatworm, here's a flat worm, it's got a head and a tail. And we amputate the tail, we amputate the head, we leave just the middle frag.",
  "token_count": 170,
  "sentence_count": 14,
  "start_sentence": 22,
  "end_sentence": 35,
  "start_time_ms": 1069990,
  "end_time_ms": 1118910,
  "start_time_seconds": 1069.99,
  "end_time_seconds": 1118.91,
  "primary_topics": [
    "Inducing organ growth",
    "Tissue level intelligence",
    "Bioelectricity in developmental biology"
  ],
  "secondary_topics": [
    "Frog model",
    "Ectopic beating hearts",
    "Forebrain induction",
    "Extra limb induction",
    "Species morphological change without genome alteration",
    "Regeneration in flatworms"
  ],
  "key_terms": [
    "Inner ears",
    "Ectopic",
    "Forebrain",
    "Extra limbs",
    "Fins",
    "Tissue level intelligence",
    "Flatworm",
    "Amputation",
    "Regeneration"
  ],
  "content_summary": "The presentation discusses the ability to induce growth of various organs and structures in a frog model, including inner ears, hearts, forebrains, and extra limbs. The speaker also mentions the possibility of changing an animal's shape to resemble a different species without altering the genome, and the concept of tissue level intelligence with memory, as demonstrated in a flatworm regeneration experiment.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}