{
  "chunk_id": "1qRIetbuoH4_chunk_034",
  "text": "But there are these amazing competencies, and the research program now in the roadmap is to learn to recognize them and then to learn to control them and reprogram them for applications in regenerative medicine, robotics, and ultimately to take what we learn from the intelligence of these cells and use them to create new artificial intelligences. And so, because biology is so incredibly interoperable, biology finds a way to live coherently under so many circumstances. In the future, almost any combination of evolved natural material, designed material and software at whatever scale is some viable creature. And so I think in the future we are going to be surrounded by all kinds of hybrids and cyborgs and chimeras and all kinds of things which are going to require a new kind of ethics for relating to beings that are nowhere on the normal tree of life with us.",
  "token_count": 149,
  "sentence_count": 6,
  "start_sentence": 34,
  "end_sentence": 39,
  "start_time_ms": 1620880,
  "end_time_ms": 1674350,
  "start_time_seconds": 1620.88,
  "end_time_seconds": 1674.35,
  "primary_topics": [
    "Cellular Intelligence",
    "Regenerative Medicine",
    "Robotics",
    "Artificial Intelligence",
    "Biohybrid Systems"
  ],
  "secondary_topics": [
    "Cellular Competencies",
    "Interoperability in Biology",
    "Evolved Natural Material",
    "Designed Material",
    "Software",
    "Ethics in Biotechnology",
    "Hybrids",
    "Cyborgs",
    "Chimeras"
  ],
  "key_terms": [
    "Cellular Competencies",
    "Regenerative Medicine",
    "Robotics",
    "Artificial Intelligence",
    "Interoperability",
    "Biohybrid Systems",
    "Evolved Natural Material",
    "Designed Material",
    "Software",
    "Hybrids",
    "Cyborgs",
    "Chimeras",
    "Ethics"
  ],
  "content_summary": "The presentation discusses the potential of understanding and harnessing cellular intelligence for applications in regenerative medicine, robotics, and artificial intelligence. The speaker envisions a future where biology's interoperability allows for the creation of various hybrids and chimeras, necessitating a new ethical framework for these beings not found on the conventional tree of life.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Bioengineering, Artificial Intelligence",
  "enhanced": true
}