{
  "chunk_id": "1qRIetbuoH4_chunk_023",
  "text": "So this middle fragment will normally regenerate 100% of the time. They make a normal worm, one head, one tail. And we asked the question, how do they know, how do they know how many heads they're supposed to have? And we found this electrical gradient that says one head, one tail. We change that gradient to say actually two heads. And so what you get is this two headed worm. And this is not photoshopped, these are real, you can see the video. These two headed worms, in their spare time, what they're doing, the amazing thing is that once you've got this two headed worm, that's it. From then on, if you amputate the primary head, you amputate this ectopic secondary head, this middle fragment will Continue to regrow two heads. The genetics are untouched. We never did any genomic editing here. There's no transgenes, no new circuits, no synthetic biology, nothing. All we did was a very brief physiological stimulus that rewrites the pattern memory.",
  "token_count": 168,
  "sentence_count": 13,
  "start_sentence": 23,
  "end_sentence": 35,
  "start_time_ms": 1119300,
  "end_time_ms": 1168780,
  "start_time_seconds": 1119.3,
  "end_time_seconds": 1168.78,
  "primary_topics": [
    "Regeneration",
    "Bioelectricity",
    "Pattern Memory"
  ],
  "secondary_topics": [
    "Physiological Stimulus",
    "Genomic Editing",
    "Synthetic Biology",
    "Transgenes",
    "Electrical Gradient",
    "Ectopic Secondary Head"
  ],
  "key_terms": [
    "Regeneration",
    "Bioelectricity",
    "Pattern Memory",
    "Physiological Stimulus",
    "Genomic Editing",
    "Synthetic Biology",
    "Transgenes",
    "Electrical Gradient",
    "Ectopic Secondary Head"
  ],
  "content_summary": "The speaker discusses an experiment where a worm's bioelectric pattern memory was altered to regenerate two heads instead of one. This was achieved without genetic modification, but through a brief physiological stimulus that changed the worm's electrical gradient.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}