{
  "chunk_id": "mOaSHpTOwu0_chunk_010",
  "text": "So these are the. And we didn't have to teach it to do that. It already does that. So these are the kind of competencies of, of this material, top down control modular communication where we can talk about an organ, not genes, not cells of individual type and so on. We can talk about whole organs. And cracking this bioelectric code is the main or one of the main efforts in our lab as to how we're going to really maximize our ability to communicate with this material. The last few things I just want to show you have to do with synthetic kinds of living constructs that don't have the benefit of eons of evolution, where we can say, well, it makes an eye, because of course it evolved a high level subroutine call that causes eyes to form because that's what the evolutionary history gave. What happens with beings that have no specific history of selection for this form factor? I'm sure Josh has already shown you some of this.",
  "token_count": 173,
  "sentence_count": 10,
  "start_sentence": 10,
  "end_sentence": 19,
  "start_time_ms": 619030,
  "end_time_ms": 676390,
  "start_time_seconds": 619.03,
  "end_time_seconds": 676.39,
  "primary_topics": [
    "Bioelectric code",
    "Organ-level communication",
    "Synthetic living constructs"
  ],
  "secondary_topics": [
    "Evolutionary history",
    "Genetic factors",
    "Cellular communication",
    "Modular communication",
    "Top-down control",
    "Selection history",
    "Form factor"
  ],
  "key_terms": [
    "Bioelectric code",
    "Organ",
    "Synthetic living constructs",
    "Evolution",
    "Subroutine call",
    "Form factor"
  ],
  "content_summary": "The speaker discusses the concept of bioelectric code and its role in organ-level communication. The focus is on understanding this code to improve communication with biological material. The speaker also touches on synthetic living constructs, questioning how they function without the benefit of evolutionary history.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}