{
  "chunk_id": "mOaSHpTOwu0_chunk_005",
  "text": "Now, in order to find out what they're capable of building, we are going to have to ratchet up our own intelligence. And you can see there's a, there's a cool relationship between the sophistication of the hacker and the complexity of what it actually builds. So bacteria basically induce galls that are featureless. Slumps, fungi kind of do the same. So nematodes and mites kind of make something that has a shape, but by the time you get to insects, you get this kind of beautiful structure. So basically there's a bidirectional relationship between how smart we are as hackers and what we can get the material to do. And as I pointed out, we as humans, because of our own evolutionary history, are obsessed with three dimensional space. We are okay at recognizing intelligence of medium sized objects moving at medium speeds through the three dimensional space that we're used to.",
  "token_count": 153,
  "sentence_count": 8,
  "start_sentence": 5,
  "end_sentence": 12,
  "start_time_ms": 382720,
  "end_time_ms": 430650,
  "start_time_seconds": 382.72,
  "end_time_seconds": 430.65,
  "primary_topics": [
    "Bioengineering",
    "Evolutionary Biology",
    "Intelligence"
  ],
  "secondary_topics": [
    "Bacteria",
    "Fungi",
    "Nematodes",
    "Mites",
    "Insects",
    "Three Dimensional Space",
    "Hacking"
  ],
  "key_terms": [
    "Bioengineering",
    "Evolutionary Biology",
    "Intelligence",
    "Bacteria",
    "Fungi",
    "Nematodes",
    "Mites",
    "Insects",
    "Three Dimensional Space",
    "Hacking"
  ],
  "content_summary": "The speaker, Michael Levin, discusses the relationship between the sophistication of bioengineering (referred to as 'hacking') and the complexity of the structures that different organisms can build. He also talks about humans' unique perception of three-dimensional space due to our evolutionary history.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}