{
  "chunk_id": "mOaSHpTOwu0_chunk_001",
  "text": "And of course, if we had something like this, a lot of problems in biomedicine would go away and a lot of problems in bioengineering would be solved. But as we all know, we don't have anything remotely like this. We can only do this in a very small, if at all, in a very small set of circumstances. And I think that's largely because we've been thinking so far about either passive matter, now increasingly active matter, computational materials. But in biology, I think what we're dealing with is what I call an agential material. It's a material that at multiple scales has agendas and problem solving capacities which we have not largely have not yet taken advantage of. And so for me, the anatomical compiler is not some sort of 3D printer. It is a communications device. It is a translator between your goals as the engineer and the goals of the material. Because I do think that in the cybernetic sense the material has goals, in fact many of them.",
  "token_count": 173,
  "sentence_count": 10,
  "start_sentence": 1,
  "end_sentence": 10,
  "start_time_ms": 83440,
  "end_time_ms": 135230,
  "start_time_seconds": 83.44,
  "end_time_seconds": 135.23,
  "primary_topics": [
    "Bioengineering",
    "Biomedicine",
    "Agential Material",
    "Cybernetics",
    "Anatomical Compiler"
  ],
  "secondary_topics": [
    "3D Printing",
    "Communication Devices",
    "Problem Solving Capacities",
    "Computational Materials",
    "Active Matter",
    "Passive Matter",
    "Multi-scale Systems",
    "Material Goals"
  ],
  "key_terms": [
    "Bioengineering",
    "Biomedicine",
    "Agential Material",
    "Anatomical Compiler",
    "Cybernetics",
    "3D Printing",
    "Communication Devices",
    "Computational Materials",
    "Active Matter",
    "Passive Matter"
  ],
  "content_summary": "The speaker discusses the concept of 'agential material' in biology, which has problem-solving capacities and 'goals' at multiple scales. They propose the idea of an 'anatomical compiler', a communication device that bridges the gap between the goals of an engineer and the goals of the material.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Bioengineering, Biomedicine",
  "enhanced": true
}