{
  "chunk_id": "mOaSHpTOwu0_chunk_007",
  "text": "Now this is another thing I could talk for hours about, but I'm just going to show you one slide. In our group, we've been studying one particular kind of cognitive glue that binds individual cells with their agendas in transcriptional space and physiological space and so on into large scale multicellular constructs that navigate anatomical space. There are several kinds at least, but one kind of cognitive glue, much like in the brain, that does exactly the same thing for your neurons, making you more than just the pile of neurons, is bioelectricity. And so we have now ways to read and write electrical states into non neural tissue. We've developed these techniques over the last 20 years to basically take all of the tools of cognitive neuroscience and bring them into understanding the decision making, the memories, the problem solving capacities of non neural cells in navigating the space of possible shapes. And this, because now we understand what the cognitive glue is, we can start to use that as an interface to communicate new goals to the tissue. And so here, for example, and we could do this with drugs, with optogenetics, there are many ways to do it.",
  "token_count": 202,
  "sentence_count": 9,
  "start_sentence": 7,
  "end_sentence": 15,
  "start_time_ms": 468860,
  "end_time_ms": 539489,
  "start_time_seconds": 468.86,
  "end_time_seconds": 539.489,
  "primary_topics": [
    "Bioelectricity",
    "Cognitive Glue",
    "Cellular Communication"
  ],
  "secondary_topics": [
    "Transcriptional Space",
    "Physiological Space",
    "Multicellular Constructs",
    "Cognitive Neuroscience",
    "Non Neural Cells",
    "Optogenetics",
    "Drug Therapies"
  ],
  "key_terms": [
    "Bioelectricity",
    "Cognitive Glue",
    "Transcriptional Space",
    "Physiological Space",
    "Multicellular Constructs",
    "Cognitive Neuroscience",
    "Non Neural Cells",
    "Optogenetics",
    "Drug Therapies"
  ],
  "content_summary": "Michael Levin discusses the concept of 'cognitive glue', a process similar to bioelectricity in the brain, that binds individual cells into multicellular constructs. He explains how his group has developed techniques to manipulate this process in non-neural tissue, potentially allowing for new ways to communicate with and direct these cells.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}