{
  "chunk_id": "mOaSHpTOwu0_chunk_017",
  "text": "So that's it. I'm going to stop here and just summarize. What I've tried to say is that in biology there's this multi scale competency architecture of nested problem solvers. We as evolution can, can exploit this material via prompts and training, not just rewiring or micromanagement. Tools are coming online to communicate with these systems via bioelectrics and of course other modalities. Lots of, lots of applications. And finally, I think that we really need to pay a lot of attention to what you might call the intrinsic motivation of the system. Not, not just programming, not just reinforcement learning, but actually understand what it is that, that these things can do, aside from what we've made them do. And so I'll just stop here and thank the people who did the work.",
  "token_count": 134,
  "sentence_count": 9,
  "start_sentence": 17,
  "end_sentence": 25,
  "start_time_ms": 1061380,
  "end_time_ms": 1102870,
  "start_time_seconds": 1061.38,
  "end_time_seconds": 1102.87,
  "primary_topics": [
    "Multi scale competency architecture in biology",
    "Bioelectric communication with biological systems",
    "Intrinsic motivation of biological systems"
  ],
  "secondary_topics": [
    "Evolutionary exploitation of biological material",
    "Training and prompts in biological systems",
    "Rewiring and micromanagement in biology",
    "Applications of bioelectric tools",
    "Understanding capabilities of biological systems"
  ],
  "key_terms": [
    "Nested problem solvers",
    "Prompts and training",
    "Bioelectrics",
    "Intrinsic motivation",
    "Reinforcement learning"
  ],
  "content_summary": "The speaker discusses the multi scale competency architecture in biology, which can be exploited by evolution through training and prompts. The speaker also highlights the emerging tools for bioelectric communication with these systems and emphasizes the importance of understanding the intrinsic motivation of these systems beyond what they are programmed to do.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}