{
  "chunk_id": "mOaSHpTOwu0_chunk_000",
  "text": "Perfect. Okay, thank you so much. Very excited to be here and share some ideas with you. I'm going to say some kind of large scale conceptual things in addition to some data that I'm going to show you. And it's hard to do that in, in 15 minutes. So if anybody wants to download the primary data, the software, the, you know, all of that stuff is here. And then this is just a personal blog where I try to write about what I think some, some of these things mean. And this is a lot of what I'll say at the end is work done in collaboration with Josh Bongaard's lab as part of this ICDO organization that we have. And what I'm going to describe today is this notion of agential materials and a way of interacting with your materials that are more around the concepts of collaboration and literally a kind of social engineering with your material. Because we view these things as a collective intelligence that we want to motivate, not just rewire or micromanage. And so one of the great challenges in our field, which is both synthetic morphology and biomedicine, is that someday you want to sit in front of a computer and you want to draw the plant animal, biobot, organ, whatever you want, with no limitations really. And what this thing should do is compile that description down to a set of stimuli that would be given to cells to get them to build whatever you want, such as this three headed flatworm. And of course, if we had something like this, a lot of problems in biomedicine would go away and a lot of problems in bioengineering would be solved.",
  "token_count": 290,
  "sentence_count": 15,
  "start_sentence": 0,
  "end_sentence": 14,
  "start_time_ms": 320,
  "end_time_ms": 91120,
  "start_time_seconds": 0.32,
  "end_time_seconds": 91.12,
  "primary_topics": [
    "agential materials",
    "synthetic morphology",
    "biomedicine",
    "bioengineering",
    "collective intelligence"
  ],
  "secondary_topics": [
    "social engineering",
    "data sharing",
    "collaboration in research",
    "computer-aided design in biology",
    "cellular stimuli",
    "biobot creation",
    "organ creation"
  ],
  "key_terms": [
    "agential materials",
    "synthetic morphology",
    "biomedicine",
    "bioengineering",
    "collective intelligence",
    "social engineering",
    "biobot",
    "cellular stimuli"
  ],
  "content_summary": "Michael Levin discusses the concept of agential materials and the idea of interacting with materials in a collaborative way, viewing them as a collective intelligence. He speaks about the challenges in synthetic morphology and biomedicine, and the potential for computer-aided design to direct cellular behavior to create desired biological forms, such as organs or biobots.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Bioengineering",
  "enhanced": true
}