{
  "file_metadata": {
    "text_file": "/Users/mbstarr/Programs/michael-levin-qa-engine-1/media_pipelines/scientific_publications/data/transformed_data/text_extraction/pdf_20250803_124126_170197_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_170197.pdf",
    "file_size": 155747,
    "authors": "Unknown",
    "journal": "Unknown",
    "doi": "Unknown",
    "year": "2025",
    "title": "Unknown",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "The standard paradigm of developmental and synthetic biology focuses on gene expression driving changes in morphology. Here, we investigated the reverse relationship: would transcriptomes change if cell collectives acquired a novel morphogenetic and behavioral phenotype in the absence of genomic editing, transgenes, heterologous materials, or drugs? We investigated the effects of morphology and nascent emergent life history on gene expression in the basal (no engineering, no sculpting) form of Xenobots – autonomously motile constructs derived from Xenopus embryo ectodermal cell explants. We compared transcriptomes of these basal Xenobots with age-matched Xenopus embryos. Basal Xenobots showed significantly larger inter-individual gene variability than age-matched embryos, suggesting increased exploration of the transcriptional space. We identified at least 537 (non-epidermal) transcripts uniquely upregulated in these Xenobots. Pathway analyses indicated transcriptomic shifts in the categories of motility machinery, multicellularity, stress and immune response, metabolism, and sensory perception of sound and mechanical stimuli. We experimentally confirmed that basal Xenobots respond to acoustic stimuli via observable changes in behavior, in ways that age-matched embryos do not. Phylostratigraphic analysis showed that the majority of transcriptomic shifts in the basal Xenobots were towards evolutionarily ancient transcripts and systems. Lastly, we found enrichment of thanatotranscriptomic genes, shedding light on the distinction between death of an organism and that of its cells. These data on the relationship between genotype and phenotype may have implications for evolution, biomedicine, and synthetic morphoengineering.",
      "section": "Abstract",
      "topic": "Xenobot Transcriptomics",
      "chunk_summary": "Basal Xenobots exhibit unique transcriptomic changes, including increased variability, upregulation of motility, multicellularity, stress response, metabolism, and sensory perception genes, and enrichment of evolutionarily ancient and thanatotranscriptomic genes, suggesting a reverse relationship where morphology influences gene expression.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The standard research paradigm of developmental and synthetic biology seeks to discover how gene expression drives specific anatomical and behavioral outcomes. However, it is also well-understood that transcriptional machinery itself is sensitive to external cues. Rapid changes of gene expression can be induced by exposures to genetic, biochemical, biomechanical, bioelectrical, and materials-mediated influences. On a much longer timescale, the properties of gene expression profiles in vivo are thought to be determined by evolutionary selection, optimizing fitness to specific environment, life history and lived experiences. Here, we sought novel aspects of the responsiveness of gene expression, in a setting in which a non-canonical multicellular, functional form is achieved without transgenes, chemical signals, foreign nanomaterials, or other added influence. A fascinating set of questions concerns the origins of species-specific transcriptomic profiles, normally shaped by eons of selection over the functionality of those forms in a specific environmental context. Unique aspects of these questions can be addressed in synthetic systems in which the entities have not had a history of selection in their current multicellular embodiment. Numerous synthetic life forms have recently been produced; however, many questions remain to be answered, via analysis of transcriptomic profiling in these synthetic living configurations. In this study we utilize one such living system to understand how synthetic morphology might result in transcriptomic changes. Our goal was to characterize unique transcriptomic changes in this synthetic living system in comparison to its native (wild-type) embryo context.",
      "section": "Introduction",
      "topic": "Synthetic Morphology and Transcriptomics",
      "chunk_summary": "This study investigates how synthetic morphology, achieved without genetic manipulation or external influences, affects transcriptomic changes in a novel multicellular system compared to its native embryo context, addressing the origins of species-specific transcriptomic profiles in the absence of evolutionary selection.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Multiple different kinds of autonomously moving biobots can be derived from Xenopus embryonic cells. They offer self-organization (a kind of developmental morphogenesis), as they need no scaffold in order to form and mature into functional constructs. They can form from a single tissue (prospective skin/epidermis) or from a combination of multiple tissues (e.g., skin/epidermis and muscles), can be of multitude of shapes and be actuated by either the muscle contraction or coordinated beating of cilia. They show self-healing and emergent group behaviors including kinematic self-replication. This overall class is referred to as “Xenobots” to emphasize the fact that we see their utility as potentially programmable living materials a model system in which to learn to control the plasticity of living active matter toward applications that shed light on life-as-it-can-be. In this study we use the basal (spherical) Xenobots derived from completely wild-type ectodermal explant cells with no drugs, synthetic biology circuits, nanomaterials, sculpting, or anything else added. Hence, we can observe latent behaviors of these cellular collectives that are released by lifting signaling constraints present when they were part of the larger organism.",
      "section": "Introduction",
      "topic": "Xenobots as a Model System",
      "chunk_summary": "Xenobots, self-assembling biobots derived from Xenopus embryonic cells, offer a model system for studying the plasticity of living active matter and the latent behaviors of cellular collectives in novel morphologies.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The basal Xenobots are autonomously motile, self-assembling constructs derived from frog (Xenopus laevis) embryonic ectodermal explants (colloquially referred to in developmental biology studies as “animal caps”) as starting material. The Xenopus ectodermal explants (animal caps) have been studied for several decades and serve as an excellent model for studying epidermal cell fate and patterning as well as testing the plasticity and responsiveness of these cells to various inducers and inhibitors. Also, mucociliary organoids developed from these Xenopus ectodermal explants have served as excellent models for understanding dynamics of mucociliary epidermis formation and maintenance. However, we cultured these ectodermal explants until they formed autonomously-moving atypical entities aka the basal Xenobots used in this study. We were particularly interested in studying the transcriptomic changes in these autonomously-moving Xenobots. Recently, elegant temporal transcriptomic analysis has shown epidermal cell fate specification during the transformation of Xenopus ectodermal explants (animal caps) to autonomously-moving atypical entities (the basal Xenobots used in this study). However, in this study we sought to broadly analyze genome-wide transcriptomic changes well beyond epidermal cell fate specification in response to a not previously selected-for embodiment and nascent life history of these autonomously-moving atypical entities as system that self-assembles without being forced onto an engineered scaffold and exhibits autonomous motion behavior (being functionally closer to a proto-organism than a typical organoid). We see these autonomously-moving atypical entities (basal Xenobots) as an important biorobotics platform because, once their properties are understood, they can be used as a testbed in which to improve our understanding and ability to control growth and form, and ultimately deploy them for many useful purposes. Unlike conventional robotic materials, living cells offer numerous complex behaviors and responses; understanding the plasticity, and molecular-biological responses, of cell collective entities in new contexts is a critical part of morphogenic engineering efforts.",
      "section": "Introduction",
      "topic": "Basal Xenobots and Transcriptomic Changes",
      "chunk_summary": "This study focuses on the transcriptomic changes in basal Xenobots, autonomously-moving entities derived from Xenopus ectodermal explants, analyzing genome-wide changes beyond epidermal cell fate specification in response to their novel embodiment and nascent life history.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "To advance this engineering roadmap, as well as more broadly understand how transcriptomes respond to internal and external environment changes (e.g., for biomedical purposes, as well as basic evolutionary developmental biology), we compared the transcriptome of basal Xenobots to those of age-matched embryo controls. Importantly, we did not focus on gene expression missing from Xenobots, because it was expected that, being made of just one tissue type, they would lack many transcripts that normal embryos expressed. Instead, we asked what transcripts, other than epidermal markers (expected to be enriched), Xenobots expressed that their age-matched embryos did not. We found at least 537 transcripts to be uniquely upregulated in these Xenobots, representing functional classes such as locomotion apparatus assemblies (cilia and motor proteins), structure formation and multicellularity, stress and immune response, metabolism, and, even sensory perception of sound and mechanical stimuli. Functional experiments confirmed that basal Xenobots, unlike age-matched Xenopus embryos, indeed respond to acoustic vibration stimuli by changing their motion behavior. Phylostratigraphic analysis shows that the majority of these transcriptomic shifts are towards evolutionary ancient transcripts and systems. These changes suggested that alteration of morphology and nascent emergent life history, in wild-type cells, were enough to strongly affect the transcriptome (morphology/behavior driving gene expression). Moreover, we found a significantly greater inter-individual gene variability in these Xenobots compared to their age-matched Xenopus embryos suggesting exploratory adaptation in the transcriptional space to adapt and survive in their new embodiment. Another unique aspect that these Xenobots allowed us to investigate was the nature of organismic death and its effects on gene expression. By making a Xenobot out of an embryonic source of cells, the original embryo “dies” – it is no more; but the cells persist and continue on in a new embodiment. Our analysis revealed enrichment of thanatotrascriptomic genes, seen previously in studies of human post-mortem molecular physiology. Taken together, these data shed light on the feedback of form and function onto cellular genetics, in the context of evolved and engineered living beings transitioning across levels of organization.",
      "section": "Introduction",
      "topic": "Transcriptomic Analysis of Basal Xenobots",
      "chunk_summary": "Transcriptomic analysis of basal Xenobots revealed upregulation of genes related to locomotion, multicellularity, stress response, metabolism, and sensory perception, with a shift towards evolutionarily ancient transcripts and enrichment of thanatotranscriptomic genes, highlighting the influence of morphology and life history on gene expression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "One major difference in the rearing condition of Xenopus embryos and basal Xenobots used in this study is the MMR (Marc's Modified Ringers) medium concentration: embryos are reared in 0.1X MMR, Xenobots are reared in 0.75X MMR (a higher concentration of salts). Thus, we first asked whether raising embryos in 0.75X MMR induces any significant transcriptional changes in comparison to embryos raised in 0.1X MMR. We performed RNA sequencing analysis on stage 35/36 Xenopus embryos (stage corresponds to the formation of mature autonomously-moving Xenobots on day 7 at 14°C after explanting ectodermal explants (animal caps) from stage 9 embryos) raised in either 0.1X MMR or raised in 0.75X MMR after stage 9 (stage at which ectodermal explants are removed from embryos and placed in 0.75X MMR to make the basal Xenobots). We collected RNA from three replicate samples (each sample containing ten stage 35/36 embryos) for each condition (0.1X and 0.75X MMR). Overall, we observed no separation between groups by principal component analysis. However, after surrogate variable analysis and batch-correction, we did observe some separation of the clusters. We thus performed differential gene expression analysis and found that in the histograms of significance the p-value histograms are relatively flat, with the proportions of the true null hypothesis (non-significant genes) to be 0.996 and all FDRs (False Discovery Rates) to be near one. These results indicate minimal changes in the overall transcriptome of 0.75X MMR raised embryos versus 0.1X MMR raised embryos. Differential expression analysis showed that out of ~24,500 transcripts only 6 genes were significantly changed (FDR < 0.05) with a log fold change > 2 in the 0.75X MMR raised embryos. These results show that overall raising embryos in the higher salt medium at 0.75X MMR results in very little transcriptional change – the transcriptome is not highly sensitive to external conditions.",
      "section": "Results",
      "topic": "Effect of MMR Concentration on Embryo Transcriptome",
      "chunk_summary": "Raising Xenopus embryos in 0.75X MMR, the concentration used for Xenobots, resulted in minimal transcriptional changes compared to embryos raised in 0.1X MMR, indicating the embryo transcriptome's resilience to external salt concentration changes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The basal Xenobots are derived by explanting ectodermal explant (animal cap) tissue from stage 9 Xenopus embryos, and reach maturity by day 7: fully differentiated cells, peak cellular health, and peak robust autonomous movement behavior. To test our hypothesis that these Xenobots would have unique and distinct transcriptomic changes compared to normal Xenopus embryos, we compared these Xenobots' transcriptome to that of age-matched (stage 35/36) control Xenopus embryos that were reared in identical conditions (incubation temperature and time) as the Xenobots. We collected RNA from three pooled samples for each condition (Xenobots and age-matched stage 35/36 Xenopus embryos) and performed RNA-seq to compare the two transcriptomes. Principal component analysis using surrogate variables and batch-correction showed marked separation between the clusters of Xenobot transcriptome and that of age-matched Xenopus embryos. Differential expression analysis showed that out of 28,009 transcripts, 1,962 transcripts were significantly up-regulated (FDR<0.05) with log fold change >2 in these Xenobots compared to age-matched embryos and 5,053 transcripts were significantly down-regulated (FDR<0.05) with log fold change < -2 in these Xenobots compared to age-matched embryos. These results show that overall, these Xenobots have major transcriptional differences from age-matched Xenopus embryos.",
      "section": "Results",
      "topic": "Transcriptomic Changes in Basal Xenobots",
      "chunk_summary": "RNA-seq analysis revealed significant transcriptional differences between basal Xenobots and age-matched Xenopus embryos, with 1,962 transcripts upregulated and 5,053 downregulated in Xenobots.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "In the principal component analysis, the three Xenobots samples show much wider separation compared to the three age-matched embryo samples. Previous work has shown that cells experiencing novel stressors can randomly change their gene expression profiles until they find configurations that resolve the stress, and that individual cells discover different expression profiles that solve the same problem. We hypothesized that the process of removal from the embryo serves as a novel stressor for the nascent Xenobot tissue, requiring the tissue to adapt to its new embodiment in ways that evolution did not prepare it for. In contrast, while embryos are indeed capable of solving novel problems to achieve their developmental goals, their developmental trajectory is more stereotyped and likely requires less transcriptional exploration than do these Xenobots. We compared the variability of individual transcripts among biological samples. Briefly, all 28,009 gene transcripts were ranked based on their mean count values across all samples (3 Xenobot samples and 3 Xenopus embryo samples), combined, and genes for which any sample had a value of 0 were removed. The standard deviations of individual gene transcripts among Xenobot samples and Xenopus embryo samples were estimated and used to calculate the coefficient of variation (CV) for each gene. In Xenobots, genes have significantly higher inter-individual CVs and a broader range of CVs than embryos (Wilcoxon Rank Sum test, p=0). The ranked gene list was split into 100 equal-size bins (percentiles), and the fraction of genes in each bin for which CV of the Xenobots (CVX) was greater than the CV of the Xenopus embryos (CVE) was plotted. We found that almost all genes have a greater CV for Xenobots than Xenopus embryos (96.06% of all included genes). Also, the general trend of increasing bin fraction with higher gene count percentile indicated that, the higher the gene expression, the higher is the variability of that gene in Xenobots compared to Xenopus embryos. A permutation test revealed that these deviations from the expected bin fraction value across gene count percentiles were statistically significant. Among the top ten most variable genes in these Xenobots, Oncomodulin gene which encodes a protein with widely distinct functional roles is most prominent with three oncomodulin genes in the top ten. Other interesting genes include A. superbus venom factor 1, salivary glue protein like, neurotrimin, tenomodulin, somatostatin receptor 4, chloride intracellular channel 4. Thus overall, there is significantly greater gene count variability in these Xenobots compared to age-matched Xenopus embryos, possibly indicating exploratory adaptation in the transcriptional space to adapt and survive in their new embodiment.",
      "section": "Results",
      "topic": "Inter-individual Gene Variability in Xenobots",
      "chunk_summary": "Xenobots exhibit significantly greater inter-individual gene count variability than age-matched Xenopus embryos, suggesting exploratory adaptation in response to the stress of removal from the embryo and the need to adapt to a new embodiment.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The basal Xenobots are derived from ectodermal explants (animal cap explants) which are primarily ectodermal progenitor cells. Most cells and tissues belonging to mesoderm and endoderm are absent in these Xenobots as compared to Xenopus embryos. Hence mesoderm and endoderm transcripts would come out as highly downregulated in these Xenobots compared to age-matched embryos largely due to absence of those cells and tissues in these Xenobots (false positives). Similar to previous studies, we found no clear path to resolve and differentiate which downregulated transcripts (out of the 5053 downregulated transcripts) are changed due to absence of mesoderm and endoderm (false positives) and which transcripts are truly downregulated in these Xenobots compared to age-matched Xenopus embryos (true positives). Hence, we did not further analyze the downregulated transcripts dataset. Conversely, Xenobots are fully derived from ectoderm, but ectoderm only forms a small portion of whole embryo (~10%). Thus, in a head-to-head comparison, ectodermal genes would be artificially enriched in these Xenobots resulting in false positives due to simple proportional enrichment of ectodermal tissues. To adjust for this, we subtracted out the artificially enriched ectodermal/epidermal-specific transcripts from the 1,962 upregulated transcripts to curate a list of transcripts uniquely upregulated in these Xenobots which could not be explained by the increased prevalence of ectodermal cells. To achieve this, we used Klein tools a database of single-cell transcriptome of stage 22 entire Xenopus embryo. We subtracted out the entire gene set for embryonic epidermal progenitors in Xenopus embryos, leaving 1742 transcripts that were upregulated in these Xenobots. ~41% (712 transcripts) of the transcripts were uncharacterized “LOC” genes. We used genome-wide functional annotation tool eggNOG-mapper to annotate these uncharacterized transcripts using human (most annotated genome) orthologs. We first tested the functional annotation using a small subset of already known Xenopus transcripts and found ~80% accuracy with differences mostly being different versions of the same gene. After functional annotation of the uncharacterized transcripts, removing any remaining unannotated transcripts, and removing all duplicate transcripts from short and long chromosomes, we were left with 1078 uniquely upregulated transcripts in these Xenobots compared to age-matched Xenopus embryos. We found many cilia and motor protein transcripts in the 1078 uniquely upregulated transcripts in Xenobots which suggested the possibility that perhaps even after epidermal gene subtraction there might still be some false positively enriched epidermal transcripts particularly belonging to the epidermal multiciliate cells. To address this issue, we raised our stringency to very high (likely losing some true positives) by again resorting to Klein tools database of single-cell transcriptome of stage 22 entire Xenopus embryos. In addition to the epidermal progenitor gene subtraction already performed, we collected all the genes expressed in the different types of epidermal cells namely, multiciliated cells, alpha and beta ionocytes, and goblet cells. We then subtracted any genes from any of these four cells that were present in our list of 1078 transcripts uniquely upregulated in these Xenobots. We then obtained a highly stringent list of 795 transcripts in which we had high confidence that these transcripts were uniquely upregulated in these Xenobots compared to age-matched embryos. After mapping these 795 transcripts to human orthologs we obtained 537 transcripts which were then used for subsequent comparisons and analysis.",
      "section": "Results",
      "topic": "Curation of Xenobot Transcripts",
      "chunk_summary": "Stringent curation of Xenobot transcripts involved removing downregulated transcripts due to missing mesoderm and endoderm, subtracting artificially enriched ectodermal transcripts, annotating uncharacterized transcripts, and further removing epidermal multiciliate cell genes to obtain a high-confidence list of 537 uniquely upregulated transcripts.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "What kind of genes did the basal Xenobots up-regulate? To understand the biological processes that might be affected by their unique transcripts, we first performed functional enrichment analysis using the Database for Annotation, Visualization and Integrated Discovery (DAVID). Using DAVID, we identified enriched biological themes amongst significantly differentially expressed genes and clustered the redundant annotation terms using the Functional Annotation Clustering tool. We identified the most enriched functional clusters and ranked them based on their group enrichment score, which is the geometric mean (in -log scale) of member's p-values in a corresponding annotation cluster. Interestingly, despite the very high stringency and removal of genes expressed by epidermal cells, we found enrichment of cilia, ciliopathies, and motor proteins. We also found categories for immune response and signaling, and metabolism/biosynthesis. Interestingly, we found a category of membrane proteins that contained largest number of genes belonging to various functions such as, ion channels and transporters, gap junction and junctional proteins, calcium binding proteins, ATP binding proteins, sound or mechanical stimuli responsive proteins. In addition, we also performed a network analysis to identify active functional biological modules. We combined gene expression and interaction data and then applied network embedding, followed by clustering similarly to that performed by. The detected functional modules were then enriched using g:profiler. This network clustering analysis identified 10 enriched clusters. Many of the clusters were similar to the functional enrichment analysis such as cilia/cytoskeleton/ciliopathies, immune and stress response, metabolism/biosynthesis. We also found clusters for extracellular matrix (ECM)/proliferation/multicellular organization, and sensory perception of sound and mechanical stimuli. In summary, we identified biological processes enriched in these Xenobots compared to age-matched Xenopus embryos. These include cilia and motor proteins, tissue building/multicellular organization, immune and stress response, metabolism shift and perception of sound and mechanical stimuli. Among these the tissue building/multicellular organization and immune and stress response were unsurprising as these functions are required for building any novel morphology. The presence of cilia and motor proteins in spite of our very high stringency was surprising. Lastly, the shift in metabolism compared to embryo and the presence of sensory perception of sound and mechanical stimuli was extremely surprising.",
      "section": "Results",
      "topic": "Functional Analysis of Upregulated Transcripts",
      "chunk_summary": "Functional enrichment and network analysis of uniquely upregulated transcripts in Xenobots revealed enrichment in cilia, motor proteins, immune response, metabolism, membrane proteins (including ion channels, gap junctions, and sensory perception proteins), and multicellular organization, highlighting surprising shifts in metabolism and sensory perception.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "To assess whether any mesodermal, endodermal, or axis patterning genes were being up-regulated in the basal Xenobots, we first curated a list of most prominent genes for each of these categories from literature. We then compared to see if any of these genes are expressed in our high stringency transcripts upregulated in these Xenobots. None of the critical genes from mesoderm, endoderm, mesendoderm, anterior-posterior patterning, dorso-ventral patterning, or left-right patterning were found to be enriched in these Xenobots. This suggests that it is unlikely that these Xenobots perform trans-differentiation to recover their missing germ layers. Sensory perception of sound and mechanical stimuli was one of the most surprising gene clusters for biological processes identified to be significantly upregulated in Xenobots. The possibility that basal Xenobots could exhibit novel functional responses to sound is fascinating as it would provide a tractable method to control Xenobot physiology and/or behavior, as well as shedding light on evolutionary developmental biology aspects of sensory capabilities. To functionally test this hypothesis, we exposed Xenobots to acoustic vibration stimulus and documented changes in their motion behavior. First, we created an apparatus to apply acoustic vibration stimulus to Xenobots. A preliminary frequency survey showed that Xenobots respond to vibration stimulus by changing their motion behavior within the frequency range of 50Hz to 300Hz with the strongest response at 300Hz. Hence, we chose a frequency of 300Hz for our experiments. The amplitude was reduced to the point where there was no visible movement of liquid in the dish and then the frequency and amplitude were kept constant throughout all experiments. We recorded time-lapse videos of Xenobot motion for 10 min before the vibration stimulus, 10 min during the vibration stimulus, and for 10 min after the vibration stimulus (total 30 minutes of observation for each Xenobot). We first performed two essential controls. To test whether subtle movement of liquid medium in response to vibration may be physically moving the Xenobot we used day 1 Xenobots as controls, because at that time point cellular differentiation has not yet occurred and there are no multiciliate cells: they are non-motile, and thus would reveal any passive movement induced externally. Day 1 Xenobots are especially good controls as they have roughly the same size and mass as the day 7 autonomously motile Xenobots. Day 1 Xenobots showed no movement within the intervals before, during, and after vibration stimulus suggesting that whatever movements we observe cannot be due to a passive displacement of inactive material by simple physical vibration. Next, to test whether vibration stimulus causes a generic change in structure and/or function of cilia leading to change in motion behavior, we tested the effect of vibration stimulus on age-matched stage 35 embryos. In addition to cilia-based gliding, stage 35 embryos also have muscle-based movement. Hence, we treated them with 0.05% tricaine (MS-222) which blocks sensory-motor responses and thus inhibits muscle-based movement while leaving the cilia-based movement intact. Age-matched stage 35 embryos showed the expected cilia-based motion but did not show any significant difference in motion behavior between the time intervals of before, during, and after vibration stimulus. This result suggests that vibration stimulus is not causing a generic change in structure and/or function of cilia and shows no significant effect on cilia-based motion in age-matched stage 35 embryos. Would the Xenobots respond differently than embryos, as suggested by the RNAseq data? We then tested the effect of vibration stimulus on day 7 autonomously motile Xenobots. Day 7 autonomously motile Xenobots show characteristic rotational motion behavior before exposure to vibration stimulus. However, upon exposure to vibration stimulus, day 7 Xenobots show marked change in motion behavior with a more linear/arcing motion behavior and a significant increase in peak velocity. After the vibration stimulus they return to rotational motion behavior similar to pre-stimulus levels. These results reveal that day 7 freely-behaving Xenobots specifically respond (in form of changed motion behavior) to vibration stimulus in ways that inactive (passive) Xenobots and age-matched normal embryos do not.",
      "section": "Results",
      "topic": "Xenobot Response to Acoustic Stimuli",
      "chunk_summary": "Xenobots, unlike age-matched embryos or non-motile Xenobots, respond to acoustic vibration stimuli by changing their motion behavior from rotational to linear/arcing with increased peak velocity, confirming the functional significance of upregulated sensory perception genes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "We next turned our attention to additional aspects of the RNAseq results. Recent studies have shown the surprising fact that cells actively turn on specific genes after an organism's death – the so called thanatotranscriptome. This is fascinating as it provides a way to dissociate death of an organism from that of its cells, thus shedding light on deep issues of multicellularity and emergent levels of organization in biology. We hypothesized that the data from human thanatotranscriptome studies indicated the cells' attempt to survive in another form after the demise of the organism. In the case of mammals, living in dry air, this would be futile, but in the case of amphibians, this could work and indeed, these Xenobots represent just that scenario – the original body is destroyed, but some of the cells live on in another form. Would these Xenobots express thanatotranscriptome genes? As control we used all the genes expressed in Xenopus embryonic epidermal progenitor cells + multiciliated cells + alpha and beta ionocytes + goblet cells (obtained with Klein tools database) a total of 2635 genes (without LOC genes and mapped to human orthologs). From the literature we curated the thanatotranscriptomic genes (336 genes). Then we determined what percentage of transcripts uniquely upregulated in these Xenobots (537 genes mapped to human orthologs) are in the thanatotranscriptome set in comparison to the controls (total list of genes from all epidermal cell types 2635 genes). We found that the Xenobot-upregulated genes had more than double (3.5%) of thanatotranscriptome genes compared to control genes (1.6%). Enrichment analysis of these Xenobot genes overlapping with the thanatotranscriptome suggests they mostly belong to immune activation, stress response, and insulin signaling. This suggests that the self-assembly process of these Xenobots following the harvesting of their source cells from an embryo may have similarities to the death process in other metazoan including humans.",
      "section": "Results",
      "topic": "Thanatotranscriptomic Gene Enrichment",
      "chunk_summary": "Xenobots exhibit enrichment of thanatotranscriptomic genes, primarily related to immune activation, stress response, and insulin signaling, suggesting similarities between Xenobot self-assembly after cell harvesting and the death process in other organisms, potentially reflecting the cells' attempt to survive in a new form after the \"death\" of the original embryo.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "To test the hypothesis that the basal Xenobots were acquiring more ancient transcriptomic patterns as a result of their morphogenesis and nascent emergent life history, we performed a phylostratigraphic analysis. For this analysis we did not need to remove LOC genes, and we did not need any mapping to human orthologs so the fullest extent of the gene lists were used. We used PhylostratR that applied BLAST to compare the whole Xenopus genome to at maximum 5 different proteomes of representative organisms of different ages in each evolutionary tree strata. Subsets of all genes in Xenopus genome associated with each stratum were shortlisted. Xenobot transcripts and control transcripts were then compared against these shortlisted genes. To determine the evolutionary age of transcripts from these Xenobots, we used both the unique Xenobot transcripts (1450 genes including LOC genes without mapping to human ortholog) and all the Xenobot up-regulated transcripts (1812 genes after removing short and long gene duplicates) and compared them to the controls (all the genes expressed in epidermal progenitor cells + multiciliated cells + alpha and beta ionocytes + goblet cells - 3374 genes including LOC genes without mapping to human orthologs). Going as far back as Vertebrata, there was not much difference between overlap of controls vs Xenobot transcripts. However, going further back in evolutionary time showed major enrichment of Xenobot transcripts overlap in comparison to controls for example, Bilateria, Eumetazoa, and Metazoa showed much more overlap with Xenobot transcripts than controls. In addition, in these (Bilateria, Eumetazoa, and Metazoa) phyla the unique Xenobot genes showed more overlap than all Xenobot up-regulated genes indicating that the unique Xenobot genes were enriched for older phyla even in comparison to its own overexpressed genes suggesting specific enrichment of evolutionary older genes. Overall, this indicates that the transcripts upregulated in these Xenobots are particularly evolutionarily ancient genes.",
      "section": "Results",
      "topic": "Evolutionary Age of Xenobot Transcripts",
      "chunk_summary": "Phylostratigraphic analysis revealed that upregulated transcripts in Xenobots are enriched for evolutionarily ancient genes, particularly in the Bilateria, Eumetazoa, and Metazoa phyla, suggesting a shift towards older transcriptomic patterns in response to their novel morphology and life history.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "In this study, we try to make inroads into the relationships between genomes, transcriptomes, and overall morphology. This is a fundamental question in biology with many knowledge gaps concerning the range and plasticity of the latent space around a genome with respect to transcriptome and morphology, and lack of predictive power for the properties of novel constructs and chimeras. Tremendous progress in the fields of synthetic biology, synthetic morphology, and biorobotics has made available biological model systems that are unencumbered by a history of environmental selection forces and serve as great model systems in which to understand the emergence of novel molecular-genetic, physiological, and morphological phenotypes. In this study we ask the question, how does the transcriptome change in response to cellular collectives acquiring non-evolved embodiments and behaviors in absence of any genomic editing, drug treatments, or heterologous interventions – to understand the top-down influence of morphology over transcriptome. Our goal was to utilize a synthetic living system to identify unique transcriptomic changes in it, in comparison to its native (wild-type) context. For this we exploited the Xenobots platform which includes multiple different kinds of autonomously-moving biobots all derived from Xenopus embryonic cells. We analyzed the basal Xenobots which are autonomously-motile, self-assembling multicellular entities derived from Xenopus ectodermal explants (animal caps). The Xenopus ectodermal explants have a rich history of serving as a tractable model system for investigating epidermal cell fate specification and cell fate plasticity in response to various chemical stimuli. In addition, mucociliary organoids derived from them have helped understand mucociliary epidermis dynamics. Recent transcriptomic analysis has looked at epidermal cell fate specification during transformation of these ectodermal explants to the autonomously-moving entities (basal Xenobots). However, in this study we investigate the transcriptome of these Xenobots in comparison to their native wild-type embryonic tissue using a different transcriptomic analysis beyond epidermal cell fate specification, to understand how these Xenobots' morphology and behavior affects their transcriptomic changes. We found significantly greater inter-individual gene variability in these Xenobots suggesting adaptive exploration of the transcriptional space to adapt to their novel embodiment and associated stressors. Gene ontology and network analysis of unique (non-epidermal marker) transcriptomic changes showed both, expected shifts in multicellular organization and immune/stress response along with surprising changes in metabolism and sensory perception of sound and mechanical stimuli. Indeed, these autonomously motile basal Xenobots respond to acoustic stimulation by changing their motion behavior while motile age-matched embryos and passive non-motile Xenobots do not. Physlostratigraphic analysis showed transcriptional changes reflecting evolutionary ancient genes. We also found significant enrichment of thanatotrascriptomic genes suggesting signatures of organismal death in them. Overall, all these transcriptomic changes in these Xenobots suggest that alteration of morphology and nascent emergent life history were enough to strongly affect the transcriptome (morphology/behavior driving gene expression).",
      "section": "Discussion",
      "topic": "Transcriptomic Response to Morphology and Behavior",
      "chunk_summary": "This study investigates the relationship between transcriptome, morphology, and behavior in Xenobots, revealing that altered morphology and life history significantly affect gene expression, with increased variability, shifts in multicellularity, immune response, metabolism, sensory perception, and enrichment of ancient and thanatotranscriptomic genes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_170197.pdf",
      "original_filename": "pdf_20250803_124126_170197_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T09:35:26.854392"
}