{
  "file_metadata": {
    "text_file": "/Users/mbstarr/Programs/michael-levin-qa-engine-1/media_pipelines/scientific_publications/data/transformed_data/text_extraction/pdf_20250803_124125_476793_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_476793.pdf",
    "file_size": 31075,
    "authors": "Unknown",
    "journal": "Unknown",
    "doi": "Unknown",
    "year": "2025",
    "title": "Unknown",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "Neurotransmitters are not only involved in brain function but are also important signaling molecules for many diverse cell types. Neurotransmitters are widely conserved, from evolutionarily ancient organisms lacking nervous systems through man. Here, results are reported from a loss- and gain-of-function survey, using pharmacological modulators of several neurotransmitter pathways to examine possible roles for these pathways in normal embryogenesis. Applying reagents targeting the glutamatergic, adrenergic and dopaminergic pathways to embryos of Xenopus laevis from gastrulation to organogenesis stages, we observed and quantified numerous malformations, including craniofacial defects, hyperpigmentation, muscle mispatterning and miscoiling of the gut. These data implicate several key neurotransmitters in new embryonic patterning roles, reveal novel earlier stages for processes involved in eye development, suggest new targets for subsequent molecular-genetic investigation, and highlight the necessity for in-depth toxicology studies of psychoactive compounds to which human embryos might be exposed during pregnancy.",
      "section": "Abstract",
      "topic": "Neurotransmitter roles in embryogenesis",
      "chunk_summary": "Pharmacological modulation of neurotransmitter pathways in Xenopus laevis embryos reveals their roles in embryonic patterning and highlights the need for toxicology studies of psychoactive compounds.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Although neurotransmitters are most often investigated for their role relaying information throughout the nervous system, they also participate as chemical messengers in many signaling events of a non-neuronal nature. Neurotransmitters precede the appearance of nervous systems on both developmental and evolutionary time scales. Classical neurotransmitters have been found in oocytes and pre-nervous embryos of both vertebrates and invertebrates, including mammals, amphibians, fish, insects and echinoderms. In addition, neurotransmitters are so evolutionarily ancient that they are found in organisms outside the animal kingdom. For example, acetylcholine is present in all kingdoms of life including fungi and bacteria, and serotonin is present in plants. It has thus been hypothesized that the complex cognitive functions occurring in animal brains, and partially mediated by neurotransmitters, evolved from much simpler cell-cell signaling events responsible for developmental patterning and maintenance of homeostasis in primitive organisms.",
      "section": "Introduction",
      "topic": "Evolutionary role of neurotransmitters",
      "chunk_summary": "Neurotransmitters predate nervous systems and play a role in cell-cell signaling in diverse organisms, suggesting their evolutionary importance in developmental processes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Humans and other vertebrates express serotonergic, glutamatergic, cholinergic and dopaminergic receptors in non-neural tissues, where these receptors participate in a variety of physiological events. Most remarkably, complete neurotransmitter systems containing not only receptors, but also machinery for neurotransmitter synthesis and degradation, are present in several somatic organs. For example, the kidney possesses its own dopaminergic system that protects it from oxidative stress and inflammation, and regulates sodium excretion. In addition, the epidermis has cholinergic and adrenergic systems that control cell growth, motility and pigmentation, as well as a serotonergic system responsible for a wide range of responses to environmental rhythms and stresses.",
      "section": "Introduction",
      "topic": "Neurotransmitter systems in non-neural tissues",
      "chunk_summary": "Vertebrates express neurotransmitter receptors and complete neurotransmitter systems in non-neural tissues, contributing to various physiological functions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Perhaps most interestingly, neurotransmitters have been shown to participate in embryonic development as well as in maintenance of physiological states. They are best known for organizing the developing mammalian brain, but also act as important body-wide patterning signals in a wide variety of animals. In the sea urchin embryo, cleavage and gastrulation are, in part, regulated by serotonin; a similar role was found for serotonin in the fruit fly model. In addition, lipophilic analogs of serotonin, acetylcholine and cannabinoids have been shown to rescue sea urchin embryos from developmental defects induced by the amyloid protein fragments responsible for Alzheimer's disease.",
      "section": "Introduction",
      "topic": "Neurotransmitters in embryonic development",
      "chunk_summary": "Neurotransmitters play crucial roles in embryonic development across various animal species, including regulating cleavage, gastrulation, and rescuing developmental defects.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "In vertebrates, several developmental roles of serotonin are well documented. Serotonin regulates many different aspects of bone development, including chondrogenic differentiation, osteoblast proliferation and maintenance of bone mass. Serotonergic signaling is also an invaluable regulator of craniofacial development, stimulating neural crest cell migration, morphogenesis of the jaw joint and branchial arches, skull ossification, formation of the teeth, and organization of the retina. In addition, it has been shown in both frog and chick that serotonin acts as a very early signal in left-right patterning, acting upstream of the earliest asymmetrically transcribed genes.",
      "section": "Introduction",
      "topic": "Serotonin in vertebrate development",
      "chunk_summary": "Serotonin plays diverse roles in vertebrate development, including bone development, craniofacial morphogenesis, and left-right patterning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Although serotonin is well established as a player in vertebrate embryonic development, the developmental functions of other neurotransmitter families are yet to be characterized. Information on involvement of neurotransmitters in pattern formation would not only identify novel components of embryogenesis, but also give important insight into potential new endpoints for teratogenic (embryotoxic) effects of widespread pharmaceuticals. To begin to identify possible patterning roles for other neurotransmitter families, this study took advantage of compounds developed for neuropharmacological research, and an exploratory drug screen was conducted in the Xenopus laevis embryo, a popular vertebrate model for the study of well-conserved developmental mechanisms, as well as for studies of developmental toxicology. This preliminary screen represents the first tier of an inverse drug screen, in which drugs are tested in a hierarchical manner according to target specificity, to rapidly bypass large families with no apparent roles and progressively home in on targets with interesting functions.",
      "section": "Introduction",
      "topic": "Rationale for drug screen",
      "chunk_summary": "This study uses a pharmacological screen in Xenopus laevis embryos to investigate the developmental roles of other neurotransmitter families and potential teratogenic effects of pharmaceuticals.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Here, representative pharmacological loss- and gain-of-function experiments were presented using reagents targeting the glutamatergic, adrenergic and dopaminergic systems indiscriminately (ex. glutamate release inhibitor) or at the first level of receptor categorization (ex. adrenergic β-agonist). This study specifically focused on reagents whose effects revealed true patterning defects as opposed to simply generalized toxicity at the cellular level. The results of this screen demonstrate that neuroactive drugs, many of which are used clinically, are capable of inducing a wide variety of craniofacial, pigmentation, muscle and body axis abnormalities. These data implicate several interesting targets for further pharmacological testing, as well as for future molecular-genetic experiments and analysis of developmental marker expression.",
      "section": "Introduction",
      "topic": "Study design and overview of results",
      "chunk_summary": "The study's pharmacological screen identified neuroactive drugs that induce specific patterning defects in Xenopus embryos, suggesting new targets for further investigation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Xenopus laevis eggs were fertilized in vitro and embryos were cultured according to standard protocols in 0.1 x modified Mark's Ringer (MMR, pH 7.8) solution with 0.1% gentamycin. Embryos were housed at 14-22 °C and staged according to Nieuwkoop & Faber (1994). All experimental procedures involving use of laboratory animals were approved by the Institutional Animal Care and Use Committee (IACUC) and Division of Laboratory Animal Medicine at Tufts University, under protocol number (M2014-79).",
      "section": "Materials and methods",
      "topic": "Animal husbandry",
      "chunk_summary": "Xenopus laevis embryos were cultured and staged according to standard protocols, with ethical approval obtained for all procedures.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "All compounds were obtained from Tocris, with the exception of propranolol, which was obtained from Sigma. Drugs were dissolved in water or dimethylsulfoxide (DMSO; if water insoluble), aliquoted and stored at -20 °C until use. Embryos from three-four mothers were mixed and divided into control (MMR) or experimental (MMR + drug at concentrations of 500 пм-500 μμ) groups. Doses were established for each drug on an individual basis as follows. To establish an initial reference point for dosing, literature using the drug in either a cell culture, syaptosome Xenopus oocyte, or mammalian brain slice system was examined. The dose was then adjusted upwards or downwards from the value found in the literature, until a dose was reached at which embryos displayed developmental phenotypes but no increase in mortality or overt toxicity compared with controls. If drugs caused different phenotypes at different doses, all such results were discussed. All doses discussed were within about one order of magnitude of the doses found in the literature: riluzole, 4 μμ; norketamine, 39 μμ; BAY 36-7620, 10 µm; propranolol, 50 µm; nicergoline, 10 μm; cimaterol, 100 μм; and SCH 23390, 10 μμ. Vehicle (DMSO for water-insoluble compounds) levels never exceeded 0.5%, a level that permits completely normal embryonic development. Water was used as vehicle whenever possible. Drug exposures began at gastrulation (Stages 10-11) and continued until Stage 45. If this length of exposure was unable to produce any aberrant phenotypes, an earlier exposure starting at cleavage was tested (2/4 cell-Stage 45). At Stage 45, embryos were imaged on a Nikon (SMZ-1500) microscope with a combination of incident light and transmitted light that best highlighted anatomical features.",
      "section": "Materials and methods",
      "topic": "Pharmacological screen",
      "chunk_summary": "A pharmacological screen was conducted using various drugs at specific doses, with drug exposures starting at gastrulation or cleavage and embryos imaged at Stage 45.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "At Stage 45, embryos were morphologically scored for craniofacial defects (compressed head, microcephaly, indentation or projection of nose), abnormal eye development (cyclopia, missing eyes, ectopic retinal pigment epithelium (RPE), pigmented optic nerves, and undersized or misshapen eyes), miscoiling of the gut and hyperpigmentation, via a Zeiss SV6 microscope. Hyperpigmentation was an all-or-nothing phenotype characterized by large numbers of ectopic melanocytes being present around the eyes and in the peripheral regions of the head, as well as increased melanocyte arborization and coverage of the gut and tail. Occasional dead embryos and embryos lacking basic body organization (such as exogastrulates) were considered unscorable and excluded from analysis. The incidences of unscorable embryos did not differ between control and drug-treated groups. Counts of normal and abnormal embryos in control and drug-treated groups were plotted on a 2 x 2 contingency table and statistically analyzed with Fisher's Exact Test, using GRAPHPAD software.",
      "section": "Materials and methods",
      "topic": "Morphological scoring and statistical analysis",
      "chunk_summary": "Embryos were scored for various morphological defects, and statistical analysis was performed using Fisher's Exact Test.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "To further characterize the defects observed, five embryos per dose of each drug were randomly selected, and a number of parameters describing craniofacial shape, pigmentation, body size and body curvature were measured using IMAGEJ software. For visual descriptions of these parameters, please see Fig. S1. These parameters were then compared with those of five randomly-selected control embryos via the Mann-Whitney U-test. Basic dimensions of the head included maximum width, length from posterior-most point of the craniofacial skeleton to anterior-most point of the head, and distance between the eyes (as defined by the proximal-most extension of RPE toward the midline). Parameters of facial shape included length: width ratio, anterior projection of the nose (length of a line running perpendicularly from the imaginary line connecting the eye lenses to the anterior-most point of the face) and eye ratio (distance between eyes: max head width).",
      "section": "Materials and methods",
      "topic": "Morphological measurements",
      "chunk_summary": "Craniofacial shape, pigmentation, body size, and curvature were measured and compared between drug-treated and control embryos using IMAGEJ software and Mann-Whitney U-test.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "In addition to quantifying craniofacial size and shape, a variety of parameters were also used to describe overall body size and curvature. Two different types of body length measurement were taken: 'straight' length and 'string' length. Straight length is defined as the length of a straight line extending from the anterior-most point of the head to the tip of the tail. String length is the length of a line that extends from the anterior-most point of the head to the tip of the tail, passing through the muscular portion of the tail and bending with the animal. Curvature of the animal was quantified by calculating the ratio of straight length to string length. Perfectly straight animals have a string: straight ratio of 1, and lower ratio values signify increased curvature. For straight drug-treated animals and their respective controls, straight length was the primary metric used to describe overall body size. For curved animals and their respective controls, however, string length was a more accurate indicator of the animals' body size.",
      "section": "Materials and methods",
      "topic": "Body size and curvature measurements",
      "chunk_summary": "Body size and curvature were measured using 'straight' and 'string' length, with the ratio between them indicating curvature.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Finally, for drugs that caused hyperpigmentation, gut and tail melanocytes were quantified on digital images using the cell counter function of IMAGEJ. Animals in the images were anesthetized with tricaine (MS-222), which contracts pigment granules and allows discrete pigmented cells to be counted unambiguously. Areas in which melanocytes were counted were defined using a standard-size area in Adobe Photoshop. In the gut, melanocytes were counted within a circle whose diameter was 350 pixels. In the tail, melanocytes were counted within a 350 x 200 pixel box extending posteriorly from the cloaca, whose bottom edge lined up with the ventral-most edge of the tail muscles.",
      "section": "Materials and methods",
      "topic": "Melanocyte quantification",
      "chunk_summary": "Gut and tail melanocytes were quantified in hyperpigmented embryos using IMAGEJ, with specific areas defined for counting.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Control and drug-exposed embryos were killed at Stage 45 with tricaine (MS-222) and fixed in MEMFA [100 мм 3-(N morpholino) propanesulfonic acid (pH 7.4), 2 тм ethylene-glycol tetraacetic acid, 1 мм MgSO4, 3.7% formaldehyde] for 2 h. Embryos were then washed 3 x in phosphate-buffered saline (PBS), permeabilized at room temperature in PBTr [PBS, 2 mg mL-¹ bovine serum albumin (BSA), 0.1% Triton X-100] for 30 min, and blocked for 1 h at room temperature with 10% goat serum in PBT (PBS, 2 mg mL-1 BSA, 0.1% Tween-20). Embryos were rocked overnight at 4 °C with 12/101 primary antibody (DHSB, 1: 100 dilution in blocking solution). Following primary exposure, embryos were washed 6 x in PBT (1 h per wash) and blocked for 1h with 10% goat serum in PBT. Embryos were then rocked overnight at 4 °C with AlexaFluor-555 (1: 500 dilution in blocking solution). Following secondary incubation, embryos were washed 6 x in PBT (1 h per wash) and imaged on a Nikon (SMZ-1500) microscope.",
      "section": "Materials and methods",
      "topic": "Immunohistochemistry",
      "chunk_summary": "Whole-mount immunohistochemistry was performed using 12/101 antibody to visualize muscle development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Alcian Blue staining was performed on embryos with phenotypes in which examination of craniofacial cartilages would be informative for characterizing their specific defects. Embryos were continuously exposed to drugs from gastrulation until Stage 45. They were then washed 3 x in MMR. Embryos were then grown in MMR and fed every other day with spirulina until they reached Stage 48 (except for riluzole and Bay 36-7620, which were analyzed at Stage 45 because of viability problems at later stages.). Tadpoles were then killed with an overdose of tricaine (MS-222) and fixed overnight in MEMFA. Tadpoles were then stained in Alcian Blue according to Pasqualetti et al. (2000) and imaged with a Nikon (SMZ-1500) microscope.",
      "section": "Materials and methods",
      "topic": "Alcian Blue staining",
      "chunk_summary": "Alcian Blue staining was used to visualize craniofacial cartilages in embryos with specific phenotypes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Riluzole treatment caused hyperpigmentation, edema, miscoiling of the gut and craniofacial defects. Riluzole is an anticonvulsive drug that increases y-aminobutyric acid (GABA)-ergic signaling by blocking its reuptake, and decreases glutamatergic signaling by inhibiting glutamate release. At all riluzole doses tested (exposed from gastrula to Stage 45), over 90% of embryos were hyperpigmented due to the presence of excess (including ectopic) abnormally arborized melanocytes darkening the gut, tail and peripheral regions of the head. The frequency of total developmental abnormalities in riluzole-treated embryos (n = 54, 61 and 58 for 5, 33 and 50 μμ, respectively) was significantly greater than in control (n = 55) embryos at all doses tested (P<0.01 for all doses). Although riluzole caused a high occurrence of defects regardless of dose, the frequencies of different sub-classes of defects changed according to the dose tested, with the exception of hyperpigmentation. In Xenopus, hyperpigmentation results from a neoplastic-like conversion of melanocytes, and in humans, can be a sign of systemic diseases resulting from the dysregulation of endocrine or cell-cell signaling pathways. Hyperpigmentation was not observed at all in controls. Quantification of gut and tail melanocytes revealed that embryos treated with 5 µm riluzole had significantly larger populations of melanocytes in these body areas than did controls (Table 1; P<0.02 for gut, P<0.03 for tail). It is not yet known whether the increased number of melanocytes in riluzole-treated tadpoles is due to conversion of additional cell types into the melanocyte lineage in ectopic locations, or overproliferation and migration of excess melanocytes away from their endogenous locations.",
      "section": "Results",
      "topic": "Riluzole effects",
      "chunk_summary": "Riluzole treatment caused hyperpigmentation, edema, miscoiling of the gut, and craniofacial defects in Xenopus embryos, with varying frequencies depending on the dose.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_476793.pdf",
      "original_filename": "pdf_20250803_124125_476793_extracted_text.txt",
      "authors": "Unknown",
      "year": "2025",
      "journal": "Unknown",
      "doi": "Unknown"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T09:31:43.715063"
}