{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_592207_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_592207.pdf",
    "file_size": 35887,
    "authors": [
      "Taining Zhang",
      "Adam Goldstein",
      "Michael Levin"
    ],
    "journal": "Adaptive Behavior",
    "doi": "10.31219/osf.io/e5d4u",
    "year": "2025",
    "title": "Classical Sorting Algorithms as a Model of Morphogenesis: self-sorting arrays reveal unexpected competencies in a minimal model of basal intelligence",
    "confidence_score": null,
    "document_type": "posted-content",
    "abstract": "<p>The Diverse Intelligence research seeks to understand commonalities in behavioral competencies across a wide range of implementations. Especially interesting are simple systems that provide unexpected examples of memory, decision-making, or problem-solving in substrates that at first glance do not appear to be complex enough to implement such capabilities. We seek to develop tools to determine minimal requirements for such capabilities, and to learn to recognize and predict basal forms of intelligence in unconventional substrates. Here, we apply novel analyses to the behavior of classical sorting algorithms - short pieces of code studied for many decades. To study these sorting algorithms as a model of biological morphogenesis and its competencies, we break two formerly-ubiquitous assumptions: top-down control (instead, each element within an array of numbers can exert minimal agency and implement sorting policies from the bottom up), and fully reliable hardware (instead, allowing elements to be “damaged” and fail to execute the algorithm). We quantitatively characterize sorting activity as traversal of a problem space, showing that arrays of autonomous elements sort themselves more reliably and robustly than traditional implementations in the presence of errors. Moreover, we find the ability to temporarily reduce progress in order to navigate around a defect, and unexpected clustering behavior among elements in chimeric arrays consisting of two different algorithms. The discovery of emergent problem-solving capacities in simple, familiar algorithms contributes a new perspective showing how basal forms of intelligence can emerge in simple systems without being explicitly encoded in their underlying mechanics.</p>",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "The Diverse Intelligence research aims to understand commonalities in behavioral competencies across various implementations, focusing on simple systems exhibiting unexpected memory, decision-making, or problem-solving capabilities in seemingly simple substrates. The research seeks to develop tools to determine minimal requirements for such capabilities and to recognize basal forms of intelligence in unconventional substrates. This study applies novel analyses to classical sorting algorithms, breaking the assumptions of top-down control and fully reliable hardware. Instead, each element within an array can exert minimal agency and implement sorting policies from the bottom up, with the possibility of \"damage\" and failure to execute the algorithm. The study quantitatively characterizes sorting activity as traversal of a problem space, showing that arrays of autonomous elements sort themselves more reliably and robustly than traditional implementations in the presence of errors.  Furthermore, the study finds the ability to temporarily reduce progress to navigate around defects and unexpected clustering behavior in chimeric arrays consisting of two different algorithms. The discovery of emergent problem-solving capacities in simple algorithms provides a new perspective on how basal forms of intelligence can emerge in simple systems without explicit encoding.",
      "section": "Abstract",
      "topic": "Decentralized intelligence",
      "chunk_summary": "Analysis of decentralized sorting algorithms reveals emergent problem-solving capabilities and robustness to errors, suggesting basal intelligence can arise in simple systems without explicit encoding.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Evolutionary and developmental biology suggest that cognitive capabilities like memory and goal-directed activity originate from proto-cognitive functions that predate complex brains. The gradual history of intermediate forms with varying competency levels challenges the view of intelligence as a binary property. Chimerizing biological and technological material further blurs the line between engineered and biological capabilities. Diverse Intelligence research seeks invariants across evolved, engineered, and hybrid systems to understand commonalities among agents and the origin and scaling of embodied minds. This understanding is crucial for recognizing, repairing, creating, communicating with, and ethically relating to a wide range of beings, from human cyborgs to synthetic life forms and AIs.",
      "section": "Introduction",
      "topic": "Diverse Intelligence",
      "chunk_summary": "Diverse Intelligence research investigates commonalities in cognitive capabilities across various systems, challenging the binary view of intelligence and aiming to understand the origin and scaling of embodied minds.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "\"Intelligence\" in this study refers to competency in navigating a problem space to achieve adaptive goals despite challenges. It focuses on problem-solving as an observable behavior, not on affect or playful exploration. This definition aligns with cybernetic approaches that seek frameworks to study degrees of intelligence empirically in unconventional forms. While humans easily recognize conventional intelligence, detecting unconventional intelligences operating in novel embodiments or at different spatio-temporal scales is challenging.  We lack a mature science to predict the goals or competency of unconventional systems, particularly in areas like physiological or anatomical morphospaces.",
      "section": "Introduction",
      "topic": "Definition of Intelligence",
      "chunk_summary": "This study defines \"intelligence\" as competency in problem-solving, focusing on observable behavior and aiming to study it in unconventional systems.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "While significant progress has been made in understanding emergent complexity from simple local rules, the emphasis has been on lower degrees of agency. Beyond simple emergent complexity lies second-order behaviors that form the basis of goals, preferences, and other phenomena scaling up to familiar cognitive systems. \"Goal\" here refers not to a high-order purpose but to a target state a system can reach despite challenges. Predicting and controlling the goals of collective systems, especially engineered ones, is crucial for human flourishing in areas like swarm robotics, AI, and bio-engineered tissues.",
      "section": "Introduction",
      "topic": "Emergent Complexity and Goals",
      "chunk_summary": "The study emphasizes the importance of understanding second-order behaviors and minimal \"goals\" in collective systems for predicting and controlling their behavior.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Diverse Intelligence research uses minimal models to understand how problem-solving capacities arise from component interactions. These models include synthetic droplets, molecular chemotaxis, biological pathway models, cells, and tissues. One such system is the collective behavior of cells during morphogenesis, including embryonic development, regeneration, and cancer suppression. These phenomena involve cells working collectively to achieve specific anatomical endpoints. This is not open-loop emergence but closed-loop control and error-minimization, with cells exhibiting problem-solving abilities in anatomical morphospace. Examples include tadpoles rearranging scrambled facial features and cells taking actions to reach target states despite perturbations. Morphogenesis is proposed as the behavior of a collective intelligence of cells, and understanding its problem-solving competencies is crucial for advances in regenerative medicine.",
      "section": "Introduction",
      "topic": "Morphogenesis as Collective Intelligence",
      "chunk_summary": "The study examines morphogenesis as a model of collective intelligence, where cells exhibit problem-solving abilities to achieve specific anatomical endpoints.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Existing work explores the complex behavioral responses of tissues, cells, and molecular pathways. However, these systems are complex, making it difficult to understand the necessary and sufficient dynamics for emergent competencies. Minimal models with transparent components and interactions are needed to gain insights into the lower bound of unexpected behavior and problem-solving competencies. This study focuses on toy models of collective decision-making to understand how novel capabilities can arise in simple systems, potentially relevant to cellular swarms.",
      "section": "Introduction",
      "topic": "Minimal Models for Collective Decision-Making",
      "chunk_summary": "The study uses minimal models to understand the necessary and sufficient dynamics for emergent competencies in collective decision-making.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "This study abstracts a key property of regulative morphogenesis: the ability to produce an anatomical structure with a precise order of components along an axis, such as the anterior-posterior axis in tadpoles or frogs.  This task, performed by cells rearranging organs even from abnormal initial configurations, is abstracted as a sorting algorithm. Traditional sorting algorithms are used as a minimal system to explore novel competencies in seemingly well-understood systems. The use of a linear array of objects determining the collective direction matches cells' ability to organize a primary developmental axis. To improve the model's fit with regulative development, two critical assumptions are broken: central control is replaced with a distributed algorithm executed by each cell with local knowledge, and the assumption of reliable hardware is replaced with an unreliable substrate where cells can be defective. The study investigates the ability of these algorithms to sort an array of integers.",
      "section": "Introduction",
      "topic": "Sorting Algorithms as a Model for Morphogenesis",
      "chunk_summary": "The study uses sorting algorithms as a minimal model for morphogenesis, breaking the assumptions of central control and reliable hardware to better reflect biological reality.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "The study's goals are: (1) to demonstrate that even simple, well-understood systems can have novel capabilities; (2) to gain insight into the dynamics of establishing a linear axis, relevant to developmental biology and synthetic bioengineering; (3) to understand how decentralized systems can solve morphogenetic control tasks; (4) to determine how such algorithms handle noise and unreliability; and (5) to identify new behaviors not explicitly encoded in the algorithm. The simplicity of sorting algorithms makes them ideal for this research, as they offer no place for hidden complexity. The study shows that even simple algorithms can handle perturbations to achieve goals and exhibit novel, unencoded behaviors.",
      "section": "Introduction",
      "topic": "Research Goals",
      "chunk_summary": "The study aims to identify novel capabilities, understand the dynamics of linear axis establishment, and explore how decentralized systems handle noise and unreliability using sorting algorithms as a model.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "The sorting evaluation system consists of two parts: sorting algorithm execution and sorting process evaluation. The sorting algorithm execution performs sorting on a given array. Each cell's status is described by Position, Value, and Algotype.  Initially, each cell has a unique Position, while Value and Algotype may be shared. During sorting, only Position changes. The execution subsystem uses a Probe to record each sorting step, storing the information as a .npy file. The sorting process evaluation analyzes the sorting across trials. Its input is configurable, including the algorithms, number of Frozen Cells, and evaluation types. It fetches files based on the specified inputs and performs the given evaluation.",
      "section": "Methods",
      "topic": "Sorting Evaluation System",
      "chunk_summary": "The sorting evaluation system comprises execution and evaluation components, tracking cell status (Position, Value, Algotype) and recording sorting steps for analysis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Traditional sorting algorithms use a top-down controller to move cells.  The baseline algorithms used were Bubble Sort, Insertion Sort, and Selection Sort.  Code examples for each are provided.",
      "section": "Methods",
      "topic": "Traditional Sorting Algorithms",
      "chunk_summary": "Traditional sorting algorithms (Bubble, Insertion, Selection) employ a top-down controller to manipulate cell positions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Cell-view sorting algorithms implement a distributed architecture where each cell is an agent implementing local policies.  Multi-thread programming is used, with cell threads representing cells and a main thread activating and monitoring them.  Cell threads are instances of the same sorting class (Algotype).  Random lock acquisition ensures random cell behavior.  Cell-view versions of Bubble Sort, Insertion Sort, and Selection Sort were designed, with code examples provided.  The main thread sets up the sorting process, activates cell threads, monitors the process, and stops threads once sorting is complete.  The Frozen Cell concept is introduced, with implementations for traditional and cell-view algorithms (Passive and Stuck Frozen Cells).",
      "section": "Methods",
      "topic": "Cell-View Sorting Algorithms",
      "chunk_summary": "Cell-view sorting algorithms utilize a distributed, multi-threaded approach where each cell acts autonomously based on its Algotype and local environment, incorporating the concept of Frozen Cells.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Evaluation metrics used to quantify algorithm performance include Total Sorting Steps (average and standard deviation), Monotonicity and Monotonicity Error, Sortedness Value, Sortedness Delayed Gratification, and Aggregation Value. Formulas for calculating each metric are provided.",
      "section": "Methods",
      "topic": "Evaluation Metrics",
      "chunk_summary": "Several metrics, including Total Sorting Steps, Monotonicity Error, Sortedness Value, Delayed Gratification, and Aggregation Value, are used to evaluate algorithm performance.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Standard statistical hypothesis methods (z-test) were applied to evaluate the significance of reported differences.",
      "section": "Methods",
      "topic": "Statistical Analysis",
      "chunk_summary": "Z-tests were used to assess the statistical significance of observed differences between algorithms.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "The study analyzed results from both cell-view and traditional sorting algorithms to determine the cell-view versions' functionality and compare efficiency, error tolerance, and Delayed Gratification. The morphological structure of the sorting process was also examined.",
      "section": "Results",
      "topic": "Overview of Results",
      "chunk_summary": "The study compared cell-view and traditional sorting algorithms across several metrics, including functionality, efficiency, error tolerance, and Delayed Gratification.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "The efficiency of the algorithms was compared using the total sorting steps needed for 100 elements over 100 independent experiments.  The average sorting steps indicated efficiency.  Cell-view Bubble and Insertion sorts showed similar efficiency to their traditional counterparts when considering only swaps.  However, cell-view Selection sort was less efficient.  When considering both comparisons and swaps, cell-view Bubble and Insertion sorts were more efficient, while cell-view Selection sort remained less efficient.",
      "section": "Results",
      "topic": "Efficiency Comparison",
      "chunk_summary": "Cell-view Bubble and Insertion sorts exhibited comparable or greater efficiency than traditional versions, while cell-view Selection sort was less efficient.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Error tolerance was compared using Frozen Cells.  Experiments with varying numbers of Frozen Cells were conducted, and the average final monotonicity errors were analyzed.  Cell-view algorithms showed less monotonicity error (higher error tolerance) than traditional versions.  Among cell-view algorithms, Bubble sort had the least error with passive Frozen Cells, while Selection sort had the highest.  With stuck Frozen Cells, Bubble sort had the highest error, and Selection sort had the lowest. Both cell-view and traditional algorithms demonstrated high error tolerance overall.",
      "section": "Results",
      "topic": "Error Tolerance",
      "chunk_summary": "Cell-view sorting algorithms generally exhibited higher error tolerance than traditional versions, with varying performance depending on the type of Frozen Cells.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "Delayed Gratification (DG) was compared between cell-view and traditional algorithms using the error tolerance experiment results. All algorithms showed DG capability. Cell-view Bubble sort exhibited more DG than the traditional version, Insertion sort showed similar DG, and Selection sort showed less. To confirm DG as a problem-solving strategy, the amount of DG was compared in the context of different numbers of Frozen Cells. Bubble and Insertion sorts showed increasing DG with more Frozen Cells, indicating context-sensitive use of backtracking. Selection sort did not show a clear trend.",
      "section": "Results",
      "topic": "Delayed Gratification",
      "chunk_summary": "Cell-view Bubble sort demonstrated more Delayed Gratification than its traditional counterpart, while Insertion sort performed similarly and Selection sort showed less, with Bubble and Insertion sorts exhibiting context-sensitive DG.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    },
    {
      "text": "The concept of \"Algotype\" was introduced, representing the specific algorithm used by a cell, distinct from its value (genotype) or position (phenotype).  Mixed Algotype sorting experiments were conducted to analyze chimeric arrays.  Aggregation Value, the percentage of cells with adjacent neighbors of the same Algotype, was measured.  Results showed that cells of the same Algotype tended to cluster together, with varying degrees depending on the specific Algotypes combined.",
      "section": "Results",
      "topic": "Mixed Algotype Sorting",
      "chunk_summary": "Chimeric arrays with mixed Algotypes showed a tendency for cells of the same Algotype to cluster together, demonstrating emergent aggregation behavior.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_592207.pdf",
      "original_filename": "pdf_20250803_124125_592207_extracted_text.txt",
      "authors": "[\"Taining Zhang\", \"Adam Goldstein\", \"Michael Levin\"]",
      "year": "2025",
      "journal": "Adaptive Behavior",
      "doi": "10.1177/10597123241287467"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:05:24.801599",
  "enriched_at": "2025-08-11T14:36:07.538159",
  "enrichment_methods": [
    "crossref_title"
  ]
}