{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_234208_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_234208.pdf",
    "file_size": 34888,
    "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
    "journal": "Anim Cogn",
    "doi": "10.1007/s10071-016-0990-5",
    "year": "2017",
    "title": "Color and intensity discrimination in Xenopus laevis tadpoles",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Investigations into the physiology of Xenopus laevis have the potential to greatly accelerate biomedical research, especially concerning neural plasticity and sensory systems, but are limited by the lack of available information on behavioral learning in this species. Here, we attempt to lay the foundations for a behavioral assay in Xenopus that can be used in conjunction with biological manipulations. We tested cohorts of Xenopus tadpoles across four light-mediated active-avoidance experiments, using either wavelength or intensity as the salient discriminative cue. In the wavelength task, we determine a baseline learning rate and characterize retention of learning, identifying active extinction effects as far more potent than the passage of time in the loss of behavior. In the intensity task, we examine the effects of varying differences between the discriminative stimuli on acquisition and extinction and identify a critical range of intensity differences where learning changes. The results of our experiments demonstrate that Xenopus is a tractable model organism for cognitive research and can learn a variety of associative tasks in the laboratory settings. These data reveal new aspects of the Xenopus larval visual processing system and facilitate future research between cognitive methods and biological/chemical manipulations to study mechanisms of brain structure and function.",
      "section": "Abstract",
      "topic": "Xenopus Learning and Visual Processing",
      "chunk_summary": "This study establishes a behavioral assay for Xenopus tadpoles using light-mediated active-avoidance experiments, demonstrating their learning capabilities in wavelength and intensity discrimination tasks and highlighting the role of active extinction in learning decay.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Xenopus laevis is a popular model organism in many areas of biomedical research, with its development and physiology well characterized in the literature. However, despite the model's popularity, there remains a lack of information on this species' cognitive capacities, and this gap severely limits the use of Xenopus in biomedical and translational research. Especially in the areas of development and regeneration (two areas where Xenopus has made significant contributions), behavioral tests are necessary to examine cognitive consequences of sensory and neural manipulations, but no such methods have been established for this species.",
      "section": "Introduction",
      "topic": "Need for Xenopus Cognitive Research",
      "chunk_summary": "Despite its widespread use in biomedical research, Xenopus laevis lacks established methods for assessing cognitive capacities, limiting its application in developmental and regenerative studies.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Xenopus was previously considered intractable to learning in the laboratory setting, and the research community had largely abandoned attempts to train both tadpoles and frogs due to a number of documented difficulties. Studies have characterized basic behaviors including mating, swimming, and feeding. Additionally, its sensory systems are highly studied, especially with regard to vision, with past experiments using spectrophotometry and electroretinography to determine how the Xenopus eye responds to specific wavelengths. However, few investigations examined how visual information directs behavior, and therefore, the literature is incomplete in characterizing Xenopus vision.",
      "section": "Methods",
      "topic": "Prior Xenopus Behavioral Research",
      "chunk_summary": "Previous research on Xenopus behavior has focused on basic actions and sensory responses, but there is limited understanding of how visual information influences behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Our laboratory has recently developed a method for training Xenopus tadpoles in an associative light learning assay. Using an automated system, we have shown that with the correct stimuli Xenopus can learn an active-avoidance task that requires the discrimination of two different light wavelengths. Additionally, a follow-up study, where blinded Xenopus tadpoles learned the same task using transplanted eyes grafted onto the body during embryonic stages, highlighted the importance of establishing more complex behavioral assays in Xenopus for conjunctive use with biological manipulations. Here, we have more fully characterized learning and memory extinction in the wavelength discrimination task, extended our behavioral method to include intensity discrimination, and started an exploration into the developmental underpinnings of learning. These findings contribute to the repertoire of a behavioral assay in Xenopus laevis that can be integrated into a number of other fields to advance biomedical research to new heights.",
      "section": "Methods",
      "topic": "Current Study Overview",
      "chunk_summary": "This study expands on previous work by characterizing learning and extinction in wavelength discrimination, introducing intensity discrimination, and exploring developmental aspects of learning in Xenopus tadpoles.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "A total of 310 Xenopus laevis tadpoles were used across the four experiments described below. No tadpoles were used in more than one experiment. Xenopus embryos were maintained according to standard procedures in 0.1× Marc's Modified Ringer (MMR), pH 7.80, and the embryonic stages were determined using standard guidelines. Throughout development and testing, individuals were housed at 16 °C under a 12:12-h light/dark cycle. Animals were reared in 100 × 25 mm Petri dishes, with a maximum of 30 individuals per dish. Beginning at stage 46, tadpoles were fed once per day with Sera micron diet at the beginning of the light cycle by vortexing 0.025 g of food into 10 ml of 0.1× MMR. Previous data indicated that hunger interferes with learning in Xenopus, so all testing sessions began shortly after feeding and additional food was provided in the behavioral testing chambers. Tadpoles were tested no more than two times and were then euthanized with a solution of 0.5% tricaine mesylate. All individuals in this experiment were tested at Nieuwkoop and Faber stage 48, except those in experiment 4, which were Nieuwkoop and Faber stage 47. The Institutional Animal Care and Use Committees (IACUC) and Tufts University Department of Laboratory Animal Medicine (DLAM) approved all procedures involving animal experimentation under protocol M2014-70.",
      "section": "Methods",
      "topic": "Animal Husbandry",
      "chunk_summary": "This section details the husbandry procedures for the 310 Xenopus laevis tadpoles used in the study, including housing, feeding, and ethical approvals.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "A previously documented custom-made automated training apparatus was utilized for all behavioral testing. The device consists of 12 independent and isolated chambers, with each containing a disposable Petri dish to house one subject at a time, an overhead light source to present stimuli, a machine vision (i.e., tracking) camera (Insight-Micro 1400, Cognex Corporation, Natick, MA, USA) to record positional data, and an electrode plate to administer punishment. Custom software controls each of these components and allows them interact with one another.",
      "section": "Methods",
      "topic": "Behavioral Apparatus",
      "chunk_summary": "A custom-built automated training apparatus with 12 independent chambers was used for behavioral testing, incorporating light stimuli, tracking cameras, and electrodes for punishment.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Light inside each chamber is provided by red and blue LEDs housed above the Petri dish (Osram Opto Semiconductors, Sunnyvale, CA, USA; blue LED, 470 nm, part no. LBW5SM; red LED, 635 nm, part no. LRG6SP). The lights are divided into four quadrants, with one red LED and one blue LED in each, and the apparatus's software can vary each light's state independently, regardless of quadrant or chamber. Opaque dividers between each quadrant prevent different stimuli from bleeding into one other. Xenopus eyes have been shown to contain at least three cone classes, and the apparatus' LEDs overlap with Xenopus' red and blue spectral sensitivity. The intensities of the LEDs range between off and maximum in 15 even steps, but only the first 10 steps were utilized in this experiment. Lumen values for each intensity step were measured using an LX1010B light meter positioned 2 cm from the center of the illumination control module.",
      "section": "Methods",
      "topic": "Light Stimuli",
      "chunk_summary": "Red and blue LEDs provided light stimuli in four quadrants within each chamber, with intensities adjustable via software and measured using a light meter.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Tracking cameras below each chamber record positional data continuously throughout a behavioral session. These data serve two purposes: (1) they are matched with the presence of the S+ or S- light stimuli to determine when a tadpole should receive a punishing current, and (2) they provide the metrics that measure performance in behavioral tests. The cameras identify and track subjects using a subtraction algorithm which requires constant background light to function properly, so red light must be displayed at all times, and any blue light presentations are overlaid.",
      "section": "Methods",
      "topic": "Tracking Cameras",
      "chunk_summary": "Tracking cameras recorded positional data to determine punishment timing and measure performance, requiring constant red background light with overlaid blue stimuli.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Punishment in behavioral sessions is provided by a set of six iridium oxide-coated titanium electrodes arranged circularly around the arena to deliver an AC current of 1.2 mA. Current is issued for a period of 100 ms, followed by 300 ms of shock inhibition to avoid an erratic swimming behavior that is sometimes observed with continuous current. These electric shock parameters were optimized in a previous study.",
      "section": "Methods",
      "topic": "Punishment Delivery",
      "chunk_summary": "Punishment was delivered via electrodes using a 1.2 mA AC current for 100 ms, followed by a 300 ms inhibition period to prevent erratic swimming.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "The apparatus' software ties each of these parameters together, allowing for precise behavioral training: light stimuli are presented to the subject, positional data are recorded by a tracking camera, and based on these data, AC current can be delivered based on specific behaviors. The software executes one experiment simultaneously in all 12 chambers, but responds to each subject's behavior independently, allowing the apparatus to test up to 12 subjects at a time in any given session.",
      "section": "Methods",
      "topic": "Software Integration",
      "chunk_summary": "The apparatus software integrates light stimuli, tracking data, and punishment delivery, allowing for simultaneous yet independent testing of up to 12 subjects.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "A basic light-mediated avoidance paradigm was created to test discrimination of different light wavelengths. Red light (635 nm, 49 lm) was designated as the S– (punishment condition) and blue light (470 nm, 422 lm) was designated as the S+ (safe condition). Each session began with a 30-min innate color preference test to determine whether subjects had a prior bias for either stimulus. During this test, the dish was illuminated half blue and half red, and no punishment was administered. The position of the lights was inverted (180° rotation) after 15 min to control for tadpoles that showed no movement.",
      "section": "Methods",
      "topic": "Experiment 1: Wavelength Discrimination Setup",
      "chunk_summary": "Experiment 1 tested wavelength discrimination using red (S-) and blue (S+) light, starting with a 30-min innate color preference test.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Next, subjects entered the acquisition phase. This phase was arranged in blocks, each consisting of a training trial, a rest trial, and a probe trial. In training trials, the dish was illuminated half S+ (blue) and half S– (red). When tadpoles occupied the S– half of the dish, current was delivered as punishment to train subjects to avoid this stimulus. These trials lasted 20 min, and the position of the lights was inverted every 5 min. Next, in rest trials, the entire dish was illuminated with the S+ for 90 min, and no shocks were delivered. Finally, in probe trials, the dish was lit half S+ and half S–, but no current was delivered. These trials lasted 5 min, and the position of the lights was always opposite the final position in the previous training trial (before the rest period) to prevent false detection of avoidance for tadpoles that did not move during the rest period. All tadpoles received six of these acquisition blocks consecutively.",
      "section": "Methods",
      "topic": "Experiment 1: Acquisition Phase",
      "chunk_summary": "The acquisition phase involved training trials with punishment for S- (red) occupancy, rest trials with S+ (blue), and probe trials without punishment to assess learning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Immediately following acquisition, tadpoles entered the extinction phase to test for duration of memory. This phase was also arranged in blocks, with each block consisting of two rest trials and two extinction trials (order: rest–extinction-rest-extinction). In rest trials, the entire dish was illuminated with the S+ and no punishment was delivered. The length of the rest trials varied to test the effect of time on loss of acquisition: the tadpoles were divided into two groups, with one group receiving 90-min extinction rest trials (henceforth referred to as the 90-min group) and the other receiving 180-min extinction rest trials (henceforth referred to as the 180-min group). In extinction trials, the dish was illuminated half S+ and half S-, and no punishment was administered. The color orientation in extinction trials was always opposite to the final presentation in the previous extinction trial (or, in the case of the first extinction trial, the previous probe trial) to control for tadpoles that did not move during rest trials. These trials lasted 5 min. Each extinction block was organized with 2 pairs of rest and extinction trials to include both inversions of the light positions in the extinction trials. Each individual received 13 blocks of extinction testing, and each block consisted of two extinction probes, so the tadpoles in this experiment received 26 total extinction probes per session.",
      "section": "Methods",
      "topic": "Experiment 1: Extinction Phase",
      "chunk_summary": "The extinction phase tested memory duration with varying rest periods (90 or 180 min) between extinction trials without punishment, analyzing the impact of time and repeated S- exposure on learning decay.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "To determine how well tadpoles can distinguish between two intensities of the same wavelength, rather than to separate wavelengths, individuals were trained in the paradigm above using a combination of two blue intensity values. The intensity of the blue S+ was set to 542 lm, and the blue S– stimuli was one of six lower intensities ranging from 60 to 363 lm in increasing increments of approximately 60 lm. Red light is required in the device for image processing; therefore, red light was present at all times in this experiment at 49 lm, and all blue stimuli were overlaid. The net intensity of each stimulus in this experiment was equal to the intensity of the overlaid blue light plus 49 lm. Each session tested one of the six S- stimuli against the fixed S+. Behavioral sessions proceed similar to those in experiment 1, consisting of an innate preference test, an acquisition phase, and an extinction phase. The innate preference test and acquisition phase were identical to those in experiment 1, with the exception of the stimuli, which now consisted of two blue lights of differing intensity instead of two lights with different wavelengths. In extinction, all tadpoles were given three blocks of testing and received 90-min rest periods.",
      "section": "Methods",
      "topic": "Experiment 2: Intensity Discrimination",
      "chunk_summary": "Experiment 2 investigated intensity discrimination using varying intensities of blue light (S-) against a fixed blue S+, with a constant red background light for image processing, following a similar procedure to Experiment 1.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "An additional discrimination test was developed in which the red (S-) and blue (S+) light were set to similar intensities to determine whether tadpoles could differentiate between the two wavelengths in the absence of brightness differences. Background red light was presented at 140 lm, and blue light was overlaid on half of the dish at 70 lm (net blue intensity = 210 lm, percent difference over red = 50%). Behavioral sessions consisted of an innate preference test and an acquisition phase, and all methods for these phases were identical to those in experiment 1.",
      "section": "Methods",
      "topic": "Experiment 3: Wavelength with Minimal Intensity Variation",
      "chunk_summary": "Experiment 3 tested wavelength discrimination with minimized intensity differences between red (S-) and blue (S+) light to isolate the effect of wavelength on learning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Tadpoles in experiment 1 were tested during stage 48; this experiment examined acquisition of the wavelength discrimination in tadpoles at stage 47. Behavioral sessions consisted of an innate preference test and an acquisition phase. All behavioral methods in this experiment were identical to those in experiment 1, except that no food was present in the device at the time of testing (as these tadpoles were too young to eat, and unconsumed food created errors in the tracking software).",
      "section": "Methods",
      "topic": "Experiment 4: Wavelength Discrimination in Younger Tadpoles",
      "chunk_summary": "Experiment 4 investigated wavelength discrimination in younger (stage 47) tadpoles, following the same procedure as Experiment 1 but without food present during testing.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "All positional data during behavioral trials were written to a log file, which was parsed and analyzed over 5-min time blocks. Performance in the avoidance task was quantified by measuring the percent of time a subject spent in the S– region during probe and extinction trials. In innate tests, a tadpole was considered to have an innate color preference if its time spent in the S- region was >70 % or <30 %. These individuals were excluded from further analyses, as a strong innate preference for one color or the other would bias the proceeding learning results. In extinction tests, tadpoles were considered to have lost acquisition learning when their time spent in S- regions was greater than or equal to 50%, or chance performance. Statistical tests were performed in R version 3.2.3 (The R Foundation for Statistical Computing) and GraphPad Prism version 6.05 (GraphPad Software, LaJolla, CA, USA). Acquisition was measured using one-tailed paired-sample t-tests comparing performance in the innate test (pre-training) to performance in the last three acquisition probes (post-training). Averaging the final three probes as a measure of acquisition reduced variability compared to examining only the final probe. In extinction analysis, a log-rank test for trend (2) determined significant hierarchies among the different extinction rates.",
      "section": "Methods",
      "topic": "Data Analysis and Statistics",
      "chunk_summary": "Positional data were analyzed to quantify avoidance performance, with tadpoles showing strong innate color preferences excluded. Statistical analysis involved t-tests for acquisition and log-rank tests for extinction rates.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "To assess both the acquisition and extinction of learning in Xenopus tadpoles, a custom automated training apparatus was utilized to train tadpoles in a visual avoidance task. Subjects were divided into two groups; the initial training was identical for all animals, but during the extinction phase one group was given a 90-min rest in between extinction probes, and the other 180 min. In the acquisition phase of this experiment, both groups of tadpoles demonstrated significant improvement in avoidance performance when trained to avoid red light (S-) by pairing the wavelength with 1.2 mA current [90 min: t(24) = 3.66, p<0.001; 180 min: t(24) = 3.84, p<0.001]. Additionally, these results confirmed that tadpoles of both groups could learn to associate a wavelength of light with punishment and allowed further comparisons of extinction rates.",
      "section": "Results",
      "topic": "Experiment 1: Wavelength Discrimination Learning",
      "chunk_summary": "Both 90-min and 180-min rest groups showed significant improvement in avoiding red light (S-) during acquisition, confirming their ability to associate wavelength with punishment.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Extinction effects were modeled as a survival curve: a tadpole was considered to have lost learning of the trained avoidance behavior when blue light (S+) preference crossed the extinction threshold of 50%. By aggregating extinction performance across tadpoles, a decay function was built representing the loss of learning in each experimental group. In this analysis, the dependent variable was the percent of tadpoles retaining red light (S-) avoidance behavior at a given time point. Comparison of extinction performance over time elapsed in the 90- versus 180-min groups revealed a significant difference in learning decay [Mantel–Cox log-rank test, x²(1) = 4.945, p= 0.026]. This initially suggested that tadpoles retained color learning for a longer time when given 180-min rests compared to 90-min rests between extinction probes; however, it was also possible that the duration of rests was not responsible for the loss of learning, and it was instead an effect of extinction [repeated trials presenting the red (S-) wavelength without punishment] that was driving down performance. If this were the case, similar extinction patterns between the two groups would be observed when analyzing the data over probes elapsed instead of time elapsed because this hypothesis proposes that loss of learning is a function of extinction probes and has little relationship to time. To test this, the 90- and 180-min groups were compared over number of probes elapsed, and no significant differences were observed [Mantel–Cox log-rank test, x²(1) = 0.0356, p> 0.05]. These results reveal that Xenopus learning decay is being driven primarily by extinction effects from neutral probes and not memory degradation over time. Overall, the results indicate that Xenopus tadpoles can learn to discriminate between red and blue light reliably, and loss of this learning is driven most readily by active extinction through repeated presentation of red light in the absence of punishment. In addition, given reports which describe difficulty in training Xenopus tadpoles, the current visual assay is novel in that it results in both strong learning and memory, in an avoidance task.",
      "section": "Results",
      "topic": "Experiment 1: Extinction and Memory",
      "chunk_summary": "Analysis of extinction rates revealed that repeated exposure to S- (red light) without punishment, rather than time elapsed, is the primary driver of learning decay in Xenopus tadpoles.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "While the first experiment tested Xenopus tadpoles in a wavelength-based task, it is possible that individuals were using intensity differences between the two colors to make decisions rather than the wavelengths themselves. To specifically examine Xenopus tadpole's intensity discrimination ability, individuals were tested in a separate task pairing varying intensities of the same wavelength. In this assay, half of the dish was always illuminated with 542 lm blue light (S+), and the other half of the dish was illuminated with S– blue light with relative differences of 442, 248, 156, 104, 68.4, or 43.4% compared to the S+, to determine whether cohorts of tadpoles could distinguish between the two intensities as they became more similar. Results from intensity discrimination trials reveal that learning rates are significant at ratio differences of 248% or greater, corresponding to 442 and 248% S– conditions [t(15) = 3.81, p<0.001 and t(18) = 4.61, p<0.001, respectively], but degrade to non-significant levels at intensity differences less than 248% [156%: t(15) = 1.55, p>0.05; 104%: t(16) = −0.52, p>0.05; 68.4%: t(13) = 0.34, p>0.05; and 43.4%: t(18) = 1.24, p>0.05]. These results indicate a threshold value of intensity, below which tadpoles have difficulty distinguishing in an associative learning assay.",
      "section": "Results",
      "topic": "Experiment 2: Intensity Discrimination Learning",
      "chunk_summary": "Tadpoles showed significant learning in intensity discrimination tasks with intensity differences of 248% or greater, but learning decreased as intensity differences became smaller.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "To determine whether extinction rates in the intensity trial were similar to the wavelength test in experiment 1, extinction was again modeled as a survival curve and analyzed over additional probes in the absence of punishment. As no differences were noted between the 90- and 180-min rest periods in the results of experiment 1, 90-min rest periods were used here. Results indicate that retention is the strongest among the intensities with the greatest differences, as a log-rank test for trend showed the order (displayed left-right in Fig. 4a) to be significant [χ²(1) = 19.77, p<0.001]. Overall, these results indicate that Xenopus tadpoles are able to differentiate between different intensities of the same wavelength of light, but discrimination weakens as the intensities become more similar. Similarly, the weakness of learning at similar intensities is paired with weaker extinction when tadpoles are subjected to repeated probes in the absence of punishment.",
      "section": "Results",
      "topic": "Experiment 2: Intensity Discrimination Extinction",
      "chunk_summary": "Extinction rates in the intensity discrimination task were similar to the wavelength task, with stronger retention observed for larger intensity differences and weaker extinction for smaller differences.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Given the results of experiment 2, it is possible that the tadpoles in experiment 1 were choosing between the red (S–) and blue (S+) light not by wavelength, but rather by the large intensity differences between the two (as the blue light in our assay was 420 lm and the red light was 49 lm, a 760% difference). To rule out this possibility, cohorts of tadpoles were tested in an additional assay where the intensity of red and blue light were matched as closely as possible with a 50% intensity difference between the two (S– red: 140 lm, S+ blue: 210 lm, below the 248% S+/S– ratio threshold found in experiment 2). In this test, significant learning was observed [t(20) = 4.12, p<0.001] demonstrating that Xenopus tadpoles can correctly identify wavelengths of light in the absence of strong intensity differences.",
      "section": "Results",
      "topic": "Experiment 3: Wavelength Discrimination with Matched Intensities",
      "chunk_summary": "Even with minimized intensity differences (50%), tadpoles demonstrated significant learning in wavelength discrimination, confirming their ability to distinguish wavelengths independent of intensity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "To date, all of the Xenopus learning assays described have used Nieuwkoop and Faber stage 48 individuals, as anecdotal evidence suggests that younger tadpoles have difficulty learning. This experiment examined acquisition of the wavelength discrimination in tadpoles at stage 47. Behavioral sessions consisted of an innate preference test and an acquisition phase. All behavioral methods in this experiment were identical to those in experiment 1, except that no food was present in the device at the time of testing (as these tadpoles were too young to eat, and unconsumed food created errors in the tracking software).",
      "section": "Results",
      "topic": "Experiment 4: Learning in Younger Tadpoles",
      "chunk_summary": "This experiment investigated wavelength discrimination in stage 47 tadpoles, using the same methods as Experiment 1 but without food, to explore developmental aspects of learning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Our results in the wavelength tasks (experiments 1 and 3) are consistent with the findings of Blackiston and Levin (2012, 2013) that Xenopus tadpoles can learn a discriminative task mediated by different wavelengths, specifically 470-nm blue light and 635-nm red light. In addition, by matching the brightness levels between the two training colors, we have determined that individuals can correctly distinguish between wavelengths even in the absence of intensity differences. The development of a replicable behavioral method here is especially significant given that Xenopus was previously considered intractable to laboratory learning. The wavelengths used here are an ideal starting point for examining tadpole perception because they are at the far opposite ends of Xenopus' visible spectrum. Future experiments should evaluate more values on the visible spectrum to more completely characterize Xenopus vision.",
      "section": "Discussion",
      "topic": "Wavelength Discrimination and Learning",
      "chunk_summary": "The study confirms previous findings that Xenopus tadpoles can discriminate between wavelengths, even with matched intensities, highlighting the novelty of this replicable behavioral method.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Xenopus also showed robust memory in our task, as there were no differences in retention when individuals were given 90- or 180-min rest periods between tests. Our data clearly show that, within the scope of our selected values, time is not an influencing factor in loss of learning, and exposure to extinction trials primarily drives loss of learning. This is reasonable given that avoidance learning tends to be very resistant to degradation, and extinction is generally more powerful than the passage of time in decreasing discriminative responding. Rodent studies have investigated the impact of age on active-avoidance learning and retention and found impairments in younger rats at short-term retention intervals. Unfortunately, there have been no successful active-avoidance studies in grown Xenopus frogs, so there is no directly comparable data. It is possible (and reasonable to hypothesize, given the literature in other species) that time has different effects at larger values and in individuals of different ages, so future research should examine whether Xenopus tadpoles and frogs can retain learning for periods of time longer than 180 min.",
      "section": "Discussion",
      "topic": "Memory and Extinction",
      "chunk_summary": "Xenopus tadpoles demonstrated robust memory, with extinction trials, rather than time, being the primary factor in loss of learning, consistent with findings in other species.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "Our results in the intensity task are entirely novel findings in Xenopus and show that tadpoles can discriminate between a range of intensities of a 470-nm blue light wave. It was not surprising to find that learning generally decreased as the intensity difference decreased because the discriminative stimuli became more and more similar. Extinction of the intensity learning follows a strikingly similar pattern to acquisition, in that extinction rates become steeper as the training intensities become more similar. Overall, this learning retention evaluation shows that learning of smaller intensity differences is less robust, which, in conjunction with the acquisition results, allows us to conclude that decreasing intensity differences are an effective method for increasing overall task difficulty in Xenopus. A key observation in all of the phases of the intensity experiment is that learning significantly drops off at intensity differences of 248% or less. This seems to suggest a critical range of difference ratios where Xenopus' just noticeable difference of light intensity lies. Our current behavioral device has a limited range of intensity values for both blue and red light, and future studies would benefit from a more fine-scale examination of intensity discrimination in Xenopus.",
      "section": "Discussion",
      "topic": "Intensity Discrimination and Learning",
      "chunk_summary": "The study's novel findings on intensity discrimination in Xenopus show that learning decreases with smaller intensity differences, suggesting a critical range for just noticeable difference and highlighting the potential for manipulating task difficulty.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "The results from testing younger tadpoles provide an important building block for future experiments integrating developmental and cognitive manipulations. In multiple studies, we have shown that stage 48 tadpoles are able to learn in a variety of conditions, but in our most established learnable task (wavelength discrimination), stage 47 tadpoles were unable to learn to avoid red light. These findings show a drastic difference in learning ability across developmental stages and suggest that the ability to learn in a light-mediated assay develops over the course of only several days. This period also overlaps with a number of critical developmental events in the visual system of Xenopus tadpoles. Tectal neurons of the tadpole brain show significant changes in response properties between stages 46 and 48 (both field sharpness and temporal profiles), and avoidance behavior improves during this period as well; stage 46 tadpoles show weak performance, while stage 48/49 show strong performance. Further, the peripheral nuclear layer of the optic tectum begins to develop at stage 47 and is fully developed by stage 48. These findings suggest a number of developmental events likely drive the learning differences we report here between stage 47 and 48 tadpoles.",
      "section": "Discussion",
      "topic": "Developmental Stages and Learning",
      "chunk_summary": "The inability of stage 47 tadpoles to learn the wavelength discrimination task, compared to stage 48 tadpoles, highlights a rapid developmental shift in learning ability coinciding with key visual system developments.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "One limitation of our training method with stage 48 tadpoles, which perform well in many conditions here, is that we have been unable to achieve learning with counterbalanced punishment assignments (where blue light is the punishing S- condition and red is the S+). This is odd given our results clearly show that the tadpoles can discriminate between the wavelengths, but for some reason this discrimination is only apparent in one of the two possible punishment setups. We believe this may indicate a functional asymmetry in learning, where animals can learn in one set of conditions but not in the reverse set, even though they can discriminate between the stimuli. Similar results have been reported in insects and chicks, though the mechanism underlying these observations remains unclear.",
      "section": "Discussion",
      "topic": "Limitations and Asymmetry in Learning",
      "chunk_summary": "The inability to achieve learning with reversed punishment assignments (blue as S-) suggests a functional asymmetry in learning, despite tadpoles' ability to discriminate wavelengths, similar to observations in other species.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    },
    {
      "text": "This study was the first in-depth analysis of light-mediated associative learning in Xenopus, so a number of direct and significant conclusions can be drawn from the data concerning basic learning abilities: Xenopus tadpoles in developmental stage 48 are able to discriminate between both red and blue light and different intensities of blue light, and when acquisition is widely successful, the learning is quite robust to retention and extinction effects. Extinction is much more powerful in reducing discriminative responding than the passage of time, suggesting a highly developed learning system in this underdeveloped organism. However, this highly developed system likely develops at a specific period in developmental time-space, as tadpoles only a couple of days younger are unable to learn the same task.",
      "section": "Discussion",
      "topic": "Overall Conclusions",
      "chunk_summary": "This first in-depth analysis of light-mediated learning in Xenopus demonstrates stage 48 tadpoles' ability to discriminate wavelengths and intensities, with robust learning susceptible to extinction rather than time, and highlights a rapid developmental progression in learning capacity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_234208.pdf",
      "original_filename": "pdf_20250803_124126_234208_extracted_text.txt",
      "authors": "[\"Gabriel R. Rothman\", \"Douglas J. Blackiston\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "Anim Cogn",
      "doi": "10.1007/s10071-016-0990-5"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:26:13.315862",
  "enriched_at": "2025-08-11T14:49:56.865225",
  "enrichment_methods": [
    "crossref"
  ]
}