{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_778095_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_778095.pdf",
    "file_size": 34497,
    "authors": [
      "Caitlin Hicks",
      "Debra Sorocco",
      "Michael Levin"
    ],
    "journal": "Journal of Neurobiology",
    "doi": "10.1002/neu.20290",
    "year": "2006",
    "title": "Automated analysis of behavior: A computer‐controlled system for drug screening and the investigation of learning",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2006",
    "abstract": "<jats:title>Abstract</jats:title><jats:p>Efforts to understand cognition will be greatly facilitated by computerized systems that enable the automated analysis of animal behavior. A number of controversies in the invertebrate learning field have resulted from difficulties inherent in manual experiments. Driven by the necessity to overcome these problems during investigation of neural function in planarian flatworms and frog larvae, we designed and developed a prototype for an inexpensive, flexible system that enables automated control and analysis of behavior and learning. Applicable to a variety of small animals such as flatworms and zebrafish, this system allows automated analysis of innate behavior, as well as of learning and memory in a plethora of conditioning paradigms. We present here the schematics of a basic prototype, which overcomes experimenter effects and operator tedium, enabling a large number of animals to be analyzed with transparent on‐line access to primary data. A scaled‐up version of this technology represents an efficient methodology to screen pharmacological and genetic libraries for novel neuroactive reagents of basic and biomedical relevance. © 2006 Wiley Periodicals, Inc. J Neurobiol, 2006</jats:p>",
    "page_range": "977-990",
    "volume": "66",
    "issue": "9",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Efforts to understand cognition will be greatly facilitated by computerized systems that enable the automated analysis of animal behavior. A number of controversies in the invertebrate learning field have resulted from difficulties inherent in manual experiments. Driven by the necessity to overcome these problems during investigation of neural function in planarian flatworms and frog larvae, we designed and developed a prototype for an inexpensive, flexible system that enables automated control and analysis of behavior and learning. Applicable to a variety of small animals such as flatworms and zebrafish, this system allows automated analysis of innate behavior, as well as of learning and memory in a plethora of conditioning paradigms.",
      "section": "Abstract",
      "topic": "Automated behavior analysis",
      "chunk_summary": "An automated system for analyzing animal behavior and learning has been developed to overcome limitations of manual experiments and address controversies in invertebrate learning.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "We present here the schematics of a basic prototype, which overcomes experimenter effects and operator tedium, enabling a large number of animals to be analyzed with transparent on-line access to primary data. A scaled-up version of this technology represents an efficient methodology to screen pharmacological and genetic libraries for novel neuroactive reagents of basic and biomedical relevance.",
      "section": "Abstract",
      "topic": "Drug screening and learning investigation",
      "chunk_summary": "The presented prototype allows for efficient analysis of large animal groups and has potential for high-throughput screening of neuroactive reagents.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "The current challenge before modern cognitive science is to understand and integrate the processes that span from the molecular genetics establishing the structure of the nervous system to the information processing mechanisms that give rise to behavior and thought. The biomedical aspect of this program includes the search for useful neuromodulatory drugs and the understanding of the effects of various influences on normal cognition. Fundamental advances on these tasks require analysis of behavior in a variety of genetically and pharmacologically modified organisms. However, assessing behavior manually places significant limitations on experimental progress. These restrictions include the limited number of animals that may be analyzed by hand, the experimenter effects inherent in manual handling and observation by different individuals, and the difficulty in allowing other groups to analyze all of the primary data and potentially uncover trends missed by the experimenters.",
      "section": "Introduction",
      "topic": "Limitations of manual behavior analysis",
      "chunk_summary": "Manual analysis of behavior limits experimental progress in cognitive science due to small sample sizes, experimenter effects, and restricted data sharing.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Indeed, these problems have been instrumental in a number of controversies in neurobiology. For example, the lack of consensus on the learning ability of planarian flatworms, and in particular on the ability of memories to persist during the regeneration of the central nervous system, was due in large part to small sample sizes necessitated by the tedium of training worms by hand, the inevitable but often important small differences in handling by different experimenters (observer bias, oversensitization of subject animals from handling), inconsistencies in exact protocols and controls, and the difficulties in making all of the primary data available to other groups in the field (Thompson, 1955; Corning, 1961; Cornwell, 1961; Humphries, 1961; Best, 1963; Lee, 1963; Murphy, 1963; Roe, 1963; Stephen, 1963; Wells, 1963; Hartry et al., 1964; McConnell, 1965; Jacobson, 1966; Chapoutier, 1967; Ungar, 1974; Sarnat, 1985). Driven by our lab's desire to mechanistically investigate memory during regeneration and tissue remodeling (McConnell, 1959, 1965; Corning, 1961; Best, 1963; Sheiman and Tiras, 1996), and to understand behavioral function in Xenopus larvae and flatworms whose large-scale CNS structure was altered by molecular or epigenetic manipulations during embryogenesis and regeneration (Nogi and Levin, 2005), we pursued the development of an automated system for the analysis of behavior.",
      "section": "Introduction",
      "topic": "Planarian learning and regeneration",
      "chunk_summary": "Controversies surrounding planarian learning and memory regeneration are largely due to limitations of manual experimentation, motivating the development of an automated system.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "A useful paradigm for such analysis necessitates the following properties: (a) it must be applicable to powerful genetic model systems such as zebrafish, Xenopus, and flatworms (as current efforts for automation of behavioral analysis are almost exclusively focused on rodents); (b) it must allow analysis of multiple animals simultaneously for larger sample sizes; (c) it must be fully automated to exclude experimenter effects and subjective scoring, thus allowing consistent reproducibility of experimental paradigms across labs; (d) it must allow convenient usage of essential control conditions (e.g., yoked controls); and (e) it must record all primary data so that it can be easily made available on-line for analysis by reviewers and other labs.",
      "section": "Introduction",
      "topic": "Requirements for automated behavior analysis",
      "chunk_summary": "An ideal automated behavior analysis system should be applicable to diverse model organisms, enable simultaneous analysis of multiple animals, be fully automated, incorporate control conditions, and provide accessible primary data.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "A number of previous efforts have been made in attempts to automate behavioral experiments. While the majority focused on rodents (Torello et al., 1983; Sanberg et al., 1985; Hulsey and Martin, 1991; Madrid et al., 1995; Valentinuzzi et al., 1998; Boisvert and Sherry, 2000; Nielsen and Crnic, 2002), some have addressed smaller organisms (McConnell et al., 1960; Lee, 1963; Corning and Freed, 1968; Tiras and Aslanidi, 1981; Sadauskas and Shuranova Zh, 1982; Fernandez de Miguel et al., 1989). We sought to improve these systems using more modern computer and optical technology, to design a system ideally suited for molecularly tractable model systems, and to incorporate a crucial additional property: scalability.",
      "section": "Introduction",
      "topic": "Prior work on automated behavior analysis",
      "chunk_summary": "Previous attempts to automate behavioral experiments have primarily focused on rodents, while some have addressed smaller organisms; this work aims to improve existing systems using modern technology and incorporate scalability.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "A number of academic and commercial pharmaceutical projects have generated large genetic, proteomic, or small-molecule (drug) libraries that must be screened to identify compounds of interest to both biomedicine and basic biology (Bensing et al., 2001; Goodnow, 2001; Katayama et al., 2001; Koide et al., 2001; MacNeil et al., 2001; Nuttall, 2001; Cheung et al., 2002). Cell culture or simple organisms like yeast (Kirsch, 1993; Chen and Zhao, 2003) are obviously insufficient for identifying compounds that exert effects on complex multicellular systems or alter nervous system function in desired ways. Screens on multicellular model systems such as zebrafish (Zon and Peterson, 2005) have been successful in cell-biological assays, but the current necessity of manual analysis precludes effectiveness in high-throughput neurological screens. Thus, we pursued a system that could be scaled to provide an extremely powerful tool to biomedicine and neuropharmacology by allowing automated screens in small animal model systems for new compounds that, for example, increase learning and cognitive ability, expand memory, are sedatives or stimulants, counteract effects of neurotoxins, suppress pain, modulate the activity of other psychoactive compounds, or serve as antidotes to drug addiction.",
      "section": "Introduction",
      "topic": "High-throughput screening for neuroactive compounds",
      "chunk_summary": "The need for high-throughput screening of large libraries for neuroactive compounds necessitates an automated system capable of analyzing behavior in multicellular model systems.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Here, we present details on the design and construction of a prototype system for the automated analysis of behavior that meets all of the above criteria. We also provide sample proof-of-principle data obtained in a number of paradigms in planaria, to illustrate the operation and applications of this system to a model system that offers the advantage of a large database of existing behavioral data. Past controversies can be resolved using the proposed apparatus, and it offers significant promise for exciting molecular investigations of memory and regeneration in the same organism (Pietsch and Schneider, 1969, 1985, 1991).",
      "section": "Introduction",
      "topic": "Prototype system and planarian model",
      "chunk_summary": "This paper presents a prototype automated behavior analysis system and demonstrates its use in planaria, aiming to resolve past controversies and facilitate molecular investigations of memory and regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "The species of planaria used in this study was Dugesia tigrinia, obtained from Ward's Natural Science. Planaria colonies were stored in rectangular plastic containers measuring 22 × 22 × 7 cm and filled with Poland Springs natural spring water. The containers were stored in an incubator at 22.5°C, and kept on a strict cycle of light (9:00 am to 6:00 pm) and dark (6:00 pm to 9:00 am) in order to facilitate colony health and expansion. Three planaria colonies were kept at any one time. The colonies are fed once per week with organic beef liver. The liver was purchased biannually from Valley Livestock Marketing Co-op, liquefied in a blender, and then frozen in teaspoon-sized aliquots. Prior to feeding, an aliquot was thawed at room temperature and then poured into the containers of planaria. The colonies were allowed to feed for 3 h, after which the remaining liver pieces are removed via pipette and discarded, and the water was changed twice to remove any remaining debris. The water was changed once again 3 days following feeding in order to remove excess slime build-up and to replenish the oxygen supply. On any given week only two of the three planaria colonies were fed, because planaria that were starved for a week were better for training, as they were less likely to spontaneously fission. The health of the planaria colonies was maintained through careful observation; they were viewed regularly under a dissecting microscope to monitor for any lesions or discoloration. If a colony became sick, it was transferred to a new container filled with spring water that was treated with 1 mL/L gentomycin (Invitrogen). The treatment continued daily for 1-3 weeks, until the symptoms disappeared.",
      "section": "Materials and Methods",
      "topic": "Planaria husbandry",
      "chunk_summary": "Detailed procedures for maintaining and caring for planaria colonies, including feeding, water changes, and health monitoring, are described.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "For the duration of an experiment, individual worms were placed into a cell and not fed during the experiment. Each cell consisted of a plastic Petri dish; electrodes for the delivery of current were made of a 90/10% platinum/iridium alloy (a biologically compatible, inert material that gives off no electrolysis products) and were constructed flush with the edge of the dish (so as not to create any corners in which worms could get stuck). For the drug experiments, compounds made from stock solutions were dissolved in Poland Spring water and worms were kept in the compound throughout the experiment. The camera used was a PixeLink Pl-A661 (monochrome, 1.3 Megapixel resolution), with a Kowa HR F1.4/12 mm flatfield lens. The PC controlling the prototype device was a Dell Dimension 4600 with Windows 2000 Pro and a FireWire PCI card. The software controlling the device was written and run within Matlab v7.1 with image acquisition toolbox. The red LEDs ranged from 0-3.75 V; white LEDs ranged from 0.5-3.75 V (providing 7 Lux from the red LEDs and 315 Lux from the four white LEDs). The shocks ranged from 0-10.5 V DC; this range was chosen empirically based on shocks that result in a visible reaction in the worms (contraction and avoidance movements) but do not impair the health of the worms when applied repeatedly.",
      "section": "Materials and Methods",
      "topic": "Experimental setup and equipment",
      "chunk_summary": "This section details the experimental setup, including the cell design, electrode material, camera specifications, software, and the range of light and shock stimuli used.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "The basic concept of the device is a series of Skinner cells monitored by a digital camera. Each cell has one animal. The main point is that the environment in each cell is individually controlled by the software depending on the behavior of the animal within. The animals are shielded from external stimuli. A weak light out of the band of spectral sensitivity of the worms (far red) allows observation of animal position at all times. The current prototype (optimized for work with planaria) contains the ability to expose experimental animals to stimuli including one to four dish quadrants illuminated by bright light and a set of electrodes allowing electric shocks to be delivered to the water inside the cell. The mechanical design enables standard disposable plastic Petri dishes to be utilized inside each cell. The existing device is ideal for a plethora of experiments in any aqueous model species; modifications to adjust the device to a specific application are discussed below.",
      "section": "Results",
      "topic": "Device schematic",
      "chunk_summary": "The device consists of individual Skinner cells monitored by a camera, allowing for controlled environmental stimuli (light and electric shock) based on animal behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "A number of specific construction details are important. The shock must be kept at constant current; thus, if the overall chamber resistance changes with time due to mucus deposition, the strength of the shock will remain level throughout the training period. Each cell lid is covered with an opaque material to allow different lighting conditions among the cells. LEDs are used to provide light but no heat to the quadrants individually. A rectangular array of 3 × 4 such cells are located within the view of a digital camera, which represents the main input to the software. The output, sent as text strings over the computer's serial port, contains instructions controlling the state of a custom processing unit that exists as a separate printed circuit. This is a state machine that interprets the incoming control message and sets the lights, electric shock, and other parameters in each dish according to their respective bits (established by the software, depending on the particular behavioral paradigm being used).",
      "section": "Results",
      "topic": "Device construction details",
      "chunk_summary": "Important construction details include constant current shock delivery, opaque cell lids for individual lighting control, LED light sources, and a custom processing unit controlled by software.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "The basic algorithm, implemented in the Matlab software platform, consists of the following steps, performed in an iterative loop throughout the length of the experiment. An image is obtained of the animals in their dishes and parsed as follows to identify the centroid of each worm. Each animal's position and orientation is calculated by image-processing code containing the following transformations in order: background subtraction, morphological top-hat filtering using a diamond-structured element, conversion to binary (pixel intensity threshold of 0.9), binary area opening operation (removes small islands of white that are smaller than 10 pixels), dilation of remaining white pixels to connect any pixels in close proximity and to smooth out edges of white islands, majority elimination of remaining pixel spots (sets a pixel to 1 if five or more pixels in its 3-by-3 neighborhood are 1's; otherwise, it sets the pixel to 0). The software then makes a decision (based on the details of the experiment as defined by the user before the start of the run) for each animal, as to whether it is to be rewarded or punished (via a brief electric shock to the water and/or an appropriate change in light conditions), or to receive no action. The position of each animal along with the action taken is recorded as a time-stamped record in an Excel spreadsheet, and the image taken of the dish is saved as a frame in an MPEG movie file. This process continues until the experiment is terminated by the experimenter or a predefined condition is reached.",
      "section": "Results",
      "topic": "Software algorithm",
      "chunk_summary": "The software algorithm uses image processing to track animal position and orientation, and then determines reward/punishment based on user-defined experimental parameters, logging data in an Excel spreadsheet and MPEG movie file.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "A graphical user-interface to the software allows the user to define the experimental paradigm. This system can be used in two main modes: simple behavioral observation and analysis, and instrumental/classical conditioning paradigms. The former can be used to study actograms or assay light responses. The latter can be used to create a consistent environment where specific behaviors are encouraged. For example, the software might punish prolonged inactivity, location in a particular part of the dish, or more complicated relationships (sample tasks include: “whenever your quadrant is lit up, move to the next one to the left or be shocked\"; or, \"when the light comes on, you have 5 s to move to a spot within 5 mm from a wall\"; or, \"stay on a small agarose pad placed in the dish\"). The possibilities are practically unlimited. Controls are set up by having a given animal's cell receive random stimuli (or those linked to the behavior of a master animal in a yoked control). Sensitization controls are easily handled (by specifying regular intervals of either light, shock, or both stimuli), and innate preferences are controlled by training half of the animals on a task opposite to the others (to avoid light vs. darkness for example), or by prescreening using 12 h observation periods and assigning alternate tasks to train against the preference, or by eliminating animals not meeting the behavioral criteria of a given paradigm. The main concept is that having set up such an environment, the computer automatically keeps track of the behavior of each animal. At any point during the trial, the experimenter can observe the progress of the experiment: the data, stored in Microsoft Excel format, allows easy plots of performance versus time for each animal, variability among animals, time spent in light versus darkness, total distance traveled by each animal, activity level throughout the experiment, percentage of time present in any given area of the dish, and so forth. Also important are the QuickTime format movies of each dish, allowing time-lapse or real-time observation of exactly what each animal was doing at each point in the experiment. The frames of the movie are cross-referenced to the Excel processed data, so that any given period can be examined (and verified to ensure accurate data collection and interpretation by a given algorithm). The movie frames are also annotated with marks so that invisible events (such as electric shocks) are seen in the movie.",
      "section": "Results",
      "topic": "Experimental paradigms and controls",
      "chunk_summary": "The software allows for user-defined experimental paradigms, including simple observation and conditioning, with various controls for sensitization and innate preferences, and provides real-time data and video recording.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "This system provides a number of immediate advantages. First and foremost, this provides complete consistency among labs replicating experiments, and removes experimenter bias in scoring behaviors. As long as a set of starting parameters is published with the results, any group will be able to independently run the same experiment. Second, because the procedure is fully automated, no user involvement is needed during the experiment—no blind (or double-blind) protocols are required, and the experiment can go on for weeks, involving millions of observations and training iterations/reinforcement (resulting in a training level exponentially beyond what can realistically be accomplished by hand). The removal of operator tedium results not only in extremely robust data with significant sample sizes, but allows much stronger learning in a consistent environment than usually results from a small number of training trials that can be achieved manually in a given day. Moreover, because animals do not have to be handled during the experiment, this avoids sensitization to handling and confounding stimuli (animals may not like new environments and may act differently when they are moved from their \"home\" colony to a testing paradigm).",
      "section": "Results",
      "topic": "Advantages of automated system",
      "chunk_summary": "The automated system ensures consistency across labs, eliminates experimenter bias, enables long-term experiments with large datasets, and avoids sensitization to handling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Third, any interested independent observer can view the progress of the experiment; if allowed by access controls, this can be done in real-time over the web. This means that many different groups can analyze data, and potentially uncover trends and relationships unforeseen by the original experimenter. The extensive data logging also allows other scientists to analyze all of the primary data, increasing the likelihood that others will discover novel trends via data-mining the original dataset. This can be particularly crucial when a set of rare (e.g., mutant) animals is being studied that cannot easily be duplicated outside a given lab. It also has important implications for low-budget high-school or undergraduate educational institutions because hundreds of students could have access to behavioral data being generated by such a device in a primary research institution. Potential uses of this system are numerous. In its simplest mode, it can be used to provide detailed analyses of animals' innate behavior and light preferences. By focusing on actogram measurements and conducting experiments at longer time-scales, experiments on circadian cycles can be greatly facilitated (Brown and Park, 1964). In the training paradigm, properties of memory and learning can be studied. One of the key features of this system is that the paradigms can be made incentive-based, which in many systems can produce very robust learning because the animals have the opportunity to avoid punishment by noticing patterns in their environment. Once a robust memory is formed, pharmacological, surgical, or molecular-biological interventions can be performed, and the recall can be automatically tested, enabling powerful analyses of the mechanisms of memory storage.",
      "section": "Results",
      "topic": "Data sharing and potential uses",
      "chunk_summary": "The system allows for real-time data sharing and analysis by multiple groups, facilitating discovery of novel trends, and has potential uses in studying innate behavior, circadian cycles, learning, memory, and the effects of interventions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Our lab focuses on understanding biophysical control mechanisms during morphogenesis; one of the model systems we use is the free-living flatworm Planaria (P. Platylhelmenthes, C. Turbellaria), which offers the unique ability to study regeneration and memory in the same organism. We have chosen to illustrate the function of this behavioral analysis system with proof-of-principle data in the planaria model system for a number of reasons. Planaria exhibit much of the complexity of vertebrate systems: a well-differentiated nervous system, intestine, eyes, brain, three tissue layers, and bilateral symmetry (Bronsted, 1969; Sanchez Alvarado, 2004). Planaria possess a well-developed nervous system with true synaptic transmission and have what can be considered the first animal 'brain\" (Sarnat and Netsky, 1985). They have also developed sensory capabilities for the detection of light (Brown et al., 1968; Brown and Park, 1975) and other modalities (Brown and Park, 1964; Brown, 1966; Brown and Ogden, 1968; Fulgheri and Messeri, 1973; Brown and Chow, 1975; Mason, 1975; Miyamoto and Shimozawa, 1985). Planaria have been shown to exhibit learning and memory under classical conditioning paradigms as well as to perform more complex tasks requiring a surprising degree of intelligence (such as operant or instrumental conditioning); they also possess many of the neurotransmitters, receptors, and behaviors associated with higher cognition (McConnell et al., 1960; Jacobson, 1962; McConnell, 1965; Block and McConnell, 1967; Smith, 1985; Creti et al., 1992; Villar and Schaeffer, 1993; Eriksson and Panula, 1994; Sheiman and Tiras, 1996). They are an ideal organism for screening because they are small, and easy to raise and to subject to a multitude of reagents and manipulations. Moreover, evolutionarily, they are very similar to the ancestor of the bilateria clade, and have high relevance to human medicine and physiology both structurally and physiologically (Best and Morita, 1982; Sarnat and Netsky, 1985). Planaria offer an excellent combination of experimental tractability and sufficient complexity for asking a number of fascinating questions about basic functions of living systems (Eisenstein, 1997). Crucially, as a model system, planaria are quickly acquiring a powerful set of molecular biological reagents and techniques, enabling genetic and cell-biological investigations into their structure and function (Cebria et al., 2002; Sanchez Alvarado et al., 2002; Agata et al., 2003).",
      "section": "Results",
      "topic": "Planaria as a model system",
      "chunk_summary": "Planaria are chosen as a model system due to their complex nervous system, regenerative abilities, established behavioral data, and increasing availability of molecular tools.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "One of the most common protocols for demonstration of memory is to train an animal against its normal preference, because this can result in the greatest difference between controls and trained individuals. Therefore, to demonstrate a prescreening function as well as the use of this system for noninvasive behavioral observation and analysis, we began with a simple observe trial. A population of worms was monitored to ascertain the amount of time each animal spent in the light versus dark quadrants of a cell (Fig. 4). Interestingly, while a majority of the worms did indeed prefer darkness (consistent with the common wisdom about worm behavior; Walter, 1907; Reynierse, 1967), a significant percentage of our animals preferred light. This is important because if these individuals were used for a \"learn to stay in the light\" study, their native preference would reduce the difference between trained and untrained worms. Thus, this method allows the experimenter to rapidly select animals from a population for training; one might train the animals in the left-most photo-phobic bin for spending time in the light, while training the animals from the right-most photo-philic bin for spending time in the darkness.",
      "section": "Results",
      "topic": "Prescreening and light preference",
      "chunk_summary": "Prescreening for light preference revealed a significant portion of planaria prefer light, highlighting the importance of accounting for individual preferences in training paradigms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "The apparatus facilitates study of spatial relationships. It is easy to add agarose pads, mazes, miniature platforms, or other spatial cues for animals and reward spending time in a particular location within the dish. We chose the simple dichotomy provided by each worm's being horizontal, on the bottom surface of a dish, versus turned 90°, sitting on the vertical edge of a dish. We trained worms using a yoked control paradigm after prescreening for worms that, when left to their own devices, spent time on the dishes' walls. After 24 h of training (Fig. 5), where worms were punished with shock for being located on the edge, the worms were significantly more likely (p < 0.001) to spend time on the bottom of the dish—against their normal preference. Thus, the animals can sense their orientation and associate it with the punishment. In a similar paradigm, we explored the ability to learn visual cues. An even more profound level of learning could be obtained in worms (Fig. 6) prescreened for photo-avoidance and trained to spend time in the light; the trained (but not the yoked control) worms changed from 10% light exposure to almost 100% light exposure within 3 days of training (p < 6 × 10¯º). This learning paradigm can also be analyzed in terms of latency (time elapsed or number of trials before a series of correct responses); an example of such data is shown in Figure 7.",
      "section": "Results",
      "topic": "Spatial learning and visual cues",
      "chunk_summary": "Planaria demonstrated spatial learning by associating their orientation with punishment and visual learning by associating light with reward, showing significant changes in behavior after training.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Finally, we studied long-term retention (asking whether the memory formed during these experiments is retained for significant time periods after the training ends; Fig. 8). Our data demonstrate that almost perfect performance is retained after 7 days of rest following a 3 day training period. This result supports our contention that a consistent environment that automatically rewards and punishes various behaviors avails the experimenter of an extremely robust memory for subsequent experiments. The classical planarian memory experiments done by hand were very tedious (especially to obtain the large differences between trained and control worms) and memory recall was analyzed as “savings”—how fast a trained animal could relearn the task (Jacobson, 1962; McConnell, 1965). In this system, even after 7 days of rest in an environment where the target behavior was not reinforced, the worms remembered their task very well and did not require retraining. Moreover, the retention of the memory for 7 days is long enough for cut worms to regenerate, opening the possibility to study memory and brain regeneration in the same model system (McConnell et al., 1959).",
      "section": "Results",
      "topic": "Long-term memory retention",
      "chunk_summary": "Planaria exhibited long-term memory retention, retaining learned behavior for 7 days after training, suggesting a robust memory formation facilitated by the automated system.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "As a final example, we sought to illustrate the use of this device to assay the effects of psychiatric drugs on worm behavior. A number of previous studies demonstrated that neuromodulatory reagents used in mammalian systems also have the expected effects on planarian behavior (Algeri et al., 1983; Sarnat and Netsky, 1985; Kitamura et al., 2003; Raffa and Martley, 2005). We selected two compounds, p-chlorophenylalanine (PCPA) and reserpine—two modulators of serotonergic signaling that are known to have effects on activity levels (Garattini and Valzelli, 1958; Georgiev and Petkova, 1975; Hussey et al., 1983). Figure 9 illustrates a simple actogram analysis, where overall mobility of the worms was tracked (see Supplements 1-3 at http://server.drmichaellevin.org/worm_supplement.html for real-time movies of the worm behavior in each condition). While the data revealed significant variation among animals, the PCPA and reserpine, respectively, increased and decreased the locomotor activity level compared to controls. Thus, this system can be fruitfully used to analyze the effects of known and as-yet-uncharacterized compounds on behavior (as well as learning rate, retention, etc.).",
      "section": "Results",
      "topic": "Drug effects on behavior",
      "chunk_summary": "The system was used to assess the effects of PCPA and reserpine on planarian behavior, demonstrating its utility in analyzing drug-induced changes in locomotor activity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Using the planaria model, we performed a number of different studies designed to illustrate the use of the automated behavioral analysis system. The automated nature of the process made it easy to test different paradigms and parameters (strength of shock, light levels, timing of training and rest periods, etc.). Moreover, by designating some of the dishes as controls and assigning yoke relationships, it was easy to compare animals undergoing training at the same time (thus minimizing the effects of environmental, circadian, and other confounding factors). While these data demonstrate multiple uses of this system for investigating memory and behavior in planaria, we believe this same paradigm can be used, with minimal modifications, with a wide variety of experimental model systems. The experiments above surely raise many further questions about planarian ethology; there is much room for improvement and tantalizing directions for further studies of behavior and its genetic and epigenetic basis (the worms used in this study were wild-caught, but clonal isogenic animals can also be used to investigate the endogenous variability in cognitive function). Work currently in preparation will report primary data addressing the relationship between memory and regeneration in planaria and vertebrate model systems. Our goal here was not to derive conclusive answers about planarian learning, but rather to illustrate practical use of the system we have designed in the hopes that it will be utilized and extended by others. The planarian data demonstrate that this basic system provides automated analysis of behavior in real time, can be used to train and test animals in memory experiments, and allows the evaluation of the behavioral effects of neuroactive compounds.",
      "section": "Discussion",
      "topic": "Planarian studies and future directions",
      "chunk_summary": "The automated system facilitated various planarian behavior studies, and its adaptability to other model systems is highlighted, with future research focusing on memory and regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    },
    {
      "text": "Crucially, this system is ideally suited to screening applications. When scaled up, in addition to facilitating inquiry into basic mechanisms of animal learning, this system is usable for screens of compounds that alter behavior. In this paradigm, each cell would receive one of the library's compounds to be tested dissolved in the water. The software would then enable the search for reagents that increase activity (stimulants), decrease movement (paralytics or sedatives), alter normal behavior in other well-defined ways (e.g., render the animals more or less sensitive to environmental stimuli such as light or weak electric shock), increase learning rate, memory retention, or intelligence (ability to abstract more complex patterns from their environments), and so forth. Moreover, if each cell contains the same basic reagent, plus one element from a library, the system can be used to screen that library for compounds that augment or counteract the activity of that reagent. This can be used to search for new antitoxins, drugs that prevent or ameliorate addiction, or reagents that modulate the activity of other psychoactive compounds. In addition to screening drug libraries for drugs to modulate endogenous processes, use of this system in genetically tractable model systems (such as those amenable to RNAi-based inhibition) will allow screens to identify endogenous gene products with roles in important aspects of cognitive function and nervous system activity. The ability to identify compounds and genes involved in these processes could significantly contribute to biomedical efforts addressing brain disorders, security threats from neurotoxin exposure, and treatment of drug abuse.",
      "section": "Discussion",
      "topic": "Screening applications",
      "chunk_summary": "The system's scalability makes it ideal for screening compounds that alter behavior, including stimulants, sedatives, and those affecting learning and memory, as well as for identifying genes involved in cognitive function.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_778095.pdf",
      "original_filename": "pdf_20250803_124126_778095_extracted_text.txt",
      "authors": "[\"Caitlin Hicks\", \"Debra Sorocco\", \"Michael Levin\"]",
      "year": "2006",
      "journal": "Journal of Neurobiology",
      "doi": "10.1002/neu"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:18:11.000761",
  "enriched_at": "2025-08-11T14:36:25.750285",
  "enrichment_methods": [
    "crossref_title"
  ]
}