{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_114050_208524_extracted_text.txt",
    "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
    "pdf_filename": "pdf_20250803_114050_208524.pdf",
    "file_size": 29576,
    "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
    "journal": "Scientific Reports",
    "doi": "10.1038/srep18279",
    "year": "2015",
    "title": "Comparison of the depolarization response of human mesenchymal stem cells from different donors",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Bioelectric signaling is being explored as a regulator of cell processes, particularly in stem cells where it influences stemness, proliferation, differentiation, and migration. However, stem cell heterogeneity necessitates characterizing variability in response to biophysical manipulations to assess the universality of bioelectric modulation for stem cell control. This work evaluates human mesenchymal stem cells (hMSCs) from five donors for their response to membrane potential (Vmem) depolarization, comparing their osteogenic and adipogenic differentiation potential and maintenance of differentiated phenotypes. The study identifies consistent markers across donors, such as calcium deposition and gene expression of bone sialoprotein, lipoprotein lipase, and fatty acid binding protein 4, for assessing differentiation response to Vmem depolarization.  Due to observed variability, these assays are recommended for any new hMSC population undergoing bioelectric studies.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in stem cell differentiation",
      "chunk_summary": "This study investigates the impact of membrane potential depolarization on hMSC differentiation, highlighting the importance of accounting for donor variability and identifying reliable markers for assessing bioelectric modulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Human mesenchymal stem cells (hMSCs) are valuable for stem cell therapies and regenerative medicine due to their self-renewing and stromal properties. Extensive research characterizes hMSC response to various biophysical and biochemical stimuli, aiming to optimize cell functions like stemness, proliferation, differentiation, and migration. HMSCs show promise in tissue repair and regeneration across various tissues, along with immunomodulatory and anti-inflammatory properties. However, clinical trials indicate a need for better optimization of MSC-based therapies, partly due to donor-dependent heterogeneity. Understanding inter-donor variability in cell behavior is crucial for reliable therapeutic applications. Studies have revealed significant differences in hMSC properties like growth rate, gene expression, mineralization, and surface marker expression, influenced by factors like donor age and gender.  This inherent variability necessitates examining responses to experimental manipulations across multiple donors to understand the heterogeneity of observed responses.",
      "section": "Introduction",
      "topic": "hMSC heterogeneity and therapeutic applications",
      "chunk_summary": "hMSCs are promising for regenerative medicine, but donor-dependent heterogeneity necessitates understanding inter-donor variability in cell behavior and responses to experimental manipulations for optimizing therapeutic applications.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Bioelectric signaling plays a crucial role in various cell functions, including proliferation, migration, differentiation, wound healing, pattern formation, and tissue regeneration.  The role of intrinsic cell electrophysiology in non-excitable cells, including stem cells, is under active investigation. HMSCs express various ion currents and channels, but the consistency of their expression across different donors remains unexplored.  hMSC electrophysiology is important for regulating osteogenic (OS) and adipogenic (AD) differentiation.  Previous research indicates that hMSC resting membrane potential (Vmem) hyperpolarizes during OS and AD differentiation, and this hyperpolarization is essential for differentiation. Artificial depolarization suppresses differentiation, while hyperpolarization enhances OS differentiation.  Vmem also influences the maintenance of differentiated phenotypes in hMSCs. Controlling cell fate using electrophysiology would be a valuable tool, but systematic assessment of hMSC response heterogeneity to bioelectric signals is lacking, which is crucial for understanding the effectiveness of this strategy for primary cells with donor-to-donor variations. Understanding robustness and variability in bioelectric networks is essential for leveraging voltage-based pathways in regenerative medicine and synthetic bioengineering.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in hMSC differentiation",
      "chunk_summary": "Bioelectric signaling, particularly Vmem, plays a key role in hMSC differentiation, but further research is needed to understand the heterogeneity of hMSC responses to bioelectric signals across different donors.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "This study investigates the effects of Vmem depolarization on hMSC differentiation from five donors.  Depolarization was applied during OS and AD differentiation to assess its impact on the differentiation process.  Subsequently, depolarization was applied to pre-differentiated hMSCs (osteoblasts or adipocytes) to examine its effects on maintaining the differentiated phenotype.  The study compares the responses of the five cell sources to determine the consistency of hMSC response to electrophysiological modulation.  Different tissue-specific markers were also compared to identify those with the most consistent response to depolarization. This research is the first to address inter-donor heterogeneity of stem cell responses to electrophysiological modulation.",
      "section": "Introduction",
      "topic": "Study overview and objectives",
      "chunk_summary": "This study investigates the effects of Vmem depolarization on hMSC differentiation and maintenance of differentiated phenotypes across five donors, aiming to understand the heterogeneity of responses to bioelectric modulation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Bone marrow aspirates were obtained from healthy male donors (18-25 years old) with informed consent.  hMSCs were isolated and cultured in control medium supplemented with bFGF.  Hematopoietic stem cells were removed after five days.  Cells were trypsinized and frozen upon reaching confluence.  For differentiation, cells (passages 2-4) were cultured in osteogenic or adipogenic differentiation media under normoxic conditions.  Osteogenic medium consisted of α-MEM with supplements, while adipogenic medium consisted of control medium with supplements. Undifferentiated hMSCs were maintained in control medium.",
      "section": "Materials and Methods",
      "topic": "Cell culture",
      "chunk_summary": "hMSCs were isolated from bone marrow aspirates of healthy male donors and cultured in specific media for osteogenic or adipogenic differentiation, while undifferentiated cells were maintained in control medium.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Vmem depolarization was induced by increasing extracellular K+ concentration using potassium gluconate, predicted to alter Vmem according to the Goldman-Hodgkin-Katz equation.  Depolarization in response to elevated K+ was previously confirmed.  Final K+ concentrations were 40 mM for osteogenic and 80 mM for adipogenic studies.  For differentiation studies, depolarization and differentiation began concurrently (Day 0).  Depolarizing medium was replenished at each medium change.  For pre-differentiation studies, cells were pre-treated for two weeks, then switched to high K+ medium, normal differentiation medium, or control medium for one week before analysis.",
      "section": "Materials and Methods",
      "topic": "Vmem depolarization",
      "chunk_summary": "Vmem depolarization was induced by increasing extracellular K+ concentration, with different concentrations used for osteogenic and adipogenic studies, and applied either concurrently with differentiation or after pre-differentiation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Quantitative PCR was used to evaluate gene expression in depolarized cells. RNA was collected on Day 7 (differentiation studies) or Day 21 (pre-differentiation studies). RNA was isolated, reverse transcribed, and osteogenic/adipogenic gene transcripts were amplified and quantified. Transcript levels were normalized to GAPDH and reported relative to undifferentiated hMSCs.",
      "section": "Materials and Methods",
      "topic": "Quantitative PCR",
      "chunk_summary": "Gene expression analysis was performed using qPCR on RNA collected at different time points, with transcript levels normalized to GAPDH and compared to undifferentiated hMSCs.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Alkaline phosphatase (ALPL) activity was measured on Day 14 (differentiation) or Day 21 (pre-differentiation). ALPL activity was quantified by measuring p-nitrophenol converted from p-nitrophenyl phosphate. Samples were lysed, centrifuged, and supernatants were incubated with pNPP substrate. Absorbance was measured at 405 nm.",
      "section": "Materials and Methods",
      "topic": "Alkaline phosphatase activity",
      "chunk_summary": "ALPL activity was measured by quantifying p-nitrophenol conversion from p-nitrophenyl phosphate, with absorbance measured at 405 nm.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Total calcium levels were quantified on Day 21 for osteogenic samples using a Calcium CPC Liquicolor Kit. Calcium was eluted, cellular debris removed, and samples were incubated with assay reagent. Absorbance was measured at 575 nm.",
      "section": "Materials and Methods",
      "topic": "Calcium quantification",
      "chunk_summary": "Total calcium levels were quantified using a biochemical assay, with absorbance measured at 575 nm.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "DNA content was measured for normalization of ALP activity and calcium data using a PicoGreen dsDNA Assay Kit. Samples were lysed, centrifuged, and supernatants were diluted and incubated with PicoGreen reagent. Fluorescence was measured at 480/520 nm excitation/emission.",
      "section": "Materials and Methods",
      "topic": "DNA quantification",
      "chunk_summary": "DNA content was measured using a PicoGreen assay for normalization of ALP activity and calcium data.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Lipid droplets were stained with Oil Red O and visualized on Day 21 for adipogenic samples. Cells were fixed, stained, washed, and imaged with an inverted microscope. Images were processed for brightness and contrast.",
      "section": "Materials and Methods",
      "topic": "Oil Red O staining",
      "chunk_summary": "Lipid droplets in adipogenic samples were visualized using Oil Red O staining and light microscopy.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Data are reported as mean ± standard deviation. One-way ANOVA and Tukey-Kramer post-hoc test were used for statistical analysis.  Differences were considered significant if p < 0.05.  Different letters on bar graphs indicate statistically different groups (p < 0.05).",
      "section": "Materials and Methods",
      "topic": "Statistical analysis",
      "chunk_summary": "Statistical analysis was performed using one-way ANOVA and Tukey-Kramer post-hoc test, with p < 0.05 considered significant.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "During osteogenic differentiation with depolarization, ALPL expression decreased in three of five donors, while IBSP expression increased consistently across all donors but was lowered by depolarization in three donors. ALPL activity was an inconsistent marker, and total calcium content increased with osteogenic differentiation and decreased with depolarization consistently across all donors. IBSP expression and calcification were the most consistent markers, with depolarization suppressing these markers in most donors. ALPL expression and activity were less consistent.",
      "section": "Results",
      "topic": "Depolarization during osteogenic differentiation",
      "chunk_summary": "Depolarization during osteogenic differentiation affected ALPL and IBSP expression, with calcium content being the most consistent marker of differentiation and its suppression by depolarization.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "During adipogenic differentiation with depolarization, adipogenic markers generally showed upregulation upon differentiation, except for PPARG in one donor. LPL expression consistently decreased with depolarization across all donors. PPARG and FABP4 expression decreased with depolarization in four donors, but increased in one donor. Oil Red O staining showed decreased lipid droplets with depolarization in four donors, consistent with gene expression patterns. Overall, depolarization suppressed adipogenic markers in most donors, with one donor showing an atypical response.",
      "section": "Results",
      "topic": "Depolarization during adipogenic differentiation",
      "chunk_summary": "Depolarization during adipogenic differentiation generally suppressed adipogenic markers in most donors, with LPL being the most consistent marker, while one donor exhibited an atypical response.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "In pre-differentiated osteoblasts, ALPL expression was inconsistent, while IBSP expression increased with osteogenic differentiation and decreased with depolarization in four donors. Calcification increased with differentiation and decreased with depolarization in four donors. IBSP and calcium levels were the most consistent markers for maintaining the osteogenic phenotype, with depolarization decreasing marker expression in most donors. ALPL activity and expression were less consistent.",
      "section": "Results",
      "topic": "Depolarization after osteogenic pre-differentiation",
      "chunk_summary": "In pre-differentiated osteoblasts, depolarization decreased IBSP and calcium levels, which were the most consistent markers for maintaining the osteogenic phenotype, while ALPL was less consistent.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "In pre-differentiated adipocytes, depolarization suppressed PPARG expression in three of five donors, while having no effect in the other two.  Oil Red O staining showed a similar pattern, with four donors exhibiting decreased lipid droplets upon depolarization. The atypical response was again observed in one donor, where depolarization upregulated transcript expression instead of suppressing it.",
      "section": "Results",
      "topic": "Depolarization after adipogenic pre-differentiation",
      "chunk_summary": "In pre-differentiated adipocytes, depolarization suppressed PPARG expression in some donors but not others, with one donor showing an atypical response of increased expression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Growing interest in pluripotent stem cell electrophysiology stems from evidence that endogenous bioelectric properties play important roles in non-excitable cell functions and can be modulated for desired outcomes. While studies suggest that electrophysiological state can be modulated for desired cell behaviors, primary stem cells exhibit significant donor-dependent heterogeneity.  Evaluation of lipid droplets by Oil Red O staining showed a similar pattern, with most donors exhibiting a decrease in lipid droplets upon depolarization. The atypical response was again found in one donor, where depolarization upregulated transcript expression instead of suppressing it.",
      "section": "Discussion",
      "topic": "Stem cell electrophysiology and donor heterogeneity",
      "chunk_summary": "Stem cell electrophysiology is gaining interest due to its role in cell function, but donor heterogeneity must be considered when modulating bioelectric properties for desired outcomes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "Friedenstein, A. J., Petrakova, K. V., Kurolesova, A. I. & Frolova, G. P. Heterotopic of bone marrow. Analysis of precursor cells for osteogenic and hematopoietic tissues. Transplantation 6, 230-247 (1968). Friedenstein, A. J., Piatetzky, S., II & Petrakova, K. V. Osteogenesis in transplants of bone marrow cells. J Embryol Exp Morphol 16, 381-390 (1966).",
      "section": "References",
      "topic": "hMSC origins and transplantation",
      "chunk_summary": "Early work by Friedenstein and colleagues explored the osteogenic and hematopoietic potential of bone marrow cells and their transplantation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "The authors acknowledge funding from NIH (P41 EB002520, R01 AR005593, R01 AR061988), the G. Harold and Leila Y. Mathers Charitable Foundation, and the W. M. Keck Foundation.",
      "section": "Acknowledgements",
      "topic": "Funding sources",
      "chunk_summary": "The study was funded by NIH, Mathers Charitable Foundation, and W. M. Keck Foundation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    },
    {
      "text": "S.S. contributed to conception and design, data collection and assembly, data analysis and interpretation, and manuscript writing. M.L. contributed to conception and design and final manuscript approval. D.L.K. contributed to conception and design, financial support, and final manuscript approval.",
      "section": "Author Contributions",
      "topic": "Author roles and responsibilities",
      "chunk_summary": "Sundelacruz led the experimental work and manuscript preparation, while Levin and Kaplan contributed to the study's conception, design, and oversight.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_114050_208524.pdf",
      "original_filename": "pdf_20250803_114050_208524_extracted_text.txt",
      "authors": "[\"Sarah Sindelacrz\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2015",
      "journal": "Scientific Reports",
      "doi": "10.1038/srep18279"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:56:18.794721",
  "enriched_at": "2025-08-11T14:49:22.395331",
  "enrichment_methods": [
    "crossref"
  ]
}