{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_657702_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_657702.pdf",
    "file_size": 36761,
    "authors": [
      "Amy E. Thurber",
      "Michaela Nelson",
      "Crystal L. Frost",
      "Michael Levin",
      "William J. Brackenbury",
      "David L. Kaplan"
    ],
    "journal": "Oncotarget",
    "doi": "10.18632/oncotarget.16389",
    "year": "2017",
    "title": "IK channel activation increases tumor growth and induces differential behavioral responses in two breast epithelial cell lines",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2017",
    "page_range": "42382-42397",
    "volume": "8",
    "issue": "26",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Many potassium channel families are over-expressed in cancer, but their mechanistic role in disease progression is poorly understood. Potassium channels modulate membrane potential (Vmem) and thereby influence calcium ion dynamics and other voltage-sensitive signaling mechanisms, potentially acting as transcriptional regulators. This study investigated the differential response to over-expression and activation of a cancer-associated potassium channel, the intermediate conductance calcium-activated potassium channel (IK), on aggressive behaviors in mammary epithelial and breast cancer cell lines. IK was over-expressed in the highly metastatic breast cancer cell line MDA-MB-231 and the spontaneously immortalized breast epithelial cell line MCF-10A, and the effect on cancer-associated behaviors was assessed. IK over-expression increased primary tumor growth and metastasis of MDA-MB-231 in orthotopic xenografts, demonstrating for the first time in any cancer type that increased IK is sufficient to promote cancer aggression. The primary tumors had similar vascularization as determined by CD31 staining and similar histological characteristics. Interestingly, despite the increased in vivo growth and metastasis, neither IK over-expression nor activation with agonist had a significant effect on MDA-MB-231 proliferation, invasion, or migration in vitro. In contrast, IK decreased MCF-10A proliferation and invasion through Matrigel but had no effect on migration in a scratch-wound assay. We conclude that IK activity is sufficient to promote cell aggression in vivo. Our data provide novel evidence supporting IK and downstream signaling networks as potential targets for cancer therapies.",
      "section": "Abstract",
      "topic": "IK channel role in cancer",
      "chunk_summary": "Overexpression of IK channel promotes tumor growth and metastasis in vivo, but shows differential effects on in vitro behaviors in breast cancer and epithelial cell lines.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Breast cancer is a common cancer with high mortality in metastatic cases, highlighting the need for better treatments. A major obstacle is the lack of understanding of the drivers of metastasis. While many metastasis-specific pathways are known, the upstream signals activating them and the factors determining which cells metastasize remain largely unknown. Ion channels have gained attention for their roles in cancer progression, with altered expression correlating with cancer stage. Inhibiting certain channels reduces cancer-associated behaviors. Most studies focus on ion channels as downstream targets executing mechanical functions for aggressive behaviors. However, evidence suggests ion channels may have upstream regulatory roles, initiating signaling cascades to promote aggressive behaviors.",
      "section": "Introduction",
      "topic": "Metastasis and ion channels in breast cancer",
      "chunk_summary": "Ion channels, potentially with upstream regulatory roles, are implicated in breast cancer metastasis, but the underlying mechanisms remain poorly understood.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The intermediate conductance calcium-activated potassium channel (IK) is over-expressed in numerous cancer types, and inhibiting IK decreases cancer cell proliferation, migration, tumor growth, and metastasis. The prevailing theory is that IK is a downstream effector required for late steps of aggressive behaviors. However, IK may have upstream instructive roles, initiating aggressive behaviors through its effect on calcium dynamics. In prostate cancer cells, IK activation increased intracellular calcium and proliferation, suggesting IK can regulate downstream calcium-dependent pathways. However, the sufficiency of IK to promote aggressiveness has not been studied in breast cancer cells.",
      "section": "Introduction",
      "topic": "IK channel and cancer",
      "chunk_summary": "IK channel, often viewed as a downstream effector, may have upstream instructive roles in promoting cancer aggressiveness through calcium dynamics, but this remains unexplored in breast cancer.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "This study aimed to investigate whether increased IK activity was sufficient to promote proliferation and other aggressive behaviors in breast epithelial and cancer cells. The metastatic breast cancer cell line MDA-MB-231 was chosen because IK inhibition studies showed decreased proliferation, migration, and colony formation. Surprisingly, MDA-MB-231 in vitro proliferation, invasion, and migration were unaffected by IK over-expression or activation. However, increased IK decreased proliferation and invasion of the non-tumorigenic MCF-10A cell line but not migration. In contrast to in vitro results, over-expressing IK in MDA-MB-231 increased primary tumor growth and metastasis in mice. This study is the first to demonstrate IK's sufficiency to increase cancer aggression in vivo and suggests potential differences in behavioral response to IK activation between tumorigenic and non-tumorigenic cells. The results indicate IK's instructive role in cancer progression and suggest unique signaling mechanisms as potential targets.",
      "section": "Introduction",
      "topic": "Study aims and rationale",
      "chunk_summary": "This study investigated the sufficiency of IK channel activity to promote aggressive behaviors in breast cancer and epithelial cells, revealing differential in vitro and in vivo responses.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "To test the sufficiency of increased IK activity in MDA-MB-231 cells, cells with increased IK expression were generated using retroviral infection. IK overexpression was confirmed by RT-PCR and immunofluorescence. Functional activity was validated by measuring current density and Vmem with and without the IK agonist 1-EBIO. 1-EBIO treatment significantly increased current density in MDA-MB-231-IK cells, but not in control cells. The reversal potential near the potassium reversal potential indicated the current was primarily potassium flux. IK overexpression without agonist did not significantly alter Vmem but increased the range of values, skewing towards hyperpolarization. 1-EBIO significantly hyperpolarized Vmem in MDA-MB-231-IK cells. These data suggest MDA-MB-231-IK cells express more functional IK channels than control cells.",
      "section": "Results",
      "topic": "IK overexpression and electrophysiology",
      "chunk_summary": "IK overexpression increased potassium current and hyperpolarized membrane potential in MDA-MB-231 cells upon agonist stimulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The effect of IK expression and activity on in vitro behaviors of MDA-MB-231 cells was investigated.  Proliferation, invasion, and migration were monitored in control and IK-overexpressing cells with and without 1-EBIO. No significant difference in proliferation was observed across any condition. Similarly, invasion and migration were not affected by IK overexpression or activation. These results suggest increased IK activity is not sufficient to increase in vitro measures of MDA-MB-231 cell aggression.",
      "section": "Results",
      "topic": "In vitro effects on MDA-MB-231",
      "chunk_summary": "IK overexpression and activation did not significantly affect MDA-MB-231 cell proliferation, invasion, or migration in vitro.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Colony formation in soft agar was assessed as a measure of transformation and tumor-forming ability. Surprisingly, colony formation in IK-expressing cells was decreased compared to control, and further decreased by 1-EBIO treatment. 1-EBIO also reduced colony formation in control cells. These data suggest constant IK activation by 1-EBIO inhibits colony formation more severely than elevated transiently activated IK.",
      "section": "Results",
      "topic": "Colony formation assay",
      "chunk_summary": "IK overexpression and activation decreased colony formation in MDA-MB-231 cells, with constant activation having a stronger inhibitory effect.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The effect of increased IK expression and activation was tested in non-tumorigenic MCF-10A cells. IK overexpression increased IK expression and current density with 1-EBIO treatment, and hyperpolarized Vmem. 1-EBIO further hyperpolarized Vmem in both control and IK-overexpressing MCF-10A cells. IK overexpression alone had no effect on MCF-10A proliferation, but 1-EBIO treatment decreased proliferation in both control and IK-expressing cells.  Invasion was significantly decreased by both IK overexpression and activation, but migration was unaffected. Neither MCF-10A control nor MCF-10A-IK cells formed colonies in soft agarose with or without 1-EBIO.",
      "section": "Results",
      "topic": "In vitro effects on MCF-10A",
      "chunk_summary": "IK activation decreased MCF-10A proliferation and invasion, but not migration, while overexpression alone had no effect on proliferation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The differential proliferative response between MCF-10A and MDA-MB-231 cells was investigated by measuring apoptosis and cell cycle distribution.  No significant difference in apoptotic or dead cells was observed between the two cell lines. However, 1-EBIO treatment increased the percentage of MCF-10A cells in G2 phase, while no changes were observed in MDA-MB-231 cells. The increased G2 accumulation in MCF-10A cells suggests that the G2/M checkpoint requires decreased IK activity or depolarization, and that MDA-MB-231 cells evade this requirement.",
      "section": "Results",
      "topic": "Apoptosis and cell cycle analysis",
      "chunk_summary": "1-EBIO treatment caused G2 accumulation in MCF-10A cells but not MDA-MB-231 cells, suggesting differential cell cycle regulation in response to IK activation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The effect of IK overexpression on in vivo tumor growth and metastasis was assessed in mice. MDA-MB-231-IK tumors showed significantly increased primary tumor growth compared to control tumors. Tumor sections stained positive for human nuclear antigen and showed higher IK immunoreactivity. Despite increased tumor size, there was no significant difference in Ki67-positive proliferating cells or cleaved caspase-3 positive apoptotic cells at day 28, although there was a trend towards increased Ki67+ cells and reduced caspase-3+ cells in IK-overexpressing tumors.",
      "section": "Results",
      "topic": "In vivo tumor growth",
      "chunk_summary": "IK overexpression increased primary tumor growth in vivo, but did not significantly alter proliferation or apoptosis markers at day 28.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Primary tumor sections revealed similar local invasion and vascular density between control and MDA-MB-231-IK tumors. However, there was a significant increase in the number of metastasizing cells to the lung in MDA-MB-231-IK injected mice.  In summary, IK overexpression significantly increased primary tumor growth and lung metastasis.",
      "section": "Results",
      "topic": "Metastasis and tumor characteristics",
      "chunk_summary": "IK overexpression increased lung metastasis in vivo, but did not significantly affect local invasion or vascular density of primary tumors.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Metastatic cancer remains a significant clinical challenge. IK channels are known to play important roles in cancer-related behaviors. This study investigated whether IK is sufficient to promote these behaviors. IK overexpression increased primary tumor growth and metastasis, but had cell line-dependent effects on in vitro behaviors. This study supports previous findings of differential responses to potassium channel activation between cell lines.  The in vivo data contrast with the lack of significant effects on MDA-MB-231 proliferation, migration, or invasion in vitro. The opposing results may reflect the influence of the tumor microenvironment, which is not recapitulated in vitro.",
      "section": "Discussion",
      "topic": "IK channel and cancer progression",
      "chunk_summary": "IK overexpression promotes tumor growth and metastasis in vivo, but its effects on in vitro behaviors are cell line-dependent, highlighting the potential role of the tumor microenvironment.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The lack of effect of IK on MDA-MB-231 migration in vitro may be due to the lack of spatial regulation of IK activation with agonist treatment. The effect of increased IK expression on spatially restricted activation is unknown.  IK expression and activation decreased MCF-10A invasion, but not MDA-MB-231 invasion. This may be related to an inability to degrade the ECM or dysregulation of volume control.  IK expression and activation decreased MDA-MB-231 colony formation, requiring further investigation. Unlike in prostate cancer cells, IK did not affect MDA-MB-231 proliferation, suggesting different downstream mechanisms across cancer types. IK activation decreased MCF-10A proliferation by causing G2 accumulation, while MDA-MB-231 proliferation and cell cycle distribution were unaffected. This suggests different bioelectric profiles and sensitivities between the two cell lines.",
      "section": "Discussion",
      "topic": "Differential effects of IK",
      "chunk_summary": "The study observed differential effects of IK on migration, invasion, proliferation, and cell cycle progression in MDA-MB-231 and MCF-10A cells, suggesting cell type-specific mechanisms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "The contrasting behavioral responses between MCF-10A and MDA-MB-231 cells may be due to differences in IK binding partners and associated proteins. IK signaling depends on interactions with beta-1-integrin and TRP calcium channels.  Variability in associated proteins may affect behavioral response.  Different TRP calcium channel family members may have different effects on calcium dynamics and downstream signaling.  The downstream response to IK modulation is complex and may be cell-type specific. Further analysis is needed to determine if the divergent responses are characteristic of specific cell types or disease states.",
      "section": "Discussion",
      "topic": "IK signaling mechanisms",
      "chunk_summary": "Differences in IK binding partners and associated proteins, particularly TRP calcium channels, may contribute to the cell type-specific responses to IK modulation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "This study demonstrates that IK is sufficient to promote in vivo cancer growth and metastasis. The findings suggest IK has a greater impact on cancer progression, likely through calcium-sensitive pathways, than previously thought. Ion channels may be a mechanism of metastasis initiation due to their sensitivity to microenvironmental factors.  The results support the potential of IK-inhibiting drugs to decrease cancer progression. The opposing behavioral responses between MDA-MB-231 and MCF-10A cells warrant further study to identify unique mechanisms and potential targeted therapies.",
      "section": "Discussion",
      "topic": "Therapeutic implications",
      "chunk_summary": "The sufficiency of IK to promote cancer growth and metastasis highlights its potential as a therapeutic target, and the differential responses between cell types suggest possibilities for targeted therapies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Retroviral expression plasmid pMIG was modified to include the IK coding sequence and tagRFP. Primers were designed to amplify pMIG excluding the IRES-GFP sequence and to insert the IK coding sequence, P2A sequence, and tagRFP. PCR-amplified fragments were used in a Gibson assembly reaction to create the final plasmid pMIG-IK. A control plasmid with only tagRFP (pMIG-RFP) was also generated.",
      "section": "Materials and Methods",
      "topic": "Plasmid construction",
      "chunk_summary": "The pMIG retroviral expression plasmid was modified to express IK and tagRFP, with a control plasmid expressing only tagRFP.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "Retrovirus was produced by transfecting 293 Plat GP cells with VSV packaging plasmid and pMIG-IK or pMIG-RFP. Virus-containing media was collected and filtered. Human breast epithelial cells were transduced with the virus and selected using G418. Retrovirus-infected cells were expanded for FACS sorting.",
      "section": "Materials and Methods",
      "topic": "Retrovirus production and transduction",
      "chunk_summary": "Retrovirus carrying IK or RFP was produced and used to transduce human breast epithelial cells.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    },
    {
      "text": "MCF-10A and MDA-MB-231 cells were obtained from ATCC and maintained according to ATCC recommendations. Cells were treated with 200 μM 1-EBIO or an equivalent concentration of DMSO as vehicle control. Patch clamp recordings were performed in the cell-attached perforated patch configuration. RNA was isolated from confluent cells, and quantitative PCR was performed.",
      "section": "Materials and Methods",
      "topic": "Cell culture and experimental procedures",
      "chunk_summary": "Standard cell culture procedures, IK activation with 1-EBIO, electrophysiology recordings, and RNA isolation were performed.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_657702.pdf",
      "original_filename": "pdf_20250803_124126_657702_extracted_text.txt",
      "authors": "[\"Amy E. Thurber\", \"Michaela Nelson\", \"Crystal L. Frost\", \"Michael Levin\", \"William J. Brackenbury\", \"David L. Kaplan\"]",
      "year": "2017",
      "journal": "Oncotarget",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:47:39.521410",
  "enriched_at": "2025-08-11T14:37:14.432631",
  "enrichment_methods": [
    "crossref_title"
  ]
}