{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_220296_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_220296.pdf",
    "file_size": 97312,
    "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
    "journal": "Biological Journal of the Linnean Society",
    "doi": "10.1093/biolinnean/blac123",
    "year": "2023",
    "title": "Correction to: Endless forms most beautiful 2.0: teleonomy and the bioengineering of chimaeric and synthetic organisms",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2023",
    "page_range": "246-246",
    "volume": "138",
    "issue": "2",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Progress in molecular biology and genetics has led to great strides in understanding the micro-scale hardware of cells (the protein machinery encoded by the genome). However, this is only the beginning; the next frontier is the software of life: developing a mature science of prediction and control over system-level phenotypes. Despite a deluge of big data on the molecular mechanisms necessary for specific functionalities, important capability and knowledge gaps remain with respect to the dynamics that are sufficient for the remarkable robustness and plasticity we observe in the living world.",
      "section": "Introduction",
      "topic": "Knowledge gaps in biological systems",
      "chunk_summary": "Despite advances in molecular biology, significant gaps remain in understanding the system-level dynamics that govern robustness and plasticity in living organisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "A fertilized egg produces a cellular swarm that reliably self-assembles into a highly complex organism. This process is not hardwired: mammalian embryos cut in half produce normal monozygotic twins, because each side can grow what is missing. Some organisms maintain this regenerative capacity throughout their lifetime; for example, salamanders regenerate limbs, jaws, eyes, tails and ovaries. A salamander limb can be amputated at any level and will produce precisely the missing parts and then stop when a correct salamander limb is complete. The ability to handle novelty in the form of external damage is not the only aspect of the robust plasticity of life; this ability also extends to unexpected changes in the internal building blocks of the organism.",
      "section": "Introduction",
      "topic": "Robustness and plasticity in development and regeneration",
      "chunk_summary": "Living organisms exhibit remarkable robustness and plasticity in development and regeneration, adapting to both external damage and internal changes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Tadpoles generated to have no primary eyes, but an ectopic eye on their tail, can see reasonably well; in their aberrant new location, eye primordia cells form a proper eye and often connect the optic nerve to the spinal cord. A brain that has evolved for millions of years to expect visual input to a specific location immediately adjusts its behavioural programmes to operate with signals coming from its tail. The same plasticity has been observed in adult humans provided with novel senses and effector organs (such as prosthetics with novel degrees of freedom).",
      "section": "Introduction",
      "topic": "Adaptability to novel sensory inputs",
      "chunk_summary": "Organisms demonstrate remarkable adaptability to novel sensory inputs, as evidenced by tadpoles with ectopic eyes and humans with prosthetics.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Kidney tubules in newts normally form from the interactions of eight to ten cells in cross-section, working together to make a lumen of a specific size. Cell size can be made larger by artificially increasing the ploidy (chromosome number) of embryonic cells. Such animals are of a normal size and proportion, because fewer and fewer cells participate in the tubulogenesis as the cell size increases. Most remarkably, when cells are truly enormous, a single cell will wrap around itself to make a proper tubule. In this case, instead of the normal cell-to-cell communication, cytoskeletal bending is used to achieve the same morphological goal. Thus, diverse molecular mechanisms are triggered in service of a higher-level anatomical specification (a tubule of specific cross-section).",
      "section": "Introduction",
      "topic": "Structural robustness to change",
      "chunk_summary": "Kidney tubule formation in newts demonstrates structural robustness, achieving the same morphological goal despite variations in cell size and number.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "These changes in the quantity of genetic material and cell size are dealt with dynamically. Our robotics technology does not even begin to approach this kind of capacity, and any engineered swarm that could adjust to this type of novelty (perturbation in size and information content of its components) would be hailed as a milestone in artificial intelligence. The connection to intelligence is not accidental: William James defined it as the ability to reach the same goal by different means. The proficiency of living systems in this respect is best revealed not by the reliable normal development of standard model species (which obscures the true capacities of cellular swarms), but by the type of engineered, novel beings of which the above altered examples are only the beginning.",
      "section": "Introduction",
      "topic": "Intelligence in biological systems",
      "chunk_summary": "The dynamic adaptability of living systems to changes in genetic material and cell size highlights their inherent intelligence, defined as the ability to achieve the same goal by different means.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "This type of plasticity, in the context of epigenetic controls and responses to the environment, extends to all scales, from the variability of the traditional environment of the whole animal to the microenvironment (internal properties) of organs and cells. Life is massively inter-operable, enabling functional chimaeras and hybrids at the molecular, cellular, tissue, organ and even organism levels. What computations, algorithms or dynamics enable cellular collectives to respond adaptively, reaching the same form and function despite radical induced changes of circumstances? Importantly, all these phenomena show adaptations to novelty that exists on the time scale of an individual, not requiring aeons of evolutionary search. This suggests that life exploits an architecture that provides much more efficiency than could be expected from a blind process that always chooses short-term gains (selection that adapts to a specific environment).",
      "section": "Introduction",
      "topic": "Interoperability and adaptability of life",
      "chunk_summary": "Life's massive interoperability and adaptability, enabling functional chimaeras and hybrids at multiple scales, suggest an efficient architecture that goes beyond short-term evolutionary gains.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "The answer to 'what determines the shape of an organism?' is often said to be 'the genome', but many deep questions remain about the relationship between the genome and anatomy. In addition to artificially produced chimaeric organisms, in which diverse genomes can live together and generate large-scale form and function, some animals are natural chimaeras. Some species of planarians reproduce largely by fission and regeneration; this avoids the segregation of the germline in a type of somatic inheritance: any mutation that does not kill a stem cell takes it into the next generation to proliferate in the lineage. For hundreds of millions of years, these animals have accumulated mutations and are even mixoploid; different cells within one animal can have different numbers of chromosomes.",
      "section": "Introduction",
      "topic": "Genome-anatomy relationship",
      "chunk_summary": "The relationship between genome and anatomy is complex, as evidenced by natural chimaeras like planarians, which exhibit high anatomical fidelity despite genetic diversity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "And despite this messy genome, they are champions of regeneration, building the correct body from even small fragments with very high anatomical fidelity; each piece of a cut planarian produces a perfect little worm. We have no models in developmental genetics that would predict that the highest fidelity of anatomical outcomes would be associated with genetic diversity that rivals any tumour. Indeed, planarian lines can even be made permanently two headed by manipulating the bioelectric circuit that stores head number, resulting in permanent 'strains' of animals whose cells continue to build worms with a different anatomical body plan from the genomic default. What is the relationship between the genome and anatomy, and what mechanisms allow biology to exhibit robustness and plasticity simultaneously, enabling adaptive, coherent organisms to arise in novel circumstances?",
      "section": "Introduction",
      "topic": "Planarian regeneration and bioelectric circuits",
      "chunk_summary": "Planarians' regenerative abilities and the influence of bioelectric circuits on their body plan further complicate the relationship between genome and anatomy.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Moreover, the highly competent decision-making of cellular collectives in anatomical morphospace reveals a fascinating commonality between problems of cognition (mind) and problems of body (morphogenesis). This fundamental link was well understood by early workers in developmental biology, such as Hans Spemann, and those in computer science, such as Alan Turing; it is only now beginning to be fleshed out. Ontogeny recapitulates phylogeny, in that all of us have made the journey across the Cartesian cut (from the 'mere physics' of molecular networks in a quiescent oocyte to a thinking being) not only during evolution but also during our own lifetimes. What aspects of biological structure enabled mind gradually to develop and expand?",
      "section": "Introduction",
      "topic": "Cognition and morphogenesis",
      "chunk_summary": "The connection between cognition and morphogenesis, recognized by early developmental biologists and computer scientists, highlights the journey from molecular networks to thinking beings.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "These knowledge gaps are not obscure issues in evolutionary biology and philosophy of mind. The whole of regenerative medicine hangs on the question of how to induce collectives of cells to build one structure rather than another. Birth defects, traumatic injury, cancer and degenerative disease would all be solved if we had a mature science of making predictions and deriving rational interventions into the morphogenetic process. Advances in molecular medicine and genomic editing will not have an impact on biomedicine unless we know what to edit or which pathways to target to achieve system-level goals, such as 'make a new arm'. It is no accident that current medical interventions that solve problems in the long term exist only in the realms of infectious disease and surgery. Transformative regenerative medicine awaits a mature understanding of how to induce collections of cells to make desired anatomical features.",
      "section": "Introduction",
      "topic": "Regenerative medicine and morphogenetic control",
      "chunk_summary": "Advances in regenerative medicine depend on understanding how to control morphogenesis to achieve desired anatomical outcomes, going beyond current limitations of molecular medicine and genomic editing.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Chimaeras and bioengineered organisms challenge us to make predictions and spotlight areas in which genomics have driven unwarranted complacency. For example, when we make a frogolotl (a hybrid frog-axolotl embryo), will it have legs, like a larval axolotl, or not, like a tadpole? If it has legs, will they be made of frog cells or only of axolotl cells? We have no models in biology to make predictions about such cases, despite having full access to the genomes of both species. Crucially, this inability to predict or control outcomes is not a special feature of rare 'corner cases'; it lays bare the often-neglected fact that even for a single species, knowing its genome enables us to say almost nothing about the form or function of the organism it 'encodes' (except when we cheat by comparing the genome with that of organisms whose anatomy we know already).",
      "section": "The need to go beyond standard model species",
      "topic": "Limitations of genomics in predicting form and function",
      "chunk_summary": "Knowing an organism's genome does not guarantee the ability to predict its form or function, as highlighted by chimaeras and bioengineered organisms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "This is because, although the genetics specify the cell-level hardware of the system (proteins), the outcome is the product of physiological software dynamics that are not predicted easily from the hardware level. If we 'zoomed in' to observe developmental events at the cellular level, seeing all of the stochastic cell behaviour and signalling noise, would we be able to predict that all of that activity would reliably give rise to a fish or mouse, if we did not already know about development and the fact that it is highly reliable in a range of conditions? Managing the reliability of outcomes in novel circumstances challenges us to develop a science of predicting stable outcomes at large scales. Knowing how to detect and characterize specific goal states (in the cybernetic sense) of collectives, such as cell groups, is a crucial part of understanding systems. Novel instantiations of multicellular life are a crucial dataset on which to train and improve the conceptual tools of scientists and learning machines and must complement the developmental biology of standard, evolved model systems.",
      "section": "The need to go beyond standard model species",
      "topic": "Predicting stable outcomes in novel circumstances",
      "chunk_summary": "Predicting stable outcomes in novel circumstances requires understanding the physiological software dynamics and goal states of cellular collectives, going beyond cell-level hardware specifications.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Beyond life on Earth, how would we recognize novel forms of life? What is the appropriate scale of observation for detecting the behaviour and appropriate problem spaces in which life operates? Bioengineering provides a crucial inroad for exobiology; a stepping-stone for enabling generalization of biology such that we can detect truly alien forms of life if and when we encounter them. Regardless of natural life elsewhere, exploring the option space of beings enables us to improve the terms and categories we use to understand life, manipulating all the components in a schema such as the traditional brain-body-environment framework to unfamiliar components, in order to see how our existing approaches break down when faced with unfamiliar implementations. Like the very successful strategy of looking for symmetries in physics, in biology we must ask which of our concepts are deep invariants. Which of them remain when contingent details of implementation (cell type, genetics, origin, etc.) are changed?",
      "section": "The need to go beyond standard model species",
      "topic": "Recognizing novel life forms and searching for invariants",
      "chunk_summary": "Exploring the option space of beings, including bioengineered organisms, helps us refine our understanding of life and identify deep invariants that transcend specific implementations.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "The need to expand beyond familiar life forms goes deeper than Feynman's dictum, that we do not really understand a thing until we can make one ourselves. The future of biomedicine and engineering depends on being able to offload much of the complexity we wish to manage onto the system itself; for example, triggering a body to regenerate a limb in the right location instead of trying to micromanage its construction from the molecular level. This, in turn, relies on understanding the modules, decision-making and information processing of which the system is capable. We have argued in the past that an important aspect of future medicine will involve guiding the large-scale behaviour of cellular collectives with incentives, stimuli and set point rewriting, rather than micromanaging the structure of their parts. This means that we need to understand the algorithms guiding these systems at multiple scales and, in particular, their basal intelligence (i.e. their ability to navigate physiological, transcriptional and morphological spaces competently despite novel circumstances and perturbations).",
      "section": "The need to go beyond standard model species",
      "topic": "Guiding cellular collectives and understanding basal intelligence",
      "chunk_summary": "Future biomedicine and engineering will rely on guiding cellular collectives through incentives and set point rewriting, requiring an understanding of their basal intelligence and multi-scale algorithms.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "However, such intelligence is rarely apparent in 'normal' circumstances, when a system appears to be doing the same thing every time; this is what gives rise to a view of most biological systems as clockwork mechanisms, full of complexity but without intelligence. In order to uncover, understand, control and, eventually, cooperate with the true intelligence of biology at all scales, it is essential to confront biological systems with novelty, both inside and out, and to study the context-specific problem-solving capacities and plasticity that are revealed in response to that novelty. Chimaerism (mixing biological components) was a popular concept in the ancient world, but the story of Adam naming a discrete set of animals in the Garden of Eden suggests a different and much more limiting picture: a type of essentialism that suggests sharp categories (distinctions of biological form) and natural kinds that do not, in fact, exist. We now have the opportunity to extend this story and 'name the animals' in a much deeper way, by understanding the design principles of biology that transcend extant evolutionary examples. The implications of embracing the space of possible beings will extend to terminology, conceptual frameworks, research programmes in several fields, and ethics.",
      "section": "The need to go beyond standard model species",
      "topic": "Confronting biological systems with novelty and expanding the space of possible beings",
      "chunk_summary": "Confronting biological systems with novelty reveals their true intelligence, challenging traditional essentialist views and opening up a vast space of possible beings with implications for various fields and ethics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Examples of novel 'life as it could be' are highly diverse, and current technologies and proof-of-concept results clearly indicate the coming diversity of life in the near future. These novel life forms result from the recombination of existing evolved components at multiple scales (DNA, cells, tissues and organs) and the incorporation of designed components, such as nanomaterials, electronic/chemical/optical interfaces and software algorithms; replacements can be made at every level of organization, with parts that occupy some position with respect to functional sophistication and origin. Bioengineering and evolution work in the same living medium; thus, we first consider an example of an entirely natural evolved functional chimaerism, where two kingdoms of life come together to form a new hybrid system. Ophiocordyceps unilateralis s.l. is a fungal parasite that creates 'zombie ants' of Camponotus castaneus, a carpenter ant. This fungus infects an ant, freely flowing through the circulatory system of the host.",
      "section": "Synthetic beings: Expanding through the space of possible bodies and minds",
      "topic": "Synthetic life forms and natural chimaerism",
      "chunk_summary": "Novel life forms arise from combining evolved and designed components, with natural chimaerism, such as the zombie ant phenomenon, offering insights into hybrid systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "After it expands throughout the organism, it takes over the body of the host ant. Under control of the fungus, the host ant navigates to a plant located near the semi-permanent food trails of the colony, climbs up to an optimal growth zone and bites onto the plant, allowing the fungal spores to disperse onto uninfected ants wandering the nearby trails. Most interestingly, the brain of the host ant is left entirely untouched. This poses the question of how a 'simple' fungus can manipulate the behaviour of the host ant in such a reproducible way. To achieve its goal of reproduction, the fungus must adapt to sensory signals from the environment; this involves processing the incoming signals to determine when it has come in contact with a suitable host and can thus begin targeted growth by navigating inside the host body.",
      "section": "Synthetic beings: Expanding through the space of possible bodies and minds",
      "topic": "Zombie ant phenomenon",
      "chunk_summary": "The fungus Ophiocordyceps unilateralis controls the behavior of its ant host without affecting the brain, raising questions about how it manipulates the host's sensory and motor systems.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Importantly, this process needs to be precise enough to take control of the host ant without altering the behaviour of the host too strongly, because ant colonies will reject infected members of the colony. However, as the fungus infects the host ant further, what incoming signals does the fungus receive and how does it process these signals now that it is in a body not its own? Is it cut off from the external world and does it 'see' only the inside of the ant, or does the fungus hijack the sensory system of the host, thus acquiring new ways to sense and act in the world? Although these are unanswered questions, studies demonstrate that large, complex fungal networks invade the muscle fibres in the host, potentially allowing for precise body-wide control without need for the brain-to-central nervous system axis. However, agent-based modelling shows that the fungus might hijack and repurpose the 'food searching' behavioural regimen of the ant into an algorithm to find sites for fungal dispersion. This would imply that O. unilateralis s.l. has developed a way evolutionarily to exhibit control of a dynamic system (the nervous system of the host ant) without needing to understand how the nervous system of its host functions. It is clear that there is much to be understood in chimaeric 'life as it is' studies, because researchers can study existing evolutionary accidents to reveal common relationships between brain, body and behaviour across species and systems.",
      "section": "Synthetic beings: Expanding through the space of possible bodies and minds",
      "topic": "Mechanism of fungal control in zombie ants",
      "chunk_summary": "The mechanism by which the fungus controls the ant's behavior remains unclear, with possibilities including direct muscle control or hijacking of the ant's sensory and motor programs.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "The field of artificial chimaeras has been realized most notably in brain-computer interfaces.  A remarkable study merges existing biological systems, here the motor cortex in a human subject, with technology to provide a way for a patient to communicate with the outside world even years after the onset of paralysis. They instructed a patient to “attempt” to write as if his hand were not paralyzed, while imagining that he was holding a pen on a piece of ruled paper', while recording neural activity from the precentral gyrus. Using a variety of methods, neural activity was decoded and associated with each letter, allowing a computer program to produce written sentences for the patient in real time at a speed much higher than other approaches. In many ways, this artificial chimaera works in the same way as the parasitic fungus; experimenters do not need to know how certain neural dynamics arise owing to imaginary handwriting, merely that these signals can be used to drive goal-directed behaviour.",
      "section": "Synthetic beings: Expanding through the space of possible bodies and minds",
      "topic": "Brain-computer interfaces",
      "chunk_summary": "Brain-computer interfaces demonstrate the potential of artificial chimaeras, allowing paralyzed patients to communicate by decoding neural activity associated with imagined handwriting.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "In addition, this particular patient was not paralysed at birth; writing had been learned before the paralysis, and the hypothesis is that this aided in the stability of the decoded neural dynamics. This is similar to the case of the zombie ants; the fungi were not necessarily creating new behaviours from scratch, but rather hijacking and repurposing existing behaviours. Another example of artificial chimaeras is the field of hybrots, which are hybrid robots that combine living biological components with robotic components. One example of a hybrot is the animat, which is a simulated robot controlled by a dissociated neural culture. In this study, the neural culture was placed on a multi-electrode array (MEA), and the activity of the neurons was recorded. The animat was then placed in a virtual maze, and the neural activity was used to control the movement of the animat through the maze. The researchers found that the neural culture could learn to control the movement of the animat through the maze, even though it had no prior experience with controlling a robot.",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Hybrots and animats",
      "chunk_summary": "Hybrots, such as the animat controlled by a neural culture, demonstrate the potential of combining living biological components with robotic components to create novel life forms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "This was achieved by associating unique spatiotemporal spiking patterns with directional movement. Feedback based on that directional movement and on the distance to obstacles in the maze was then returned to the culture. This was designed to mimic how neural systems have evolved to take input and interact meaningfully with the world, with the goal of allowing the culture to learn relationships between its own activity and incoming 'sensory stimuli'. This paradigm was later used to build MEART (multi-electrode array art), a hybrot that was built to create art through neural control of robotic arms attached to drawing utensils. This study focused on examining the stimulus (patterned training stimulus) that was applied to the neural culture, based on the present drawing and the desired 'goal drawing', a black square in the middle of the canvas. Here, they reported that although there were shifts in synaptic plasticity in the network, if the patterned training stimulus was not updated at regular intervals, the overall behaviour did not reflect any signs of learning. This closed-loop chimaeric approach allows for investigation of the plasticity with which evolved biological components learn to function with novel bodies and environments. It is not known how neural systems adapt their dynamics as new behaviours, whether goal directed or not, are learned, with hypotheses typically revolving around changes in synaptic weight. However, there are many ways in which underlying neuronal circuitry might change. Hybrots are poised to serve as a general-purpose platform for understanding the basic rules of engagement for neural systems, because they lack the evolutionary complexity of complete nervous systems that might confound interpretation, yet they still possess goal-directed capabilities.",
      "section": "Engineering novel bodies and novel minds",
      "topic": "MEART and neural plasticity",
      "chunk_summary": "MEART, a hybrot that creates art through neural control of robotic arms, demonstrates the plasticity of neural systems in adapting to novel bodies and environments, although the mechanisms of learning remain unclear.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "The many diverse viable combinations of evolved and engineered components reveal a rich medium in which to understand truly general principles of self-organization of structure and function in unexpected circumstances. The ability to make novel living beings is significant in several ways. It frees us from the contingencies and frozen accidents of the trajectory of evolution on Earth and shows us life as it can be, enabling us to expand our thinking and generalize to learn lessons of biology in its general form. It allows us to probe the intelligence of life at all levels by exploring the degree of goal-directed behaviour, competency and failure modes of living modules in highly diverse environments. However, novelty is not only about new external circumstances. Some of the most informative aspects of perturbation are changes of inner composition; changes to the parts of the living system itself that are enabled by chimaerism and bioengineering. The introduction of synthetic DNA constructs, nanomaterials and other components into living systems reveals how multicellular collectives handle rapid changes in the properties of their parts. Response to a wide variety of new challenges is the cornerstone of the study of the intelligence of any system, including that of evolution (generalizing adaptive behaviour beyond previously encountered challenges).",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Exploring the space of possible life forms",
      "chunk_summary": "Creating novel living beings allows us to explore general principles of self-organization, probe the intelligence of life, and understand how multicellular collectives respond to changes in their internal composition.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "A hallmark of chimaeric and bioengineered organisms is that they are functional; they operate in physiological and behavioural spaces and often exhibit the same robustness as evolved beings with respect to being able to reach specific states or behaviours despite perturbations. The study of this class of systems provides ways to uncover novel goal-directed activities that are masked by default developmental constraints and standard ecological scenarios. But most of all, the diversity of composition and provenance in this rich space of possible life forms requires us to look for a deep invariant: a parameter that can help us to recognize, compare and relate to intelligences in novel embodiments, when the familiar phylogenetic tree offers no convenient classification.",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Functionality and teleonomy in chimaeric organisms",
      "chunk_summary": "Chimaeric and bioengineered organisms exhibit functional behavior and robustness, prompting the search for a deep invariant to understand agency in diverse embodiments.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "One important promise of synthetic life forms concerns what they can tell us about the relationship of mind and body (i.e. cognition in novel media). Importantly, the ability to solve problems in various spaces, with diverse degrees of competency, is known to extend well beyond brains. The emerging field of basal cognition seeks to understand the roots of intelligence in ancient, pre-neural forms and unfamiliar guises. Recently, it has been argued that the origins of problem-solving in novel circumstances (behavioural intelligence) lie in ancient capacities that long pre-date central nervous system development. The implications of this view include the idea that the tools of neuroscience can be applied far beyond neurons, to understand how all types of cells join into collectives that work to achieve large-scale objectives. Importantly however, we must look beyond behaviour in three-dimensional space (movement) as the arena in which intelligence can be observed. Life solves problems in many different spaces, and chimaeric organisms help us to widen our criteria and begin to recognize intelligence in unexpected guises. The ability to rearrange neural structures in novel configurations also reminds us that as collections of neurons, beings with brains are, in an important sense, also collective intelligences.",
      "section": "Basal cognition and diverse intelligences: Teleonomy as a common thread",
      "topic": "Basal cognition and diverse intelligences",
      "chunk_summary": "Basal cognition explores intelligence in pre-neural forms, suggesting that problem-solving abilities predate the central nervous system and that neuroscience tools can be applied to understand cellular collectives.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Morphogenesis by cell groups is a natural example that is only now beginning to be understood as a collective intelligence problem and to be investigated using the same tools and conceptual paradigms as those used in neuroscience. For example, tadpoles with craniofacial organs placed in abnormal positions can become frogs with normal faces, because the components of the head will move around as needed to produce a correct face. This ability to find the right region of morphospace corresponding to a normal frog anatomy, despite components of that anatomy starting off in the wrong position, reveals an important fact visible in many examples of regulative development, regeneration and remodelling (such as those described in the Introduction). Evolution does not simply make hardwired machines that execute a predetermined set of steps (such as the default movements of tadpole eyes and jaws during metamorphosis). Instead, it produces hardware that can execute error minimization, traversing novel paths in morphological and transcriptional spaces to achieve their target morphologies.",
      "section": "Basal cognition and diverse intelligences: Teleonomy as a common thread",
      "topic": "Morphogenesis as collective intelligence",
      "chunk_summary": "Morphogenesis can be viewed as a collective intelligence problem, with cells exhibiting error minimization and navigating morphological spaces to achieve target anatomies.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Models of morphogenesis as collective intelligence are driving empirical work to understand what such systems measure, how they store set points for their homeostatic activity, how these set points arise and how they can be edited by biomedical approaches. They also suggest a research programme to understand how homeostatic loops scale and pivot across problem spaces during evolution. A focus on the actions of systems in arbitrary spaces, rather than on their anatomical or molecular-genetic composition, requires us to identify invariants that can serve as a parameter by which to organize and compare highly diverse types of agents in unfamiliar embodiments. We suggest that one important and interesting thing that all agents, no matter their composition or origin, have in common is goal-directed behaviour (at some level of competency).",
      "section": "Basal cognition and diverse intelligences: Teleonomy as a common thread",
      "topic": "Goal-directed behavior as an invariant",
      "chunk_summary": "Goal-directed behavior is proposed as a key invariant for comparing diverse agents, regardless of their composition or origin.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Goal-directed behaviour is, at the very least, uncontroversial in human animals. It is thought that this capacity is enabled by collectives of neurons (brains) exhibiting memory, error minimization capacity and second-order metacognition that enables us to think about those goals (and perhaps re-set them) in addition to executing them. However, brains evolved from much more ancient bioelectric networks that are formed by all cells in the body and are as old as bacterial biofilms. These networks readily form circuits with memory that enables basal homeostatic function. The remarkable capacity to exhibit both robustness and novelty in morphogenesis reveals the central role of the scaling of goals as an explanatory, facilitating concept for new basic research and biomedical applications. What is essential is to understand and tame the gradual changes in information processing that occur in the slow transition from egg cell to complex goal-driven cognitive agent with intrinsic purposiveness.",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Goal-directed behavior and bioelectric networks",
      "chunk_summary": "Goal-directed behavior, present in humans and rooted in ancient bioelectric networks, plays a central role in morphogenesis and offers potential for biomedical applications.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Cybernetic approaches are substrate independent and remind us that no specific materials (cytoplasm, neurons, etc.) are required for the key capacity of proto-cognitive systems (and perhaps all life): homeostatic and allostatic loops that expend energy to attain specific preferred states with respect to information, prediction error, metabolic conditions and anatomical configurations. This view emphasizes a central invariant that unifies all attempts to predict, control, recognize, create and relate to such systems: teleonomy (i.e. goal-directed behaviour that achieves specific observable states, by different means and with varying degrees of reliability and competency). This independence from implementation details, and a willingness to recognize navigation towards preferred states in any problem space, removes traditional but limiting opacities from the lens through which we view 'agents' that exhibit teleonomic behaviour; such self-imposed filters, like a type of mind-blindness, have restricted research, because our perceptual systems are tuned to recognize only familiar types of agency (i.e. that of medium-sized beings navigating three-dimensional space).",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Teleonomy as a unifying framework",
      "chunk_summary": "Teleonomy, or goal-directed behavior, is a unifying framework for understanding proto-cognitive systems and life, emphasizing the pursuit of preferred states regardless of material substrate.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    },
    {
      "text": "Teleonomy here is proposed as a conceptual tool to drive the creation and analysis of novel synthetic beings. Rather than (as is sometimes claimed) being a tool to distinguish living beings from 'mere machines', it provides a unifying framework to understand the whole multidimensional spectrum of possible agents. Cybernetics is an ideal framework for life as it can be. The dissolution of shallow, contingent boundaries between evolved and engineered systems was foreseen long ago in the title of Wiener's foundational work, 'Cybernetics, or control and communication in the animal and the machine'. It gives us a mature framework for understanding goal-directed behaviour without resort to mysterianism; dynamical systems and control theories offer rigorous formalisms for understanding causes of long-term behaviour as types of navigation policies in problem space. Attractors (regions of the state space not occupied by the system at a given moment) serve as empirically useful views of causes of system-level behaviour as it navigates the space, guided by its non-local topology. In keeping with the practical engineering focus of our approach, we eschew questions of teleology (philosophical wrangling over real, objective purpose or agency) and focus on goal-seeking and problem-solving behaviour that is apparent, or relative, to an observer (usually, scientists, but also to the system itself, in the case of sufficiently sophisticated agents). This approach has already been emphasized by key early figures in cybernetics: 'organization is partly in the eye of the beholder'. Thus, our ability to detect, understand and manage teleonomy says as much about our own intelligence as it does about the system being studied.",
      "section": "Engineering novel bodies and novel minds",
      "topic": "Cybernetics and teleonomy",
      "chunk_summary": "Cybernetics and teleonomy provide a framework for understanding goal-directed behavior across a spectrum of agents, from simple systems to complex organisms, emphasizing the observer's role in recognizing agency.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_220296.pdf",
      "original_filename": "pdf_20250803_124126_220296_extracted_text.txt",
      "authors": "[\"WESLEY P. CLAWSON\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Biological Journal of the Linnean Society",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:10:29.247833",
  "enriched_at": "2025-08-11T14:34:48.302912",
  "enrichment_methods": [
    "crossref_title"
  ]
}