{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_780458_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_780458.pdf",
    "file_size": 96376,
    "authors": [
      "Léo Pio-Lopez",
      "Johanna Bischof",
      "Jennifer V. LaPalme",
      "Michael Levin"
    ],
    "journal": "Interface Focus",
    "doi": "10.1098/rsfs.2022.0072",
    "year": "2022",
    "title": "The scaling of goals from cellular to anatomical homeostasis: an evolutionary simulation, experiment and analysis",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2023",
    "abstract": "<jats:p>Complex living agents consist of cells, which are themselves competent sub-agents navigating physiological and metabolic spaces. Behaviour science, evolutionary developmental biology and the field of machine intelligence all seek to understand the scaling of biological cognition: what enables individual cells to integrate their activities to result in the emergence of a novel, higher-level intelligence with large-scale goals and competencies that belong to it and not to its parts? Here, we report the results of simulations based on the TAME framework, which proposes that evolution pivoted the collective intelligence of cells during morphogenesis of the body into traditional behavioural intelligence by scaling up homeostatic competencies of cells in metabolic space. In this article, we created a minimal<jats:italic>in silico</jats:italic>system (two-dimensional neural cellular automata) and tested the hypothesis that evolutionary dynamics are sufficient for low-level setpoints of metabolic homeostasis in individual cells to scale up to tissue-level emergent behaviour. Our system showed the evolution of the much more complex setpoints of cell collectives (tissues) that solve a problem in morphospace: the organization of a body-wide positional information axis (the classic French flag problem in developmental biology). We found that these emergent morphogenetic agents exhibit a number of predicted features, including the use of stress propagation dynamics to achieve the target morphology as well as the ability to recover from perturbation (robustness) and long-term stability (even though neither of these was directly selected for). Moreover, we observed an unexpected behaviour of sudden remodelling long after the system stabilizes. We tested this prediction in a biological system—regenerating planaria—and observed a very similar phenomenon. We propose that this system is a first step towards a quantitative understanding of how evolution scales minimal goal-directed behaviour (homeostatic loops) into higher-level problem-solving agents in morphogenetic and other spaces.</jats:p>",
    "volume": "13",
    "issue": "3",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "All cognitive agents are composite beings, and complex living agents consist of cells, which are competent sub-agents. This paper explores the scaling of biological cognition, investigating how individual cells integrate their activities to create higher-level intelligence with novel goals.  Simulations based on the TAME framework are used, proposing that evolution scaled up cellular goal states during morphogenesis. The hypothesis tested was whether a minimal evolutionary framework allows small, low-level metabolic homeostasis setpoints in cells to scale into collectives (tissues) that solve a problem in morphospace: organizing a body-wide positional information axis (the French Flag problem).  The emergent morphogenetic agents exhibited predicted features like using stress propagation dynamics to achieve target morphology, robustness to perturbation, and long-term stability. Unexpected remodeling behavior was observed long after system stabilization, a phenomenon also seen in regenerating planaria. This system offers a step toward understanding how evolution scales minimal goal-directed behavior (homeostatic loops) into higher-level problem-solving agents.",
      "section": "Abstract",
      "topic": "Scaling of Biological Cognition",
      "chunk_summary": "Simulations demonstrate how cell-level metabolic homeostasis can scale up to tissue-level morphogenetic goals, exhibiting robustness and unexpected remodeling behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This paper addresses the question of how complex anatomical structures form reliably from individual cell activity, including the ability to regenerate despite injuries and other insults.  This raises the problem of understanding how cell competencies relate to tissue-level swarm behavior and the evolutionary dynamics enabling this.  The paper focuses on the origin of dynamics that allow cellular collectives to work towards large-scale anatomical target states too complex for individual cells to represent.  Frameworks motivated by cybernetics and behavior science suggest a deep symmetry among homeostatic behavior across scales.  The same mechanisms (ion channels, electrical synapses, bioelectrical networks) underlie problem-solving in physiological space by bacteria, navigation of morphospace by embryonic and regenerative systems, and classical behavior in organisms with neurons and brains.",
      "section": "Introduction",
      "topic": "Multi-scale Homeostasis and Morphogenesis",
      "chunk_summary": "The paper investigates how individual cell competencies scale up to tissue-level morphogenesis and regeneration, highlighting the role of homeostatic behavior across scales.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Traditional behavior science focuses on individual cognitive capacities, assuming a fixed body structure and stable brain structure. However, all intelligences are collective, composed of biological agents. Regenerative biology and biobots reveal that cognition in intact bodies is a narrow view of a larger picture: the multi-scale interface between body and mind. Cognition is linked to physical structure, from anatomical to molecular and bioelectric levels, and both structure and function are plastic.  Understanding how mind and body co-evolve is crucial for regenerative medicine and body/mind extension technologies.  This requires understanding the \"software\" or algorithms enabling cell decision-making and the transition to larger selves. The scale-free cognition framework uses control and information theory to identify multi-scale information processing principles.  Earlier studies showed collectives outperforming individuals, with performance depending on organizational structure, information aggregation, and member diversity.  This paper focuses on morphogenetic systems, porting neuroscience tools to developmental biology for novel capabilities in regeneration, cancer reprogramming, and birth defect repair.  Quantitative, generative models are needed to understand the scaling of competencies and generalization to new problem spaces.",
      "section": "Introduction",
      "topic": "Scale-Free Cognition and Collective Intelligence",
      "chunk_summary": "Cognition is a multi-scale, plastic phenomenon, and understanding its scaling requires studying the collective intelligence of cells and their information processing principles.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The model assumes cells have the competency for homeostatic pursuit of metabolic resources, a minimal requirement for life.  Two scales are modeled: a developmental phase with cell interactions and an evolutionary wrapper changing cell behavior policies based on collective fitness (how well the \"embryo\" matches a 3-valued positional information axis).  \"Goal\" is used in the cybernetic sense of systems expending effort to reduce error from a homeostatic setpoint. The aim is to show how goals scale and arise in new problem spaces under evolutionary selection, given minimal assumptions about component properties.  While not explicitly invoking bioelectric signaling, the cell interaction model is compatible with it, providing cells with gap junctions for sharing state signals and a mechanism for stress signal propagation.",
      "section": "Methods",
      "topic": "Model Foundations",
      "chunk_summary": "The model simulates the evolution of cell collectives, focusing on the scaling of homeostatic goals from metabolic needs to morphogenetic patterning.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This work relates to amorphous computing and previous French flag problem models.  Key differences include the irregular structure of amorphous computing systems versus the regular cell networks used here.  Previous models used linear iterative arrays, reaction-diffusion, computational primitives, and genetic programming. Miller evolved a development program with a predefined grammar and a feed-forward Boolean circuit for cell programs. Chavoya and Duthen used Genetic Algorithms to evolve Cellular Automata for 2D and 3D shapes and an Artificial Regulatory Network for cell pattern generation. Elmenreich and Mordvintsev combined neural networks and cellular automata under evolutionary control.  A key difference in this work is the artificial neural network (ANN) inside each cell modeling a gene-regulatory network, controlling gap junctions for morphogen delivery and stress reduction.",
      "section": "Methods",
      "topic": "Related Work in Silico Embryogeny",
      "chunk_summary": "This model differs from previous in silico embryogeny work by using ANNs within cells to control gap junctions and stress reduction, modeling gene-regulatory networks.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The evolutionary simulation involves cells forming a tissue on a 2D grid.  Two time-scale loops are used: an evolutionary loop with genome mutation and agent selection, and an ontogenetic loop constructing agents from genomes, simulating development, and testing phenotype fitness. Each cell has a genome encoding metabolic processes and interacts with other cells. A homeostatic loop optimizes chemical levels. Cells attach via gap junctions, send signals, and spread metabolites. Signal properties (speed, gap junction propagation, gating) are genetically encoded. Cells have minimal memory, accessing stress, energy, and states at t and t-1.  The approach relates to cellular neural networks and growing neural cellular automata, but cell number is fixed, and the tissue has borders. Each cell's ANN controls gap junction opening in 4 directions.  The ANN represents gene-regulatory networks and pathways.  One molecule type goes through gap junctions, triggering genomic expression leading to three cell states (blue, white, red) based on molecule levels.  An energy cost is imposed on state change.  Cells have stress and anti-stress molecules for sending to neighbors.",
      "section": "Methods",
      "topic": "Evolutionary Simulation Design",
      "chunk_summary": "The simulation uses a two-loop system (evolutionary and ontogenetic) with cells on a 2D grid, interacting via gap junctions and a stress system, aiming to solve the French Flag problem.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The learning task is the French Flag problem, where a spatial gradient (molecule amount) determines cell state.  Single-cell and anatomical homeostatic loops are tied. Each cell's goal is survival, achieved by being in the appropriate state for energy reward, which is proportional to how well its sub-collective (stripe) approaches the French Flag pattern.  This creates reward uncertainty, as the reward depends on collective behavior.  The environment has high uncertainty.  This is a multi-agent reinforcement learning problem under reward uncertainty. Goal-directed systems use selective attention or interference suppression.  Here, the top-down biasing mechanism is the energy reward tying the two homeostatic levels. Energy costs are imposed for communication and state changes. The stress system involves external/internal stimuli, emergency responses, and pathological consequences of over-stimulation.  A communication system diffuses a stress molecule, increasing stress in the stressed cell and neighbors.  The ANN can also send a stress-reduction molecule.  Evolution can choose to use this system.",
      "section": "Methods",
      "topic": "Learning Task and Homeostasis",
      "chunk_summary": "Cells aim to survive by achieving the correct state within the French Flag pattern, facing reward uncertainty due to collective dependence, and utilizing a stress communication system.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The evolutionary algorithm uses ES-HyperNEAT. The fitness function is the percentage of correct cell states in the tissue. The system is coded in Python using Mesa and MultiNEAT.  Parameters include 250 generations, 350 individuals, division and variance thresholds of 0.03, energy costs for state change (0.25) and per step (0.8), minimum/maximum species (5/15), stagnation generations (10), neural net depth (4 hidden layers), quadtree depth (3), CPPN activation functions (sigmoid, Gaussian, linear, sine, step), band-pruning threshold (0.3), CPPN bias (-1), initial energy (70), communication cost (0.8). Information-theoretic analysis uses active information storage (AIS) and transfer entropy (TE). AIS is the stored information used for computing the next state. TE is the information from the source about the destination's next state not contained in the destination's past. Local AIS and TE are computed. TE is calculated from stress to neighbor states, energy to cell state, and cell state to energy. TE from one stripe to another is the sum of all pairwise TEs between cells of different stripes.",
      "section": "Methods",
      "topic": "Evolutionary Algorithm and Information Analysis",
      "chunk_summary": "ES-HyperNEAT is used with a fitness function based on correct cell states. Information-theoretic analysis employs AIS and TE to understand information flow within the tissue.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Planaria experiments involved colony maintenance, animal manipulation (cutting, pharmacological treatments), and scoring of repatterned phenotypes.  Dugesia japonica were maintained, fed, and cleaned. Cutting was performed on a cooling plate. Headless animals were created by cutting pre-tail fragments. Tail regeneration was tracked by cutting between head and tail. A/P axis regeneration was tracked by decapitation, cutting below the head, or at the pharynx. Puncture wounds were created posterior to the pharynx. Pharmacological treatments used U0126 (ERK/MAP Kinase inhibitor) on pre-tail fragments for 3 days, scoring phenotypes at 14 days. Repatterning was defined as morphology change after 4 weeks. Head regeneration, fissioning, and ectopic tissue development were noted. Polarity flip was scored when a headless worm fissioned with head regeneration at the posterior. D/V repatterning was scored for dorsal outgrowths. Lateral growth was scored for significant lateral morphology changes without head formation.",
      "section": "Methods",
      "topic": "Planaria Experiment Methods",
      "chunk_summary": "Planaria experiments involved controlled cutting, pharmacological treatments with U0126, and observation of repatterning phenotypes over time.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The tissue successfully solved the French Flag problem, organizing into a 1D positional information axis. Cells received energy based on their location and the accuracy of their stripe's pattern.  Initially, all cells were blue. Future grey and red stripes became stressed, particularly the red stripe. Gap junctions were open, with upper/right fully open and lower/left half open.  Molecule flow was weighted equally in horizontal and vertical axes. Diffusion from left to right occurred due to blue stripe cells acting as a reservoir. Stress increased at 55 steps, then decreased as the pattern resolved. At 90 steps, the tissue reached 95.1% accuracy, with 4 mislocated blue cells.  This was consistent over 20 runs (94.4% ± 0.84). The tissue learned error minimization to reach the target morphology for survival, demonstrating how cell behaviors enable collectives to harness metabolic homeostasis for global patterning goals.",
      "section": "Results",
      "topic": "French Flag Problem Solution",
      "chunk_summary": "The simulated tissue successfully solved the French Flag problem through cell communication and stress dynamics, demonstrating error minimization for survival.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The tissue demonstrated robustness to perturbation. At 110 steps, the last two columns of the red stripe were changed to grey.  The tissue corrected this in 10 steps, with some blue cells appearing in the grey stripe. Stress increased and decreased with the perturbation and its resolution.  At 200 steps, the tissue reached 95.1% accuracy. Gap junction dynamics remained consistent.  Although only rewarded for self-organization, the cells acquired a homeostatic ability to reach the target morphology from multiple starting configurations, similar to biological systems.",
      "section": "Results",
      "topic": "Robustness to Perturbation",
      "chunk_summary": "The tissue exhibited robustness by correcting induced perturbations and returning to the target morphology, demonstrating homeostatic capabilities.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The tissue maintained allostasis in long-term simulations (1000 steps), preserving morphology and even improving accuracy to 96.3% in one simulation.  Spontaneous stress increases occurred due to intrinsic dynamics, not external perturbation. The first stress increase (before 90 steps) was for initial patterning; subsequent increases (285, 322, 395, 896 steps) corrected deviations from the target. Stress reduced to 0 after homeostasis.  Average accuracy over 20 runs was 87.7% ± 13.  Despite evolving only for initial development (100 steps), the tissue maintained itself for much longer, demonstrating emergent allostasis.  The tissue remodeled to remove mislocated blue cells, sometimes deviating from the target enough to trigger corrective homeostasis.  Long-term survival doesn't require direct selection; intrinsic dynamics and regenerative capacity suffice. Homeostasis is not a static state but a dynamic process.",
      "section": "Results",
      "topic": "Long-Term Allostasis",
      "chunk_summary": "The tissue demonstrated long-term survival and allostasis, correcting deviations from the target morphology through spontaneous stress responses and remodeling, even without direct selection pressure.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Stress dynamics were consistent with the idea that homeostatic loops are driven by stress reflecting deviation from setpoint.  To determine if stress was instructive or a byproduct, a loss-of-function experiment simulated anxiolytic drug action, reducing stress to 0. Gap junction dynamics were similar, but at 90 steps, accuracy was only 82.8%, and the red stripe cells died at 99 steps.  Over 20 runs, accuracy was 67.3% ± 2.8.  Anatomical homeostasis was not achieved or maintained without stress.  With stress, accuracy reached 95.1% at 90 steps and was maintained.  Stress is thus instructive for morphogenesis and survival.",
      "section": "Results",
      "topic": "Stress as an Instructive Signal",
      "chunk_summary": "Loss-of-function experiments demonstrated that stress is instructive for morphogenesis and survival, as its absence prevented the tissue from achieving and maintaining the target morphology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "To test if stress has an optimal level, high stress was induced in the grey stripe at 110 steps, simulating a non-informative environmental stressor. Stress decreased without changing cell states. At 140 steps, blue cells appeared in the grey stripe. Stress was instructive only at specific levels; excess stress had no effect and continued decreasing.  Stress transformed border cells into molecule reservoirs, turning them blue. Evolution made stress instructive only at specific levels.",
      "section": "Results",
      "topic": "Stress Level and Instructiveness",
      "chunk_summary": "Experiments with artificially high stress levels showed that stress is instructive only within a specific range, with excess stress having no effect on morphogenesis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Evolution found multiple solutions to the French Flag problem. In 10 evolutions with >90% fitness, 93% ± 2.6 accuracy was achieved, and 91.5% ± 8 with anxiolytics. 70% of tissues used the stress system, but it wasn't always functional.  For some, stress absence was lethal; for others, it had no impact. 1/10 of tissues used stress instructively and died under anxiolytics.  3/10 performed better with anxiolytics, indicating stress as noise.  To test stress's adaptive role, the 10 tissues were tested with a changing target morphology (at 60 steps) and grey cell regeneration.  The stress-using tissue achieved 89.2% ± 4.5 accuracy, while others achieved 73% ± 18.6 (statistically significant difference, p=0.0312). Stress enables adaptive responses in challenging environments.  Stress is not always necessary for the French Flag problem, but it enhances adaptive fitness in scenarios with external perturbations. Stress represents error in homeostatic contexts, driving \"grow and remodel until complete\" in regeneration.",
      "section": "Results",
      "topic": "Stress and Adaptability",
      "chunk_summary": "While not always essential, the stress system enhances adaptability by improving performance in changing environments and enabling \"grow and remodel until complete\" dynamics.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Information-theoretic analysis revealed information flow dynamics during anatomical homeostasis.  Transfer entropy (TE) from stress to neighbor states increased at step 55, peaking at 59 in grey/red stripes (300 bits). TE then decreased to 0. Negative TE indicated misleading information. TE from stress to own state was less significant than to neighbors (paracrine, not autocrine signaling). Local active information storage (AIS) on cell states showed different dynamics.  Negative AIS occurred in grey/red stripes when TE increased. AIS increased gradually for grey after reaching a steady state.  For red, AIS decreased, then increased around 70 steps as stress decreased. Blue stripe AIS remained 0. Stress increased with decreasing AIS (past memory ineffective for prediction), consistent with stressors as unpredictable stimuli.  Averaged TE from red to grey peaked at 250 bits before 60 steps, then reversed (450 bits from grey to red), suggesting alternating \"organizer\" regions.  TE from energy to state peaked around 55 steps, then overlapped with TE from state to energy as average stripe energy increased/stopped decreasing.  Anatomical homeostasis drove information flow, controlling energy for single-cell survival.",
      "section": "Results",
      "topic": "Information-Theoretic Analysis",
      "chunk_summary": "Information analysis revealed stress as a paracrine signal, increasing with decreasing AIS, and alternating \"organizer\" regions driving morphogenesis, with anatomical homeostasis controlling energy flow.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Planaria experiments showed sudden remodeling after long periods of stable pattern, mirroring the simulation.  Headless planaria (ERK/MAP Kinase inhibition) were monitored for 18 weeks. 22% showed sudden repatterning after 4 weeks, without intervention.  78% showed no change except shrinking. Repatterning occurred mostly between 4 and 10 weeks, with some as late as 18 weeks. Repatterning types included single-headed (61%), polarity reversal (18%), D/V outgrowths (10%), and lateral outgrowths (11%).  Head repatterning involved anterior end lightening, flattening, and blastema formation. Eyespots appeared, followed by head reshaping. Brain repatterning involved neural tissue clustering at the anterior ventral nerve cord, followed by progressive brain structure formation, slower than normal regeneration (up to 25 days).",
      "section": "Results",
      "topic": "Planaria Repatterning",
      "chunk_summary": "Planaria experiments confirmed the simulation's prediction of sudden remodeling, with headless planaria spontaneously repatterning their heads and brains after weeks of stable abnormal morphology.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study addresses the scaling of single-cell capacities to solve problems in morphogenetic space, such as axial polarity.  Intelligence is defined as competency in navigating problem spaces, and understanding how evolutionary forces and generic dynamics scale collectives and pivot their homeostatic properties into more complex capabilities is crucial. The simulation showed how cell-level metabolic goals scale to embryo-wide axial positional information, illustrating multi-scale homeostasis.  Evolution used the shared stress system for spatiotemporal coordination, developing error minimization and homeostatic capacities (robustness).  The tissue was robust to perturbation, using stress instructively for morphogenesis and long-term survival.  While maintaining allostasis, the tissue also removed mislocated cells, demonstrating \"delayed gratification\" for better solutions.  These capabilities emerged without direct selection pressure.  The study reveals functional connections between single-cell and anatomical homeostatic loops.  Each cell aims for survival by achieving the appropriate state for energy, navigating a discretized metabolic space.  The collective aims for the French Flag pattern, navigating a larger morphospace.",
      "section": "Discussion",
      "topic": "Scaling of Goals and Multi-scale Homeostasis",
      "chunk_summary": "The study demonstrates how evolution scales cell-level goals to tissue-level morphogenesis, highlighting the emergence of robustness, allostasis, and \"delayed gratification\" without direct selection.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Planarian repatterning after maintaining a stable abnormal morphology raises questions about how abnormal states are maintained and then corrected.  The spontaneous repatterning without injury suggests a missing tissue response isn't necessary for regeneration and that internal dynamics can initiate change long after apparent stability. Slower repatterning compared to normal regeneration supports this.  The stochastic repatterning time raises the question of what acts as a \"clock\" for remodeling.  Chou et al. found a similar dynamic in bacterial biofilms, with nitrogen stress forming concentric rings, revealing spatial stress responses in social microbes.  Biofilm development is driven by oscillatory processes amplifying stress responses, leading to spore differentiation even in nutrient-rich environments.  The simulation showed similar oscillatory stress responses driving cell differentiation into stripes, analogous to somitogenesis.  Conserved dynamics may be relevant across bacteria, metazoans, and in silico models.",
      "section": "Discussion",
      "topic": "Planarian Repatterning and Bacterial Biofilms",
      "chunk_summary": "Planarian repatterning and bacterial biofilm dynamics suggest conserved mechanisms involving stress responses and oscillatory processes for spatial patterning and differentiation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Communication is crucial for collective intelligence. In the simulation, gap junctions mediated communication, exchanging morphogen, stress, and \"anxiolytic\" molecules. Stress plays a key role, encompassing stimuli, responses, and chronic over-stimulation.  Defining stress is complex, with one approach defining stressors as homeostasis disruptors. A more general definition is unpredictable/uncontrollable stimuli, fitting the simulation's stress system, which increased with decreasing AIS, indicating ineffective past memory for prediction. This relates to active inference and the free-energy principle, integrating homeostasis and allostasis in morphogenetic systems. Network structure is key to collective intelligence. Flat, fully-connected networks are efficient but costly.  Cell networks are typically locally connected. The stress system could act as another communication system, changing network structure to facilitate information aggregation.",
      "section": "Discussion",
      "topic": "Stress, Communication, and Network Structure",
      "chunk_summary": "The stress system acts as a communication system, potentially altering network structure to enhance information flow, and its activation correlates with unpredictable stimuli and decreased predictive capacity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The simulation aims to inform robotics and machine learning by demonstrating dynamics for emergent properties across scales.  The collective intelligence aspect is underemphasized in AI, but recent attempts integrate it into swarm robotics and deep learning (adversarial networks). Artificial collective intelligence is studied in swarm intelligence and human society, but morphogenetic systems offer unique characteristics: grid network architecture, informational wiping, and local communication similar to cellular automata.  The study's relevance to basal cognition is also considered. Body patterning and behavioral control may share a common origin, not only through ion channels and neurotransmitters but also through the evolutionary pivot from physiological to morphogenetic and behavioral spaces.  Somatic tissues exhibit learning and basal cognition (cardiac, bone, pancreatic), and unicellular organisms show learning and decision-making. These capacities are ancient, and higher cognition's molecular apparatus was present in unicellular ancestors. Brains evolved from other cell types, and somatic cells scaled their cognitive abilities for larger anatomical goals. The symmetry between development/regeneration and cognition is not hardwired but emerges from a plastic, context-dependent system achieving invariant outcomes under uncertainty.",
      "section": "Discussion",
      "topic": "Implications for AI and Basal Cognition",
      "chunk_summary": "The study's findings on multi-scale homeostasis and stress dynamics have implications for AI and basal cognition, suggesting a shared evolutionary origin for body patterning and behavioral control.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_780458.pdf",
      "original_filename": "pdf_20250803_124126_780458_extracted_text.txt",
      "authors": "[\"Leto Pio-Lopez\", \"Johanna Bischof\", \"Tuka V. LaPalme\", \"Michael Levin\"]",
      "year": "2022",
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T11:50:07.620848",
  "enriched_at": "2025-08-11T14:38:02.946089",
  "enrichment_methods": [
    "crossref_title"
  ]
}