{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_232616_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_232616.pdf",
    "file_size": 27361,
    "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
    "journal": "Developmental Neuroscience",
    "doi": "10.1159/000088451",
    "year": "2005",
    "title": "Serotonin Transporter Function Is an Early Step in Left-Right Patterning in Chick and Frog Embryos",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "The neurotransmitter serotonin regulates embryonic patterning events in addition to its role in the nervous system. This study examines the role of two serotonin transporters, SERT and VMAT, in embryonic left-right asymmetry. Pharmacological or genetic inhibitors of either SERT or VMAT randomized the laterality of the heart and viscera in Xenopus embryos. This effect occurs during cleavage stages and is upstream of the left-sided gene XNR-1. Targeted microinjection of an SERT-dominant negative construct confirmed the necessity of SERT function in embryonic laterality and revealed that the right ventral blastomere descendants are most dependent on SERT signaling. The importance of SERT and VMAT in laterality is conserved in chick embryos, being upstream of the early left-sided gene Shh. Endogenous transcripts of SERT and VMAT are expressed from the initiation of the primitive streak in chick and are asymmetrically expressed in Hensen's node.",
      "section": "Abstract",
      "topic": "Serotonin transporter function in left-right patterning",
      "chunk_summary": "SERT and VMAT, serotonin transporters, play a crucial role in establishing left-right asymmetry in chick and frog embryos during early development, acting upstream of XNR-1 and Shh.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Serotonin regulates psychodynamic function and is linked to various medical conditions. It plays a crucial role in controlling neuronal activity and is implicated in cognition and syndromes like memory impairment, sleep disorders, schizophrenia, aggression, depression, and other mood disorders. Serotonin also controls morphogenesis during early embryonic stages before the appearance of neurons. It is widely distributed in both animal and plant kingdoms and occurs in mammalian and other vertebrate and invertebrate embryos. Serotonin is synthesized by embryonic stem cells and plays a role in egg maturation, vascular remodeling, neural crest migration, cell division rates, cytoskeletal patterning, blastomere adhesion, gastrulation movements, gap-junctional communication, craniofacial patterning, and neuronal specification. Links between 5-HT pathway pharmaceuticals and birth defects suggest these roles may exist in human embryos, making it crucial to understand serotonin's mechanisms in development.",
      "section": "Introduction",
      "topic": "Serotonin's role in embryonic development",
      "chunk_summary": "Serotonin plays a crucial role not only in neuronal activity but also in various developmental processes during early embryogenesis, with potential implications for human birth defects.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Understanding serotonin's nonneuronal functions is crucial in evolutionary developmental biology. The serotonin pathway includes enzymes synthesizing 5-HT from tryptophan, membrane receptors transducing the serotonin signal, and a system for 5-HT degradation. Two important families of serotonin transporters are VMAT and SERT. Free 5-HT is catabolized by MAO, so it is transported into vesicles by VMAT to avoid degradation. VMAT uses proton gradients to drive transport, exchanging two protons for one monoamine. Vesicles release 5-HT through exocytosis, making it available to receptors on neighboring cells. SERT uses the Na+ gradient to remove the transmitter from synapses. SERT is a crucial regulator of nervous system activity and a target for pharmaceuticals like Prozac. SERT function is also implicated in embryonic morphogenesis and cell proliferation.",
      "section": "Introduction",
      "topic": "Serotonin transporters (SERT and VMAT)",
      "chunk_summary": "Serotonin transporters, VMAT and SERT, play essential roles in regulating serotonin levels and signaling, with SERT also implicated in embryonic development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Invariant left-right (LR) asymmetry is a key feature of vertebrate morphogenesis with implications for biomedicine and birth defects. While the middle phase of LR patterning is understood, upstream events and their conservation present open questions. Serotonergic signaling through receptor subtypes 3 and 4 at early stages is a crucial component of the LR pathway in chick and frog embryos. This study investigates the roles of 5-HT transport in determining consistent laterality, showing that SERT and VMAT are involved in LR patterning at early stages in two vertebrate species, identifying novel roles for serotonin transporters, and suggesting a possible teratological endpoint for SERT modulators during pregnancy.",
      "section": "Introduction",
      "topic": "Left-right asymmetry and serotonin transport",
      "chunk_summary": "This study investigates the role of serotonin transporters SERT and VMAT in left-right asymmetry patterning during early vertebrate development, building on previous work on serotonergic signaling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Chick SERT and VMAT were cloned using RNA isolated from chicken embryos. Degenerate primers and PCR amplification were used to obtain candidate fragments, which were then cloned and sequenced. Specific primers were designed based on the complete cDNA sequences, and highly conserved stretches were amplified for in situ hybridization. The chick SERT sequence matched the previously cloned GenBank sequence AY573844, and the chick VMAT2 sequence was submitted to GenBank under accession number AY974771.",
      "section": "Materials and Methods",
      "topic": "Cloning of chick SERT and VMAT",
      "chunk_summary": "Chick SERT and VMAT were cloned using standard molecular biology techniques, and their sequences were confirmed and deposited in GenBank.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Xenopus embryos were exposed to various SERT blockers (nisoxetine, fluoxetine, alaproclate, citalopram, imipramine) and VMAT inhibitors (reserpine, TBZOH) at specific concentrations. Embryos developed in the drug-containing medium until stage 16, then washed and allowed to develop further until stage 45.  Embryonic situs was determined by scoring the position of the stomach, gallbladder, and heart atrium. Embryos with normal dorsoanterior development and clearly sided organs were scored. Heterotaxia was defined as the reversal of one or more of the three organs. Statistical analysis was performed using the chi-squared test with Pearson correction.",
      "section": "Materials and Methods",
      "topic": "Xenopus drug exposure and situs scoring",
      "chunk_summary": "Xenopus embryos were exposed to SERT and VMAT inhibitors, and the resulting laterality defects were assessed by scoring organ situs.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Chick embryos were exposed to pharmacological reagents (fluoxetine, reserpine) in ovo. A hole was made in the egg, albumin was removed, and replaced with the experimental solution. Eggs were incubated until the desired stages and then fixed for in situ hybridization analysis of laterality markers. In situ hybridization was performed on chick and frog embryos using probes for cShh, cNodal, XNodal. Embryos were fixed, and histological sections were obtained after in situ hybridization. For Xenopus blastomere injection, synthetic mRNA encoding the SERT D98G mutant, RLD, and β-galactosidase were injected into specific blastomeres.",
      "section": "Materials and Methods",
      "topic": "Chick drug exposure and in situ hybridization",
      "chunk_summary": "Chick embryos were exposed to drugs in ovo, and in situ hybridization was used to analyze gene expression related to left-right asymmetry in both chick and frog embryos.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Specific inhibitors of SERT and VMAT were used to determine the role of SERT function in laterality. Xenopus embryos were exposed to SERT blockers (fluoxetine, imipramine, citalopram, alaproclate) or VMAT inhibitors (reserpine, TBZOH) from fertilization to stage 16. Embryos were then washed, allowed to develop to stage 45, and analyzed for the situs of the heart, gut, and gallbladder. The incidence of reversal of one or more organs from their normal situs was scored. The maximum possible incidence of laterality phenotypes is 87.5% because in fully randomized organs, 12.5% will have wild-type positions by chance. The observed phenotype was heterotaxia, with independent randomization of organ positions. No general toxicity or changes in dorsoanterior character were observed. Control embryos and those exposed to nisoxetine exhibited normal laterality. Embryos exposed to SERT or VMAT blockers showed a significant level of heterotaxia (24% for SERT blockers, 28% for VMAT blockers).",
      "section": "Results",
      "topic": "Heterotaxia induced by SERT and VMAT inhibitors in Xenopus",
      "chunk_summary": "Inhibiting SERT or VMAT in Xenopus embryos resulted in a significant incidence of heterotaxia, indicating their role in left-right asymmetry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "To determine the timing of SERT and VMAT function in LR patterning, Xenopus embryos were exposed to specific blockers at different developmental stages. Exposure during cleavage stages resulted in the most effective randomization (20% for VMAT inhibitor, 27% for SERT inhibitor), while later exposures had insignificant effects. This suggests SERT and VMAT function in early LR patterning steps between fertilization and stage 7.  Analysis of XNR-1 expression in embryos exposed to SERT and VMAT blockers showed bilateral expression in 26% and 28% of embryos, respectively, indicating that SERT and VMAT function upstream of the asymmetric gene cascade in Xenopus.",
      "section": "Results",
      "topic": "Timing of SERT and VMAT function in Xenopus",
      "chunk_summary": "SERT and VMAT function during early cleavage stages in Xenopus LR patterning, upstream of the asymmetric gene cascade initiated by XNR-1.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "A dominant negative SERT mutant (D98G) was used to confirm SERT's involvement in Xenopus embryogenesis. Microinjection of D98G mRNA into each blastomere at the 4-cell stage induced 18% randomization of organs when injected into the right ventral cell. Injecting into other cells had lesser effects: 9% heterotaxia in the right dorsal cell and 6-7% in the left dorsal and ventral cells. This confirms SERT's importance in early embryogenesis and suggests the right ventral blastomere descendants are the major locus of SERT function in the LR pathway.",
      "section": "Results",
      "topic": "SERT dominant negative effect in Xenopus",
      "chunk_summary": "A dominant negative SERT mutant confirmed SERT's role in Xenopus LR patterning, with the right ventral blastomere being the most sensitive to SERT disruption.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Chick SERT and VMAT were cloned and their expression examined during gastrulation. cVMAT expression began at primitive streak initiation and continued throughout elongation, localized in mesodermal cells and laterally to the streak. At stages 4-5, expression was in primitive ridges and notochord cells, with stronger expression on the right side of Hensen's node. cSERT showed a similar profile, expressed strongly at the primitive streak base and throughout early elongation. Unlike VMAT, SERT expression was punctate in ectoderm and mesoderm. At stages 4-5, Hensen's node expressed SERT more strongly on the right side, and at stage 7+, neural folds expressed SERT, with pronounced right-sided asymmetry in Hensen's node. These data suggest SERT and VMAT are involved in early LR patterning in chick and identify a novel right-sided asymmetric marker.",
      "section": "Results",
      "topic": "SERT and VMAT expression in chick embryos",
      "chunk_summary": "SERT and VMAT are expressed in chick embryos during gastrulation, showing asymmetric expression in Hensen's node, suggesting their involvement in LR patterning.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "Chick embryos exposed to fluoxetine and reserpine between incubation start and stage 4+ showed randomized expression of Shh and Nodal. Incorrect Shh sidedness was 36% and 38% for SERT and VMAT inhibition, respectively. This supports the necessity of SERT and VMAT function upstream of consistent left-sided Shh expression, suggesting they function between stages 1 and 4.",
      "section": "Results",
      "topic": "SERT and VMAT inhibition in chick embryos",
      "chunk_summary": "Inhibiting SERT or VMAT in chick embryos randomized Shh and Nodal expression, placing their function upstream of Shh in the LR pathway.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "The serotonin system, with its machinery for production, degradation, and sensing, is a candidate for a morphogen-like signal. The serotonergic synapse may have evolved from primitive signaling between embryonic blastomeres.  Previous work demonstrated that serotonin exists in chick and frog embryos before neurons appear, and 5-HT signaling through R3 and R4 receptors is crucial for LR axis patterning. However, the role of serotonin transporters was not previously tested.  Since SERT and VMAT control serotonin availability for intracellular signaling and its extracellular concentration, understanding 5-HT signaling in patterning requires considering transport.",
      "section": "Discussion",
      "topic": "Serotonin as a morphogen",
      "chunk_summary": "The serotonin system, including its transporters, is a potential morphogen-like signal crucial for LR patterning, extending previous findings on serotonin signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "This study demonstrates that SERT and VMAT function is required for LR patterning in two vertebrate species.  The timing of transporter activity is consistent with a role upstream of the known asymmetric gene cascade.  The right ventral blastomere in Xenopus is particularly sensitive to SERT disruption, suggesting a possible locus of early asymmetry.  The asymmetric expression of SERT and VMAT in Hensen's node in chick further supports their role in LR patterning.  These findings identify a new, early component of the LR pathway and suggest a new biological role for serotonin transport.",
      "section": "Discussion",
      "topic": "Role of SERT and VMAT in LR patterning",
      "chunk_summary": "SERT and VMAT are essential for LR patterning, acting upstream of the asymmetric gene cascade, with asymmetric localization in chick and specific blastomere sensitivity in Xenopus.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "The results suggest that serotonin may act as a morphogen in LR patterning.  The early action of transporters and receptors suggests a model where serotonin signaling establishes an initial bias, which is then amplified by downstream genetic cascades.  Further research is needed to determine the precise mechanisms by which serotonin transport influences asymmetry, including the specific cell types involved and the downstream targets of serotonin signaling.  The findings also have implications for understanding the potential teratological effects of SERT-modulating drugs during pregnancy.",
      "section": "Discussion",
      "topic": "Serotonin as a morphogen and future directions",
      "chunk_summary": "Serotonin, regulated by its transporters, may act as a morphogen in LR patterning, initiating an asymmetry later amplified by genetic cascades, with further research needed to elucidate the precise mechanisms and potential teratological effects.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "We thank Dr. Randy Blakely for the SERT D98G construct. This work was supported by the G. Harold and Leila Y. Mathers Charitable Foundation. M.L. is the Vannevar Bush Fellow at Tufts University.",
      "section": "Acknowledgements",
      "topic": "Funding and acknowledgements",
      "chunk_summary": "The authors acknowledge Dr. Randy Blakely and the G. Harold and Leila Y. Mathers Charitable Foundation for their support.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    },
    {
      "text": "This section contains a list of references cited throughout the paper, providing details of the publications mentioned in the study.  The references include a range of sources relevant to serotonin, embryonic development, left-right asymmetry, and related topics.  This list allows readers to access the original research and further explore the background and context of the study's findings.",
      "section": "References",
      "topic": "Citations",
      "chunk_summary": "The references section lists the publications cited in the study, providing sources for further reading on related topics.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_232616.pdf",
      "original_filename": "pdf_20250803_124125_232616_extracted_text.txt",
      "authors": "[\"Takahiro Fukumoto\", \"Randy Blakely\", \"Michael Levin\"]",
      "year": "2005",
      "journal": "Developmental Neuroscience",
      "doi": "10.1159/000088451"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:39:37.442748",
  "enriched_at": "2025-08-11T14:28:48.226146",
  "enrichment_methods": [
    "crossref"
  ]
}