{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_406283_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_406283.pdf",
    "file_size": 37206,
    "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
    "journal": "Int J Dev Biol",
    "doi": "10.1387/ijdb.140207ml",
    "year": "2023",
    "title": "Optogenetics in Developmental Biology: using light to control flux-dependent signals in Xenopus embryos",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Developmental bioelectricity, involving electrical signaling among non-excitable cells, regulates crucial processes like proliferation, apoptosis, gene expression, and patterning during development. Optogenetics, with its high temporal and spatial resolution, holds immense potential for advancing the study of bioelectricity, similar to its impact on neuroscience. This study aims to address the lack of guidance on adapting optogenetic techniques to patterning systems.",
      "section": "Abstract",
      "topic": "Optogenetics in developmental bioelectricity",
      "chunk_summary": "Optogenetics offers a powerful approach to studying developmental bioelectricity, but its application to patterning systems requires specific adaptations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "This study utilized optogenetic reagents, including proteins like Channelrhodopsins and Archaerhodopsin, and photochemical switches, to manipulate the steady-state bioelectrical properties of non-spiking embryonic cells in *Xenopus laevis*. mRNA injections and media soaks were employed to introduce the reagents, and the effects of light and dark on membrane voltage (Vmem) were assessed using electrodes and fluorescent reporters. Tadpoles were also scored for phenotypes associated with Vmem variations, such as left-right asymmetry disruption, hyperpigmentation, and craniofacial abnormalities.",
      "section": "Abstract",
      "topic": "Experimental approach",
      "chunk_summary": "Optogenetic reagents were used to manipulate Vmem in Xenopus embryos, and the resulting phenotypic effects were analyzed.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "While most tested reagents induced phenotypes in light-exposed tadpoles, a significant portion also caused phenotypes in dark controls. This \"dark phenotype\" suggests potential reversal or unpredictable ion flux direction in non-neural cells when using common optogenetic reagents. Despite these challenges, optogenetics remains a valuable tool for investigating ion-flux-based signaling in non-excitable systems, provided rigorous controls are implemented. The development of new reagents specifically designed for non-neural cell types is crucial for future advancements.",
      "section": "Abstract",
      "topic": "Challenges and future directions",
      "chunk_summary": "The \"dark phenotype\" observed in some experiments highlights the need for careful controls and the development of new optogenetic reagents tailored for non-neural cells.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Resting potential plays a crucial role in controlling cell migration, differentiation, and proliferation, including stem cell differentiation and tumor growth. Spatio-temporal gradients of resting potential (Vmem) act as bioelectrical signals that mediate patterning information during embryogenesis, regeneration, and cancer. Molecular techniques to alter Vmem have shown promise in studying pattern formation and controlling biological growth and form, but these methods have limitations.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in development and regeneration",
      "chunk_summary": "Resting potential gradients serve as bioelectrical signals that regulate patterning and growth, but current techniques for manipulating Vmem have limitations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Optogenetics offers exciting possibilities for precise control of Vmem. Optogenetic reagents, initially genetically encoded proteins like Channelrhodopsin (ChR), can be activated or deactivated by light. Advances in protein engineering, the discovery of new light-activated channels, pumps, and enzymes, and the development of photochemical switches have expanded the optogenetics toolbox. These tools enable precise control of protein activity, revolutionizing neuroscience research by controlling action potentials in excitable cells.",
      "section": "Introduction",
      "topic": "Optogenetics technology",
      "chunk_summary": "Optogenetics provides precise control over protein activity using light, and has revolutionized neuroscience research.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Despite its potential, the application of optogenetics to developmental contexts is still in its early stages. Current optogenetic reagents are optimized for rapid and transient control of action potentials in individual excitable cells. While reagents with longer-lasting activity exist, their use in controlling steady-state potential gradients in large cell fields is just beginning to be explored. This study aims to adapt optogenetic strategies for investigating ion-dependent signaling during patterning and morphogenesis.",
      "section": "Introduction",
      "topic": "Adapting optogenetics to development",
      "chunk_summary": "Adapting optogenetics to developmental biology requires addressing the differences between excitable cells and developing embryos, and the need to control steady-state potential gradients.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "*Xenopus laevis* offers numerous advantages for studying developmental, regenerative, and neoplastic processes, including large embryo availability, large cell size facilitating microinjection, a wide range of molecular-genetic tools, and established protocols for testing protein activity in oocytes.  *Xenopus* also has a growing body of research on ion-flux-dependent signaling in development and regeneration, including left-right axis patterning, appendage regeneration, and craniofacial development.  The ability to target molecular reagents to specific organs is aided by a detailed fate map and microinjection techniques, but these lack the spatial and temporal resolution of optogenetics.",
      "section": "Results",
      "topic": "Xenopus as a model organism",
      "chunk_summary": "Xenopus laevis is a valuable model for developmental biology research, but current molecular techniques lack the spatiotemporal resolution of optogenetics.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Adapting optogenetic tools for use in *Xenopus* embryos requires addressing the differences between mammalian neurons and embryonic cells, as well as the complexities of working with a multicellular organism.  Successful adaptation would provide unprecedented insights into developmental control mechanisms, with potential applications in drug development, stem cell biology, evolutionary biology, regenerative bioengineering, and birth defect prevention.  The ability to modulate patterns of iso-potential regions would also expand the toolkit of synthetic biology.",
      "section": "Results",
      "topic": "Adapting optogenetics to Xenopus",
      "chunk_summary": "Adapting optogenetic tools to Xenopus embryos presents challenges but offers significant potential for advancing developmental biology and bioengineering.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "The predicted effects of optogenetic reagents in *Xenopus* embryos were based on reported effects in neurons and the Goldman-Hodgkin-Katz (GHK) equation.  Due to the embryo's opacity, light can only penetrate the outermost ectodermal layer, which includes cells that will become placodes and neural crest.  Because these cells are in contact with a dilute medium, the concentration gradients favor ion efflux.  The GHK equation predicts that most reagents, including ChR2s, would hyperpolarize these cells, while only the photochemical switches AAQ and QAQ would depolarize them.",
      "section": "Results",
      "topic": "Predicting reagent effects",
      "chunk_summary": "The predicted effects of optogenetic reagents in Xenopus embryos were based on neuronal data and the GHK equation, considering the dilute external medium.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "All tested optogenetic constructs were successfully expressed in *Xenopus* embryonic cells, with the fused tdTomato marker detected at the cell surface within a few hours of mRNA injection. Control experiments showed that most light wavelengths did not affect *Xenopus* development, except for UV light at early stages.  Further controls showed that fluorescent proteins conjugated to optogenetic reagents did not influence the results.",
      "section": "Results",
      "topic": "Reagent expression and control experiments",
      "chunk_summary": "Optogenetic reagents were successfully expressed, and control experiments showed minimal effects of light and fluorescent proteins on development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Resting membrane potential (Vmem) was altered by optogenetic reagents.  Electrophysiological measurements in early embryos showed that AAQ-treated blastomeres were hyperpolarized compared to untreated controls, contrary to the predicted depolarization or no effect.  Voltage-sensitive dyes were used to measure Vmem in later stages.  HRDA-expressing cells were hyperpolarized as predicted, but HRFY-expressing cells were depolarized, opposite to the prediction.  These findings suggest that the effects of optogenetic reagents in non-neural cells can differ significantly from their actions in neurons.",
      "section": "Results",
      "topic": "Vmem measurements",
      "chunk_summary": "Measurements of Vmem showed that some optogenetic reagents had unexpected effects in Xenopus embryos compared to neurons.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Activating wavelengths of light led to phenotypes known to be caused by Vmem changes, including hyperpigmentation, heterotaxia, and craniofacial defects. All tested reagents caused significant increases in these phenotypes compared to untreated controls. However, few reagents showed the expected difference when compared to inactivating wavelengths or darkness, suggesting that their behavior in *Xenopus* embryo cells differs from that in neurons.",
      "section": "Results",
      "topic": "Phenotypic effects of activating wavelengths",
      "chunk_summary": "Activating wavelengths induced expected phenotypes, but comparisons with inactivating wavelengths and darkness revealed unexpected reagent behavior.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Inactivating wavelengths were tested on AAQ, LiGluR+MAG1, QAQ, and Vcomet-HRFY. AAQ and LiGluR+MAG1 exposed embryos developed normally, as predicted. However, QAQ injected and Vcomet-HRFY expressing embryos showed unexpectedly high proportions of phenotypes, further highlighting the difference between these reagents' effects in *Xenopus* embryos and neurons.",
      "section": "Results",
      "topic": "Phenotypic effects of inactivating wavelengths",
      "chunk_summary": "Inactivating wavelengths had unexpected effects on some reagents, further demonstrating differences between Xenopus embryos and neurons.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Except for AAQ and QAQ, all tested reagents were predicted to be inactive in the dark. While this held true for Arch+PMA, ChR2-D156A, and the Vcomets, Arch alone, ChR2-C128T, and Melanopsin caused increased phenotypes compared to controls.  These results suggest that absence of light is not sufficient to inactivate these reagents in developing *Xenopus* embryos, unlike in neurons.",
      "section": "Results",
      "topic": "Dark phenotypes",
      "chunk_summary": "Several reagents unexpectedly induced phenotypes in the dark, indicating constitutive activity in Xenopus embryos.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Embryos exposed to brief periods of ambient light in incubators developed phenotypes with all treatments, even though the light exposure was far below the activation threshold reported for these reagents.  Only AAQ did not cause phenotypes, contrary to predictions.  These results further suggest that some reagents may be constitutively active in *Xenopus* cells unless exposed to inactivating wavelengths or kept in absolute darkness.",
      "section": "Results",
      "topic": "Effects of ambient light",
      "chunk_summary": "Even brief ambient light exposure induced phenotypes, suggesting constitutive activity of some reagents in Xenopus embryos.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Additional control experiments provided further evidence of differences between reagent behavior in neurons and *Xenopus* cells.  Adding retinal did not affect the activity of ChR2 or Vcomet-HRDA, suggesting sufficient endogenous retinal.  A ChR2-C128T variant lacking the retinal binding domain still induced phenotypes, indicating light-insensitive activity.  Titration experiments with ChR2-C128T showed that even very low mRNA doses did not consistently prevent dark phenotypes.",
      "section": "Results",
      "topic": "Additional control experiments",
      "chunk_summary": "Further controls revealed light-independent activity of some reagents, even at very low concentrations.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Raising external Na⁺ concentration did not prevent the dark phenotype in melanopsin-expressing embryos, suggesting that matching the Na⁺ gradient to neuronal conditions was insufficient to prevent channel activity in the absence of light. Co-expression of Arch with PMA1.2, a constitutively active H⁺-pump, reduced the incidence of craniofacial phenotypes to background levels, suggesting that Arch may facilitate H⁺ influx in the dark, possibly by running in reverse.",
      "section": "Results",
      "topic": "Manipulating ion concentrations and co-expression experiments",
      "chunk_summary": "Manipulating Na+ gradients and co-expressing Arch with a H+ pump provided further insights into the dark phenotype.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "This study explored the utility of optogenetic reagents in *Xenopus* embryos, finding that light regimens had minimal effects on development, and that reagents were expressed rapidly and at high rates.  While most reagents induced expected phenotypes, dark phenotypes were a significant challenge.  Hypotheses to explain this include constitutive channel opening, amplification of stochastic channel opening by endogenous channels, and temperature effects on channel behavior.  The success in preventing the Arch dark phenotype by co-injecting PMA1.2 suggests a useful approach to counteract unwanted ion flux.",
      "section": "Discussion",
      "topic": "Optogenetics in Xenopus embryos",
      "chunk_summary": "Optogenetic reagents were successfully expressed in Xenopus embryos, but dark phenotypes presented a challenge, potentially explained by constitutive channel activity or amplification of stochastic opening.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "The different ionic environment of *Xenopus* embryos compared to mammalian neurons could also contribute to the observed differences in reagent activity.  The dilute medium favors ion efflux, and the GHK equation predicts that changes in sodium permeability would hyperpolarize, not depolarize, *Xenopus* cells.  Changes in external cation concentrations can significantly shift reversal potentials of optogenetic channels.  Despite these challenges, the positive results obtained demonstrate the potential of optogenetics beyond excitable cells.",
      "section": "Discussion",
      "topic": "Ionic environment and reagent activity",
      "chunk_summary": "The different ionic environment of Xenopus embryos compared to neurons could explain the observed differences in reagent activity.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "The study recommends several considerations for using optogenetic reagents in new systems: GHK predictions of ion flow, rescuing phenotypes by co-expressing ion channels, negative controls with inactive wavelengths, and using non-fluorescent tags.  The spatial and temporal control offered by optogenetics will be valuable for cell and developmental biology research, particularly in models like *Xenopus* where ion currents play established developmental roles.  Future progress in optical control of resting potential in somatic cells will open new possibilities for regenerative biomedicine, bioengineering, and cancer research.",
      "section": "Discussion",
      "topic": "Recommendations and future directions",
      "chunk_summary": "Researchers using optogenetics in new systems should consider ion flow predictions, rescue experiments, negative controls, and non-fluorescent tags.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "*Xenopus laevis* embryos were collected and maintained using standard protocols, staged according to Nieuwkoop and Faber (1994), and scored for phenotypes at stages 45-46.  Phenotypes included hyperpigmentation, heterotaxia, and craniofacial defects, known to be induced by Vmem changes.",
      "section": "Materials and Methods",
      "topic": "Xenopus husbandry and phenotyping",
      "chunk_summary": "Standard Xenopus husbandry protocols were followed, and embryos were scored for specific phenotypes related to Vmem changes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Optogenetic cDNAs were cloned into the pCS2+ vector or its derivatives for *in vitro* mRNA synthesis.  Modifications to pCS2+ included insertion of an *Nco*I site for optimal translation and additional restriction sites for linearization.  Mutagenesis was performed using the QuikChange Lightning Mutagenesis Kit.  Some clones were produced by ligation of restriction-digested fragments, and chimeric proteins with tdTomato were created.  Correct clones were identified by sequencing.",
      "section": "Materials and Methods",
      "topic": "Construct preparation",
      "chunk_summary": "Optogenetic constructs were prepared using standard cloning and mutagenesis techniques, including the use of pCS2+ vector and tdTomato tagging.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "AAQ and MAG1 were stored as aliquots and diluted before use. Embryos were exposed to AAQ or MAG1 before light exposure. Microinjection of capped, synthetic mRNAs was performed in the animal hemisphere of early cleavage stage embryos. Alexa647-labeled dextran was used as a lineage tracer. Embryos were sorted based on expression levels before phenotyping. QAQ was injected into early blastomeres.",
      "section": "Materials and Methods",
      "topic": "Reagent delivery",
      "chunk_summary": "Reagents were delivered via microinjection or media soaks, and embryos were sorted based on expression levels.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Light was delivered using LED arrays controlled by an external controller, or via fiber optic cable inside a light-tight box.  Cooling stages maintained temperature during light exposure.  Light was blinked at specific frequencies to minimize phototoxicity and overheating.  The Goldman-Hodgkin-Katz equation was used to predict Vmem effects and ion flux direction, based on published values for *Xenopus* blastomeres and 0.1X MMR.",
      "section": "Materials and Methods",
      "topic": "Light delivery and electrophysiology setup",
      "chunk_summary": "Light was delivered using controlled LED arrays or fiber optic cables, and the GHK equation was used for electrophysiological predictions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    },
    {
      "text": "Resting membrane voltage recordings were made using a Warner Instruments Oocyte Clamp Amplifier and microelectrodes filled with 2M KCl. Embryos were bathed in 0.1X MMR.  Voltage reporting dyes CC2-DMPE and DiBAC4(3) were used for later stage embryos too small for impalement.",
      "section": "Materials and Methods",
      "topic": "Electrophysiology measurements",
      "chunk_summary": "Electrophysiological measurements were performed using microelectrodes or voltage-sensitive dyes, depending on embryo stage.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_406283.pdf",
      "original_filename": "pdf_20250803_124125_406283_extracted_text.txt",
      "authors": "[\"DANY SPENCER ADAMS\", \"JOAN M. LEMIRE\", \"RICHARD H. KRAMER\", \"MICHAEL LEVIN\"]",
      "year": "2023",
      "journal": "Int J Dev Biol",
      "doi": "10.1387/ijdb.140207ml"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-05T13:28:41.325685",
  "enriched_at": "2025-08-11T14:49:47.782399",
  "enrichment_methods": [
    "crossref"
  ]
}