{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_961271_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_961271.pdf",
    "file_size": 13466,
    "authors": [
      "Mariano Bizzarri",
      "Douglas E. Brash",
      "James Briscoe",
      "Verônica A. Grieneisen",
      "Claudio D. Stern",
      "Michael Levin"
    ],
    "journal": "Nature Reviews Molecular Cell Biology",
    "doi": "10.1038/s41580-019-0127-1",
    "year": null,
    "title": "A call for a better understanding of causation in cell biology",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2019",
    "page_range": "261-262",
    "volume": "20",
    "issue": "5",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "What does it mean to say that event X caused outcome Y in biology? Explaining the causal structure underlying the dynamic function of living systems is a central goal of biology. Transformative advances in regenerative medicine and synthetic bioengineering require efficient strategies for causing desired system-level outcomes. We present a perspective on why it is critical to move beyond the classical 'necessary and sufficient' approach to define biological causality.",
      "section": "Introduction",
      "topic": "Biological Causality",
      "chunk_summary": "Defining causality in biology requires moving beyond traditional approaches to understand the complex interplay of factors influencing living systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": 1,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Genes that control the development of specific tissues have been identified and organized into pathways, which has increased our understanding of how tissues are formed and what goes wrong in disorders and diseases. As a consequence, biological processes tend to be described by genes and gene networks. The result is a gene-centric view with genes assigned fixed and specific functions within hierarchical mechanisms, in which master regulators are the drivers of a developmental process. But developmental biology is more than a catalogue of parts. Understanding mechanisms must include a description of the activity and the causal relationship between components. This description shifts the attention to morphogenic patterns and connections between components, providing conceptual insight into how and why processes occur.",
      "section": "Introduction",
      "topic": "Gene-centric view vs. Morphogenic Patterns",
      "chunk_summary": "While gene networks provide valuable information, a deeper understanding of developmental biology requires focusing on morphogenic patterns and the causal relationships between components.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 2,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Such change in perspective requires an interdisciplinary mix of theory and experiment. In cases where this approach has been followed, the picture that arises reveals more sophistication and subtlety than implied by simple hierarchical genetic wiring diagrams. Nonlinearity and multi-level feedbacks in even small systems can have unexpected consequences. Reasoning that follows a linear logic becomes inadequate because the distinction between cause and effect is lost, and the explanation for how a process occurs will require an understanding of how relationships change over time. Describing and understanding these dynamics is now the challenge facing twenty-first century developmental biologists.",
      "section": "Introduction",
      "topic": "Nonlinearity and Feedback in Development",
      "chunk_summary": "Nonlinearity and feedback loops complicate the understanding of cause and effect in biological systems, requiring a shift towards understanding dynamic relationships.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 2,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Through next-generation sequencing, protein interactomes, metabolomics and quantitative genetics, modern biology has become obsessed with compiling lists. But it is difficult, if not impossible, to understand processes from lists and merely undertaking the effort at multiple scales does not suffice. Many of the current approaches to studying biological events have turned us away from asking the key questions needed to understand a biological process. Shifting our attention to patterns, connections and processes is what is needed, but not simply to make different types of lists. Emphasis should be placed on designing experiments to test alternative explanations for the observed behaviors. The experiments should make predictions of how one or another model might fit with the observations, so that the experiment, along with its controls, can distinguish between different mechanisms. This 'critical experiment' approach is the opposite of making lists, which effectively increases the number of dimensions.",
      "section": "Introduction",
      "topic": "Limitations of List-Making in Biology",
      "chunk_summary": "Modern biology's focus on compiling lists of components hinders the understanding of biological processes, and a shift towards hypothesis-driven experiments is necessary.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 2,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This change in focus and experimental design, will largely use the \\\"IF (x is TRUE) THEN (y) ELSE (z)\\\" logic of computational approaches. The approach becomes iterative with each round of analysis including more data (produced by consecutive experiments) as well as more knowledge to reformulate the question. Ideal models make counter-intuitive predictions that can be tested rigorously — a crucial aspect of distinguishing between possible explanations.",
      "section": "Introduction",
      "topic": "Computational Approaches and Iterative Experimentation",
      "chunk_summary": "Computational approaches and iterative experimentation, guided by the \"IF-THEN-ELSE\" logic, are crucial for testing and refining models of biological processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 2,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The current Gene Regulatory Network (GRN) formalism is not well-suited to explain the influence of spatially distributed physical factors, most of which manifest as constraints, arising from multiple interactions and physical fields. A constraint specifies some limits on independent behaviors of a dynamical system and this can provide access to new states unavailable to the unconstrained system. A specific case is provided by studies performed on mammalian cells cultured in microgravity that undergo changes in shape morphology and functions, leading to the partitioning of cells into two different populations. Yet, by separately re-seeding these populations once more in microgravity, two distinct phenotypes emerge from each cell cluster. This experiment demonstrates that a biological field ‘deprived' of the gravity constraint does not provide a stable environment for differentiation, as it favors a never-ending transition among different phenotypes leading to a consequent change in the GRN state of activation. In other words, in the absence of physical constraints the environment cannot select between two different phenotypes due to the emergence of a 'permanent transition state', while the presence of physical cues force the system into a specific differentiated state. Constraints, by providing the system with a deterministic output that would otherwise have been impossible to obtain, act thereby as organizing principles during cell differentiation.",
      "section": "Introduction",
      "topic": "Biophysical Constraints and Cell Differentiation",
      "chunk_summary": "Physical constraints, such as gravity, play a crucial role in cell differentiation by limiting the possible states of a biological system and providing a deterministic output.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 3,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "If we look beyond the single cell level, regulative embryogenesis and regeneration exemplify the still poorly understood decision-making processes by which cells cooperate toward the dynamic maintenance and repair of complex 3-dimensional structures. Salamanders regenerate entire limbs and, crucially, they stop precisely when a correct limb structure is complete. Tadpoles with highly abnormal faces nevertheless can become normal frogs, underscoring the fact that genomes encode not hardwired cell movements for metamorphosis but a system of large-scale remodeling that implements profound plasticity, reaching the species-specific target morphology despite drastic interventions. Remarkably, the setpoint of this anatomical homeostasis can be re-written, e.g. as trophic memory. In deer antler regeneration, ectopic tines will form at sites of prior years' injuries in an antler rack replacing one that has already been shed; in planarian axial patterning, a transient stimulus can make permanent lines of genetically-normal 2-headed worms.",
      "section": "Introduction",
      "topic": "Regeneration and Anatomical Homeostasis",
      "chunk_summary": "Regeneration and embryogenesis demonstrate the remarkable plasticity of biological systems to achieve target morphologies despite disruptions, highlighting the concept of anatomical homeostasis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 3,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "An important component of such control systems appears to be biophysical, with instructive information encoded by bioelectric state dynamics distributed across tissues. The anatomical pattern that defines the target (and the stop condition) for regeneration can be permanently altered, for example by transiently modulating the state of bioelectric circuits. This strategy is already being used in model systems for repairing birth defects and inducing complex regeneration. Expanding comfortable paradigms of master regulator genes and cell-level epigenetics to include a physiological layer that enables robust computation and pattern memory will be essential to improving the understanding and control of the adaptive remodeling of growth and form.",
      "section": "Introduction",
      "topic": "Bioelectric Signaling and Regeneration",
      "chunk_summary": "Bioelectric signals play a crucial role in controlling regeneration and anatomical homeostasis, and incorporating this physiological layer into existing paradigms is essential for advancing regenerative medicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 3,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The billiard ball model of causality has lured biologists into using knock-down and overexpression approaches to test linear, unidirectional models of biological systems that are not actually built this way. Linearity is broken by branching pathways and unidirectionality is broken by feedback, which can occur on different levels of biological organization (molecular, cellular, tissue-, organ- and organism-level). Models of single-level interactions are broken by biological hierarchy. An archetype is the Chladni plate. If we sprinkle a flat plate with sand grains and set it to vibrate, distinctive patterns emerge, which will differ depending on shape or size of the plate, with different patterns emerging as a result of vibration frequency changes or local constraints, such as our thumb placed on the plate's corner. The pattern results from collisions of sand grains governed by Newton's Laws. The precise collisions might be computed, but are in fact irrelevant, as the collisions will be different tomorrow. However, the patterns reproducible independently of these alterations, remaining consistent with the external constraints such as the plate's size and shape, and the frequency of vibration. So what is meaningful for understanding the patterns is not to seek a description of the links between sand grains but the rules that link the higher-level patterns to constraints — a new form of causality focusing on determinants rather than instigators. A key first step is to identify the constraints.",
      "section": "Introduction",
      "topic": "Limitations of Linear Models and the Importance of Constraints",
      "chunk_summary": "Linear, unidirectional models are inadequate for capturing the complexity of biological systems, and a shift towards understanding the influence of constraints on emergent patterns is necessary.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 4,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Three useful refinements of causality in physics and engineering can be imported into biology: A shift from causes acting at a single site in an organism and instigating changes in a linear pathway, to looking at the behavior of the entire system, including the constraints that shape it. A shift from studying molecular events to discrete pattern states, \\\"eigenisms\\\" analogous to the eigenstates of quantum mechanics that can only exist in a small number of distinctly different states. A shift from medicines that briefly control a single target to treatments that put constraints on many parts of the organism, sustained over time.",
      "section": "Introduction",
      "topic": "Refinements of Causality for Biology",
      "chunk_summary": "Three key refinements of causality involve shifting focus from linear pathways to system-level behavior, from molecular events to discrete pattern states, and from single-target drugs to sustained, multi-target treatments.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 4,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Furthermore, to these principles, biology adds an inevitable duality of causation. Ludwig von Bertalanffy described the state of biology in 1928 as “dominated by the 'mechanistic' world view... that is, it (biology) tried to model itself according to the pattern set by physics.” Biological causation goes beyond asking how a system of proteins establishes heterogenous patterning, and seeks to explain what the biological function is. For example, stating that small GTPases are activated by GAPs and inactivated by GEFs, and that GTPase activity regulates downstream events, is like stating that A leads to B. However, defining the function of these interactions (providing intrinsic polarity information to the cell) requires us to operate on a different conceptual level. This is in stark contrast with physics, in which a causational understanding of physical phenomena is (generally) devoid of function. By comparing species that have evolved multicellularity independently, such as in the animal and plant kingdoms, we are now able to search for fundamental mechanisms adopted by life, by identifying conserved and modified functions rather than conserved components (such as protein structures, DNA, etc). Such comparative approaches, using understanding of system processes rather than system components, gives insight into how tissue polarity is established and why it has done so in a particular manner. Thus, causation in biology should define how and why a process occurs in a certain manner. Notwithstanding the qualitative challenge of defining such biological causation, the quantitative approaches of mathematical modelling and experimentation are required to test quantitative constraints needed to appropriately direct a biological process.",
      "section": "Introduction",
      "topic": "Duality of Causation in Biology",
      "chunk_summary": "Biological causation, unlike physics, must consider function in addition to mechanism, requiring a shift from focusing on components to understanding system processes and their evolutionary context.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": 5,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Despite biologists' general awareness of redundancy and homeostatic control circuits, we still largely do not understand the corrective, self-organizing processes that reliably reach complex, systems-level patterning goals. This insight is key in contexts where the outcome is an emergent result of coupled, parallel processes, and it will be increasingly important for knowing when machine learning strategies could be an appropriate approach to extract actionable, efficient control policies from the ever-increasing deluge of data. Importantly, extensive work in fields such as philosophy, physics and engineering has identified profound problems with respect to naïve models of causation, which still pervade experimental biology. Advances in mathematical approaches that extract causal control structures from biological data and an increased awareness of the presence and importance of variability, stochasticity, heterogeneity, and noise are revolutionizing the search for effective causes of complex biological states and processes. An appreciation of new kinds of instructive influences, from network science and physics, must be coupled with hypothesis testing, focused on models of functional processes (not necessarily molecular components). Developing methodology for the rigorous identification and efficient control of causal processes in complex biological systems is very much a nascent field that has not been widely integrated with molecular approaches to growth and form. At stake is not only perceptive review of manuscripts and grants (in which distinguishing between causes and epiphenomena is a key goal), but the development of efficacious next-generation interventions in regenerative, cancer and synthetic biology.",
      "section": "Conclusion",
      "topic": "Future Directions in Understanding Biological Causality",
      "chunk_summary": "Moving beyond naïve models of causation requires integrating new approaches from mathematics, physics, and network science, coupled with hypothesis testing focused on functional processes, to understand and control complex biological systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": 6,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Competing interests The authors declare no competing interests.",
      "section": "Competing Interests",
      "topic": "Competing Interests",
      "chunk_summary": "The authors declare no competing interests.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": 7,
      "pdf_filename": "pdf_20250803_124126_961271.pdf",
      "original_filename": "pdf_20250803_124126_961271_extracted_text.txt",
      "authors": "[\"Brash, D. E.\", \"Bizarri, M.\", \"Briscoe, J.\", \"Stern, C. D.\", \"Grieneisen, V. A.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "```json\n[\n{\"text\": \"What does it mean to say that event X caused outcome Y in biology? Explaining the causal structure underlying the dynamic function of living systems is a central goal of biology. Transformative advances in regenerative medicine and synthetic bioengineering require efficient strategies for causing desired system-level outcomes. We present a perspective on why it is critical to move beyond the classical 'necessary and sufficient' approach to define biological causality.\", \"section\": \"Introduction\", \"topic\": \"Biological Causality\", \"chunk_summary\": \"Defining causality in biology requires moving beyond traditional approaches to understand the complex interplay of factors influencing living systems.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": 1},\n{\"text\": \"Genes that control the development of specific tissues have been identified and organized into pathways, which has increased our understanding of how tissues are formed and what goes wrong in disorders and diseases. As a consequence, biological processes tend to be described by genes and gene networks. The result is a gene-centric view with genes assigned fixed and specific functions within hierarchical mechanisms, in which master regulators are the drivers of a developmental process. But developmental biology is more than a catalogue of parts. Understanding mechanisms must include a description of the activity and the causal relationship between components. This description shifts the attention to morphogenic patterns and connections between components, providing conceptual insight into how and why processes occur.\", \"section\": \"Introduction\", \"topic\": \"Gene-centric view vs. Morphogenic Patterns\", \"chunk_summary\": \"While gene networks provide valuable information, a deeper understanding of developmental biology requires focusing on morphogenic patterns and the causal relationships between components.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 2},\n{\"text\": \"Such change in perspective requires an interdisciplinary mix of theory and experiment. In cases where this approach has been followed, the picture that arises reveals more sophistication and subtlety than implied by simple hierarchical genetic wiring diagrams. Nonlinearity and multi-level feedbacks in even small systems can have unexpected consequences. Reasoning that follows a linear logic becomes inadequate because the distinction between cause and effect is lost, and the explanation for how a process occurs will require an understanding of how relationships change over time. Describing and understanding these dynamics is now the challenge facing twenty-first century developmental biologists.\", \"section\": \"Introduction\", \"topic\": \"Nonlinearity and Feedback in Development\", \"chunk_summary\": \"Nonlinearity and feedback loops complicate the understanding of cause and effect in biological systems, requiring a shift towards understanding dynamic relationships.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 2},\n{\"text\": \"Through next-generation sequencing, protein interactomes, metabolomics and quantitative genetics, modern biology has become obsessed with compiling lists. But it is difficult, if not impossible, to understand processes from lists and merely undertaking the effort at multiple scales does not suffice. Many of the current approaches to studying biological events have turned us away from asking the key questions needed to understand a biological process. Shifting our attention to patterns, connections and processes is what is needed, but not simply to make different types of lists. Emphasis should be placed on designing experiments to test alternative explanations for the observed behaviors. The experiments should make predictions of how one or another model might fit with the observations, so that the experiment, along with its controls, can distinguish between different mechanisms. This 'critical experiment' approach is the opposite of making lists, which effectively increases the number of dimensions.\", \"section\": \"Introduction\", \"topic\": \"Limitations of List-Making in Biology\", \"chunk_summary\": \"Modern biology's focus on compiling lists of components hinders the understanding of biological processes, and a shift towards hypothesis-driven experiments is necessary.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 2},\n{\"text\": \"This change in focus and experimental design, will largely use the \\\\\\\"IF (x is TRUE) THEN (y) ELSE (z)\\\\\\\" logic of computational approaches. The approach becomes iterative with each round of analysis including more data (produced by consecutive experiments) as well as more knowledge to reformulate the question. Ideal models make counter-intuitive predictions that can be tested rigorously — a crucial aspect of distinguishing between possible explanations.\", \"section\": \"Introduction\", \"topic\": \"Computational Approaches and Iterative Experimentation\", \"chunk_summary\": \"Computational approaches and iterative experimentation, guided by the \\\"IF-THEN-ELSE\\\" logic, are crucial for testing and refining models of biological processes.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 2},\n{\"text\": \"The current Gene Regulatory Network (GRN) formalism is not well-suited to explain the influence of spatially distributed physical factors, most of which manifest as constraints, arising from multiple interactions and physical fields. A constraint specifies some limits on independent behaviors of a dynamical system and this can provide access to new states unavailable to the unconstrained system. A specific case is provided by studies performed on mammalian cells cultured in microgravity that undergo changes in shape morphology and functions, leading to the partitioning of cells into two different populations. Yet, by separately re-seeding these populations once more in microgravity, two distinct phenotypes emerge from each cell cluster. This experiment demonstrates that a biological field ‘deprived' of the gravity constraint does not provide a stable environment for differentiation, as it favors a never-ending transition among different phenotypes leading to a consequent change in the GRN state of activation. In other words, in the absence of physical constraints the environment cannot select between two different phenotypes due to the emergence of a 'permanent transition state', while the presence of physical cues force the system into a specific differentiated state. Constraints, by providing the system with a deterministic output that would otherwise have been impossible to obtain, act thereby as organizing principles during cell differentiation.\", \"section\": \"Introduction\", \"topic\": \"Biophysical Constraints and Cell Differentiation\", \"chunk_summary\": \"Physical constraints, such as gravity, play a crucial role in cell differentiation by limiting the possible states of a biological system and providing a deterministic output.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 3},\n{\"text\": \"If we look beyond the single cell level, regulative embryogenesis and regeneration exemplify the still poorly understood decision-making processes by which cells cooperate toward the dynamic maintenance and repair of complex 3-dimensional structures. Salamanders regenerate entire limbs and, crucially, they stop precisely when a correct limb structure is complete. Tadpoles with highly abnormal faces nevertheless can become normal frogs, underscoring the fact that genomes encode not hardwired cell movements for metamorphosis but a system of large-scale remodeling that implements profound plasticity, reaching the species-specific target morphology despite drastic interventions. Remarkably, the setpoint of this anatomical homeostasis can be re-written, e.g. as trophic memory. In deer antler regeneration, ectopic tines will form at sites of prior years' injuries in an antler rack replacing one that has already been shed; in planarian axial patterning, a transient stimulus can make permanent lines of genetically-normal 2-headed worms.\", \"section\": \"Introduction\", \"topic\": \"Regeneration and Anatomical Homeostasis\", \"chunk_summary\": \"Regeneration and embryogenesis demonstrate the remarkable plasticity of biological systems to achieve target morphologies despite disruptions, highlighting the concept of anatomical homeostasis.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 3},\n{\"text\": \"An important component of such control systems appears to be biophysical, with instructive information encoded by bioelectric state dynamics distributed across tissues. The anatomical pattern that defines the target (and the stop condition) for regeneration can be permanently altered, for example by transiently modulating the state of bioelectric circuits. This strategy is already being used in model systems for repairing birth defects and inducing complex regeneration. Expanding comfortable paradigms of master regulator genes and cell-level epigenetics to include a physiological layer that enables robust computation and pattern memory will be essential to improving the understanding and control of the adaptive remodeling of growth and form.\", \"section\": \"Introduction\", \"topic\": \"Bioelectric Signaling and Regeneration\", \"chunk_summary\": \"Bioelectric signals play a crucial role in controlling regeneration and anatomical homeostasis, and incorporating this physiological layer into existing paradigms is essential for advancing regenerative medicine.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 3},\n{\"text\": \"The billiard ball model of causality has lured biologists into using knock-down and overexpression approaches to test linear, unidirectional models of biological systems that are not actually built this way. Linearity is broken by branching pathways and unidirectionality is broken by feedback, which can occur on different levels of biological organization (molecular, cellular, tissue-, organ- and organism-level). Models of single-level interactions are broken by biological hierarchy. An archetype is the Chladni plate. If we sprinkle a flat plate with sand grains and set it to vibrate, distinctive patterns emerge, which will differ depending on shape or size of the plate, with different patterns emerging as a result of vibration frequency changes or local constraints, such as our thumb placed on the plate's corner. The pattern results from collisions of sand grains governed by Newton's Laws. The precise collisions might be computed, but are in fact irrelevant, as the collisions will be different tomorrow. However, the patterns reproducible independently of these alterations, remaining consistent with the external constraints such as the plate's size and shape, and the frequency of vibration. So what is meaningful for understanding the patterns is not to seek a description of the links between sand grains but the rules that link the higher-level patterns to constraints — a new form of causality focusing on determinants rather than instigators. A key first step is to identify the constraints.\", \"section\": \"Introduction\", \"topic\": \"Limitations of Linear Models and the Importance of Constraints\", \"chunk_summary\": \"Linear, unidirectional models are inadequate for capturing the complexity of biological systems, and a shift towards understanding the influence of constraints on emergent patterns is necessary.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 4},\n{\"text\": \"Three useful refinements of causality in physics and engineering can be imported into biology: A shift from causes acting at a single site in an organism and instigating changes in a linear pathway, to looking at the behavior of the entire system, including the constraints that shape it. A shift from studying molecular events to discrete pattern states, \\\\\\\"eigenisms\\\\\\\" analogous to the eigenstates of quantum mechanics that can only exist in a small number of distinctly different states. A shift from medicines that briefly control a single target to treatments that put constraints on many parts of the organism, sustained over time.\", \"section\": \"Introduction\", \"topic\": \"Refinements of Causality for Biology\", \"chunk_summary\": \"Three key refinements of causality involve shifting focus from linear pathways to system-level behavior, from molecular events to discrete pattern states, and from single-target drugs to sustained, multi-target treatments.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 4},\n{\"text\": \"Furthermore, to these principles, biology adds an inevitable duality of causation. Ludwig von Bertalanffy described the state of biology in 1928 as “dominated by the 'mechanistic' world view... that is, it (biology) tried to model itself according to the pattern set by physics.” Biological causation goes beyond asking how a system of proteins establishes heterogenous patterning, and seeks to explain what the biological function is. For example, stating that small GTPases are activated by GAPs and inactivated by GEFs, and that GTPase activity regulates downstream events, is like stating that A leads to B. However, defining the function of these interactions (providing intrinsic polarity information to the cell) requires us to operate on a different conceptual level. This is in stark contrast with physics, in which a causational understanding of physical phenomena is (generally) devoid of function. By comparing species that have evolved multicellularity independently, such as in the animal and plant kingdoms, we are now able to search for fundamental mechanisms adopted by life, by identifying conserved and modified functions rather than conserved components (such as protein structures, DNA, etc). Such comparative approaches, using understanding of system processes rather than system components, gives insight into how tissue polarity is established and why it has done so in a particular manner. Thus, causation in biology should define how and why a process occurs in a certain manner. Notwithstanding the qualitative challenge of defining such biological causation, the quantitative approaches of mathematical modelling and experimentation are required to test quantitative constraints needed to appropriately direct a biological process.\", \"section\": \"Introduction\", \"topic\": \"Duality of Causation in Biology\", \"chunk_summary\": \"Biological causation, unlike physics, must consider function in addition to mechanism, requiring a shift from focusing on components to understanding system processes and their evolutionary context.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": 5},\n{\"text\": \"Despite biologists' general awareness of redundancy and homeostatic control circuits, we still largely do not understand the corrective, self-organizing processes that reliably reach complex, systems-level patterning goals. This insight is key in contexts where the outcome is an emergent result of coupled, parallel processes, and it will be increasingly important for knowing when machine learning strategies could be an appropriate approach to extract actionable, efficient control policies from the ever-increasing deluge of data. Importantly, extensive work in fields such as philosophy, physics and engineering has identified profound problems with respect to naïve models of causation, which still pervade experimental biology. Advances in mathematical approaches that extract causal control structures from biological data and an increased awareness of the presence and importance of variability, stochasticity, heterogeneity, and noise are revolutionizing the search for effective causes of complex biological states and processes. An appreciation of new kinds of instructive influences, from network science and physics, must be coupled with hypothesis testing, focused on models of functional processes (not necessarily molecular components). Developing methodology for the rigorous identification and efficient control of causal processes in complex biological systems is very much a nascent field that has not been widely integrated with molecular approaches to growth and form. At stake is not only perceptive review of manuscripts and grants (in which distinguishing between causes and epiphenomena is a key goal), but the development of efficacious next-generation interventions in regenerative, cancer and synthetic biology.\", \"section\": \"Conclusion\", \"topic\": \"Future Directions in Understanding Biological Causality\", \"chunk_summary\": \"Moving beyond naïve models of causation requires integrating new approaches from mathematics, physics, and network science, coupled with hypothesis testing focused on functional processes, to understand and control complex biological systems.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Drawing conclusions\", \"page_number\": 6},\n{\"text\": \"Competing interests The authors declare no competing interests.\", \"section\": \"Competing Interests\", \"topic\": \"Competing Interests\", \"chunk_summary\": \"The authors declare no competing interests.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": 7}\n]\n```",
  "processed_at": "2025-08-05T10:56:45.078811",
  "enriched_at": "2025-08-11T14:38:12.130302",
  "enrichment_methods": [
    "crossref_title"
  ]
}