{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_202312_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_202312.pdf",
    "file_size": 37403,
    "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
    "journal": "Frontiers in Bioengineering and Biotechnology",
    "doi": "10.3389/fbioe.2016.00055",
    "year": "2016",
    "title": "Exploring Instructive Physiological Signaling with the Bioelectric Tissue Simulation Engine",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Bioelectric cell properties are powerful targets for modulating stem cell function, regenerative response, developmental patterning, and tumor reprogramming. Spatio-temporal distributions of endogenous resting potential, ion flows, and electric fields are influenced by the genome, external signals, and their own intrinsic dynamics. Ion channels and electrical synapses (gap junctions) both determine, and are themselves gated by, cellular resting potential, making the origin and progression of bioelectric patterns complex. To understand these dynamics and develop bioelectric pattern control strategies, we created the BioElectric Tissue Simulation Engine (BETSE), a finite volume method multiphysics simulator. BETSE predicts bioelectric patterns and their dynamics by modeling ion channel and gap junction activity and tracking ion concentration changes. We validate BETSE by matching simulated values to experimental data on membrane permeability, ion concentration, and resting potential, and by demonstrating expected outcomes for known cases, such as predicting transmembrane voltage changes for single-cell membrane state and environmental ion concentration perturbations, and the development of realistic transepithelial potentials and bioelectric wounding signals. In silico experiments reveal that factors influencing transmembrane potential differ significantly in gap junction-networked cell clusters with tight junctions, and identify non-linear feedback mechanisms generating strong, emergent, cluster-wide resting potential gradients. BETSE will enable a deep understanding of bioelectrical dynamics in tissues and assist in developing interventions for pattern control during morphogenesis and remodeling.",
      "section": "Abstract",
      "topic": "Bioelectric signaling and BETSE simulator",
      "chunk_summary": "BETSE, a bioelectric tissue simulator, models ion channel and gap junction activity to predict bioelectric patterns and their dynamics, validated by experimental data and known cases, revealing influential factors in networked cell clusters.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "Explaining and controlling large-scale pattern is crucial for mitigating birth defects and advancing regenerative medicine and synthetic bioengineering. Understanding the dynamics of signals orchestrating large-scale order is essential for developing interventions. While chemical signal dynamics are increasingly understood, endogenous bioelectric signals represent a parallel regulatory system controlling growth and form. Bioelectric signaling underpins biological pattern control, with endogenous bioelectric gradients serving as early pre-patterns for transcriptional and morphogenetic events. For example, specific transmembrane voltage (Vmem) patterns determine facial and brain development in frogs. Modulating cell Vmem can alter anatomy, inducing ectopic eye formation, reprogramming planarian regeneration, and rescuing brain patterning despite mutated neurogenesis genes. Thus, bioelectric signaling is a powerful tool for controlling biological patterns.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in development",
      "chunk_summary": "Endogenous bioelectric signals are a key regulatory system in development, acting as pre-patterns for morphogenesis and influencing large-scale anatomy, as demonstrated by examples in frog development and planarian regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "1",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "Single-cell Vmem regulates processes like proliferation, cell death, and differentiation, and influences immune cell activation. While single-cell bioelectric properties are understood, bioelectric states regulate large-scale anatomical properties like axial polarity, organ size and shape, and appendage induction. Pattern control involves long-range coordination of bioelectric states, crucial in processes like metastatic conversion, tumor suppression, brain size regulation, and planarian regeneration.  Cells are electrochemically connected via gap junctions (GJ) and ephaptic coupling, creating bioelectrical circuits with long-range signal patterns essential for embryonic development, limb development, wound healing, and tumor suppression.  The ability of cells to communicate via these networks is crucial, and disruptions, such as improper GJ function, are implicated in diseases like cancer. Altering bioelectric connectivity can rewrite target morphology, as seen in planarian flatworms regenerating with different species' head shapes or permanently altered two-headed forms. This highlights the importance of understanding how electrical gradients self-organize and evolve in multicellular networks.",
      "section": "Introduction",
      "topic": "Local and Long-Range Order in Bioelectrical Networks",
      "chunk_summary": "Bioelectric states regulate large-scale anatomy through long-range coordination facilitated by gap junctions and ephaptic coupling, forming bioelectrical circuits crucial for development and regeneration, while disruptions in these networks are linked to disease.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "The trans-epithelial potential (TEP), a voltage gradient at the outer boundary of organs or organisms, is implicated in developmental processes, wound healing, and diseases like cystic fibrosis, fungal infection, inflammation, and cancer.  The TEP is created by impermeable tight junctions (TJ) between cells at the exterior boundary, and disruptions induce electric fields that guide migratory cells during injury response and limb development. Understanding the spatio-temporal transitions of plasma membrane voltage gradients and TEPs is crucial for developmental bioelectricity and its applications.",
      "section": "Introduction",
      "topic": "Transepithelial Potential (TEP)",
      "chunk_summary": "The trans-epithelial potential (TEP), formed by tight junctions, plays a role in development, wound healing, and disease, with disruptions creating electric fields that guide cell migration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "Understanding and controlling patterning signals requires quantitative models of their dynamics. While platforms exist for modeling brain spiking activity, few frameworks model bioelectric signaling in somatic cell pattern regulation, especially from the perspective of ionic concentrations and movements. Biorealistic models are crucial for developing effective interventions targeting bioelectric control processes. Ion channels and GJs are voltage-sensitive, enabling complex non-linear behaviors and feedback loops difficult to predict by inspection.  A flexible platform for in silico experimentation and model-building, connecting bioelectric dynamics with other physiological aspects, physical forces, and genetic networks, is needed.",
      "section": "Introduction",
      "topic": "Modeling Bioelectric Signaling",
      "chunk_summary": "Biorealistic models of bioelectric signaling, considering ionic concentrations and movements, are crucial for understanding and controlling patterning signals, especially given the complex non-linear dynamics of voltage-sensitive ion channels and gap junctions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "A realistic bioelectricity modeling system will enable: (1) modeling specific patterning events based on physiological and channel expression data; (2) designing intervention strategies to induce desired electrical state changes and patterning outcomes; and (3) investigating bioelectrical networks' capabilities for synthetic biology and unconventional computation.  We created the Bio-Electric Tissue Simulation Engine (BETSE) to explore bioelectrical signals in cell collectives. BETSE integrates various mechanisms and physiologies for model building and hypothesis testing, including electrodiffusion of multiple ions, consideration of concentration, charge, voltage, and current in intra- and extracellular networks, and dynamic control of membrane permeability and gap junction state. This work is the first in a series modeling specific patterning systems and using BETSE to infer targeted modulation strategies. Here, we discuss BETSE's design, validate its performance, and provide insights into patterning mechanisms in multicellular clusters.",
      "section": "Introduction",
      "topic": "BETSE and its applications",
      "chunk_summary": "BETSE, a bioelectric tissue simulation engine, enables realistic modeling of bioelectric phenomena, allowing for the design of interventions and exploration of bioelectrical networks for synthetic biology and computation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": "3",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "Voltages in biological systems are created by net electrical charge from ion concentration profiles. Ion fluxes generate current, associated with intracellular and tissue-wide electric fields. BETSE considers ions like Na+, K+, Cl¯, Ca2+, HCO₃⁻, H+, and charged macromolecules (X¯), as well as charged biomolecules (Yn¯ or Yn+) at low concentrations. Cells control Vmem by altering ion fluxes across their membrane. Ion pumps, like Na/K-ATPase, create ionic charge density and voltage gradients. Ion channels allow charge movement, altering charge densities and creating bioelectrical signals. BETSE tracks ion concentrations and fluxes, calculates net charge distributions, voltages, concentration changes from fluxes and pumps, and endogenous currents. Membrane permeability simulates ion channel action. Further details on BETSE's theory and implementation are in Supplementary Material. Table 1 summarizes key parameters and variables. Figure 1 shows a simplified bioelectrical \"circuit\" implemented in BETSE.",
      "section": "Materials and Methods",
      "topic": "Model Overview",
      "chunk_summary": "BETSE models bioelectrical systems by tracking ion concentrations and fluxes, calculating voltages and currents, and simulating ion channel action through membrane permeability.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "3",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "BETSE is a finite volume method multiphysics simulator specialized for bioelectric phenomena in spatially heterogeneous biological tissues. Implemented in Python 3.4 using Numpy, Scipy, and Matplotlib, BETSE uses matrix-based solvers, with memory limiting simulation size. Simulating a square millimeter of tissue (~10,000 cells) with all features uses ~14 Gb of RAM. BETSE code is publicly available.",
      "section": "Materials and Methods",
      "topic": "BETSE Platform and Performance",
      "chunk_summary": "BETSE, a Python-based finite volume method simulator, is specialized for bioelectric tissue simulation, with memory being the primary limitation on simulation size.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "4",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "Biological tissue's heterogeneous nature, with closely spaced cells interacting with a small extracellular space and connected internally via gap junctions, presents modeling challenges. BETSE uses an irregular Voronoi diagram-based cell grid within a regular square environmental grid to model this complexity. Each cell has a center point for scalar properties (ci, Vcell), a volume (volcell), and a perimeter. Membrane properties (Vmem) are defined for each membrane segment, allowing for studying individual cell polarizations. Membrane-specific properties are defined at membrane segment midpoints, interfacing with environmental grid points via interpolation. A weighting function conserves mass and charge. The interconnected grids allow shaping the cluster, cutting holes for vasculature or wounding, and assigning properties using bitmaps.",
      "section": "Materials and Methods",
      "topic": "Core Mathematical Strategy",
      "chunk_summary": "BETSE uses interconnected Voronoi and square grids to model the heterogeneous nature of biological tissues, allowing for detailed representation of cell and membrane properties and simulation of complex tissue shapes and wounding.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "5",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    },
    {
      "text": "BETSE's core mathematical operators are gradient (∇sj), divergence (∇ · Fj), and Laplacian (∇²sj). Discrete versions of these operators are defined on the cell and environmental grids using finite difference and finite volume techniques. These operators are used in specific differential equation expressions.",
      "section": "Materials and Methods",
      "topic": "Core Mathematical Operators",
      "chunk_summary": "BETSE utilizes discrete versions of gradient, divergence, and Laplacian operators on its grids for solving differential equations related to bioelectric phenomena.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "5",
      "pdf_filename": "pdf_20250803_124126_202312.pdf",
      "original_filename": "pdf_20250803_124126_202312_extracted_text.txt",
      "authors": "[\"Alexis Pietak\", \"Michael Levin\"]",
      "year": "2016",
      "journal": "Frontiers in Bioengineering and Biotechnology",
      "doi": "10.3389/fbioe.2016.00055"
    }
  ],
  "gemini_response": "```json\n[\n{\"text\": \"Bioelectric cell properties are powerful targets for modulating stem cell function, regenerative response, developmental patterning, and tumor reprogramming. Spatio-temporal distributions of endogenous resting potential, ion flows, and electric fields are influenced by the genome, external signals, and their own intrinsic dynamics. Ion channels and electrical synapses (gap junctions) both determine, and are themselves gated by, cellular resting potential, making the origin and progression of bioelectric patterns complex. To understand these dynamics and develop bioelectric pattern control strategies, we created the BioElectric Tissue Simulation Engine (BETSE), a finite volume method multiphysics simulator. BETSE predicts bioelectric patterns and their dynamics by modeling ion channel and gap junction activity and tracking ion concentration changes. We validate BETSE by matching simulated values to experimental data on membrane permeability, ion concentration, and resting potential, and by demonstrating expected outcomes for known cases, such as predicting transmembrane voltage changes for single-cell membrane state and environmental ion concentration perturbations, and the development of realistic transepithelial potentials and bioelectric wounding signals. In silico experiments reveal that factors influencing transmembrane potential differ significantly in gap junction-networked cell clusters with tight junctions, and identify non-linear feedback mechanisms generating strong, emergent, cluster-wide resting potential gradients. BETSE will enable a deep understanding of bioelectrical dynamics in tissues and assist in developing interventions for pattern control during morphogenesis and remodeling.\", \"section\": \"Abstract\", \"topic\": \"Bioelectric signaling and BETSE simulator\", \"chunk_summary\": \"BETSE, a bioelectric tissue simulator, models ion channel and gap junction activity to predict bioelectric patterns and their dynamics, validated by experimental data and known cases, revealing influential factors in networked cell clusters.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Presenting new results\", \"page_number\": null},\n{\"text\": \"Explaining and controlling large-scale pattern is crucial for mitigating birth defects and advancing regenerative medicine and synthetic bioengineering. Understanding the dynamics of signals orchestrating large-scale order is essential for developing interventions. While chemical signal dynamics are increasingly understood, endogenous bioelectric signals represent a parallel regulatory system controlling growth and form. Bioelectric signaling underpins biological pattern control, with endogenous bioelectric gradients serving as early pre-patterns for transcriptional and morphogenetic events. For example, specific transmembrane voltage (Vmem) patterns determine facial and brain development in frogs. Modulating cell Vmem can alter anatomy, inducing ectopic eye formation, reprogramming planarian regeneration, and rescuing brain patterning despite mutated neurogenesis genes. Thus, bioelectric signaling is a powerful tool for controlling biological patterns.\", \"section\": \"Introduction\", \"topic\": \"Bioelectric signaling in development\", \"chunk_summary\": \"Endogenous bioelectric signals are a key regulatory system in development, acting as pre-patterns for morphogenesis and influencing large-scale anatomy, as demonstrated by examples in frog development and planarian regeneration.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"1\"},\n{\"text\": \"Single-cell Vmem regulates processes like proliferation, cell death, and differentiation, and influences immune cell activation. While single-cell bioelectric properties are understood, bioelectric states regulate large-scale anatomical properties like axial polarity, organ size and shape, and appendage induction. Pattern control involves long-range coordination of bioelectric states, crucial in processes like metastatic conversion, tumor suppression, brain size regulation, and planarian regeneration.  Cells are electrochemically connected via gap junctions (GJ) and ephaptic coupling, creating bioelectrical circuits with long-range signal patterns essential for embryonic development, limb development, wound healing, and tumor suppression.  The ability of cells to communicate via these networks is crucial, and disruptions, such as improper GJ function, are implicated in diseases like cancer. Altering bioelectric connectivity can rewrite target morphology, as seen in planarian flatworms regenerating with different species' head shapes or permanently altered two-headed forms. This highlights the importance of understanding how electrical gradients self-organize and evolve in multicellular networks.\", \"section\": \"Introduction\", \"topic\": \"Local and Long-Range Order in Bioelectrical Networks\", \"chunk_summary\": \"Bioelectric states regulate large-scale anatomy through long-range coordination facilitated by gap junctions and ephaptic coupling, forming bioelectrical circuits crucial for development and regeneration, while disruptions in these networks are linked to disease.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"2\"},\n{\"text\": \"The trans-epithelial potential (TEP), a voltage gradient at the outer boundary of organs or organisms, is implicated in developmental processes, wound healing, and diseases like cystic fibrosis, fungal infection, inflammation, and cancer.  The TEP is created by impermeable tight junctions (TJ) between cells at the exterior boundary, and disruptions induce electric fields that guide migratory cells during injury response and limb development. Understanding the spatio-temporal transitions of plasma membrane voltage gradients and TEPs is crucial for developmental bioelectricity and its applications.\", \"section\": \"Introduction\", \"topic\": \"Transepithelial Potential (TEP)\", \"chunk_summary\": \"The trans-epithelial potential (TEP), formed by tight junctions, plays a role in development, wound healing, and disease, with disruptions creating electric fields that guide cell migration.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"2\"},\n{\"text\": \"Understanding and controlling patterning signals requires quantitative models of their dynamics. While platforms exist for modeling brain spiking activity, few frameworks model bioelectric signaling in somatic cell pattern regulation, especially from the perspective of ionic concentrations and movements. Biorealistic models are crucial for developing effective interventions targeting bioelectric control processes. Ion channels and GJs are voltage-sensitive, enabling complex non-linear behaviors and feedback loops difficult to predict by inspection.  A flexible platform for in silico experimentation and model-building, connecting bioelectric dynamics with other physiological aspects, physical forces, and genetic networks, is needed.\", \"section\": \"Introduction\", \"topic\": \"Modeling Bioelectric Signaling\", \"chunk_summary\": \"Biorealistic models of bioelectric signaling, considering ionic concentrations and movements, are crucial for understanding and controlling patterning signals, especially given the complex non-linear dynamics of voltage-sensitive ion channels and gap junctions.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"2\"},\n{\"text\": \"A realistic bioelectricity modeling system will enable: (1) modeling specific patterning events based on physiological and channel expression data; (2) designing intervention strategies to induce desired electrical state changes and patterning outcomes; and (3) investigating bioelectrical networks' capabilities for synthetic biology and unconventional computation.  We created the Bio-Electric Tissue Simulation Engine (BETSE) to explore bioelectrical signals in cell collectives. BETSE integrates various mechanisms and physiologies for model building and hypothesis testing, including electrodiffusion of multiple ions, consideration of concentration, charge, voltage, and current in intra- and extracellular networks, and dynamic control of membrane permeability and gap junction state. This work is the first in a series modeling specific patterning systems and using BETSE to infer targeted modulation strategies. Here, we discuss BETSE's design, validate its performance, and provide insights into patterning mechanisms in multicellular clusters.\", \"section\": \"Introduction\", \"topic\": \"BETSE and its applications\", \"chunk_summary\": \"BETSE, a bioelectric tissue simulation engine, enables realistic modeling of bioelectric phenomena, allowing for the design of interventions and exploration of bioelectrical networks for synthetic biology and computation.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Presenting new results\", \"page_number\": \"3\"},\n{\"text\": \"Voltages in biological systems are created by net electrical charge from ion concentration profiles. Ion fluxes generate current, associated with intracellular and tissue-wide electric fields. BETSE considers ions like Na+, K+, Cl¯, Ca2+, HCO₃⁻, H+, and charged macromolecules (X¯), as well as charged biomolecules (Yn¯ or Yn+) at low concentrations. Cells control Vmem by altering ion fluxes across their membrane. Ion pumps, like Na/K-ATPase, create ionic charge density and voltage gradients. Ion channels allow charge movement, altering charge densities and creating bioelectrical signals. BETSE tracks ion concentrations and fluxes, calculates net charge distributions, voltages, concentration changes from fluxes and pumps, and endogenous currents. Membrane permeability simulates ion channel action. Further details on BETSE's theory and implementation are in Supplementary Material. Table 1 summarizes key parameters and variables. Figure 1 shows a simplified bioelectrical \\\"circuit\\\" implemented in BETSE.\", \"section\": \"Materials and Methods\", \"topic\": \"Model Overview\", \"chunk_summary\": \"BETSE models bioelectrical systems by tracking ion concentrations and fluxes, calculating voltages and currents, and simulating ion channel action through membrane permeability.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"3\"},\n{\"text\": \"BETSE is a finite volume method multiphysics simulator specialized for bioelectric phenomena in spatially heterogeneous biological tissues. Implemented in Python 3.4 using Numpy, Scipy, and Matplotlib, BETSE uses matrix-based solvers, with memory limiting simulation size. Simulating a square millimeter of tissue (~10,000 cells) with all features uses ~14 Gb of RAM. BETSE code is publicly available.\", \"section\": \"Materials and Methods\", \"topic\": \"BETSE Platform and Performance\", \"chunk_summary\": \"BETSE, a Python-based finite volume method simulator, is specialized for bioelectric tissue simulation, with memory being the primary limitation on simulation size.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"4\"},\n{\"text\": \"Biological tissue's heterogeneous nature, with closely spaced cells interacting with a small extracellular space and connected internally via gap junctions, presents modeling challenges. BETSE uses an irregular Voronoi diagram-based cell grid within a regular square environmental grid to model this complexity. Each cell has a center point for scalar properties (ci, Vcell), a volume (volcell), and a perimeter. Membrane properties (Vmem) are defined for each membrane segment, allowing for studying individual cell polarizations. Membrane-specific properties are defined at membrane segment midpoints, interfacing with environmental grid points via interpolation. A weighting function conserves mass and charge. The interconnected grids allow shaping the cluster, cutting holes for vasculature or wounding, and assigning properties using bitmaps.\", \"section\": \"Materials and Methods\", \"topic\": \"Core Mathematical Strategy\", \"chunk_summary\": \"BETSE uses interconnected Voronoi and square grids to model the heterogeneous nature of biological tissues, allowing for detailed representation of cell and membrane properties and simulation of complex tissue shapes and wounding.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"5\"},\n{\"text\": \"BETSE's core mathematical operators are gradient (∇sj), divergence (∇ · Fj), and Laplacian (∇²sj). Discrete versions of these operators are defined on the cell and environmental grids using finite difference and finite volume techniques. These operators are used in specific differential equation expressions.\", \"section\": \"Materials and Methods\", \"topic\": \"Core Mathematical Operators\", \"chunk_summary\": \"BETSE utilizes discrete versions of gradient, divergence, and Laplacian operators on its grids for solving differential equations related to bioelectric phenomena.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"5\"}\n]\n```",
  "processed_at": "2025-08-05T10:55:21.236135",
  "enriched_at": "2025-08-11T14:49:12.172801",
  "enrichment_methods": [
    "crossref"
  ]
}