{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_448752_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_448752.pdf",
    "file_size": 39665,
    "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
    "journal": "Biomaterials",
    "doi": "10.1016/j.biomaterials.2013.05.040",
    "year": "2013",
    "title": "Bioelectric modulation of wound healing in a 3D in vitro model of tissue-engineered bone",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Long-standing interest in bioelectric regulation of bone fracture healing has primarily focused on exogenous stimulation of bone using applied electromagnetic fields. Endogenous electric signals, such as spatial gradients of resting potential among non-excitable cells in vivo, have also been shown to be important in cell proliferation, differentiation, migration, and tissue regeneration, and may therefore have as-yet unexplored therapeutic potential for regulating wound healing in bone tissue. To study this form of bioelectric regulation, there is a need for three-dimensional (3D) in vitro wound tissue models that can overcome limitations of current in vivo models. We present a 3D wound healing model in engineered bone tissue that serves as a pre-clinical experimental platform for studying electrophysiological regulation of wound healing. Using this system, we identified two electrophysiology-modulating compounds, glibenclamide and monensin, that augmented osteoblast mineralization. Of particular interest, these compounds displayed differential effects in the wound area compared to the surrounding tissue. Several hypotheses are proposed to account for these observations, including the existence of heterogeneous subpopulations of osteoblasts that respond differently to bioelectric signals, or the capacity of the wound-specific biochemical and biomechanical environment to alter cell responses to electrophysiological treatments. These data indicate that a comprehensive characterization of the cellular, biochemical, biomechanical, and bioelectrical components of in vitro wound models is needed to develop bioelectric strategies to control cell functions for improved bone regeneration.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "A 3D in vitro wound model was developed to study the effects of bioelectric signals on bone healing, revealing differential effects of glibenclamide and monensin on mineralization in wound and surrounding tissue.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Endogenous electrical signals play an instructive role in many cellular behaviors, including in vitro cell proliferation, differentiation, and migration, and in vivo tissue wound healing and regeneration. Endogenous wound electric fields (EFs) have been measured in a wide range of wounded and regenerating tissues, including amputated newt limbs, bone fractures, corneal wounds, and skin wounds. In these injured tissues, a potential difference results from ion flux across leaky cell membranes or disrupted tissue barriers, establishing a wound EF. Disruption of the electrical currents that result from the wound EF has been shown to interfere with regeneration events, demonstrating that these currents are necessary for tissue regeneration. Application of exogenous fields can also induce a degree of regeneration in cases where regeneration does not normally occur. On the cellular level, exogenously-applied EFs within the physiological range have been shown to act as a guidance cue for migration in numerous cell types, including keratinocytes, corneal epithelial cells, and human bone marrow mesenchymal stem cells (hMSCs), and can be adjusted to direct migration toward or away from a wound. Electrical signaling may also coordinate the participation of the nervous and vascular systems in the wound healing process. EFs stimulate nerve sprouting toward the wound, migration of vascular endothelial cells, and angiogenesis. Altogether, these observations point to a critical role for electrical signaling in wound healing, and suggest that current strategies for directed tissue repair and regeneration may benefit from a bioelectric approach.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in wound healing",
      "chunk_summary": "Endogenous electric fields play a crucial role in wound healing and regeneration, influencing cell proliferation, differentiation, migration, and nerve and vascular system participation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Bone healing is often studied in vivo by creating an artificial fracture, then applying cells or soluble factors into the defect or implanting engineered bone constructs. Numerous fracture models have been developed to study different repair outcomes, including normal fracture repair, delayed union, nonunion, segmental defects, and fractures at risk of impaired healing, and have been established in a wide range of animal species, including rat, mouse, rabbit, dog, primate, sheep, pig, and cat. In general, the bone repair process has been partitioned into several characteristic stages: initial inflammatory response, soft callus formation, hard callus formation, initial bony union and bone remodeling. The in vivo environment provided by animal models successfully captures the three-dimensional (3D) nature of cell-cell and cell-matrix interactions that occur during these phases of repair, overcoming the two-dimensional (2D) limitations imposed by monolayer cell culture. However, animal fractures may not accurately reflect the biochemistry, biomechanics, anatomy, physiology, and healing processes of human fractures; thus, designing an animal model that adequately models human bone repair can be challenging.",
      "section": "Introduction",
      "topic": "In vivo bone fracture models",
      "chunk_summary": "In vivo animal models, while capturing the 3D nature of bone repair, may not accurately reflect human fracture healing processes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "To better understand bioelectric regulation of bone regeneration, there is a need for in vitro human tissue systems in which this form of control can be studied. Electric signaling in in vitro bone has been studied mostly in the context of exogenously-applied electrical stimulation of osteogenic cells in 2D and 3D cultures. Because of the multiple cellular processes affected by applied electric fields, mechanistically integrating data on electric field effects with biochemical and genetic pathways requires an in vitro system in which transmembrane potential in key cells can be directly regulated by manipulation of ion conductances in the cell membrane. However, to our knowledge, there have been no studies of the role of endogenous electrical properties, as distinct from exogenously-applied stimulation, in osteoblast physiology in a 3D model. Hence, there is a need for a 3D in vitro model of bone wound healing as a platform in which to study human osteoblast electrophysiology during tissue repair. This approach would provide an in vitro mimic for in vivo conditions with relevant 3D features, allowing more control of the system than can be achieved in vivo and providing options for statistical validation. Such an in vitro model could provide insight into key therapeutic directions to pursue in vivo.",
      "section": "Introduction",
      "topic": "Need for 3D in vitro bone wound model",
      "chunk_summary": "A 3D in vitro model of bone wound healing is needed to study the role of endogenous electrical properties in osteoblast physiology and tissue repair.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Whole bone marrow aspirate from a 25-year old healthy male was purchased from Lonza, and hMSCs were isolated as we have previously reported. Fluorescence activated cell sorting confirmed the presence of the cell surface antigens CD105, CD73, and CD90 in the harvested hMSCs. Cells were expanded in tissue culture flasks in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), penicillin (100 U/mL), streptomycin (100 µg/mL), 0.1 mM non-essential amino acids, and basic fibroblast growth factor (bFGF, 1 ng/mL) (Invitrogen, Carlsbad, CA). Cells were maintained in a humidified incubator at 37°C with 5% CO₂ and 5% O₂ until initiation of differentiation. Medium was changed every 3–4 days until confluence, when cells were then trypsinized with 0.25% trypsin-1mM EDTA (Invitrogen), and frozen in liquid nitrogen in FBS with 8% DMSO.",
      "section": "Materials and Methods",
      "topic": "hMSC cultivation",
      "chunk_summary": "hMSCs were isolated from bone marrow aspirate, expanded in culture, and characterized by cell surface markers.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "To stimulate bone formation, hMSC-seeded scaffolds were cultured in osteogenic (OS) medium, consisting of α-MEM supplemented with 10% FBS, penicillin (100 U/mL), streptomycin (100 µg/mL), 10 mM β-glycerophosphate, 0.05 mM L-ascorbic acid-2-phosphate, and 100 nM dexamethasone (Sigma-Aldrich, St. Louis, MO). Undifferentiated hMSCs were maintained in control medium, consisting of DMEM supplemented with 10% FBS, penicillin (100 U/mL), streptomycin (100 µg/mL), and 0.1 mM non-essential amino acids.",
      "section": "Materials and Methods",
      "topic": "hMSC differentiation",
      "chunk_summary": "hMSCs were differentiated towards osteoblasts using osteogenic medium containing specific supplements.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Cells were treated with several electrophysiology-modulating compounds, which were added to osteogenic medium. These include glibenclamide (GL, 10 µM), monensin (MO, 10 nM), barium chloride (BA, 100 µM), and potassium gluconate (High K⁺, HK, 40 mM) (Sigma-Aldrich).",
      "section": "Materials and Methods",
      "topic": "Electrophysiology-modulating compounds",
      "chunk_summary": "Several electrophysiology-modulating compounds, including glibenclamide, monensin, barium chloride, and potassium gluconate, were used to treat the cells.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Silk fibroin was isolated from Bombyx mori cocoons as described previously. Briefly, sericin was extracted from cocoons by boiling in 0.2 M sodium carbonate and rinsing in distilled water. The remaining silk fibroin was dissolved in 9.3 M LiBr for 4 hr at 60°C, then dialyzed for 48 hours in dialysis cassettes with 3500MW cutoff (Pierce, Rockford, IL). Dialyzed silk solution was centrifuged twice at 9000 rpm and 4°C for 20 minutes, then diluted to a 6% solution with distilled water. Silk solution was cast into cylindrical containers filled with NaCl granules of diameters of 500–600 µm and allowed to solidify for 72 hours. Salt crystals were leached from scaffolds by rinsing in distilled water for 48 hours to obtain porous scaffolds.",
      "section": "Materials and Methods",
      "topic": "Silk scaffold preparation",
      "chunk_summary": "Porous silk scaffolds were prepared by leaching salt crystals from solidified silk fibroin solution.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Tissue-engineered bone was generated by differentiating hMSCs on porous silk scaffolds. One million hMSCs were seeded onto each silk scaffold (6 mm diameter × 3 mm height) and were differentiated toward osteoblasts for six weeks. Silk scaffolds were wounded by cutting the tissue in half in cross-section, and inserting a fresh unseeded silk scaffold (6 mm diameter × 1.5 mm height) between the two cut halves of the tissue, simulating implantation of a silk scaffold into a bone defect. The triple-layered structure was held together by a thin stainless steel wire inserted through the center of the scaffolds with two rubber stoppers at either end securing the scaffolds together. The constructs were cultured for an additional six weeks, with or without electrophysiology-modulating compounds in the medium. GL, MO, BA, and HK were added for the entire six weeks following wounding. One group was treated with HK for the first three weeks after wounding, followed by BA for the last three weeks (KB). At the end of the total twelve weeks, the scaffolds were harvested for analysis of cell ingrowth and osteogenic differentiation (Figure 1A).",
      "section": "Materials and Methods",
      "topic": "3D bone wound model",
      "chunk_summary": "A 3D bone wound model was created by wounding tissue-engineered bone constructs and culturing them with or without electrophysiology-modulating compounds.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Matrix calcification was determined by a colorimetric assay using the Calcium (CPC) Liquicolor Test (Stanbio Laboratory, Boerne, TX). Calcium was dissociated with trichloroacetic acid and reacted with o-cresolphthalein complexone. The colored reaction product was measured spectrophotometrically at 575 nm using a microplate reader (VersaMax, Molecular Devices, Sunnyvale, CA). Mineral deposition was also visualized by Alizarin Red staining. Samples were fixed in 10% formalin, embedded in paraffin, cut into 8 µm sections, and stained with Alizarin Red S (Sigma-Aldrich). Quantitative real time PCR was used as previously described to quantify expression of several bone markers, including runt-related transcription factor 2 (Runx2), Collagen I alpha 1 (Col 1), alkaline phosphatase (ALP), and bone sialoprotein (BSP). Briefly, total RNA was isolated from hMSCs using Trizol reagent (Invitrogen) following the single step acid-phenol guanidinium method, and purified using the Qiagen RNEasy kit (Qiagen, Valencia, CA). Reverse transcription was performed on the purified RNA using the High Capacity cDNA Reverse Transcription kit (Applied Biosystems, Foster City, CA). Transcript expression levels were quantified using a Stratagene Mx3000P QPCR System (Stratagene, La Jolla, CA). Primers and probes for bone-related genes were obtained from TaqMan® Gene Expression Assay kits (Applied Biosystems). Expression levels were normalized to the housekeeping gene glyceraldehyde 3-phosphate dehydrogenase (GAPDH) and reported relative to untreated OS cells. We have previously reported PCR reaction conditions and primers.",
      "section": "Materials and Methods",
      "topic": "Assessment of OS differentiation",
      "chunk_summary": "Osteogenic differentiation was assessed by measuring matrix calcification, Alizarin Red staining, and quantifying bone marker gene expression using qPCR.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Cell content of scaffolds was assessed with the Quant-iT Picogreen dsDNA assay according to the manufacturer's instructions (Invitrogen). Additionally, cell distribution within the scaffolds was visualized by histological staining of scaffold sections. Scaffolds were fixed in 10% formalin, embedded in paraffin, cut into 8 µm sections, and stained with hemotoxylin and eosin for nuclei and cytoplasm.",
      "section": "Materials and Methods",
      "topic": "Assessment of cell content",
      "chunk_summary": "Cell content and distribution within scaffolds were assessed using DNA quantification and histological staining.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "OS-differentiated hMSCs were stained with a voltage-sensitive fluorescent dye. Bis-(1,3-diethylthiobarbituric acid)trimethine oxonol (DiSBAC, Invitrogen) is an anionic voltage-sensitive dye whose uptake into cells is voltage-dependent: higher uptake is seen in more depolarized cells. A fresh solution of 10 mM DiSBAC in DMSO was prepared and diluted to 0.5 µM in Hank's Buffered Salt Solution (HBSS, Invitrogen). Cells grown in glass-bottom dishes (poly-D-lysine coated, No. 1.5, MatTek Corp., Ashland, MA) were incubated in DiSBAC for 20 minutes at 37°C, equilibrated to room temperature for 10 minutes, then imaged while submerged in dye. Images were acquired on a Leica TCS SP2 laser scanning confocal microscope with an inverted DM IRE2 stand (Wetzlar, Germany) and a Leica PL APO 63x (NA 1.2) water-immersion objective. DiSBAC was excited with a 543 nm HeNe laser; images were collected at 570 ± 5 nm by a non-descanned PMT controlled by Leica Confocal Software. A double dichroic filter was used to eliminate excitation light. To visualize membrane potential changes, cells at resting potential were imaged as above, exposed to test compound and allowed to equilibrate for 5 min, then imaged once more. MATLAB software (The MathWorks, Inc.) was used to assist in the drawing of regions of interest (ROI) around cells and in calculating pixel intensities within the ROIs. ROIs were drawn on thresholded images by using the function bwboundaries to trace cells and their nuclei. Fluorescence intensities of cells encircled by ROIs were calculated by averaging corresponding pixel intensities in the original image, excluding pixels within encircled nuclei, after background correction using a blank (no cell) region of the image.",
      "section": "Materials and Methods",
      "topic": "Confocal imaging using voltage-sensitive fluorescent dye",
      "chunk_summary": "Membrane potential changes were visualized using the voltage-sensitive fluorescent dye DiSBAC and confocal microscopy.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Data are reported as means ± standard deviation. One-way ANOVA statistical analysis was performed, followed by the Tukey-Kramer post-hoc test. In bar graphs, means labelled with the same letter are not significantly different from one another (Tukey-Kramer, p>0.05).",
      "section": "Materials and Methods",
      "topic": "Statistics",
      "chunk_summary": "Statistical analysis was performed using one-way ANOVA and Tukey-Kramer post-hoc test.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "To quantify the effects of our chosen pharmacological reagents on membrane potential (V_mem) of osteogenic-differentiated hMSCs, we used the voltage-sensitive fluorescent dye DiSBAC to measure relative changes in V_mem after treatment with the drugs. All of the pharmacological treatments caused increases in fluorescence, which is indicative of depolarization. Due to inter-cell variability, however, the average increases in fluorescence after glibenclamide, monensin, and barium treatments were not statistically different from that of cells treated with a blank solution (6.95 ± 5.44%, 5.72 ± 4.52%, 2.17 ± 2.87%, versus -1.65 ± 4.41 %, p>0.05) (Figure 1B). This variability likely arises from the inherent heterogeneity of hMSC populations, a heterogeneity that includes expression of different ionic currents. In our heterogeneous population of hMSCs, we observed that for a given reagent (glibenclamide, monensin, or barium), some cells responded with V_mem depolarization, while other cells did not respond with any V_mem change. In contrast, high K⁺ caused a large and significant increase in fluorescence (61.41 ± 16.70 %, p << 0.001) (Figure 1B), a response that was consistently observed in all cells. We conclude that our electrophysiological reagents do induce V_mem depolarization, but the heterogeneity of the cell population causes some reagents (glibenclamide, monensin, and barium) to elicit a response from only a subpopulation of cells.",
      "section": "Results",
      "topic": "Membrane voltage response to pharmacological modulation",
      "chunk_summary": "Pharmacological treatments induced V_mem depolarization, but heterogeneity in hMSC populations resulted in variable responses to glibenclamide, monensin, and barium, while high K+ consistently depolarized all cells.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Histological evaluation of the outer scaffolds of the bone wound model indicated that overall cell distribution and content within the scaffolds was dense and uniform. Cells filled the entire pores of the outer scaffolds regardless of treatment (Figure 2A–F). Measurement of DNA content of the scaffolds revealed that glibenclamide treatment caused a statistically significant decrease in cell content compared to monensin-treated, barium-treated, high K⁺-barium-treated, and untreated scaffolds (1.5-fold, p<0.006; 1.5-fold, p<0.02; 1.5-fold, p<0.02; and 1.6-fold, p<0.002) (Figure 2G). Cell distribution was less homogenous and dense in center scaffolds compared to outer scaffolds. Histological staining revealed that some scaffold pores were loosely filled with cells, other pores were only lined with cells along the pore edge, while other pores lacked cells completely (Figure 3A-F). None of the treated center scaffolds demonstrated significant changes in DNA content compared to the untreated OS group (Figure 3G). However, among the treated scaffolds, the KB-treated group exhibited a statistically significant increase in cell content relative to both the monensin-treated and the high K⁺-treated groups (1.4-fold, p < 0.04, and 1.6-fold, p < 0.004, respectively) (Figure 3G). Overall, we conclude that cell content in outer scaffolds was decreased by glibenclamide treatment compared to all conditions except high K⁺ treatment, and that cell content in center scaffolds was increased by high K⁺-barium treatment compared to monensin and high K⁺ treatments.",
      "section": "Results",
      "topic": "Effect of electrophysiological modulation on cell content and distribution",
      "chunk_summary": "Glibenclamide decreased cell content in outer scaffolds, while high K⁺-barium treatment increased cell content in center scaffolds compared to monensin and high K⁺ treatments.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "To analyze the extent of mineralization within the bone wound model, both outer and center scaffolds were sectioned and stained with Alizarin Red, and calcium content was quantified biochemically. All outer scaffolds were positive for Alizarin Red staining (Figure 4A–F). However, staining was unevenly distributed for most scaffolds. We observed a combination of scattered punctate staining, staining of the silk pore lining, as well as broad, dense staining throughout the pores. Glibenclamide-treated outer scaffolds showed the greatest degree of uniformity, exhibiting heavy, dense staining throughout most of the scaffold (Figure 4B). Biochemical analysis of calcium content revealed that glibenclamide and monensin treatments increased calcification significantly by 2.7-fold and 1.6-fold, respectively, compared to untreated outer scaffolds (p≪0.001 and p<0.002, respectively) (Figure 4G). The other treatments did not have significant effects. Alizarin Red staining was greatly reduced in center scaffolds compared to outer scaffolds. We did not observe any punctate staining or any dense staining throughout entire pores. Instead, center scaffolds displayed heavy staining only along the silk pore edges (Figure 5A-H). All V_mem treatments altered mineral content of the center scaffolds. Only monensin treatment yielded an increase (1.8-fold) in calcium content (p<0.03) (Figure 5G). Glibenclamide, barium, high K⁺, and high K⁺/barium treatments produced significantly less calcium in the center scaffolds (4.5-fold decrease, 5.0-fold decrease, 24.2-fold decrease, and undetectable, respectively) (p<0.04, p<0.03, p<0.007, respectively) (Figure 5G). Thus, electrophysiological modulation of wounded bone constructs induced a response in mineralization, a late-stage osteogenic marker, and this response differed between outer and center scaffolds. Monensin increased mineralization in both outer and center scaffolds. Glibenclamide increased mineralization in outer scaffolds, but decreased mineralization in center scaffolds. Barium, high K⁺, and high K⁺/barium treatments had no effect on outer scaffolds, but decreased mineralization in center scaffolds.",
      "section": "Results",
      "topic": "Effect of electrophysiological modulation on scaffold mineralization",
      "chunk_summary": "Glibenclamide and monensin increased mineralization in outer scaffolds, while only monensin increased mineralization in center scaffolds; other treatments decreased mineralization in center scaffolds.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "We next analyzed the expression of key mRNA markers to examine transcriptional events downstream of biophysical modulation. While electrophysiology-altering reagents did not have statistically significant effects on bone transcript expression in center scaffolds, they did alter gene expression in outer scaffolds. Runx2 expression was not significantly different in treated groups compared to the untreated OS group. However, glibenclamide-treated scaffolds did show significantly lower Runx2 expression compared to barium-treated, high K⁺-treated, and the high K⁺/barium-treated groups (Figure 6A). Col 1 expression was increased in high K⁺/barium-treated groups compared to all other groups. In addition, Col 1 expression in the barium-treated group was lower than in the untreated OS group (Figure 6B). ALP expression was higher in the glibenclamide-treated group compared to all groups except the monensin-treated group (Figure 6C). BSP expression was elevated in the high K⁺-treated group compared to all other groups (Figure 6D). Electrophysiological treatments therefore altered the expression of early, intermediate, and late markers of osteogenic differentiation. Each treated group exhibited a unique osteogenic gene expression profile, suggesting that the different bioelectric treatments produced slight differences in the differentiated state of the cells.",
      "section": "Results",
      "topic": "Effect of electrophysiological treatments on expression of bone genes",
      "chunk_summary": "Electrophysiological treatments altered bone gene expression in outer scaffolds, with each treatment producing a unique osteogenic gene expression profile.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "We and others have previously reported many strategies for bone tissue engineering using a wide variety of polymeric and natural biomaterials. These efforts aim to stimulate important cellular events in osteochondral development and regeneration by providing appropriate biochemical and biophysical cues, with the goal of engineering implantable bone-like constructs to fill a defect. Beyond serving as implantable replacements for diseased or damaged native tissue, engineered tissues may also function as ex vivo platforms in which tissue response to various stimuli can be tested. Development of such pre-clinical models would be invaluable for studying the wound healing behavior of a human tissue in a tightly controlled, ex vivo environment. Of particular interest in this study is the role of bioelectrical cues in regulating bone formation and healing. Clinically, electromagnetic fields have been applied to bone fractures to promote healing via direct current, capacitive coupling, or inductive coupling methods. However, the utility and efficacy of these treatments is still not widely accepted due to inconsistent experimental designs and variable dosages, and the fundamental difficulty of mechanistically linking the many diverse effects of exogenous electromagnetic field exposure to changes in endogenous bioelectrical (V_mem) and genetic (transcriptional) cell regulatory pathways. In vitro studies of osteoblasts in monolayer cultures and in 3D scaffolds have shown that applied electric fields induce changes in morphology, proliferation, gene expression, differentiation markers, stress markers, and Ca²⁺ dynamics. Less is known, however, about the role of endogenous electrical signaling, rather than exogenous electrical stimulation, in bone repair. Tissue-engineered bone offers a suitable in vitro model system for studying endogenous electrical properties of bone tissue during wound healing. We have previously reported an engineered 3D bone model system in which osteogenic-differentiated hMSCs are grown in porous, aqueous-derived silk fibroin scaffolds. This in vitro model supported cell proliferation and increased several markers of the bone phenotype, including ALP activity; calcium deposition; gene expression of Col 1 and ALP; and protein expression of Col 1, osteopontin, bone sialoprotein, and matrix metalloproteinase 13. In our present study, we developed this model further to incorporate a wounding component.",
      "section": "Discussion",
      "topic": "Bioelectric cues in bone tissue engineering",
      "chunk_summary": "This study investigates the role of endogenous bioelectrical cues in bone regeneration using a 3D tissue-engineered bone wound model, addressing the limitations of exogenous electromagnetic field application.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "In this study, we screened a number of compounds in our tissue-engineered bone wound model, specifically focusing on reagents that directly perturb resting potential. One group of scaffolds was treated with monensin, an ionophore with selectivity for the Na⁺ ion. Monensin-induced Na⁺ currents have been shown to initiate tail regeneration following tail amputation in Xenopus laevis, and indeed induce the regeneration of complete Xenopus limbs. We treated our engineered bone constructs with monensin to determine whether induction of a sodium current could similarly improve healing in engineered bone. Another group of scaffolds was treated with glibenclamide, an antagonist of the inward rectifying, ATP-sensitive K⁺ channel (Kir 6.x). Pharmacologic modulation of Kir 6.x channel activity was previously shown to regulate osteogenic differentiation of hMSCs. Additionally, expression of the various Kir6.x subunits was shown to be differentially regulated on the gene and protein level during both osteogenic and adipogenic differentiation, suggesting a possible role for Kir6.x in hMSC differentiation. We used glibenclamide in our model to determine whether modulation of Kir6.x activity could stimulate osteoblast differentiation in the wound. Another group of scaffolds was treated with barium chloride, a general K⁺ channel blocker, to compare the effects of specific vs. broad K⁺ channel inhibition. Finally, another group of scaffolds was depolarized by high extracellular [K⁺]. Modulation of V_mem by high K⁺ was previously shown to down-regulate the progression of hMSC differentiation and also to alter the mature phenotype of differentiated cells. Loss of mature phenotype could be useful for mobilizing cells in the wound environment, similar to de-differentiation events that have been reported in several systems, such as zebrafish heart and fin regeneration, urodele limb regeneration, and Schwann cell de-differentiation following nerve injury. We included a group of scaffolds treated first with high K⁺, then with barium chloride, to determine if, after responding to a de-differentiation signal, cells could also respond to another electrophysiological signal regulating differentiation.",
      "section": "Discussion",
      "topic": "Electrophysiology-modulating compounds",
      "chunk_summary": "The study screened compounds that perturb resting potential, including monensin, glibenclamide, barium chloride, and high extracellular [K⁺], to investigate their effects on bone healing and differentiation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Evaluation of cell content of the scaffolds indicated that glibenclamide-treated outer scaffolds had a significantly lower number of cells than untreated scaffolds, although this was not apparent when observing the tissue sections by eye. This indicates that hMSC-derived osteoblasts are sensitive to blockade of the ATP-sensitive Kir 6.x channel. Interestingly, however, this effect was not seen with barium chloride, a general K⁺ channel blocker. Cell content is therefore decreased when Kir6.x channels specifically are antagonized. Why was there a decrease in cell numbers? Cell proliferation and differentiation are often oppositely regulated: since glibenclamide-treated outer scaffolds showed a greater amount of differentiation, there may have been a concomitant decrease in cell proliferation. Alternatively, some cells may have undergone apoptosis, another feature of bone remodeling and a part of the regeneration process.",
      "section": "Discussion",
      "topic": "Effect of glibenclamide on cell content",
      "chunk_summary": "Glibenclamide treatment decreased cell content in outer scaffolds, suggesting sensitivity of hMSC-derived osteoblasts to Kir 6.x channel blockade, potentially due to decreased proliferation or apoptosis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "After wounding, cells from our tissue-engineered bone constructs were detected in the center scaffolds. This demonstrates that the osteogenic cells do possess the potential to participate in wound healing by repopulating the wound area. This may resemble early phases of fracture healing in vivo, where both osteoprogenitor cells and undifferentiated mesenchymal stem cells aggregate at the wound site, then undergo proliferation and differentiation along chondrogenic and osteogenic lineages. In our in vitro healing model, it is unclear whether the cell population in the center scaffolds arises primarily from cell migration from the surrounding scaffolds, from proliferation of a small migrating population, or from a combination of the two. Future studies may utilize lineage-tracing dyes during time-course evaluation of the wound area to follow the behavior of these cells. The observation that even untreated cells were able to partially re-populate the wound indicates that our engineered bone model possesses a baseline degree of regenerative potential. This raises the question of how to evaluate and determine the limits to an engineered tissue's in vitro regenerative potential. This is analogous to defining a critical size bone defect (CSBD) in an in vivo wound model. Establishing such a parameter is not a trivial matter. The CSBD has been defined as the smallest sized defect that will not completely heal over the lifetime of the animal. Some variants of the above CSBD definition include a defect that has less than 10% regeneration during the lifetime of the animal, and a segmental bone deficiency whose length is greater than 2–2.5 times the diameter of the bone. CSBD values can be influenced by factors including animal breed and age, bone location, surgical fixation, defect size, the presence of the periosteum, and biomechanical conditions. Thus, the CSBD value for an animal model is dependent both on the biology of the model and on the metric chosen to define the CSBD.",
      "section": "Discussion",
      "topic": "Cell repopulation of wound area and critical size bone defect",
      "chunk_summary": "Osteogenic cells repopulated the wound area, suggesting regenerative potential; defining a critical size bone defect (CSBD) for in vitro models presents challenges due to various factors.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    },
    {
      "text": "Defining an analogous CSBD value for in vitro studies requires further consideration of additional factors, including the ambiguity of the term ‘lifetime' for an in vitro construct, the range of measures available for evaluating regeneration, the variability in defining when an in vitro wound has completely healed, and the possible irrelevancy of employing a ratiometric definition of CSBD (gap-length:bone-diameter) due to arbitrary scaffold dimensions. Because of these complications, this study did not undertake the task of defining an in vitro CSBD value. However, an appropriate CSBD value could be explored using this model by investigating the effects of altering various parameters of the bone model (including dimensions of the scaffold and the wound gap) and by setting reasonable metrics with which to define complete healing and construct lifetime. In this study, rather than define an in vitro CSBD value, a wound gap length was chosen and the endogenous healing properties of the bone construct within the wound were characterized. Subsequently, the regenerative effect of several electrophysiological treatments was determined relative to this baseline evaluation. Because an in vitro model likely has lower regeneration potential compared to native tissue and because of the small size of engineered constructs used in this study (3mm in height) compared to entire bones in vivo, a gap-length:bone-diameter ratio was chosen that is significantly less than what has been reported for in vivo CSBDs (0.25 for this study vs. 2-2.5 for some CSBD criteria), so as not to far exceed the possibility for regeneration.",
      "section": "Discussion",
      "topic": "Defining CSBD for in vitro studies",
      "chunk_summary": "Defining a CSBD in vitro requires considering factors like construct \"lifetime\" and healing metrics; this study characterized endogenous healing properties and electrophysiological treatment effects relative to a chosen wound gap length.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_448752.pdf",
      "original_filename": "pdf_20250803_124125_448752_extracted_text.txt",
      "authors": "[\"Sarah Sundelacruz\", \"Chunmei Li\", \"Young-Jun Choi\", \"Michael Levin\", \"David L. Kaplan\"]",
      "year": "2013",
      "journal": "Biomaterials",
      "doi": "10.1016/j.biomaterials.2013.05.040"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:35:16.737052",
  "enriched_at": "2025-08-11T14:37:56.255267",
  "enrichment_methods": [
    "crossref"
  ]
}