{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_799133_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_799133.pdf",
    "file_size": 20273,
    "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
    "journal": "npj Regenerative Medicine",
    "doi": "10.1038/s41536-017-0012-5",
    "year": "2017",
    "title": "Serotonergic stimulation induces nerve growth and promotes visual learning via posterior eye grafts in a vertebrate model of induced sensory plasticity",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Serotonergic stimulation induces nerve growth and promotes visual learning via posterior eye grafts in a vertebrate model of induced sensory plasticity. The major goal of regenerative medicine is to repair damaged tissues and organ systems, thereby restoring their native functions in the host. Control of innervation by re-grown or implanted structures, and integration of the nascent nerves into behavioral/cognitive programs of the host, remains a critical barrier. In the case of sensory organs, this is particularly true, as afferent neurons must form connections with the host to communicate auditory, visual, and tactile information.",
      "section": "Abstract",
      "topic": "Regenerative medicine and sensory organ transplantation",
      "chunk_summary": "Restoring function in damaged sensory organs through transplantation requires successful innervation and integration with the host nervous system.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Xenopus embryos and tadpoles are powerful models for such studies, as grafting techniques allow for the creation of eyes and other sensory structures along the body axis, and the behavior of the resulting organism can be quantitatively analyzed. Previous work has demonstrated that ectopic eyes could be grafted in blinded tadpoles, allowing some of the animals to learn in a simple light-preference assay. Here, we show that it is possible to improve the efficiency of the process in the context of a novel image-forming vision assay, using a drug already approved for human use.",
      "section": "Abstract",
      "topic": "Xenopus model for sensory plasticity",
      "chunk_summary": "Xenopus provides a model to study sensory plasticity and improve the efficiency of ectopic eye graft integration using a human-approved drug.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Innervation of the host by ectopic eyes can be increased by targeting a serotonergic signaling mechanism: grafts treated with a 5-HT1B/D agonist strongly innervate the recipient compared with untreated grafts, without large-scale disruption of the host nervous system. Blind animals possessing eye grafts with the augmented innervation demonstrate increased performance over untreated siblings in wavelength-based learning assays. Furthermore, treated animals also exhibit enhanced visual pattern recognition, suggesting that the increased innervation in response to 5-HT1B/D activation leads to enhanced functional integration of the ectopic organ with the host central nervous system and behavioral programs. These data establish a model system and reveal a new roadmap using small molecule neurotransmitter drugs to augment innervation, integration, and function of transplanted heterologous organs in regenerative medicine.",
      "section": "Abstract",
      "topic": "Serotonergic stimulation and graft innervation",
      "chunk_summary": "5-HT1B/D agonist treatment enhances innervation of ectopic eye grafts, leading to improved visual learning and pattern recognition in Xenopus.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "The future of regenerative medicine will surely involve the transplantation of a wide variety of bioengineered structures, from hybrid artificial constructs to stem cell-derived organoids grown in vitro. A key aspect of this research program is the establishment of neural connections between the host central nervous system (CNS) and the implanted tissue, to restore normal function or to provide augmented sensory/motor capability to patients. In addition to the biomedical aspects, this research provides an unprecedented opportunity for basic research into the relationship between the brain and body, and the evolution of plasticity of cognitive programs in the face of altered bodyplans.",
      "section": "Introduction",
      "topic": "Regenerative medicine and neural connections",
      "chunk_summary": "Establishing neural connections between transplanted tissues and the host CNS is crucial for restoring or augmenting sensory/motor function and understanding brain-body plasticity.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Novel models in which the ability of the brain to make use of ectopic organs must be developed in vertebrate animal species that are tractable to molecular, physiological, and behavioral assays. Such platforms would enable the study of the inherent plasticity that might be exploited for sensory repair or even enhancement, and the evaluation of potential treatments to improve function in such contexts. The resolution with which implanted structures must communicate with the host's CNS remains poorly understood. Conventional theory suggests that specific, direct communication between sensory structures and their corresponding processing centers within the brain is required for function.",
      "section": "Introduction",
      "topic": "Vertebrate models for ectopic organ integration",
      "chunk_summary": "Developing vertebrate models to study ectopic organ integration will help understand the necessary communication between implants and the CNS for functional sensory repair or enhancement.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "However, sensory substitution studies using human-machine interfaces have revealed a striking plasticity of the CNS to interpret sensory data presented at novel locations. The majority of this work has focused on tactile-vision substitution devices, which transmit wavelength information from a camera to electrical or vibratory stimulation via a small array that the patent places on their body (dermal stimulation) or tongue (where the saliva allows less current to deliver a similar stimulus). Blind individuals using these devices report imaging formation consistent with vision, and positron emission tomography (PET) imaging of the brains of users reveal activity within the visual centers of the occipital lobe. This tactile vision involved more than simple object recognition: subjects were able to time their actions to intercept a ball rolling off of a surface and coordinate eye-hand movements in three-dimensional space.",
      "section": "Introduction",
      "topic": "Sensory substitution and CNS plasticity",
      "chunk_summary": "Sensory substitution studies demonstrate the CNS's plasticity to interpret sensory data from novel locations, suggesting potential for functional integration of ectopic organs.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Beyond vision, similar devices have been used in a variety of other sensory modalities, including auditory-visual substitution, tactile-vestibular (balance) substitution, and a sensory augmentation belt that signals the direction of magnetic north. All of these devices highlight the adaptive nature and remarkable plasticity of the brain:body system. However, the cross-modal functionality revealed by these studies is limited in comparison with the goal of fully integrated biological organs such as regenerated or transplanted eyes.",
      "section": "Introduction",
      "topic": "Cross-modal sensory substitution",
      "chunk_summary": "Cross-modal sensory substitution devices demonstrate brain plasticity but are limited compared to the goal of fully integrating biological organs like transplanted eyes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Progress in the sophistication of 3D culture methods allows for the in vitro creation of morphologically complete mouse and human optic cups, and a major goal of regenerative medicine is to one day implant these structures in human patients, thereby restoring the function of damaged or missing sensory systems. However, what remains unknown are the necessary signals that could be used to promote sufficient afferent innervation between the implant and host and whether the host brain could properly interpret sensory information from structures that were added long after embryogenesis.",
      "section": "Introduction",
      "topic": "Challenges in optic cup transplantation",
      "chunk_summary": "While in vitro optic cup creation is advancing, promoting sufficient innervation and ensuring proper sensory interpretation by the host brain remain key challenges for transplantation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "A number of secreted molecules involved in axon growth cone extension and pathfinding have been identified using in vitro developmental models and neuronal culture systems. In the case of the visual system these include sonic hedgehog as well as Ephrin, Netrin, Semaphorin, and Slit family members, which coordinate the exit of retinal ganglion cell axons from the optic cup to visual-processing centers within vertebrate brain. In addition to these well-studied factors, serotonin has also been identified as a pathfinding cue during neural development. In invertebrates, cultured Helisomia snail neurons show growth changes response to extracellular serotonin. In vertebrates, serotonin has been shown to reverse the effect of netrin-1 from attraction to repulsion when both were presented to cultured mouse thalamocortical axons; in addition, serotonin levels have been shown to alter segregation of retinal ganglion projections within the dorsal lateral geniculate nucleus and superior colliculus in vivo.",
      "section": "Introduction",
      "topic": "Molecular cues in axon guidance and serotonin's role",
      "chunk_summary": "Several molecules, including serotonin, play a role in axon guidance and pathfinding during neural development, influencing the connections between the eye and the brain.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Xenopus laevis represents an ideal model to investigate graft and implant innervation. Specifically, cut and paste experiments allow the generation of eyes and ears at any position along the body axis of developing tadpoles: in both cases, afferent innervation between the graft and host CNS was observed, even when the sensory structures were positioned far from their native locations. Remarkably, behavioral assays showed that such grafted eyes were capable of conferring light-sensing ability to blinded tadpoles. However, good performance in visual assays was infrequent because most grafts failed to innervate the host. We have been testing strategies for inducing innervation of ectopic structures, focusing on bioelectric properties of the host and the neurotransmitter molecules downstream of voltage-dependent signaling.",
      "section": "Introduction",
      "topic": "Xenopus model for graft innervation",
      "chunk_summary": "Xenopus laevis is a suitable model for studying graft innervation, but previous studies showed limited success in achieving consistent innervation and functional integration of ectopic eyes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Here, we demonstrate that strong innervation can be induced for eye grafts by exposure to a 5-HT1B/D agonist, without significantly altering elements of the host CNS. Moreover, this induced innervation causes animals receiving treated grafts to perform significantly better in wavelength-discrimination tasks than animals receiving untreated grafts. We show that the function of ectopic eyes in otherwise blind animals is not only for light sensing, but to confer performance in a novel behavior assay that requires image-forming vision (pattern detection). Taken together, these data demonstrate that organ grafts are capable of providing sensory information to a vertebrate host, even when located far from the brain, and they reveal a novel strategy for promoting innervation of implanted sensory structures using a pharmacological reagent already approved for human use.",
      "section": "Introduction",
      "topic": "5-HT1B/D agonist and enhanced graft function",
      "chunk_summary": "This study demonstrates that 5-HT1B/D agonist promotes innervation of eye grafts in Xenopus, leading to improved performance in visual tasks, including image-forming vision.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "5-HT1B/D activation induces innervation of transplanted tissue following eye graft in Xenopus embryos. In an effort to identify methods to increase the innervation of implanted sensory structures, we utilized an eye primordia graft method developed in Xenopus laevis, which results in morphologically complete eyes developing at the site of the graft. Grafts were performed embryonically between tdTomato mRNA injected donors and untreated recipients at Nieuwkoop and Faber stage 24, which allowed afferent innervation to be visualized under fluorescence. In addition, microsurgery at stage 34 could be performed to create blinded animals. Grafts were positioned caudally, which resulted in an ectopic eye forming in the posterior of the animal along the trunk of the tail. Induced eyes were morphologically similar to native eyes in both proximal/distal orientation and size, and vasculature could be seen carrying blood to the structure. Donor tissue and innervation could be observed through fluorescence of the injected tdTomato protein and imaging of the ventral fin posterior to the graft revealed little innervation of the host.",
      "section": "Results",
      "topic": "Eye graft method and initial observations",
      "chunk_summary": "Eye primordia grafts in Xenopus embryos resulted in morphologically complete ectopic eyes, with limited host innervation observed in untreated animals.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Previous work that promoted graft innervation through modulation of host cells' bioelectrical properties showed that innervation was induced by extracellular 5-HT exposure and could be blocked by inhibition of 5-HT receptor 1 family members. Based on these prior data identifying serotonergic signaling downstream of somatic depolarization, we hypothesized that activation of these receptors should promote neurite outgrowth. Treatment of grafted animals with 50 μM of the 5-HT1B/D activator Zolmitriptan following surgery had a dramatic effect on innervation: 40% of treated animals (n = 38) displayed a hyper-innervated phenotype with labeled neurites present throughout the ventral fin and trunk of the animal.",
      "section": "Results",
      "topic": "5-HT1B/D activation and hyper-innervation",
      "chunk_summary": "Treatment with Zolmitriptan, a 5-HT1B/D activator, significantly increased innervation of the ectopic eye grafts in Xenopus embryos.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "To determine whether 5-HT1B/D activation altered innervation of eyes in their native locations, developing eye tissue was removed from stage 24 wild-type animals and replaced with labeled donor tissue from the same location. In untreated animals, grafts produce labeled optic nerves which migrate ventrally below the brain before penetrating the contralateral side at the location of the optic tecta, as in the endogenous pattern. Animals receiving rostral grafts in the presence of 5-HT1B/D activation demonstrate the normal innervation outcomes, sending specific, targeted projections to the brain rather than the broad, distributed innervation observed in caudal grafts. Thus, sham operations do not induce the hyperinnervated phenotype. As innervation from such grafts was easily visible in the brain, posterior transplants were then specifically examined to determine if any of ectopic neurites were present in the brain of the host. In no case did we detect labeled neurons in brain of animals receiving posterior grafts (n = 20), even when strong innervation was present throughout the trunk and fin of the animal. We conclude that posterior grafts do not innervate directly into the brain.",
      "section": "Results",
      "topic": "Innervation of rostral vs. caudal grafts",
      "chunk_summary": "5-HT1B/D activation did not alter the normal innervation pattern of rostral eye grafts, while caudal grafts showed hyper-innervation but did not directly innervate the brain.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "To examine the timing of neurite outgrowth, animals were imaged daily for 8 days following surgery. No labeled axons were observed during the initial 3 days following surgery, but labeled tissue was clearly visible on day 4. After this period, continued neurite elongation and branching was observed through the remainder of the experiment, with donor tissue innervating much of the ventral fin and trunk of the host. We conclude that a drastic hyper-innervation of transplants could be induced by Zolmitriptan exposure without toxic side effects.",
      "section": "Results",
      "topic": "Timing of neurite outgrowth",
      "chunk_summary": "Neurite outgrowth from the grafts became visible on day 4 post-surgery and continued to elongate and branch, indicating that Zolmitriptan induced hyper-innervation without apparent toxicity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "5-HT1B/D activation does not disrupt native innervation in the host. The massive increase in graft innervation after 5-HT1B/D receptor activation could be expected to be part of a universal neural response, which would disrupt the host nervous system. To test this hypothesis, we examined the anatomy of another sensory system, the host's lateral line, in the presence or absence of 5-HT1B/D activation. Using immunohistochemistry against the neuronal marker acetylated-tubulin, we also examined whether blinding animals caused a large-scale disruption to this system, as any perturbations could alter future behavioral trials. Immunohistochemical detection of neurons in wild-type animals revealed the stereotypic anatomy of lateral line elements in the anterior of the animal, with the post-orbital, maxillary, supra-orbital, and parietal lateral line being clearly defined. In addition, just anterior to the gut, the anterior lower, upper, middle, and occipital lateral line was visible. Finally, in lateral images of the ventral tail fin around the anus of the animal, the caudal lateral line was visualized its standard branching phenotype.",
      "section": "Results",
      "topic": "Effect of 5-HT1B/D activation on host lateral line",
      "chunk_summary": "Analysis of the host's lateral line system showed no significant disruption in anatomy or branching patterns due to 5-HT1B/D activation or blinding, suggesting targeted effects on graft innervation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "In animals raised in 50 µM of the 5-HT1B/D agonist Zolmitriptan from stages 24-46, the lateral line elements were unperturbed, showing the same anatomy and branching patterns as that of untreated animals. Further, lateral line anatomy was also visualized in blinded animals to determine if the removal of native eyes altered host innervation in the presence of 5-HT1B/D activation. No differences were noted between the lateral line elements of these animals compared with wild types, other than the connection between the post-orbital and maxillary lateral line being visible, as it is normally obstructed by the presence of the eye. The nostrils of the animals in all three treatments were also similar with regard to morphology and position. In the posterior, the motor axons located between somite boundaries maintained their characteristic chevron pattern, regardless of treatment. Finally, the ventral fin, which is the site of eye primordia grafts, did not show aberrant innervation by the lateral line and was devoid of ectopic innervation in the absence of donor tissue. Taken together, these data indicate that while grafted eye primordia respond to the 5-HT1B/D agonist, the host nervous system is not detectably altered when these receptors are activated. These findings highlight the ability to functionally dissociate responses between the host's own innervation and ectopic structures.",
      "section": "Results",
      "topic": "Host nervous system unaffected by Zolmitriptan",
      "chunk_summary": "The host nervous system, including the lateral line, nostrils, motor axons, and ventral fin, remained largely unaffected by Zolmitriptan treatment, indicating a specific effect on the grafted tissue.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Animals with innervated grafts demonstrate learning in an automated visual assay. To determine if blinded animals receiving eye grafts could learn in a visual assay and whether increased innervation leads to better performance, a custom automated behavior apparatus was employed. The device uses motion tracking cameras to record animals' positions in an arena illuminated with red or blue light and issues commands to punish animals with a 1.2 mA current based on location. Briefly, the general training regime evaluates the animal's preference for red or blue, trains the animal to avoid red by punishing it when it occupies a red quadrant, and examines any change in color preference after a rest period. By repeating this procedure, a reproducible red-avoidance behavior is observed; this approach has been used to successfully train animals in multiple studies. The majority of wild-type animals learn in our automated assay, with 76% of trained animals (n = 50) demonstrating learning, compared with blinded animals, which rarely meet the learning criteria (5%, n = 20). Non-blinded animals raised in 50 μM Zolmitriptan were also able to learn in the device, but at a reduced frequency compared with untreated siblings (z = 2.05, p = 0.02). The presence of an eye graft in blinded animals resulted in a learning frequency of 11%, a rate which was not significantly higher than non-grafted siblings (n = 43, z= −0.77, p = -0.221). However, in animals receiving grafts that innervated the host in response to 5-HT1B/D activation, the frequency of learning was significantly higher compared with blinded animals (n = 24, z= -2.30, p = 0.011). Taken together, these results indicate that blinded animals fail to learn in an automated visual assay, but learning can be induced when animals receive eye grafts that were made to innervate the host by 5-HT1B/D activation.",
      "section": "Results",
      "topic": "Visual learning in grafted animals",
      "chunk_summary": "Blinded Xenopus with innervated eye grafts, induced by 5-HT1B/D activation, showed significantly improved learning in a visual assay compared to blinded animals with untreated grafts or no grafts.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Control of eye-graft innervation by 5-HT1B/D activation. To better characterize the behavior of innervated graft animals that learned in the assay and those that did not, the following behaviors were compared between the two groups during the innate portion of the trial: time spent at the edge vs. center of the arena, time spent swimming in a clockwise/counterclockwise direction, time spent in the red half of the dish, area of the dish explored, and speed. None of these behaviors differed between innervated learners and non-learners, except for exploration: animals that learned explored a greater portion of the dish than non-learning siblings (t-test, p = 0.024). These results were similar when comparing across treatments, as wild-type and blind controls showed minimal differences between basic behaviors in the device. In addition to basic behavior, the proportion of time punished during each of the training periods was compared for innervated learners and non-learners, as poor performance during training could indicate a difficulty in perceiving the overhead lighting conditions. This analysis revealed a significant difference between groups, with non-learners receiving more punishments than learners in any given training session (two-way ANOVA, p = 0.004). In addition, punishments during training sessions tended to decrease among the animals that demonstrated learning, while non-learners trended upward across trials. These data support the learning results and indicate that the 5-HT1B/D-activated eye-graft animals that learned in the device were better able to discriminate the associative stimuli (color) during training sessions in the automated assay.",
      "section": "Results",
      "topic": "Behavioral analysis of grafted animals",
      "chunk_summary": "Analysis of behavior in grafted animals revealed that learners explored a larger area and received fewer punishments during training, suggesting improved visual discrimination in those with innervated grafts.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "Graft innervation confers image-forming vision: a moving pattern assay. In addition to wavelength discrimination, tadpoles were tested for true vision—the ability to follow patterns rotating clockwise and counterclockwise directions. The patterns were presented from below the tadpoles, and consisted of groups of triangular clusters rotating at a rate of 18° per second. Cohorts from each treatment were placed in dishes above the pattern, and their swimming direction was scored after 15 min of clockwise and counterclockwise pattern rotation—final performance scores were averaged between the two tests. Wild-type animals were able to follow the pattern well, with 80% of tested animals following the pattern after averaging the clockwise and counterclockwise portions of the trial. In comparison, blinded animals performed poorly, with only 38% of individuals swimming in the correct direction. Animals with an untreated ectopic eye also performed poorly, with 32% of tadpoles following the pattern. However, blinded animals with innervated grafts induced by exposure to the 5-HT1B/D activator exhibited much better performance levels, with 57% of animals able to follow the rotating patterns. Analysis of the distribution revealed a significant effect of the treatment on the result compared with expected values (x² = 18.76, p < 0.001). Taken together, these data reveal that animals receiving grafts in the presence of 5-HT1B/D activation perform better in a pattern-movement task than those with non-treated grafts.",
      "section": "Results",
      "topic": "Image-forming vision in grafted animals",
      "chunk_summary": "Blinded Xenopus with 5-HT1B/D activated grafts performed significantly better in a pattern-following task, demonstrating that the innervated grafts conferred image-forming vision.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    },
    {
      "text": "This study demonstrates that treatment with a 5-HT1B/D agonist can significantly enhance the innervation and functional integration of ectopic eye grafts in Xenopus laevis, leading to improved visual learning and pattern recognition in blinded animals. These findings suggest a novel strategy for promoting innervation of transplanted sensory structures in regenerative medicine, using a pharmacological agent already approved for human use.  Further research is needed to explore the mechanisms underlying this effect and to determine its potential applicability to other organ systems and species.",
      "section": "Discussion",
      "topic": "Implications for regenerative medicine",
      "chunk_summary": "The study's findings on enhanced graft innervation and function via 5-HT1B/D activation offer a promising new approach for regenerative medicine, warranting further investigation into its mechanisms and broader applicability.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_799133.pdf",
      "original_filename": "pdf_20250803_124126_799133_extracted_text.txt",
      "authors": "[\"Douglas J. Blackiston\", \"Khanh Vien\", \"Michael Levin\"]",
      "year": "2017",
      "journal": "npj Regenerative Medicine",
      "doi": "10.1038/s41536-017-0012-5"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:25:59.234797",
  "enriched_at": "2025-08-11T14:28:39.585677",
  "enrichment_methods": [
    "crossref"
  ]
}