{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_515434_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_515434.pdf",
    "file_size": 42128,
    "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
    "journal": "Annual Review of Biomedical Engineering",
    "doi": "10.1146/annurev-bioeng-071114-040647",
    "year": "2023",
    "title": "Endogenous Bioelectric Signaling Networks: Exploiting Voltage Gradients for Control of Growth and Form",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "With sufficient understanding, it should be possible to control morphogenesis to drive the production of normal tissues or organs in order to address traumatic injury or degenerative disease, as well as to create entire novel biological constructs with desired functionality. A fundamental barrier to achieving this goal is complexity: Even if any cell type could be made from stem cells, how would we generate a functional hand or eye? Micromanaging the construction process at the lowest level is likely not feasible for such complex structures. We suggest that the path to these capabilities is through an understanding of the endogenous computational dynamics that allow living systems to create and drastically remodel complex three-dimensional (3D) anatomies.",
      "section": "Introduction",
      "topic": "Morphogenesis and Complexity",
      "chunk_summary": "Controlling morphogenesis for tissue and organ regeneration and creation of novel biological constructs is hindered by complexity, suggesting a need to understand the endogenous computational dynamics of living systems.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Eggs reliably self-assemble into adults with many distinct tissues in precise geometric configurations. Crucially, the embryos of many species are not predetermined mosaics, but exhibit astonishing capabilities of self-repair, dynamic rescaling, reconfiguration, and functional plasticity. Embryos that are split or combined early in development revise their developmental program to generate complete, undamaged organisms. Many adult animals can regenerate complex organs after amputation or damage; for example, planarian flatworms can regenerate their entire body after almost any kind of amputation, and they continuously remodel their tissue to match the available cell number to its target morphology and correct proportions among all organs (1). Salamanders regenerate limbs, eyes, jaws, hearts, and brain; deer regenerate bone and nerves when replacing their antlers each year; and even human children can regenerate their fingertips completely (2). A key aspect of regeneration is that the process stops when a structure of the correct size and shape has been achieved, suggesting that organisms have implicit or explicit ways to encode and monitor anatomical target (or goal) states.",
      "section": "Introduction",
      "topic": "Regeneration and Shape Homeostasis",
      "chunk_summary": "Embryos and adult animals exhibit remarkable regenerative capabilities, suggesting the existence of mechanisms for encoding and monitoring anatomical target states.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Some animals not only regenerate amputated parts but also actively remodel large portions of their bodies. Transplanted cockroach legs with the wrong number of segments undergo intercalation to restore proper leg segmentation (4). Tails ectopically grafted to the flank of an amphibian host will slowly remodel into limbs (5), and froglets will eventually establish a normal facial anatomy after drastic rearrangements of the tadpoles' craniofacial components are experimentally induced (6). We believe that one of the most powerful methods of controlling patterning could be achieved if we learn how to rewrite these target states, allowing the cells to build to specifications without micromanaging.",
      "section": "Introduction",
      "topic": "Remodeling and Reprogramming",
      "chunk_summary": "Animals exhibit remarkable remodeling capabilities, suggesting the possibility of controlling patterning by rewriting anatomical target states.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Remarkably, embryonic (7) and regenerative (8) environments can reprogram cancerous growth into normal anatomy, revealing the importance of context and patterning cues in regulating individual cell behavior. These data not only suggest that cancer may be a kind of disease of geometry (and thus that normalization of tumors is within the domain of bioengineering) but also point to the importance of global patterning information in the understanding of cell behavior. Next-generation bioengineering must move beyond the direct assembly of cell types toward the control of the endogenous error-correcting morphogenetic networks and the programming of shape by specifying organs and their topological relationships (9). What all of the above examples have in common is a kind of shape homeostasis—the ability of systems to flexibly regulate cell-level events in order to achieve higher-level (organ-, tissue-, or whole organism-level) patterning states despite deviations from those states. A key issue for the future of biology and medicine is to find the appropriate theoretical paradigm with which to understand complex pattern regulation and derive quantitative models with predictive power that will enable rational modification of shape for engineering and biomedical applications. Global control systems are mediated by chemical gradients (10), physical forces (11), and bioelectrical signaling (12) (Supplemental Table 1; follow the Supplemental Material link from the Annual Reviews home page at http://www.annualreviews.org), distinct and orthogonal layers of the morphogenetic field.",
      "section": "Introduction",
      "topic": "Cancer and Shape Homeostasis",
      "chunk_summary": "Embryonic and regenerative environments can reprogram cancer, highlighting the importance of global patterning information and the need for next-generation bioengineering to focus on controlling morphogenetic networks and programming shape.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Here, bioelectricity (Figure 2) refers to endogenous electrical signaling via ion channels, pumps, and electrical synapses (gap junctions) at the plasma membrane (13). One of the earliest experimental approaches toward pattern regulation was Roux's (14) application of electric fields to developing eggs in 1892. Since then, solid functional data have implicated steady ion currents in embryogenesis and wound healing (15, 16). By tracking developmental currents and applying physiological-strength electric fields, investigators have shown that transepithelial electric fields regulate cell migration, orientation, and nerve growth (reviewed in Reference 17). However, recent advances and development of molecular-level techniques (18) have identified new aspects of bioelectricity that regulate individual cell function and help coordinate the embryogenesis and regenerative repair of complex structures.",
      "section": "Introduction",
      "topic": "Bioelectricity and Pattern Regulation",
      "chunk_summary": "Bioelectricity, referring to endogenous electrical signaling via ion channels, pumps, and gap junctions, plays a crucial role in pattern regulation during embryogenesis and regenerative repair.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "In this review, we discuss advances in bioelectrical signaling from the perspective of integrating bottom-up (molecular mechanism focus) with top-down (information perspective) approaches to the control of biological pattern and function. We focus on endogenous bioelectric signaling (rather than on effects of applied fields) that implements morphological computation in vivo and explain how it can be exploited by bioengineering (19). Due to length constraints, we exclude transepithelial electric fields, the geomagnetic field, electromagnetic communication among cells via ultraweak photons, static charge effects in cell function, and subcellular organelle potentials. Recent advances have revealed that such bioelectric dynamics are a novel control layer, the manipulation of which will enable much of the complexity to be off-loaded onto the inherent computational abilities of cells. Thus, we review data and techniques being developed in this exciting emerging field, focusing not only on cellular mechanisms but also on bioelectricity's role as a long-range integrator of instructive patterning cues within tissues. This review focuses on the instructive cues mediated by spatiotemporal patterns of voltage potentials across the membrane of nonneural cells and the roles they play in coordinating size control, organ identity, and axial patterning during regeneration, development, and cancer suppression. These examples will be of particular interest to bioengineers because they illustrate modular, top-down control of patterning (e.g., reprogramming a region of the gut into a complete eye), reprogramming patterns without genome editing (permanent change of planarian regenerative morphology to two-headed forms), overcoming genetic or pharmacological teratogenic influences to force normal brain pattern, or reprogramming tumors into normal tissue (20). Bioengineering and synthetic biology have not yet made extensive use of this modality; for this reason, we highlight the background information necessary to lower the barrier for these communities to enable them to begin to exploit the remarkable properties of developmental bioelectricity, and provide a forward-looking perspective on this emerging field.",
      "section": "Introduction",
      "topic": "Bioelectricity as a Control Layer",
      "chunk_summary": "This review focuses on endogenous bioelectric signaling as a novel control layer for biological pattern and function, highlighting its role in coordinating size control, organ identity, and axial patterning during regeneration, development, and cancer suppression.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Bioelectric circuits consist of several main components in vivo, including ion channel proteins, which passively segregate specific positive and negative charges across the membrane, and ion pumps, which use energy to transport ions against concentration gradients. Ion channels and pumps in the plasma membrane set the resting potential of the cell, the difference between the inside and the outside of the cell, which is measured in millivolts (mV). In general (Figure 3a), terminally differentiated, quiescent cells tend to be strongly polarized (bearing a more negative resting potential), whereas embryonic, stem, and tumor cells tend to be depolarized (closer to zero) (21). Whereas these membrane proteins exchange ions with the milieu outside the cell surface, gap junctions are channels that allow direct cell-to-cell transfer of molecules, and therefore electrical signals, from the cytoplasm of one cell to a neighboring cell. Cells connect to each other via these electrical synapses (22), which facilitate the formation of bioelectrical networks that help shape the distribution of resting potential (Vmem) levels within large groups of cells and form isopotential cell fields within the body demarcated by gap junctional isolation zones (23). Vmem gradients are defined as patterned spatial differences among cells' Vmem values across anatomical distances. Bioelectrical signals are defined as temporal changes in such a pattern, which can trigger downstream patterning cascades.",
      "section": "Bioelectric Pathways: The Basics",
      "topic": "Components of Bioelectric Circuits",
      "chunk_summary": "Bioelectric circuits consist of ion channels, pumps, and gap junctions, which regulate the resting potential of cells and facilitate the formation of bioelectrical networks.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "The transmembrane resting potential, in concert with canonical biochemical signaling pathways, serves as an instructive cue for cellular behaviors that underlie morphogenesis, such as differentiation, proliferation, migration, cell morphology change, orientation, and transcriptional changes (Supplemental Table 2). Bioelectric signals (specific ion currents and the resulting changes in Vmem pattern) occur in a wide variety of cell types from all developmental lineages, including stem cells, in both animal (24) and plant (25) cells. Supplemental Tables 3 and 4 list ion channels, pumps, and gap junction proteins that have been implicated by unbiased genetic screens as sources of bioelectric signals that are important in pattern regulation. Cellular Vmem is not static, but changes in time with the cell cycle (26) and longer period oscillations (27). Cell populations, even ones that appear homogeneous by molecular markers, often exhibit distinct subpopulations with respect to bioelectric gradients. For example, in induced pluripotent stem cells (iPSCs), potassium channels play a role in regulating proliferation (28) as they do in mesenchymal stem cells (MSCs) (29); whereas iPSCs are electrophysiologically homogeneous, MSCs are not. Cells in culture show distinct Vmem patterns that are largely due to cell cycle differences, while in vivo a variety of signals impinge upon cells and cause spatial differences of bioelectrical states within cell populations (30).",
      "section": "Bioelectric Pathways: The Basics",
      "topic": "Bioelectric Signals and Cell Behavior",
      "chunk_summary": "Transmembrane resting potential serves as an instructive cue for cellular behaviors underlying morphogenesis, and bioelectric signals occur in various cell types, including stem cells, influencing proliferation and differentiation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "As in the brain, the most common way for cells to sense bioelectrical changes is by coupling voltage changes to the movement of small signaling molecules (Figure 3b-d). The most common one is calcium (31); a change in Vmem leads to the opening of calcium channels and an influx of calcium ions into the cell. This mode of transduction has been implicated in control of growth-cone turning (32), eye patterning (33), and flatworm regeneration (34, 35) via voltage-gated calcium channels, which activate a plethora of well-known calcium sensors such as calcineurin. Another such molecule is serotonin, the levels of which change via the effects of voltage on the serotonin transporter (SERT) in the amplification of embryonic left-right asymmetry (36), metastatic induction (37), and neural pathfinding (38). The transporter SLC5A8 converts ion levels into the movements of butyrate, which in turn is an important regulator of histone deacetylases and thus of epigenetic chromatin state, as occurs in tumorigenesis in *Xenopus* (39) and in mammals (40). Additional mechanisms for transduction include voltage-sensitive phosphatases, which couple changes in Vmem to the plethora of events regulated by phosphatase and tensin homolog (PTEN) phosphatases (41), and clustering of protein receptors in the membrane, as appears to occur for RAS signaling (42).",
      "section": "Bioelectric Pathways: The Basics",
      "topic": "Transduction Mechanisms",
      "chunk_summary": "Cells sense bioelectrical changes by coupling voltage changes to the movement of small signaling molecules like calcium and serotonin, which activate downstream pathways involved in various cellular processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Several target genes, including *Hedgehog* and *Notch*, are known to be regulated by resting potentials (Supplemental Table 5). Although some of these are probably indirect effects, several promoters are sensitive to changes in Vmem; for example, depolarization upregulates cytomegalovirus (CMV) promoter activity by >90-fold (43). A recent study (44) using microarray analysis identified many genes that are induced by forced Vmem change, regardless of the channel or ion used, that are shared among frog embryos, adult regenerating axolotl spinal cords, and human MSCs. A pathway analysis revealed that genetic responses to Vmem change occur within pathways related to numerous organ systems and disease-relevant pathways. In some cases, Vmem change also alters the expression of other ion channel genes (45), forming feedback loops that integrate bioelectric and transcriptional responses (Figure 4a).",
      "section": "Bioelectric Pathways: The Basics",
      "topic": "Gene Regulation by Resting Potentials",
      "chunk_summary": "Resting potentials regulate several target genes, including *Hedgehog* and *Notch*, and Vmem changes can induce gene expression changes in various pathways related to organ systems and diseases.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Vmem regulation extends far beyond the state of single cells, as cellular resting potential is also linked to the Vmem of proximal and distal cells. Bioelectric signaling is an ideal way for cells to coordinate their behaviors across anatomical distances. This idea was first suggested by Burr (46), who used voltage readings at remote locations of the body to detect transplanted or induced tumors as disturbances to large-scale morphogenetic fields. Such long-range signaling is mediated by ephaptic field effects (47), transepithelial potentials (48), tunneling nanotubes (49), transfer of ion channels via exosomes (50), and gap junctional connectivity implemented by connexin and innexin proteins (23), all of which occur in all cell types throughout the body but have been the most extensively studied in the central nervous system (CNS).",
      "section": "Bioelectric Pathways: The Basics",
      "topic": "Long-Range Bioelectric Signaling",
      "chunk_summary": "Bioelectric signaling allows cells to coordinate their behaviors across anatomical distances through various mechanisms, including ephaptic field effects, transepithelial potentials, tunneling nanotubes, exosomes, and gap junctional connectivity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "The study of bioelectricity has had a very rich history over the last century. Interested readers should consult Reference 16 for reviews from some of the main contributors to this field. In the last decade, molecular tools that can measure and influence bioelectric patterns have been developed, as have tools that can be used to identify the molecular source and the downstream targets of specific bioelectrical events (51). Pharmacological screens are able to rapidly identify the type of electrogenic protein that could be the source of observed gradients, and systematic tiered screens (52) traversing a tree of progressively specific blocker drugs (followed by gene-specific validation) led to the identification of channel and pump proteins that are required for left-right patterning (53) and tail regeneration (54) in frog models. Unlike genetic screens, this approach overcomes the high redundancy among channel family members. More recently, high-throughput screens have been used to identify ion translocator-modifying compounds in assays for control of cancer and other stem cell behavior (55, 56). Ion channels and pumps are also frequently found within microarray or RNA sequencing data sets comparing different conditions; however, these proteins are often deprioritized for further analysis in favor of more typical targets, such as secreted proteins and growth factors, because of general unfamiliarity with the strategies for unraveling bioelectric signals' roles in patterning.",
      "section": "Modern Tools",
      "topic": "Characterizing Bioelectric Components",
      "chunk_summary": "Molecular tools have been developed to measure and influence bioelectric patterns, identify their molecular sources and targets, and screen for ion translocator-modifying compounds.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "The spatiotemporal distributions of ionic parameters cannot be inferred from expression data alone: Unlike messenger RNA (mRNA) and protein levels, bioelectric properties are ascertainable only in vivo and collapse immediately upon cell death or fixation. However, Vmem patterns across tissues can be quantified using several approaches. For example, voltage gradients can be visualized in situ using fluorescent reporters of transmembrane potential (57) or nanoscale materials (58), which are suitable for use in any optically accessible region. Such methods are noninvasive and can report multiple Vmem values across tissues and even within cell membrane domains (51). Other tools that can be used to characterize bioelectrical events include highly sensitive ion-selective extracellular electrode probes (59), which reveal ion flux at surfaces; dielectrophoretic analysis (60); and microelectrode arrays (61). New fluorescence chemistry approaches (62) are likely to revolutionize our ability to track physiological parameters in vivo by offering improved membrane targeting, calibration, brightness, and sensitivity. Significant opportunities exist for the development of specific, bright, ratiometric dyes that localize exclusively to the desired subcellular locale (e.g., plasma membrane or nucleus), and it will be particularly exciting to use multiple physiological dyes in fluorescence-activated cell sorting experiments to identify subpopulations of \"pure” stem and other cell types that differ in key bioelectric properties (63).",
      "section": "Modern Tools",
      "topic": "Visualizing Bioelectric Properties",
      "chunk_summary": "Vmem patterns can be visualized and quantified using various techniques, including fluorescent reporters, nanoscale materials, ion-selective electrode probes, and microelectrode arrays.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "One of the most promising recent developments in this field is the ability to use quantitative modeling to understand how patterns of voltage arise from the actions of multiple ion translocators and how patterns of resting potential evolve over time in collections of cells (Figure 4b). Quantitative modeling is essential because of the complex feedback loops and highly nonobvious behavior of coupled electrically active cells. For example, effects on Vmem from electrode stimulation are very hard to predict, and emergent network properties such as stable attractors and “virtual electrodes” can arise within tissues (64). Some early research had already begun to integrate ion channels and gap junctions in physiological models (65), and quantitative models have started to do so in specific contexts, such as cancer (66), but most of the developmental bioelectricity analyses performed to date have been semiquantitative in describing the circuits that give rise to specific patterns with predictable Vmem control properties (34). Recent research in this area includes cell-level models, including ones that revealed that “collective multicellular states show electrical coupling mechanisms that are not readily deduced from biochemical descriptions at the individual cell level\" (67, p. 1; 68) and ones that showed how cells can maintain bistable memory states (69). Bioelectric circuits with memory are important because they illustrate how tissues can store stable state change purely at the level of physiology (undetectable by transcriptional or genomic approaches), and because they can be exploited as flip-flop circuit elements in synthetic bioengineering approaches.",
      "section": "Modern Tools",
      "topic": "Computational Modeling",
      "chunk_summary": "Quantitative modeling is crucial for understanding bioelectric signaling due to the complex behavior of coupled electrically active cells, and recent models have explored cell-level dynamics and memory states in bioelectric circuits.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "A newly developed comprehensive modeling environment, BETSE (70), facilitates quantitative experiments and modeling of physiology and biochemical signaling in an integrated virtual tissue. BETSE should significantly enhance efforts to model specific patterning events and gain a degree of predictive control in guided self-assembly applications in vitro. The integration of this and similar systems into existing platforms for multiscale tissue simulation environments (71), and in synthetic biology frameworks for the construction of programs (biological compilers) to be implemented in living tissues, is a goal for the future. Other recent models have tackled higher-level aspects of bioelectric signaling, exploring embedded electric circuit dynamics in the control of soft robot behavior and morphological computation (72), as well as neural network-like control of regenerative morphology (73).",
      "section": "Modern Tools",
      "topic": "BETSE Modeling Environment",
      "chunk_summary": "The BETSE modeling environment facilitates quantitative experiments and modeling of bioelectric signaling in virtual tissues, enabling predictive control in guided self-assembly applications.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Perhaps the most important set of techniques involves the functional modification of Vmem distributions to alter endogenous patterning and induce desired changes in growth or morphogenesis; this is accomplished by altering electrical connectivity (targeting gap junctions) or resting potential of specific cells (Figure 4c). Guided by the modeling platforms discussed above, this strategy can be used to test specific hypotheses based on the results of screens or physiomic profiling. Pharmacological manipulation of natively expressed channels or pumps (e.g., using channel-opening drugs) is the best approach in biomedical applications where gene therapy is not possible; for example, a mixture of small molecules that alter sodium flux was used to initiate the regeneration of a tail in an amphibian model of spinal cord and muscle regeneration (74). Chloride channels are particularly useful: Once locked in an open state by drugs like ivermectin, the amount of chloride in the external milieu can be altered to set the resting potential to desired levels (75).",
      "section": "Modern Tools",
      "topic": "Modifying Vmem Distributions",
      "chunk_summary": "Functional modification of Vmem distributions can alter endogenous patterning and induce desired changes in growth or morphogenesis, achieved by altering electrical connectivity or resting potential using pharmacological manipulation or gain-of-function strategies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "When possible, one should use gain-of-function strategies, such as the misexpression of well-characterized ion channels and pumps, to rationally alter Vmem gradients in vivo. For example, the misexpression of hyperpolarizing and depolarizing channels was used to alter the endogenous bioelectrical patterns of the nascent brain, showing how the voltage states of cells in the local and even distant regions contribute to setting of brain size (76). Many well-characterized channels and pumps can be used to modulate the bioelectric state of specific cells; for example, misexpression of potassium channels in early frog embryos revealed the surprising reprogramming of many somatic areas into eyes (33). These can be introduced into cells by use of transfection, microinjection of mRNA or DNA vectors, or viral infection. It is also possible to use the misexpression of wild-type and mutant channels to unravel the mechanism of action. For example, a pore mutant can be employed to determine whether a channel's role is merely as scaffolding/binding or whether it is truly related to its ion translocation properties. Furthermore, by changing the Vmem to the same overall level using channels for different ions (K+, Na+, Cl−), one can determine whether a particular ion's concentration is what matters or whether it is actually the Vmem level that carries instructive information in the given system. A variety of connexin (gap junction protein) mutants exist that can be used to establish bioelectrical connections among cells with desired resistivity, selectivity, and directionality.",
      "section": "Modern Tools",
      "topic": "Gain-of-Function Strategies",
      "chunk_summary": "Gain-of-function strategies, such as misexpression of ion channels and pumps, can rationally alter Vmem gradients in vivo and be used to study the mechanisms of bioelectric signaling and control cell behavior.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Recent advances in these reagents have mainly involved the availability of channels with diverse gating modalities, including ligand-gated channels sensitive to novel inert ligands (77) and optogenetic (light-gated) channels and pumps (78), as well as channels that are controlled by magnetic (79, 80), thermal (81), or acoustic (82) stimuli. Together with microfluidics to control delivery of channel drugs, these novel reagents offer a rich tool kit (Figure 4d) for spatial and temporal control of Vmem, and optogenetic tools are moving beyond CNS function (83) and toward control of stem cell differentiation (84, 85), tumor reprogramming (86), and induction of regenerative growth (87). They are also becoming incorporated into closed-loop systems (88) that continuously provide feedback and will ultimately be used for guided self-assembly applications for feedback-based control of Vmem during patterning. In addition to in vitro systems for applying these modalities to tissue, in vivo applications are being developed in which ion channel-modulating stimuli are provided via wearable bioreactors, such as those that can be placed on an amputated limb for regenerative induction (89).",
      "section": "Modern Tools",
      "topic": "Advanced Reagents for Vmem Control",
      "chunk_summary": "Recent advances in reagents, including channels with diverse gating modalities and optogenetic tools, offer a rich toolkit for spatial and temporal control of Vmem and are being applied to stem cell differentiation, tumor reprogramming, and regenerative growth.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "It is also important to determine how Vmem changes are coupled to downstream transcriptional cascades in a given tissue. This is done through a suppression screen for transduction machinery. Given an assay in which a Vmem change produces a specific cell or tissue outcome, each of the known transduction pathways can be inhibited in turn to determine which one prevents the Vmem change from being sensed by cells. Known transduction mechanisms that allow cells to convert bioelectrical signals into gene expression changes include voltage-sensitive phosphatases (41), electrophoretic- and Vmem-based gating of signaling molecules through gap junctions (90), voltage-regulated transporters of signaling molecules such as serotonin (36) and butyrate (91), and clustering of molecules such as RAS in the membrane (42).",
      "section": "Modern Tools",
      "topic": "Transduction Mechanisms and Transcriptional Cascades",
      "chunk_summary": "Suppression screens can identify transduction mechanisms that couple Vmem changes to downstream transcriptional cascades, allowing cells to convert bioelectrical signals into gene expression changes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Bioelectric properties control a number of key aspects of cell behavior (Supplemental Table 1); for example, transmembrane voltage levels control the proliferation of a wide range of cell types (24), and Vmem regulates differentiation in a range of stem/progenitor and iPSCs. Galvanotaxis, the movement of cells in response to an external electric field, has been known for almost a century (92), and endogenous electric fields are known to provide spatial cues for orientation, outgrowth, and migration for a broad range of cell types (93–95). An applied electric field is one of the simplest methods used to orient cells and induce their migration in a desired direction (19). For example, directed fibroblast migration has been observed in fields as low as 0.1 V/cm in 3D collagen gels but not in two-dimensional (2D) cultures, revealing the importance of context for cells' interpretation of electrical signals in their environment.",
      "section": "Control of Growth and Form",
      "topic": "Proliferation, Differentiation, and Migration",
      "chunk_summary": "Bioelectric properties control key aspects of cell behavior, including proliferation, differentiation, and migration, with endogenous electric fields providing spatial cues for cell orientation and movement.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Cells in groups respond to and interpret bioelectrical signals differently than single cells. For example, migration in electric fields is different in collectives than in single cells (96). Bioelectric cues also provide spatially patterned signals to cells; for example, the differential activation of voltage-responsive transduction mechanisms on opposite sides of a cell allows bioelectric signals to regulate cell polarity (25, 97). Positional information can likewise be dictated by the voltage properties of cells and their neighbors (98). Studies of embryonic left-right patterning of the *Xenopus* embryo have revealed how bioelectrical processes link individual cell dynamics to axial patterning of the entire body plan: Cytoskeletal chirality within the fertilized egg drives the asymmetric distribution of ion transporter proteins in the early blastomeres, and the resulting gradient drives unidirectional (preneural) serotonin flow through cell fields, eventually triggering differential gene expression on the left versus right side of the body.",
      "section": "Control of Growth and Form",
      "topic": "Effects on Networks",
      "chunk_summary": "Cells in groups respond differently to bioelectrical signals than single cells, with bioelectric cues providing spatial information and regulating cell polarity and positional information, as seen in embryonic left-right patterning.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "We now consider some examples from developmental biology, which reveal how bioelectrical signaling is used as an endogenous patterning cue that regulates the size, position, and identity of organ structures. Recurrent network activity (ion dynamics) controls large-scale morphogenesis, connectivity, and cell type (identity) during neurogenesis and network sculpting (99). Data on the endogenous roles of bioelectricity outside the CNS come from several sources, including the identification of ion channels and gap junctions as genes responsible for a number of human birth defects (channelopathies; Supplemental Tables 3 and 4). In addition, unbiased network analyses of transcriptional profiling data sets in development (100) and cancer (101) have pointed to ion channels as key functional nodes. Thus, upstream of endogenous bioelectrical signaling lies a set of ion channel and pump proteins that establish resting potential and alter it in response to physiological, transcriptional, and mechanical signals.",
      "section": "Control of Growth and Form",
      "topic": "Developmental Models",
      "chunk_summary": "Developmental biology examples demonstrate bioelectrical signaling's role as an endogenous patterning cue regulating organ size, position, and identity, with ion channels and gap junctions implicated in human birth defects and identified as key functional nodes in development and cancer.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Some of the earliest focused research to implicate endogenous bioelectrical gradients was on the establishment of left-right asymmetry, where differences in electric potential across the midline are responsible for direction of downstream asymmetric gene cascades (53, 102). More recent studies (13) have shown that bioelectric gradients set the size of regenerating zebrafish tails (103) and that ion transporters are involved in zebrafish fin regeneration (104) and eye development (105). In zebrafish fins, gap junctions and ion channels work together to control fin size (103, 106) via a calcium downstream target. A similar process occurs in the nascent brain in the frog embryo (76, 107). In the developing cardiac epithelium of zebrafish, Wnt is a target of electrical gradients that shape cellular networks (108). In *Xenopus* embryogenesis, regionalization of the anterior field by patterns of hyperpolarized and depolarized cells specifies a prepattern for gene expression and subsequent anatomy of the face (109). Specific endogenous patterns of differential Vmem in the naïve tissue preceded and controlled the position of eyes (33) and many components of the face (110), while experimental alterations of this native pattern produced predictable craniofacial defects. Bioelectric regulation of the embryonic face is likely to be highly relevant to human biomedicine, as several channels have now been implicated in craniofacial dysmorphias (Supplemental Table 3).",
      "section": "Control of Growth and Form",
      "topic": "Bioelectric Gradients in Development",
      "chunk_summary": "Bioelectric gradients play a crucial role in establishing left-right asymmetry, regulating the size of regenerating zebrafish tails and fins, and controlling eye and face development in *Xenopus* embryos.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Such roles appear to be well conserved. The functions in left-right asymmetry have been found in *Ciona*, sea urchins, *Caenorhabditis elegans*, mouse, frog, and zebrafish. Other roles have been found in species ranging from *Drosophila*, in which the Kir2.1 channel drives aspects of the TGF-β patterning pathway in wing patterning (111), to mammals. Even wider (across kingdoms) conservation is observed in the role of proton pumps at the outer edge of pollen tube outgrowth in plant systems (25, 112, 113), which is also observed in the wound epithelium as a driver of outgrowth in regenerating appendages of vertebrates (54). These recent molecular studies support a very wide conservation of the roles of bioelectrics across the tree of life, as had been suggested from classical studies with models ranging from hydroids to bacteria and fungi to mammalian cells (114, 115).",
      "section": "Control of Growth and Form",
      "topic": "Conservation of Bioelectric Roles",
      "chunk_summary": "The roles of bioelectrics in development and regeneration are highly conserved across various species, from *Drosophila* to mammals, and even across kingdoms in plants and animals.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    },
    {
      "text": "Some animal models repair or rebuild numerous complex structures; for example, salamanders regenerate their limbs, spinal cords, eyes, jaws, hearts, and portions of the brain. One important component is bioelectric signaling. Perhaps the best-understood aspect involves the transepithelial electric field, which is a key detector of damage and guides migratory cell behavior in cornea, skin, and other types of wound healing (17, 116, 117). The role of resting potentials in regeneration has begun to be elucidated, and the link between Vmem and transepithelial electric fields is becoming mechanistically clearer (118). Specific ion channels have been implicated in regeneration in *Planaria*, *Hydra*, and frog. Resting potentials are now known to be functional determinants of mammalian liver regeneration (119) and spinal cord regeneration in axolotl (120). In axolotl, the depolarization may interact with the microRNA system, as miR-125b is crucial for regeneration (121) and is known to regulate sodium channels (122).",
      "section": "Control of Growth and Form",
      "topic": "Bioelectricity in Regeneration",
      "chunk_summary": "Bioelectric signaling, including transepithelial electric fields and resting potentials, plays a crucial role in regeneration in various animal models, from planarians to mammals.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_515434.pdf",
      "original_filename": "pdf_20250803_124125_515434_extracted_text.txt",
      "authors": "[\"Michael Levin\", \"Giovanni Pezzulo\", \"Joshua M. Finkelstein\"]",
      "year": "2023",
      "journal": "Annual Review of Biomedical Engineering",
      "doi": "10.1146/annurev-bioeng-071114-040647"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:11:12.900545",
  "enriched_at": "2025-08-11T14:34:11.658251",
  "enrichment_methods": [
    "crossref"
  ]
}