{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_546125_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_546125.pdf",
    "file_size": 105090,
    "authors": [
      "Patrick McMillen",
      "Michael Levin"
    ],
    "journal": "Unknown",
    "doi": "10.31219/osf.io/ncx84_v1",
    "year": null,
    "title": "The neural crest as a bioelectric Rosetta Stone:  translating the analog and digital bioelectric code with Fluorescent Lifetime Imaging (FLIM)",
    "confidence_score": null,
    "document_type": "posted-content",
    "abstract": "<p>Translating the bioelectric code remains one of the core challenges to widespread biomedical translation of bioelectric interventions, as well as a better evolutionary understanding of how developmental ionic signaling became the basis of neural intelligence. Thus, it is essential to develop model systems and protocols in which diverse bioelectrical parameters can be quantitatively studied together, in the living state, and connected to cell- and tissue-level outcomes.  Here, we apply state-of-the-art quantitative Fluorescent Lifetime Imaging (FLIM) optical estimation of membrane potential (Vmemoe) to map the bioelectric dynamics of spreading Xenopus laevis neural crest cells over roughly 18-hour time periods.  We identify a slow “analog” bioelectric component that functions on the scale of hours, and a faster “digital” component that acts on the scale of seconds.  We then use information theory to show that digital NCC Vmem dynamics are largely distinct from calcium dynamics.  Finally, we provide a survey of diverse bioelectric events revealing a deep complexity in collective bioelectric dynamics, likely involving tunneling nanotubes in their transmission, which suggests numerous avenues for further investigation.</p>",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Translating the bioelectric code is crucial for biomedical applications and understanding the evolution of neural intelligence.  This study uses Fluorescent Lifetime Imaging (FLIM) to map bioelectric dynamics in Xenopus laevis neural crest cells, identifying slow \"analog\" and fast \"digital\" components. Information theory analysis reveals that digital neural crest cell membrane potential dynamics are distinct from calcium dynamics.  The study also surveys diverse bioelectric events, suggesting complex collective dynamics potentially involving tunneling nanotubes.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "FLIM reveals analog and digital bioelectric components in neural crest cells, distinct from calcium dynamics, suggesting complex collective behavior.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Decoding biological codes, including bioelectricity, is essential for advancements in bioengineering, regenerative medicine, and understanding evolution and cognition.  Bioelectricity, a physical medium for encoding information, plays a crucial role in coordinating cellular activities for adaptive anatomical outcomes.  This study investigates bioelectric signaling in neural crest cells, proposing it as a model system to translate between neural and non-neural ionic signaling and gain insights into primitive cognition and brain evolution.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in development",
      "chunk_summary": "Bioelectricity, a crucial biological code, is investigated in neural crest cells as a model for understanding development, regeneration, and cognition.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Non-neural bioelectricity plays a significant role in development, regeneration, cancer, and evolution.  Voltage parameters regulate stem cell differentiation, proliferation, gene expression, and cellular responses to biochemical signals.  Bioelectric interventions have shown promise in rescuing regeneration, overcoming teratogenesis, and normalizing tumor-like structures.  This study uses neural crest cells as a model system to investigate bioelectric encoding of developmental information due to their intermediate state between neural and non-neural cells and their collective cell behavior.",
      "section": "Introduction",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "Non-neural bioelectricity is crucial in development and regeneration, and neural crest cells serve as a model for studying its encoding of developmental information.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Neural crest cells (NCCs) are multipotent stem cells that differentiate into both neural and non-neural cell types.  They exhibit collective and intelligent navigation during embryonic development, adopting diverse fates.  NCCs are bioelectrically active, and mutations in bioelectric effectors disrupt their development.  This study proposes NCCs as a \"bioelectric Rosetta Stone\" to translate between neural and non-neural ionic signaling, providing insights into primitive cognition and brain evolution.",
      "section": "Introduction",
      "topic": "Neural Crest Cells",
      "chunk_summary": "Neural crest cells, with their bioelectric activity and diverse fates, are proposed as a model for understanding the interplay between neural and non-neural signaling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Neural crest cells (NCCs) demonstrate collective intelligence, adapting their migration paths and regulating their numbers to achieve correct target morphology.  Their ability to navigate new environments and form teeth in chicken beaks highlights their plasticity.  This study uses NCCs as a model for studying bioelectric communication and collective behavior in anatomical state space.",
      "section": "Introduction",
      "topic": "Collective Intelligence",
      "chunk_summary": "Neural crest cells exhibit collective intelligence and plasticity, making them a suitable model for studying bioelectric communication and collective behavior.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Non-neural bioelectric signals are slower and weaker than neural signals, requiring specialized tools for measurement.  While calcium imaging is used in neuroscience, its correlation with non-neural bioelectric communication is unclear.  This study uses Fluorescent Lifetime Imaging (FLIM) with VoltageFluor (VF) dyes to enable long-term bioelectric imaging with minimal phototoxicity, aiming to uncover how information is encoded in bioelectric signals using Shannon's definition of information.",
      "section": "Introduction",
      "topic": "Bioelectric Imaging",
      "chunk_summary": "FLIM with VF dyes enables long-term, non-invasive bioelectric imaging to study information encoding in non-neural signals, addressing limitations of calcium imaging.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study uses information theory to map information flow between optically estimated membrane potential and calcium dynamics in migrating neural crest cell explants.  Unlike neurons, membrane potential and calcium dynamics in neural crest cells are largely independent, revealing an interesting aspect of ionic signaling evolution in multicellular contexts.",
      "section": "Introduction",
      "topic": "Information Theory",
      "chunk_summary": "Information theory analysis reveals that membrane potential and calcium dynamics are largely independent in migrating neural crest cells, unlike in neurons.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study used Xenopus laevis embryos injected with mRNA for calcium, ERK, and actin reporters. Neural crest explants were cultured on fibronectin-coated coverslips and stained with BeRST dye for FLIM imaging.  Long-term imaging was performed at 20°C, and image analysis involved LasX FLIM quantification, whole-explant quantification, kymograph generation, and CellProfiler nucleus outlining.  Information analysis of membrane potential and calcium kymographs was performed using CAIM software.",
      "section": "Methods",
      "topic": "Experimental Setup",
      "chunk_summary": "Xenopus neural crest explants were imaged using FLIM and analyzed for bioelectric and calcium dynamics using various software tools.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Statistical analysis was performed using Friedmann's test with Dunn's multiple comparison test for significance. Bioelectric event size was estimated by measuring the average number of regions of interest with signal. Scan speed bioelectric event dynamics were estimated by dividing frame capture duration by the number of scan lines.  Statistical analysis considered the number of explants as the sample size, pooling data from different K+ conditions for information and event size estimation.",
      "section": "Methods",
      "topic": "Statistical Analysis",
      "chunk_summary": "Statistical analysis included Friedmann's test, event size estimation, scan speed dynamics estimation, and pooling of data from different K+ conditions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study investigates the bioelectric properties of Xenopus neural crest, examining analog and digital signals, signaling \"frame rate,\" and bandwidth.  Three-dye bioelectric FLIM imaging revealed spatial bioelectric variation obscured in standard non-FLIM imaging.  Comparison of intensity and lifetime components of BeRST, VF2.1.Cl, and VF2.0.Cl demonstrated the value of FLIM for reducing noise and revealing subtle bioelectric patterns.",
      "section": "Results",
      "topic": "Bioelectric Imaging",
      "chunk_summary": "FLIM imaging reveals subtle spatial bioelectric variations in neural crest explants that are obscured by intensity-only imaging.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Neural crest explants exhibit multiscale bioelectric signals, ranging from seconds to hours.  A three-phase pattern of membrane potential was observed during explant spreading: an initial depolarized phase with a central depolarization gradient, a hyperpolarized phase with gradient weakening, and a final depolarization phase.  Altering external potassium levels revealed that increasing K+ depolarizes cells, while decreasing K+ does not significantly hyperpolarize them but increases fast, short-duration depolarization events.",
      "section": "Results",
      "topic": "Bioelectric Signaling Dynamics",
      "chunk_summary": "Neural crest explants show a three-phase membrane potential pattern during spreading, and altering potassium levels reveals distinct effects on depolarization and hyperpolarization.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Digital bioelectric dynamics in neural crest explants partially overlap with calcium dynamics. While some calcium signals correlate with bioelectric signals, others do not, indicating that calcium is not a sufficient proxy for developmental bioelectricity. Kymograph analysis further revealed distinct analog and digital bioelectric signals, with analog trends aligning with whole-explant analysis. Information theory analysis showed that membrane potential and calcium dynamics are largely independent in migrating neural crest cells, with minimal mutual information.",
      "section": "Results",
      "topic": "Calcium and Bioelectric Signaling",
      "chunk_summary": "Digital bioelectric and calcium dynamics in neural crest cells are partially correlated, but information theory analysis reveals largely independent signaling pathways.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Rare bioelectric events observed in neural crest explants suggest complex bioelectric decision-making.  Depolarization was observed during cell division, aligning with previous findings.  Cells and cell collectives depolarize upon re-encountering their original collective, potentially mediated by tunneling nanotubes.  Scan artifacts revealed fast, repetitive digital bioelectric events with varying kinetics, suggesting a temporally encoded vocabulary of non-neural bioelectric signals.  Cellular projections, including tunneling nanotubes, also exhibit depolarization in concert with cell bodies, indicating a broader bioelectric reach of cell collectives.",
      "section": "Results",
      "topic": "Bioelectric Events",
      "chunk_summary": "Rare bioelectric events, including depolarization during cell division and re-connection, suggest complex bioelectric decision-making in neural crest cells, potentially involving tunneling nanotubes.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study highlights the importance of FLIM in revealing bioelectric patterns, cautioning against the use of intensity-only measurements due to noise and false positives.  The study describes analog and digital bioelectric signals in neural crest cells, demonstrating their distinction from calcium dynamics using information theory.  These findings have implications for understanding the evolution of neural bioelectricity and the development of bioelectric interventions for regeneration and cancer treatment.",
      "section": "Discussion",
      "topic": "Bioelectric Signaling",
      "chunk_summary": "FLIM is crucial for accurate bioelectric pattern detection, revealing distinct analog and digital signals in neural crest cells, separate from calcium dynamics, with implications for biomedicine and evolutionary biology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The study's findings on the analog bioelectric code reveal a three-phase trajectory during neural crest cell migration, with varying bioelectric values between explants.  The effects of K+ concentration on bioelectric dynamics show that increasing extracellular K+ depolarizes cells, while decreasing K+ leads to increased digital bioelectric signals, potentially related to the evolutionary origins of sleep.  The digital bioelectric code, with its temporally encoded properties, suggests a complex vocabulary of non-neural bioelectric signals.",
      "section": "Discussion",
      "topic": "Analog and Digital Bioelectric Codes",
      "chunk_summary": "The study characterizes analog and digital bioelectric codes in neural crest cells, including their response to K+ variations and potential implications for sleep evolution.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The study demonstrates that calcium and membrane potential are largely distinct informational channels in neural crest cells, unlike in neurons.  This disparity highlights the importance of calcium-independent bioelectric signaling effectors.  The molecular basis of digital bioelectric signals may involve hyperpolarization-activated ion channels, which are appealing targets for future research on repair and regeneration.  The study's findings provide insights into the evolution of neuron specification and the potential for synthetically enhancing computational power in biological circuitry.",
      "section": "Discussion",
      "topic": "Molecular Basis and Evolutionary Implications",
      "chunk_summary": "Calcium and membrane potential are distinct in neural crest cells, suggesting calcium-independent bioelectric signaling with implications for neuron evolution and synthetic biology.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_546125.pdf",
      "original_filename": "pdf_20250803_124126_546125_extracted_text.txt",
      "authors": "[\"McMillen, P.\", \"Levin, M.\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:45:38.538836",
  "enriched_at": "2025-08-11T14:27:20.894419",
  "enrichment_methods": [
    "crossref_title"
  ]
}