{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_944797_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_944797.pdf",
    "file_size": 35481,
    "authors": [
      "Léo Pio-Lopez",
      "Michael Levin"
    ],
    "journal": "Drug Discovery Today",
    "doi": "10.31219/osf.io/7hxnp",
    "year": "2023",
    "title": "Morphoceuticals: perspectives for discovery of drugs targeting anatomical control mechanisms in regenerative medicine, cancer, and aging",
    "confidence_score": null,
    "document_type": "posted-content",
    "abstract": "<p>Morphoceuticals are a new class of interventions that target the setpoints of anatomical homeostasis for efficient, modular control of growth and form. Here, we focus on a subclass of these: electroceuticals, which specifically target the cellular bioelectrical interface - voltage-based mechanisms that coordinate cell groups toward specific morphological outcomes. Cellular collectives form bioelectrical networks via ion channels and gap junctions. The endogenous cellular ion flows are present across all tissues and are key to processing morphogenetic information, controlling gene expression and allowing cell networks to adaptively and dynamically control growth and pattern formation. Recent progress in understanding this physiological control system, including predictive computational models, suggests that targeting the bioelectrical interface can control embryogenesis and maintain shape against injury, senescence, and tumorigenesis. We propose a roadmap of efforts in drug discovery focused on manipulating endogenous bioelectric signaling for regenerative medicine, cancer suppression, and anti-aging therapeutics.</p>",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "One crucial aspect of cell biology is the ability of groups of cells to collectively reach specific, large-scale anatomical outcomes. From single cells (eggs) to complex metazoan bodies, such cell collectives cooperate toward creating complex forms and defending them against tumorigenesis, aging and injuries. Understanding the set of mechanisms that allow this is crucial for producing innovating new therapeutics for birth defects, regenerative repair and cancer. Transformative biomedical therapeutics would be within reach if there were robust methods to communicate anatomical goal states to cell groups, coaxing them to build fresh organs and tissues as needed. What features of morphogenesis can be exploited to achieve this?",
      "section": "Introduction",
      "topic": "Anatomical homeostasis",
      "chunk_summary": "Understanding how cell collectives achieve specific anatomical outcomes is crucial for developing new therapeutics for birth defects, regeneration, and cancer.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "1",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Importantly, although reliable and consistent, morphogenesis is not hardwired – it is plastic and dynamic. Cell collectives have ample resources to deal with a wide range of disruptors of their morphogenetic target states: the same anatomical configuration can be reached from different starting conditions and despite significant perturbations. For example, regenerative organisms, like salamanders, can regrow a limb after amputation. The cells reproduce a normal limb and stop their activity when the precisely correct appendage is complete, regardless of the level of the original amputation. Deer regrow huge amounts of antler bone and innervation each year, and even human beings can regenerate livers. Tadpoles with scrambled faces still make normal frogs because their craniofacial organs rearrange as needed during metamorphosis. This property is also found in the regulative development of early mammalian embryos that can recover from massive perturbation such as complete (natural or artificial) bisection, producing two identical normal bodies.",
      "section": "Introduction",
      "topic": "Morphogenetic plasticity",
      "chunk_summary": "Morphogenesis is a plastic and dynamic process, allowing cell collectives to achieve target anatomical states despite perturbations, as seen in limb regeneration and embryonic development.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "1",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Although cellular genetic hardware changes on evolutionary timescales, its remarkable physiological and computational (software) properties enable cellular collectives to form versatile machines that solve a wide range of problems in real time. The emerging field at the intersection of diverse intelligence, computer science and developmental biophysics is beginning to understand how cellular swarms deploy a kind of collective intelligence to navigate the space of possible anatomical shapes (morphospace) until the correct target morphology is reached, and despite perturbations.",
      "section": "Introduction",
      "topic": "Collective intelligence in morphogenesis",
      "chunk_summary": "Cellular collectives utilize physiological and computational properties to navigate morphospace and achieve target morphologies despite perturbations.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "1",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "How do such cellular collectives know when to stop growing and remodeling? One set of models focuses on 'anatomical homeostasis' – the competency to implement an error-minimization scheme toward an anatomical setpoint. This is a different way of thinking about morphogenesis – not as a set of outcomes that emerge inevitably from the unrolling of a fixed genome through molecular interactions but instead as a real-time problem-solving process carried out by a machine with context-specific information-processing capabilities. This difference in perspective is crucial because it has strong implications for therapeutic interventions. Most current approaches in molecular medicine assume that the only viable therapeutic target is the hardware. Biological circuits must be rewired bottom-up (e.g., via genomic editing or drugs that target specific protein activities). By contrast, the homeostatic perspective suggests that it might be possible to work top-down, rewriting the anatomical target or setpoint to induce a different outcome without changing the morphogenetic machinery itself.",
      "section": "Introduction",
      "topic": "Anatomical homeostasis as a therapeutic target",
      "chunk_summary": "The concept of anatomical homeostasis suggests that therapeutic interventions can target the anatomical setpoint rather than rewiring biological circuits bottom-up.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "This corresponds to the shift seen in information technology, which went from exclusively hardware-based control (in the 1940s and 1950s) to exploitation of reprogrammability, modularity of competent subroutines and high-level programming languages. Can medicine benefit from a similar transition? Morphoceuticals are a novel class of therapeutics inspired by this perspective, developed to exploit the modular, error-correcting capabilities of tissues instead of trying to micromanage pathways. These can be repurposed existing compounds or newly discovered ones. What makes them unique is not a particular chemical property but rather the fact that they are used to target high-level morphogenetic control machinery instead of bottom-up targeting of specific molecular-level phenotypes. Their discovery stems from efforts to understand collective decision-making of cell groups navigating morphogenetic, transcriptional, physiological and metabolic problem spaces; as the computational mechanisms that assess and modify growth and form are discovered, these sensing, memory and implementation steps become druggable targets.",
      "section": "Introduction",
      "topic": "Morphoceuticals",
      "chunk_summary": "Morphoceuticals target high-level morphogenetic control machinery, exploiting the modularity and error-correction capabilities of tissues.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "2",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Here, we focus on a subset of these: electroceuticals, which specifically target bioelectric networks using ion channel drugs and other modalities. Electroceutical approaches using direct external stimulation of peripheral nerves have been covered elsewhere; these have shown promise but face the limitations where, although suitable to trigger action potentials, electrodes are not able to set up the standing (stable) patterns of cellular Vmem that are essential for organ-level bioelectric control. Here, we focus on drug approaches for manipulating the native bioelectric interface (ion channels and gap junctions) and especially expand its relevance beyond neurons to include all body cells, complementing exciting recent advances in using direct stimulation in regenerative contexts. We review recent work that explains why bioelectric networks are such a compelling therapeutic target for developmental defects, regeneration and cancer. We also review evidence suggesting that aging, which has not yet been explored in the literature on bioelectricity, constitutes another instantiation of morphogenetic dysregulation that could also respond to targeting bioelectric networks and offer our perspective on paths forward for electroceutical drug discovery.",
      "section": "Introduction",
      "topic": "Electroceuticals",
      "chunk_summary": "This paper focuses on electroceuticals, drugs targeting bioelectric networks via ion channels and gap junctions, for regenerative medicine, cancer suppression, and anti-aging therapies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "2,3",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "How do tissues store setpoints and coordinate cellular activity across distance? Mostly occurring in the brain, this is implemented by bioelectrical networks throughout the body. Developmental bioelectricity is the ubiquitous exchange of slowly changing ion-based voltage signals within and among cells, which underlies collective decision-making at the tissue level. All cells respond to changes in transmembrane voltage potential (Vmem). In this sense, other cells are similar to neurons: their electric state is determined by their ion channels, transporters and pumps, and by gap junctions (electrical synapses), which propagate the electric state between neighboring cells. The bioelectric state of a cell is a function of past experience, extracellular signaling and signals from immediate neighbors – those directly connected via gap junctions. Bioelectric signaling has been shown to regulate a range of phenotypes in human cells, for example differentiation in mesenchymal stem cells. More important than single cell states, however, is the fact that, together, the voltage state of cells form a network – a tissue-wide bioelectrical pattern that ultimately triggers the changes in gene expression required to attain a specific morphogenetic goal.",
      "section": "Developmental bioelectricity",
      "topic": "Bioelectric networks",
      "chunk_summary": "Bioelectric networks, composed of ion channels, transporters, pumps, and gap junctions, facilitate cell communication and regulate tissue-level decision-making for morphogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "3",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "The bioelectric code maps prepatterns of voltage into organ size, shape and placement information via transduction by a set of mechanisms including neurotransmitter gating, calcium signaling and voltage-sensitive phosphatases. Whereas the electrical neural networks of the brain guide muscles to implement behavioral goals, the ancient bioelectric networks of the body guide cell activity to implement morphogenetic goals, via storage and implementation of slowly changing anatomical prepatterns.",
      "section": "Developmental bioelectricity",
      "topic": "Bioelectric code",
      "chunk_summary": "The bioelectric code translates voltage prepatterns into organ-level information, guiding cell activity to achieve morphogenetic goals.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "3",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Spatiotemporal patterns of Vmem in vivo are instructive for reaching specific morphogenetic outcomes. Microinjection of mRNA encoding Kir6.2 ion channels into blastomeres of frog embryos can reproduce the bioelectric state characteristic of the native eye field in ectopic locations by mimicking the native patterns that regionalize the face. Doing this in precursors of gut or other tissues – locations that never show competency to become eye tissue when induced by the 'master' eye gene Pax6 - induces the development of entire eyes that can connect to the nervous system and provide vision. Similarly, regenerating planaria, which normally reliably reproduce a head at one end and a tail at the other, can be coaxed into viable two-head or no-head forms by targeting the bioelectrical gradients in regenerating fragments, or even to grow heads corresponding to other species of planaria, all without any genomic editing. What these morphoceutical interventions have in common is that, in all cases, the input stimulus is informationally very simple – it does not attempt to provide instructions to individual cells on how to build an eye or a head, it provides a high-level master regulator that says 'build organ X here' and relies on the competency of the underlying cellular and molecular mechanisms to fill in the details.",
      "section": "Developmental bioelectricity",
      "topic": "Bioelectric manipulation of morphogenesis",
      "chunk_summary": "Manipulating bioelectric patterns can induce specific morphogenetic outcomes, such as ectopic eye formation and altered planarian head regeneration, by providing high-level instructions to cell collectives.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "This is a desirable property from the perspective of regenerative medicine interventions: the less we need to micromanage the more robust the outcomes. For example, inducing a second head in this manner produces well-scaled heads appropriate to the body, whereas induction using a canonical molecular mechanism (Wnt pathway) induces tiny heads because the size control has to be handled separately when approaching the problem bottom-up. As befits a native control system, ion channels have been implicated in numerous channelopathies of embryonic embryogenesis. The human phenotypes are well-modeled by functional experiments in species like fruit fly, zebrafish, mouse and frog, implicating numerous ion channels such as Kir2.1 and gap junctions (connexins).",
      "section": "Developmental bioelectricity",
      "topic": "Channelopathies and bioelectric control",
      "chunk_summary": "Bioelectric interventions offer a more robust approach to regenerative medicine than bottom-up molecular methods, and ion channels are implicated in various developmental channelopathies.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Overall, the manipulation of the bioelectrical pattern holds great promise for the control of morphogenesis and, thus, for regenerative medicine. Bioelectric interventions can work at several levels. For example, electrotaxis has been exploited for the control of cell movement in wound healing. At the level of specific organs, malformations induced by mutations and teratogens can be reversed. For example, profound defects of brain structure and function induced by teratogens can be reversed by reinforcing normal endogenous voltage pre-patterns in xenopus. Pai et al. showed that brain developmental defects induced by mutation of key neurogenesis genes such as Notch can be rescued by misexpression or activation of native HCN2 (hyperpolarization-activated cyclic nucleotide-gated) channels. As voltage-regulated ion channels, HCN2 are context-sensitive: they increase hyperpolarization of slightly polarized cells but have no effect on depolarized cells. Thus, they function as 'contrast enhancers' that sharpen weakened differences in Vmem across compartment boundaries similar to the way a Sharpen filter works to emphasize order in a fuzzy image. Pai et al. developed a computational model of the endogenous bioelectrical circuit that sets the brain prepattern, modeling the function of HCN2 channels to reinforce the voltage potential differences that demarcate the edges of the brain in development.",
      "section": "Developmental bioelectricity",
      "topic": "Bioelectric interventions in regenerative medicine",
      "chunk_summary": "Bioelectric interventions show promise for regenerative medicine by controlling cell movement, reversing organ malformations, and rescuing brain defects through HCN2 channel manipulation.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "4",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "This model suggested that bioelectric drugs that mimic the effect of HCN2 overexpression should rescue brain teratogenesis via local and long-range bioelectric repair. Indeed, lamotrigine and gabapentin, already approved for use in humans for other indications, rescued teratogen-induced defects in xenopus embryos. The ability to repair complex organ defects of the brain, face, heart and gut by simple (and systemic) application of a single, repurposed channel activator reveals the potential of this approach - it relies on the computational capacity of the tissues to do the heavy lifting, using computation to identify simple triggers that do not require manual control of gene levels, localization, stem cell behavior, among others. Above the organ level, bioelectric signaling has been shown to be a promising target to induce the regeneration of entire appendages. In rats, limb regeneration can be augmented by bioelectric signals. In a frog model of tail regeneration (which includes muscle, spinal cord, blood vessels and skin), complete regrowth in nonregenerative conditions has been shown by the 1-hour application of a simple ionophore, which induces a pro-regenerative state in the wound and then does not need to be maintained during the 10 days of regeneration. The rapid inductive aspect is also seen in non-bioelectric morphoceuticals, such as a bioreactor-delivered drug cocktail in adult frogs that triggered 18+ months of leg regeneration after just 24 h of treatment.",
      "section": "Developmental bioelectricity",
      "topic": "Bioelectric drugs for organ regeneration",
      "chunk_summary": "Bioelectric drugs, such as lamotrigine and gabapentin, can rescue teratogen-induced organ defects and promote appendage regeneration by leveraging the computational capacity of tissues.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "5, 6",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "One way to think about cancer is as the shrinking of the computational boundary from organ-sized back down to the level of a single cell, at which point cells resume their ancient unicellular past and treat the rest of the body as external environment. This model predicts that cancer would be driven by a dysregulation of the computational glue that normally keeps cells working toward organ-level morphogenetic goals, for example bioelectric signaling. It has been known for decades that tumors have depolarized bioelectric signatures and abnormal electrical connectivity compared with normal tissue, in addition to excessive sodium accumulation. Moreover, tumorigenesis starts with the bioelectric disconnection of cells from the larger somatic morphogenetic network; and metastatic melanoma can be induced in the absence of carcinogens or oncogenic mutations simply by dysregulating the bioelectric signaling between two cell types. Indeed, some authors have described cancer as a special case of channelopathies: the onco-channelopathies. It is important to keep in mind that, whereas abnormal bioelectric states can be induced by mutant ion channels, the dynamic nature of channel signaling (they can be opened or closed post-translationally) ensures that a plethora of physiological events can induce these states in the absence of any genetic lesions.",
      "section": "Cancer as a developmental defect",
      "topic": "Cancer and bioelectricity",
      "chunk_summary": "Cancer can be viewed as a breakdown of the bioelectric communication that coordinates cells within an organ, leading to depolarized signatures and abnormal connectivity.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "6",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Studies in model organisms support the diagnostic and therapeutic promise of targeting the tumor bioelectric state. In tadpoles, nascent tumors induced by microinjection of human oncogene mRNA are depolarized compared with normal tissue and can be detected in advance using voltage-sensitive fluorescent dyes, offering promise for early, noninvasive detection of cancer and for visualizing tumor boundaries during surgical intervention. Furthermore, co-injecting a hyperpolarizing ion channel greatly reduces tumor formation despite the overexpression of strong human oncogenes such as Xrel3 or KRAS. Crucial for therapeutic potential, hyperpolarization can still produce cancer normalization when it occurs after tumors have formed, as well as at long-range, via a gap-junction-dependent mechanism. This shows that hyperpolarization induced by pharmacological, genetic or even light-based stimuli could be used to prevent or revert tumors, and ion channels are beginning to be implicated in tumor resistance. Because of their essential role in controlling the spread of morphogenetic (or cancer-suppressive) signals throughout the body, gap junctions and connexins have also been proposed as therapeutic targets in cancer. Importantly, this effect was seen to occur via a normalization of the cancer cells not by killing them (cytotoxicity).",
      "section": "Cancer as a developmental defect",
      "topic": "Tumor bioelectric state as therapeutic target",
      "chunk_summary": "Targeting the tumor bioelectric state through hyperpolarization shows promise for cancer detection, prevention, and reversion, potentially normalizing cancer cells without cytotoxicity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "6, 7",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Very recently, Mathews et al. showed that ion-channel drugs can suppress the cancer phenotype in glioblastoma cell lines. Because glioblastoma overgrowth and drug resistance are characterized by depolarized resting membrane potentials and an acidic extracellular pH in the inter-tumor environment, the authors sought to identify potential treatments by screening a panel of drugs that induce hyperpolarization and/or disrupt proton pumps. They screened varying concentrations of 47 compounds (and combinations thereof), most of which were modulators of ion channels, to identify treatments that suppress cancer phenotypes. The most effective treatments for reducing proliferation, inducing senescence and promoting differentiation in human U87 cells in vitro were the following combinations: NS1643 and pantoprazole; retigabine and pantoprazole; and pantoprazole or NS1643 with temozolomide. Because all of these are FDA-approved for other uses, drug repurposing could be a key factor in the development of electroceuticals as an alternative or adjunct to chemotherapy in treatment of glioblastoma and other cancers.",
      "section": "Cancer as a developmental defect",
      "topic": "Ion channel drugs for cancer treatment",
      "chunk_summary": "Ion channel drugs, such as NS1643, pantoprazole, and retigabine, show promise in suppressing glioblastoma phenotypes, offering potential for drug repurposing in cancer treatment.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Maintaining order at the tissue level is a highly dynamic task; failures lead to cancer and disorganization (such as that of the rosettes of the tongue surface when input via the lingual nerve is suppressed). However, the most consistent and pervasive result of the failure of the body's constant regenerative efforts is aging. Aging in humans is the progressive loss of function of biological processes with a decline of the capacity to maintain anatomical homeostasis and to reproduce, resulting in progressive organ malfunctions, diseases and ultimately death. The traditional conceptual biogerontological framework enunciates that aging is a process of damage accumulation caused by energy metabolism and mitochondrial function, and that cell proliferation and lifespan are limited by replicative senescence caused by telomere shortening. Here, we propose aging as a morphostasis defect; specifically, we hypothesize that it is an ongoing developmental process with probable inputs from the ubiquitous bioelectrical control system that could link the seven pillars of aging. Next, we discuss some of the potential links between aging, aging-related diseases and bioelectricity, and the opportunities these create for biomedical research.",
      "section": "Aging as a morphostasis defect",
      "topic": "Aging and morphostasis",
      "chunk_summary": "Aging is proposed as a morphostasis defect, a failure to maintain anatomical homeostasis, potentially linked to the bioelectrical control system and the seven pillars of aging.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "7",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "The links between aging, aging-related diseases and bioelectricity via ion channels are starting to be discovered. Rates of cellular or organismal aging have been shown to be regulated by ion channels. In a few cases, specific types of ion channels and downstream transducers have been associated with aging. The seven pillars of aging can be linked directly or indirectly to bioelectricity. Indeed, ion channels have been associated with metabolism and inflammation during aging. Stem cells and regeneration are controlled by developmental bioelectricity. Epigenetic alterations have been linked to changes in the bioelectrical pattern during tadpole regeneration. Proteostasis is regulated by lysosomal function that is regulated by ion channels. Several stress-regulated ion channels exist and macromolecular damage affects ion channels and can impair the bioelectrical pattern responsible for the maintenance of the anatomy. More specifically, ion channels and transporters influence aging and longevity via the regulation of membrane excitability, Ca2+ homeostasis, mitochondrial and endolysosomal function, and the transduction of sensory stimuli. Ion channels are also implicated in aging-related diseases impacting the heart, brain, cancer and the eye and in aging-related inflammation via mitochondrial functions. Channelopathies are also often associated with organ failure during aging.",
      "section": "Aging as a morphostasis defect",
      "topic": "Ion channels and aging",
      "chunk_summary": "Ion channels play a role in regulating aging and are linked to the seven pillars of aging, influencing various cellular processes and implicated in age-related diseases.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Aging-dependent deterioration of neuronal activity has been linked to changes in Ca2+ homeostasis. In age-related cardiovascular diseases, Toro et al. observed NO release associated with a reduction in the density of the BKCa alpha subunit in coronary smooth muscle, indicating decreased expression during aging. Sinoatrial node (SAN) dysfunction can also be related to changes in the activity of several ion channels that control appropriate directionalities of ionic fluxes in the SAN and cardiac muscle. In addition, studies showed a link between Hutchinson-Gilford progeria syndrome (HGPS) and bioelectricity. An alteration of post-translational modification of progerin that contributes to the phenotype of premature aging in HGPS patients could be caused by an abnormal cytosolic Ca2+ concentration owing to upregulation of the transient receptor potential vanilloid type 2 (TRPV2) calcium channel.",
      "section": "Aging as a morphostasis defect",
      "topic": "Age-related diseases and bioelectricity",
      "chunk_summary": "Age-related decline in neuronal activity, cardiovascular diseases, and progeria syndrome are linked to changes in ion channel activity and calcium homeostasis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Rejuvenation strategies including blood factors, metabolic manipulations, senolytics and cellular reprogramming have been developed recently to delay and potentially reverse the aging process. Several of these approaches appear to have an impact on bioelectricity and regulate the behavior of ion channels. Metformin acts on nutrient-sensing pathways involved in the rejuvenation effects of dietary regimens and has several effects on bioelectricity. It restores electrophysiology of small conductance calcium-activated potassium channels in the atrium of GK diabetic rats and normalizes the aberrant intracellular Ca2+ clearing induced by high glucose in adult rat myocytes. Blood factors can have a pro-rejuvenation effect as shown by the positive impact of young blood on the liver, muscle and brain. Wnt signaling underlying the differentiation bias of aged muscle stem cell is reversed by young blood factors. Wnt signaling influences ion channels and is aberrantly activated in several human diseases including cancer. For example, inhibition of the Wnt signaling pathway downregulates Cav1.2 in aging models characterized by an altered osteogenic differentiation. More globally, Wnt signaling can be modulated by variation in K+ and Ca2+ fluxes across cell membrane induced by changes in transmembrane potential.",
      "section": "Aging as a morphostasis defect",
      "topic": "Rejuvenation strategies and bioelectricity",
      "chunk_summary": "Rejuvenation strategies, such as metformin and blood factors, impact bioelectricity and regulate ion channel behavior, potentially reversing age-related changes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": "7, 8",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Besides mechanistically testing the links between ion channel disfunction and specific aging processes, it will be essential to determine what happens to the bioelectric prepatterns during aging. What about the bioelectric states that go awry toward the end of the healthspan? Do the bioelectric cues get weaker or are the cues there but the cellular ability to perceive them (and act on them) wanes? In particular, in addition to life extension assays in canonical model systems (mice), it will be essential to understand what happens in apparently immortal species like planaria. It is tempting [to speculate]",
      "section": "Aging as a morphostasis defect",
      "topic": "Future research on bioelectricity and aging",
      "chunk_summary": "Further research is needed to understand how bioelectric prepatterns change during aging and whether the cues weaken or the cellular ability to perceive them declines.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "8",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Rational control of bioelectrical states has immense potential for biomedical applications in regeneration, cancer and aging. Several key attributes make bioelectric states an especially attractive target for drug discovery for regeneration, cancer, aging and, indeed, for any disease that can be seen as a defect or dysregulation of morphogenesis. First, many studies demonstrate that bioelectric states constitute a 'master signal', they can control morphogenetic cascades and avoid the need to micromanage extremely complex spatiotemporal biochemical interactions via genetic engineering or classical molecular biology. Instead, accurate generation or regeneration of specific parts can be induced by the simple imposition of specific voltage patterns, as shown for planarian heads, eyes or frog tails, as described above.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Bioelectric states as master signals",
      "chunk_summary": "Bioelectric states act as master signals, controlling morphogenetic cascades and offering a simpler alternative to micromanaging biochemical interactions for regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "8",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Second, bioelectric signaling seems to require only a brief, transient trigger stimulus. For example, in rat mesenchymal cells in vitro, a brief electrical stimulus induces long-lasting osteogenic effects, suggesting it could provide powerful synergy with bone-tissue-engineering therapies. Similarly, manipulation of bioelectrical states for just 1–3 h triggers an 8- or 10-day program of regeneration for planarian heads and tadpole tails, respectively. Third, ion-channel-targeting drugs are the third-best-selling group of prescribed drugs worldwide, providing a large pool of candidates that can be screened for repurposing as electroceuticals. In addition, only a small percentage of the 400 annotated ion-channel genes predicted in the human genome have been targeted, so there are many novel targets for drug discovery as well.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Advantages of bioelectric signaling",
      "chunk_summary": "Bioelectric signaling requires only brief stimuli for long-lasting effects, and the existing pool of ion-channel-targeting drugs offers ample opportunities for repurposing as electroceuticals.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": "9",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "The ideal way to control this native interface is via channel-, pump- and gap-junction-targeting compounds (although light, vibration and other exotic modalities might someday augment this technology). Repurposing of drugs that are already FDA-approved could be particularly expedient for discovery of morphoceuticals. Despite the large number of channel drugs that are already known and tested, this is only a small percentage of ion channels that have been targeted for drug development. Beyond drug repurposing, the in silico results on the opening and closing of ion channels will also suggest the design of new compounds using traditional drug design methods, to fill out the massive space of possible electroceuticals.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Drug discovery for bioelectric control",
      "chunk_summary": "Drug discovery for bioelectric control can leverage existing FDA-approved channel drugs and in silico modeling to design new compounds targeting ion channels, pumps, and gap junctions.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "This effort will require the development of tools that trawl transcriptomic databases (such as EDEn) revealing which ion channels are potential targets for intervention in a specific tissue. Computational modeling will also be key to simulating bioelectrical dynamics to predict the bioelectrical pattern resulting from opening or closing specific targeted channels with existing drugs. In silico results will predict the effects of specific drugs targeting tissue-specific ion channels, suggesting specific in vivo experiments to assess their potential for regeneration, repair or cancer normalization. For a specific purpose, the software will make suggestions regarding which channels to target, and in what way (temporal profile, and which drugs) to obtain the targeted bioelectrical pattern within a tissue. A key ingredient to this workflow however is the development of physiomic datasets across patients, ages, body regions and health or disease states. When the physiomic data catch up in volume to the deluge of transcriptional, genetic, epigenetic and metabolic datasets that are now available, the next generation of bioelectric interventions will be immediately within reach (especially given the availability of machine learning and data mining tools).",
      "section": "Concluding remarks and future perspectives",
      "topic": "Computational modeling and drug discovery",
      "chunk_summary": "Computational modeling, combined with transcriptomic data and physiomic datasets, will be crucial for predicting drug effects on bioelectric patterns and guiding in vivo experiments for regenerative medicine and cancer normalization.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "One aspect of this strategy is key. The goal is not to simply find drugs that up- or down-regulate specific channels in the same way one would address over- or under-expressed transcription factors. It is, for example, already known that ion-channel drugs are very promising cancer drugs. However, the real promise of this technology will only be realized when they are seen not as rewiring agents mechanically targeting specific gene products or even pathways but as signals (like a keypad depression on a computer interface) designed to manipulate the bioelectrically mediated decision-making of cell networks. This requires a different class of computational models that treats the underlying tissue as a computational agent, not a simple dynamical system. This in turn suggests the urgency of development (and integration into molecular-biological and physiological models) of computational frameworks, such as causal information theory, that seek to decode the information flow between cells during health and disease or integrative network representation for drug discovery including the transcriptional representation of the electrome using EDEn for example.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Cell networks as computational agents",
      "chunk_summary": "The true potential of ion-channel drugs lies in their ability to manipulate the bioelectrically mediated decision-making of cell networks, requiring computational models that treat tissues as computational agents.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "A second aspect is the non-locality of bioelectric information. As in the brain, several disease states receive input from distant locations. For example, embryonic brain structure can be damaged and repaired by bioelectric states occurring on the other side of the animal. The same is true for tumorigenesis and the amputation status of one limb can be read out from the bioelectric signals of the contralateral (untouched) limb. This suggests the possibility of surrogate site diagnostics and treatment, and makes it imperative that bioelectric models and drug searches do not focus on the local site of a wound or defect but consider the entire organism as a potential interface for treatment. For example, in the case of tail regeneration and hyperinnervation to improve vision, the entire animal was exposed but only relevant cells responded (i.e., no need for spatially specific stimulation). In other cases, local delivery via a wearable bioreactor was used.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Non-locality of bioelectric information",
      "chunk_summary": "The non-local nature of bioelectric information allows for the possibility of surrogate site diagnostics and treatment, requiring consideration of the entire organism as a potential interface.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "More broadly, beyond electroceuticals, what binds biochemical, biomechanical, optical and bioelectrical morphoceuticals together is the commitment to exploiting high-level problem-solving capacities in cells and tissues. For example, other physiological parameters such as REDOX state or tissue biomechanics can likewise serve as master controls for complex outcomes. But whether induced by CRISPR, optogenetic stimulation, pharmacological agents or even behavioral cues, the crucial aspect is to move from managing micro-level components to the cybernetic properties of entire circuits. One implication of top-down control of modules and the allostatic capabilities of living matter is that dosage and timing might not have to be micromanaged. For example, in recent examples of triggering the regeneration of complex organs and appendages via bioelectric, hormonal and other biochemical means, the organ type, composition, shape and size were all induced without any attempts to identify an effective dose or precise timing regime. A key part of this strategy is offloading the complexity onto the organism itself (exploiting its modular, regulative control structure) to achieve complex outcomes where precise parameters and molecular details are not yet known. Morphoceuticals can be rationally designed based on top-down control mechanisms or discovered in pharmacological or genetic screens specifically focused on high-level control phenotypes.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Morphoceuticals and high-level control",
      "chunk_summary": "Morphoceuticals exploit the high-level problem-solving capacities of cells and tissues, shifting focus from micro-level components to cybernetic properties of entire circuits, potentially simplifying dosage and timing requirements.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "9, 10",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    },
    {
      "text": "Taken together, a picture emerges in which the regenerative medicine of the future can stand on the shoulders of two giants: computer science and cognitive/behavioral science. Computational neuroscience progress reveals how a multiscale approach to the brain (not only molecular but circuit, network and even psychology-level) is providing a full-stack understanding of the control of behavior. We suggest that the same strategy can be applied in regenerative medicine, by targeting bioelectricity as the computational glue that binds cells together to common purpose in vivo, and embracing the idea that causally effective interventions can be applied at levels higher than that of molecules. Definitive approaches to aging, cancer, traumatic injury and birth defects await, limited only by our ability to see tissues as competent information-processing agents that we now have the tools to meet at their own level.",
      "section": "Concluding remarks and future perspectives",
      "topic": "Future of regenerative medicine",
      "chunk_summary": "The future of regenerative medicine can leverage multiscale approaches from computer science and cognitive science, targeting bioelectricity as the computational glue for cell networks and applying interventions at higher levels than molecules.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": "10",
      "pdf_filename": "pdf_20250803_124126_944797.pdf",
      "original_filename": "pdf_20250803_124126_944797_extracted_text.txt",
      "authors": "[\"Léo Pio-Lopez\", \"Michael Levin\"]",
      "year": "2023",
      "journal": "Drug Discovery Today",
      "doi": "10.1016/j.drudis.2023.103585ThisisanopenaccessarticleundertheCCBY-NC-NDlicense(http://creativecommons.org/licenses/by-nc-nd/4.0/).www.drugdiscoverytoday.com"
    }
  ],
  "gemini_response": "```json\n[\n{\"text\": \"One crucial aspect of cell biology is the ability of groups of cells to collectively reach specific, large-scale anatomical outcomes. From single cells (eggs) to complex metazoan bodies, such cell collectives cooperate toward creating complex forms and defending them against tumorigenesis, aging and injuries. Understanding the set of mechanisms that allow this is crucial for producing innovating new therapeutics for birth defects, regenerative repair and cancer. Transformative biomedical therapeutics would be within reach if there were robust methods to communicate anatomical goal states to cell groups, coaxing them to build fresh organs and tissues as needed. What features of morphogenesis can be exploited to achieve this?\", \"section\": \"Introduction\", \"topic\": \"Anatomical homeostasis\", \"chunk_summary\": \"Understanding how cell collectives achieve specific anatomical outcomes is crucial for developing new therapeutics for birth defects, regeneration, and cancer.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"1\"},\n{\"text\": \"Importantly, although reliable and consistent, morphogenesis is not hardwired – it is plastic and dynamic. Cell collectives have ample resources to deal with a wide range of disruptors of their morphogenetic target states: the same anatomical configuration can be reached from different starting conditions and despite significant perturbations. For example, regenerative organisms, like salamanders, can regrow a limb after amputation. The cells reproduce a normal limb and stop their activity when the precisely correct appendage is complete, regardless of the level of the original amputation. Deer regrow huge amounts of antler bone and innervation each year, and even human beings can regenerate livers. Tadpoles with scrambled faces still make normal frogs because their craniofacial organs rearrange as needed during metamorphosis. This property is also found in the regulative development of early mammalian embryos that can recover from massive perturbation such as complete (natural or artificial) bisection, producing two identical normal bodies.\", \"section\": \"Introduction\", \"topic\": \"Morphogenetic plasticity\", \"chunk_summary\": \"Morphogenesis is a plastic and dynamic process, allowing cell collectives to achieve target anatomical states despite perturbations, as seen in limb regeneration and embryonic development.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"1\"},\n{\"text\": \"Although cellular genetic hardware changes on evolutionary timescales, its remarkable physiological and computational (software) properties enable cellular collectives to form versatile machines that solve a wide range of problems in real time. The emerging field at the intersection of diverse intelligence, computer science and developmental biophysics is beginning to understand how cellular swarms deploy a kind of collective intelligence to navigate the space of possible anatomical shapes (morphospace) until the correct target morphology is reached, and despite perturbations.\", \"section\": \"Introduction\", \"topic\": \"Collective intelligence in morphogenesis\", \"chunk_summary\": \"Cellular collectives utilize physiological and computational properties to navigate morphospace and achieve target morphologies despite perturbations.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"1\"},\n{\"text\": \"How do such cellular collectives know when to stop growing and remodeling? One set of models focuses on 'anatomical homeostasis' – the competency to implement an error-minimization scheme toward an anatomical setpoint. This is a different way of thinking about morphogenesis – not as a set of outcomes that emerge inevitably from the unrolling of a fixed genome through molecular interactions but instead as a real-time problem-solving process carried out by a machine with context-specific information-processing capabilities. This difference in perspective is crucial because it has strong implications for therapeutic interventions. Most current approaches in molecular medicine assume that the only viable therapeutic target is the hardware. Biological circuits must be rewired bottom-up (e.g., via genomic editing or drugs that target specific protein activities). By contrast, the homeostatic perspective suggests that it might be possible to work top-down, rewriting the anatomical target or setpoint to induce a different outcome without changing the morphogenetic machinery itself.\", \"section\": \"Introduction\", \"topic\": \"Anatomical homeostasis as a therapeutic target\", \"chunk_summary\": \"The concept of anatomical homeostasis suggests that therapeutic interventions can target the anatomical setpoint rather than rewiring biological circuits bottom-up.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"2\"},\n{\"text\": \"This corresponds to the shift seen in information technology, which went from exclusively hardware-based control (in the 1940s and 1950s) to exploitation of reprogrammability, modularity of competent subroutines and high-level programming languages. Can medicine benefit from a similar transition? Morphoceuticals are a novel class of therapeutics inspired by this perspective, developed to exploit the modular, error-correcting capabilities of tissues instead of trying to micromanage pathways. These can be repurposed existing compounds or newly discovered ones. What makes them unique is not a particular chemical property but rather the fact that they are used to target high-level morphogenetic control machinery instead of bottom-up targeting of specific molecular-level phenotypes. Their discovery stems from efforts to understand collective decision-making of cell groups navigating morphogenetic, transcriptional, physiological and metabolic problem spaces; as the computational mechanisms that assess and modify growth and form are discovered, these sensing, memory and implementation steps become druggable targets.\", \"section\": \"Introduction\", \"topic\": \"Morphoceuticals\", \"chunk_summary\": \"Morphoceuticals target high-level morphogenetic control machinery, exploiting the modularity and error-correction capabilities of tissues.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"2\"},\n{\"text\": \"Here, we focus on a subset of these: electroceuticals, which specifically target bioelectric networks using ion channel drugs and other modalities. Electroceutical approaches using direct external stimulation of peripheral nerves have been covered elsewhere; these have shown promise but face the limitations where, although suitable to trigger action potentials, electrodes are not able to set up the standing (stable) patterns of cellular Vmem that are essential for organ-level bioelectric control. Here, we focus on drug approaches for manipulating the native bioelectric interface (ion channels and gap junctions) and especially expand its relevance beyond neurons to include all body cells, complementing exciting recent advances in using direct stimulation in regenerative contexts. We review recent work that explains why bioelectric networks are such a compelling therapeutic target for developmental defects, regeneration and cancer. We also review evidence suggesting that aging, which has not yet been explored in the literature on bioelectricity, constitutes another instantiation of morphogenetic dysregulation that could also respond to targeting bioelectric networks and offer our perspective on paths forward for electroceutical drug discovery.\", \"section\": \"Introduction\", \"topic\": \"Electroceuticals\", \"chunk_summary\": \"This paper focuses on electroceuticals, drugs targeting bioelectric networks via ion channels and gap junctions, for regenerative medicine, cancer suppression, and anti-aging therapies.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"2,3\"},\n{\"text\": \"How do tissues store setpoints and coordinate cellular activity across distance? Mostly occurring in the brain, this is implemented by bioelectrical networks throughout the body. Developmental bioelectricity is the ubiquitous exchange of slowly changing ion-based voltage signals within and among cells, which underlies collective decision-making at the tissue level. All cells respond to changes in transmembrane voltage potential (Vmem). In this sense, other cells are similar to neurons: their electric state is determined by their ion channels, transporters and pumps, and by gap junctions (electrical synapses), which propagate the electric state between neighboring cells. The bioelectric state of a cell is a function of past experience, extracellular signaling and signals from immediate neighbors – those directly connected via gap junctions. Bioelectric signaling has been shown to regulate a range of phenotypes in human cells, for example differentiation in mesenchymal stem cells. More important than single cell states, however, is the fact that, together, the voltage state of cells form a network – a tissue-wide bioelectrical pattern that ultimately triggers the changes in gene expression required to attain a specific morphogenetic goal.\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Bioelectric networks\", \"chunk_summary\": \"Bioelectric networks, composed of ion channels, transporters, pumps, and gap junctions, facilitate cell communication and regulate tissue-level decision-making for morphogenesis.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"3\"},\n{\"text\": \"The bioelectric code maps prepatterns of voltage into organ size, shape and placement information via transduction by a set of mechanisms including neurotransmitter gating, calcium signaling and voltage-sensitive phosphatases. Whereas the electrical neural networks of the brain guide muscles to implement behavioral goals, the ancient bioelectric networks of the body guide cell activity to implement morphogenetic goals, via storage and implementation of slowly changing anatomical prepatterns.\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Bioelectric code\", \"chunk_summary\": \"The bioelectric code translates voltage prepatterns into organ-level information, guiding cell activity to achieve morphogenetic goals.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"3\"},\n{\"text\": \"Spatiotemporal patterns of Vmem in vivo are instructive for reaching specific morphogenetic outcomes. Microinjection of mRNA encoding Kir6.2 ion channels into blastomeres of frog embryos can reproduce the bioelectric state characteristic of the native eye field in ectopic locations by mimicking the native patterns that regionalize the face. Doing this in precursors of gut or other tissues – locations that never show competency to become eye tissue when induced by the 'master' eye gene Pax6 - induces the development of entire eyes that can connect to the nervous system and provide vision. Similarly, regenerating planaria, which normally reliably reproduce a head at one end and a tail at the other, can be coaxed into viable two-head or no-head forms by targeting the bioelectrical gradients in regenerating fragments, or even to grow heads corresponding to other species of planaria, all without any genomic editing. What these morphoceutical interventions have in common is that, in all cases, the input stimulus is informationally very simple – it does not attempt to provide instructions to individual cells on how to build an eye or a head, it provides a high-level master regulator that says 'build organ X here' and relies on the competency of the underlying cellular and molecular mechanisms to fill in the details.\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Bioelectric manipulation of morphogenesis\", \"chunk_summary\": \"Manipulating bioelectric patterns can induce specific morphogenetic outcomes, such as ectopic eye formation and altered planarian head regeneration, by providing high-level instructions to cell collectives.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"4\"},\n{\"text\": \"This is a desirable property from the perspective of regenerative medicine interventions: the less we need to micromanage the more robust the outcomes. For example, inducing a second head in this manner produces well-scaled heads appropriate to the body, whereas induction using a canonical molecular mechanism (Wnt pathway) induces tiny heads because the size control has to be handled separately when approaching the problem bottom-up. As befits a native control system, ion channels have been implicated in numerous channelopathies of embryonic embryogenesis. The human phenotypes are well-modeled by functional experiments in species like fruit fly, zebrafish, mouse and frog, implicating numerous ion channels such as Kir2.1 and gap junctions (connexins).\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Channelopathies and bioelectric control\", \"chunk_summary\": \"Bioelectric interventions offer a more robust approach to regenerative medicine than bottom-up molecular methods, and ion channels are implicated in various developmental channelopathies.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"4\"},\n{\"text\": \"Overall, the manipulation of the bioelectrical pattern holds great promise for the control of morphogenesis and, thus, for regenerative medicine. Bioelectric interventions can work at several levels. For example, electrotaxis has been exploited for the control of cell movement in wound healing. At the level of specific organs, malformations induced by mutations and teratogens can be reversed. For example, profound defects of brain structure and function induced by teratogens can be reversed by reinforcing normal endogenous voltage pre-patterns in xenopus. Pai et al. showed that brain developmental defects induced by mutation of key neurogenesis genes such as Notch can be rescued by misexpression or activation of native HCN2 (hyperpolarization-activated cyclic nucleotide-gated) channels. As voltage-regulated ion channels, HCN2 are context-sensitive: they increase hyperpolarization of slightly polarized cells but have no effect on depolarized cells. Thus, they function as 'contrast enhancers' that sharpen weakened differences in Vmem across compartment boundaries similar to the way a Sharpen filter works to emphasize order in a fuzzy image. Pai et al. developed a computational model of the endogenous bioelectrical circuit that sets the brain prepattern, modeling the function of HCN2 channels to reinforce the voltage potential differences that demarcate the edges of the brain in development.\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Bioelectric interventions in regenerative medicine\", \"chunk_summary\": \"Bioelectric interventions show promise for regenerative medicine by controlling cell movement, reversing organ malformations, and rescuing brain defects through HCN2 channel manipulation.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"4\"},\n{\"text\": \"This model suggested that bioelectric drugs that mimic the effect of HCN2 overexpression should rescue brain teratogenesis via local and long-range bioelectric repair. Indeed, lamotrigine and gabapentin, already approved for use in humans for other indications, rescued teratogen-induced defects in xenopus embryos. The ability to repair complex organ defects of the brain, face, heart and gut by simple (and systemic) application of a single, repurposed channel activator reveals the potential of this approach - it relies on the computational capacity of the tissues to do the heavy lifting, using computation to identify simple triggers that do not require manual control of gene levels, localization, stem cell behavior, among others. Above the organ level, bioelectric signaling has been shown to be a promising target to induce the regeneration of entire appendages. In rats, limb regeneration can be augmented by bioelectric signals. In a frog model of tail regeneration (which includes muscle, spinal cord, blood vessels and skin), complete regrowth in nonregenerative conditions has been shown by the 1-hour application of a simple ionophore, which induces a pro-regenerative state in the wound and then does not need to be maintained during the 10 days of regeneration. The rapid inductive aspect is also seen in non-bioelectric morphoceuticals, such as a bioreactor-delivered drug cocktail in adult frogs that triggered 18+ months of leg regeneration after just 24 h of treatment.\", \"section\": \"Developmental bioelectricity\", \"topic\": \"Bioelectric drugs for organ regeneration\", \"chunk_summary\": \"Bioelectric drugs, such as lamotrigine and gabapentin, can rescue teratogen-induced organ defects and promote appendage regeneration by leveraging the computational capacity of tissues.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"5, 6\"},\n{\"text\": \"One way to think about cancer is as the shrinking of the computational boundary from organ-sized back down to the level of a single cell, at which point cells resume their ancient unicellular past and treat the rest of the body as external environment. This model predicts that cancer would be driven by a dysregulation of the computational glue that normally keeps cells working toward organ-level morphogenetic goals, for example bioelectric signaling. It has been known for decades that tumors have depolarized bioelectric signatures and abnormal electrical connectivity compared with normal tissue, in addition to excessive sodium accumulation. Moreover, tumorigenesis starts with the bioelectric disconnection of cells from the larger somatic morphogenetic network; and metastatic melanoma can be induced in the absence of carcinogens or oncogenic mutations simply by dysregulating the bioelectric signaling between two cell types. Indeed, some authors have described cancer as a special case of channelopathies: the onco-channelopathies. It is important to keep in mind that, whereas abnormal bioelectric states can be induced by mutant ion channels, the dynamic nature of channel signaling (they can be opened or closed post-translationally) ensures that a plethora of physiological events can induce these states in the absence of any genetic lesions.\", \"section\": \"Cancer as a developmental defect\", \"topic\": \"Cancer and bioelectricity\", \"chunk_summary\": \"Cancer can be viewed as a breakdown of the bioelectric communication that coordinates cells within an organ, leading to depolarized signatures and abnormal connectivity.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"6\"},\n{\"text\": \"Studies in model organisms support the diagnostic and therapeutic promise of targeting the tumor bioelectric state. In tadpoles, nascent tumors induced by microinjection of human oncogene mRNA are depolarized compared with normal tissue and can be detected in advance using voltage-sensitive fluorescent dyes, offering promise for early, noninvasive detection of cancer and for visualizing tumor boundaries during surgical intervention. Furthermore, co-injecting a hyperpolarizing ion channel greatly reduces tumor formation despite the overexpression of strong human oncogenes such as Xrel3 or KRAS. Crucial for therapeutic potential, hyperpolarization can still produce cancer normalization when it occurs after tumors have formed, as well as at long-range, via a gap-junction-dependent mechanism. This shows that hyperpolarization induced by pharmacological, genetic or even light-based stimuli could be used to prevent or revert tumors, and ion channels are beginning to be implicated in tumor resistance. Because of their essential role in controlling the spread of morphogenetic (or cancer-suppressive) signals throughout the body, gap junctions and connexins have also been proposed as therapeutic targets in cancer. Importantly, this effect was seen to occur via a normalization of the cancer cells not by killing them (cytotoxicity).\", \"section\": \"Cancer as a developmental defect\", \"topic\": \"Tumor bioelectric state as therapeutic target\", \"chunk_summary\": \"Targeting the tumor bioelectric state through hyperpolarization shows promise for cancer detection, prevention, and reversion, potentially normalizing cancer cells without cytotoxicity.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"6, 7\"},\n{\"text\": \"Very recently, Mathews et al. showed that ion-channel drugs can suppress the cancer phenotype in glioblastoma cell lines. Because glioblastoma overgrowth and drug resistance are characterized by depolarized resting membrane potentials and an acidic extracellular pH in the inter-tumor environment, the authors sought to identify potential treatments by screening a panel of drugs that induce hyperpolarization and/or disrupt proton pumps. They screened varying concentrations of 47 compounds (and combinations thereof), most of which were modulators of ion channels, to identify treatments that suppress cancer phenotypes. The most effective treatments for reducing proliferation, inducing senescence and promoting differentiation in human U87 cells in vitro were the following combinations: NS1643 and pantoprazole; retigabine and pantoprazole; and pantoprazole or NS1643 with temozolomide. Because all of these are FDA-approved for other uses, drug repurposing could be a key factor in the development of electroceuticals as an alternative or adjunct to chemotherapy in treatment of glioblastoma and other cancers.\", \"section\": \"Cancer as a developmental defect\", \"topic\": \"Ion channel drugs for cancer treatment\", \"chunk_summary\": \"Ion channel drugs, such as NS1643, pantoprazole, and retigabine, show promise in suppressing glioblastoma phenotypes, offering potential for drug repurposing in cancer treatment.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"7\"},\n{\"text\": \"Maintaining order at the tissue level is a highly dynamic task; failures lead to cancer and disorganization (such as that of the rosettes of the tongue surface when input via the lingual nerve is suppressed). However, the most consistent and pervasive result of the failure of the body's constant regenerative efforts is aging. Aging in humans is the progressive loss of function of biological processes with a decline of the capacity to maintain anatomical homeostasis and to reproduce, resulting in progressive organ malfunctions, diseases and ultimately death. The traditional conceptual biogerontological framework enunciates that aging is a process of damage accumulation caused by energy metabolism and mitochondrial function, and that cell proliferation and lifespan are limited by replicative senescence caused by telomere shortening. Here, we propose aging as a morphostasis defect; specifically, we hypothesize that it is an ongoing developmental process with probable inputs from the ubiquitous bioelectrical control system that could link the seven pillars of aging. Next, we discuss some of the potential links between aging, aging-related diseases and bioelectricity, and the opportunities these create for biomedical research.\", \"section\": \"Aging as a morphostasis defect\", \"topic\": \"Aging and morphostasis\", \"chunk_summary\": \"Aging is proposed as a morphostasis defect, a failure to maintain anatomical homeostasis, potentially linked to the bioelectrical control system and the seven pillars of aging.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"7\"},\n{\"text\": \"The links between aging, aging-related diseases and bioelectricity via ion channels are starting to be discovered. Rates of cellular or organismal aging have been shown to be regulated by ion channels. In a few cases, specific types of ion channels and downstream transducers have been associated with aging. The seven pillars of aging can be linked directly or indirectly to bioelectricity. Indeed, ion channels have been associated with metabolism and inflammation during aging. Stem cells and regeneration are controlled by developmental bioelectricity. Epigenetic alterations have been linked to changes in the bioelectrical pattern during tadpole regeneration. Proteostasis is regulated by lysosomal function that is regulated by ion channels. Several stress-regulated ion channels exist and macromolecular damage affects ion channels and can impair the bioelectrical pattern responsible for the maintenance of the anatomy. More specifically, ion channels and transporters influence aging and longevity via the regulation of membrane excitability, Ca2+ homeostasis, mitochondrial and endolysosomal function, and the transduction of sensory stimuli. Ion channels are also implicated in aging-related diseases impacting the heart, brain, cancer and the eye and in aging-related inflammation via mitochondrial functions. Channelopathies are also often associated with organ failure during aging.\", \"section\": \"Aging as a morphostasis defect\", \"topic\": \"Ion channels and aging\", \"chunk_summary\": \"Ion channels play a role in regulating aging and are linked to the seven pillars of aging, influencing various cellular processes and implicated in age-related diseases.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"7\"},\n{\"text\": \"Aging-dependent deterioration of neuronal activity has been linked to changes in Ca2+ homeostasis. In age-related cardiovascular diseases, Toro et al. observed NO release associated with a reduction in the density of the BKCa alpha subunit in coronary smooth muscle, indicating decreased expression during aging. Sinoatrial node (SAN) dysfunction can also be related to changes in the activity of several ion channels that control appropriate directionalities of ionic fluxes in the SAN and cardiac muscle. In addition, studies showed a link between Hutchinson-Gilford progeria syndrome (HGPS) and bioelectricity. An alteration of post-translational modification of progerin that contributes to the phenotype of premature aging in HGPS patients could be caused by an abnormal cytosolic Ca2+ concentration owing to upregulation of the transient receptor potential vanilloid type 2 (TRPV2) calcium channel.\", \"section\": \"Aging as a morphostasis defect\", \"topic\": \"Age-related diseases and bioelectricity\", \"chunk_summary\": \"Age-related decline in neuronal activity, cardiovascular diseases, and progeria syndrome are linked to changes in ion channel activity and calcium homeostasis.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"7\"},\n{\"text\": \"Rejuvenation strategies including blood factors, metabolic manipulations, senolytics and cellular reprogramming have been developed recently to delay and potentially reverse the aging process. Several of these approaches appear to have an impact on bioelectricity and regulate the behavior of ion channels. Metformin acts on nutrient-sensing pathways involved in the rejuvenation effects of dietary regimens and has several effects on bioelectricity. It restores electrophysiology of small conductance calcium-activated potassium channels in the atrium of GK diabetic rats and normalizes the aberrant intracellular Ca2+ clearing induced by high glucose in adult rat myocytes. Blood factors can have a pro-rejuvenation effect as shown by the positive impact of young blood on the liver, muscle and brain. Wnt signaling underlying the differentiation bias of aged muscle stem cell is reversed by young blood factors. Wnt signaling influences ion channels and is aberrantly activated in several human diseases including cancer. For example, inhibition of the Wnt signaling pathway downregulates Cav1.2 in aging models characterized by an altered osteogenic differentiation. More globally, Wnt signaling can be modulated by variation in K+ and Ca2+ fluxes across cell membrane induced by changes in transmembrane potential.\", \"section\": \"Aging as a morphostasis defect\", \"topic\": \"Rejuvenation strategies and bioelectricity\", \"chunk_summary\": \"Rejuvenation strategies, such as metformin and blood factors, impact bioelectricity and regulate ion channel behavior, potentially reversing age-related changes.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"Describing prior work\", \"page_number\": \"7, 8\"},\n{\"text\": \"Besides mechanistically testing the links between ion channel disfunction and specific aging processes, it will be essential to determine what happens to the bioelectric prepatterns during aging. What about the bioelectric states that go awry toward the end of the healthspan? Do the bioelectric cues get weaker or are the cues there but the cellular ability to perceive them (and act on them) wanes? In particular, in addition to life extension assays in canonical model systems (mice), it will be essential to understand what happens in apparently immortal species like planaria. It is tempting [to speculate]\", \"section\": \"Aging as a morphostasis defect\", \"topic\": \"Future research on bioelectricity and aging\", \"chunk_summary\": \"Further research is needed to understand how bioelectric prepatterns change during aging and whether the cues weaken or the cellular ability to perceive them declines.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"8\"},\n{\"text\": \"Rational control of bioelectrical states has immense potential for biomedical applications in regeneration, cancer and aging. Several key attributes make bioelectric states an especially attractive target for drug discovery for regeneration, cancer, aging and, indeed, for any disease that can be seen as a defect or dysregulation of morphogenesis. First, many studies demonstrate that bioelectric states constitute a 'master signal', they can control morphogenetic cascades and avoid the need to micromanage extremely complex spatiotemporal biochemical interactions via genetic engineering or classical molecular biology. Instead, accurate generation or regeneration of specific parts can be induced by the simple imposition of specific voltage patterns, as shown for planarian heads, eyes or frog tails, as described above.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Bioelectric states as master signals\", \"chunk_summary\": \"Bioelectric states act as master signals, controlling morphogenetic cascades and offering a simpler alternative to micromanaging biochemical interactions for regeneration.\", \"position_in_section\": \"Beginning\", \"certainty_level\": \"High\", \"citation_context\": \"Drawing conclusions\", \"page_number\": \"8\"},\n{\"text\": \"Second, bioelectric signaling seems to require only a brief, transient trigger stimulus. For example, in rat mesenchymal cells in vitro, a brief electrical stimulus induces long-lasting osteogenic effects, suggesting it could provide powerful synergy with bone-tissue-engineering therapies. Similarly, manipulation of bioelectrical states for just 1–3 h triggers an 8- or 10-day program of regeneration for planarian heads and tadpole tails, respectively. Third, ion-channel-targeting drugs are the third-best-selling group of prescribed drugs worldwide, providing a large pool of candidates that can be screened for repurposing as electroceuticals. In addition, only a small percentage of the 400 annotated ion-channel genes predicted in the human genome have been targeted, so there are many novel targets for drug discovery as well.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Advantages of bioelectric signaling\", \"chunk_summary\": \"Bioelectric signaling requires only brief stimuli for long-lasting effects, and the existing pool of ion-channel-targeting drugs offers ample opportunities for repurposing as electroceuticals.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"Drawing conclusions\", \"page_number\": \"9\"},\n{\"text\": \"The ideal way to control this native interface is via channel-, pump- and gap-junction-targeting compounds (although light, vibration and other exotic modalities might someday augment this technology). Repurposing of drugs that are already FDA-approved could be particularly expedient for discovery of morphoceuticals. Despite the large number of channel drugs that are already known and tested, this is only a small percentage of ion channels that have been targeted for drug development. Beyond drug repurposing, the in silico results on the opening and closing of ion channels will also suggest the design of new compounds using traditional drug design methods, to fill out the massive space of possible electroceuticals.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Drug discovery for bioelectric control\", \"chunk_summary\": \"Drug discovery for bioelectric control can leverage existing FDA-approved channel drugs and in silico modeling to design new compounds targeting ion channels, pumps, and gap junctions.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"9\"},\n{\"text\": \"This effort will require the development of tools that trawl transcriptomic databases (such as EDEn) revealing which ion channels are potential targets for intervention in a specific tissue. Computational modeling will also be key to simulating bioelectrical dynamics to predict the bioelectrical pattern resulting from opening or closing specific targeted channels with existing drugs. In silico results will predict the effects of specific drugs targeting tissue-specific ion channels, suggesting specific in vivo experiments to assess their potential for regeneration, repair or cancer normalization. For a specific purpose, the software will make suggestions regarding which channels to target, and in what way (temporal profile, and which drugs) to obtain the targeted bioelectrical pattern within a tissue. A key ingredient to this workflow however is the development of physiomic datasets across patients, ages, body regions and health or disease states. When the physiomic data catch up in volume to the deluge of transcriptional, genetic, epigenetic and metabolic datasets that are now available, the next generation of bioelectric interventions will be immediately within reach (especially given the availability of machine learning and data mining tools).\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Computational modeling and drug discovery\", \"chunk_summary\": \"Computational modeling, combined with transcriptomic data and physiomic datasets, will be crucial for predicting drug effects on bioelectric patterns and guiding in vivo experiments for regenerative medicine and cancer normalization.\", \"position_in_section\": \"Middle\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"9\"},\n{\"text\": \"One aspect of this strategy is key. The goal is not to simply find drugs that up- or down-regulate specific channels in the same way one would address over- or under-expressed transcription factors. It is, for example, already known that ion-channel drugs are very promising cancer drugs. However, the real promise of this technology will only be realized when they are seen not as rewiring agents mechanically targeting specific gene products or even pathways but as signals (like a keypad depression on a computer interface) designed to manipulate the bioelectrically mediated decision-making of cell networks. This requires a different class of computational models that treats the underlying tissue as a computational agent, not a simple dynamical system. This in turn suggests the urgency of development (and integration into molecular-biological and physiological models) of computational frameworks, such as causal information theory, that seek to decode the information flow between cells during health and disease or integrative network representation for drug discovery including the transcriptional representation of the electrome using EDEn for example.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Cell networks as computational agents\", \"chunk_summary\": \"The true potential of ion-channel drugs lies in their ability to manipulate the bioelectrically mediated decision-making of cell networks, requiring computational models that treat tissues as computational agents.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"9\"},\n{\"text\": \"A second aspect is the non-locality of bioelectric information. As in the brain, several disease states receive input from distant locations. For example, embryonic brain structure can be damaged and repaired by bioelectric states occurring on the other side of the animal. The same is true for tumorigenesis and the amputation status of one limb can be read out from the bioelectric signals of the contralateral (untouched) limb. This suggests the possibility of surrogate site diagnostics and treatment, and makes it imperative that bioelectric models and drug searches do not focus on the local site of a wound or defect but consider the entire organism as a potential interface for treatment. For example, in the case of tail regeneration and hyperinnervation to improve vision, the entire animal was exposed but only relevant cells responded (i.e., no need for spatially specific stimulation). In other cases, local delivery via a wearable bioreactor was used.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Non-locality of bioelectric information\", \"chunk_summary\": \"The non-local nature of bioelectric information allows for the possibility of surrogate site diagnostics and treatment, requiring consideration of the entire organism as a potential interface.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"9\"},\n{\"text\": \"More broadly, beyond electroceuticals, what binds biochemical, biomechanical, optical and bioelectrical morphoceuticals together is the commitment to exploiting high-level problem-solving capacities in cells and tissues. For example, other physiological parameters such as REDOX state or tissue biomechanics can likewise serve as master controls for complex outcomes. But whether induced by CRISPR, optogenetic stimulation, pharmacological agents or even behavioral cues, the crucial aspect is to move from managing micro-level components to the cybernetic properties of entire circuits. One implication of top-down control of modules and the allostatic capabilities of living matter is that dosage and timing might not have to be micromanaged. For example, in recent examples of triggering the regeneration of complex organs and appendages via bioelectric, hormonal and other biochemical means, the organ type, composition, shape and size were all induced without any attempts to identify an effective dose or precise timing regime. A key part of this strategy is offloading the complexity onto the organism itself (exploiting its modular, regulative control structure) to achieve complex outcomes where precise parameters and molecular details are not yet known. Morphoceuticals can be rationally designed based on top-down control mechanisms or discovered in pharmacological or genetic screens specifically focused on high-level control phenotypes.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Morphoceuticals and high-level control\", \"chunk_summary\": \"Morphoceuticals exploit the high-level problem-solving capacities of cells and tissues, shifting focus from micro-level components to cybernetic properties of entire circuits, potentially simplifying dosage and timing requirements.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"9, 10\"},\n{\"text\": \"Taken together, a picture emerges in which the regenerative medicine of the future can stand on the shoulders of two giants: computer science and cognitive/behavioral science. Computational neuroscience progress reveals how a multiscale approach to the brain (not only molecular but circuit, network and even psychology-level) is providing a full-stack understanding of the control of behavior. We suggest that the same strategy can be applied in regenerative medicine, by targeting bioelectricity as the computational glue that binds cells together to common purpose in vivo, and embracing the idea that causally effective interventions can be applied at levels higher than that of molecules. Definitive approaches to aging, cancer, traumatic injury and birth defects await, limited only by our ability to see tissues as competent information-processing agents that we now have the tools to meet at their own level.\", \"section\": \"Concluding remarks and future perspectives\", \"topic\": \"Future of regenerative medicine\", \"chunk_summary\": \"The future of regenerative medicine can leverage multiscale approaches from computer science and cognitive science, targeting bioelectricity as the computational glue for cell networks and applying interventions at higher levels than molecules.\", \"position_in_section\": \"End\", \"certainty_level\": \"High\", \"citation_context\": \"None\", \"page_number\": \"10\"}\n]\n```",
  "processed_at": "2025-08-05T10:54:44.102923",
  "enriched_at": "2025-08-11T14:49:17.800559",
  "enrichment_methods": [
    "crossref_title"
  ]
}