{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_948569_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_948569.pdf",
    "file_size": 124265,
    "authors": [
      "Oak Ridge National Lab., TN (US); National Renewable Energy Lab., Golden, CO (US); Argonne National Lab., IL (US); Brookhaven National Lab., Upton, NY (US); USDOE Federal Energy Technology Center, Pittsburgh, PA (US); Idaho National Engineering Lab., Idaho Falls, ID (US); Los Alamos National Lab., NM (US); Lawrence Berkeley Lab., CA (US); Sandia National Labs., Livermore, CA (US); Lawrence Livermore National Lab., CA (US); Pacific Northwest National Lab., Richland, WA (US)"
    ],
    "journal": "Unknown",
    "doi": "10.2172/589181",
    "year": null,
    "title": "Technology opportunities to reduce US greenhouse gas emissions. Appendix B: technology pathways characterization (working document)",
    "confidence_score": null,
    "document_type": "report",
    "publication_date": "1997",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "The invention provides methods and compositions for increasing the intracellular sodium concentration in a cell to promote regeneration.",
      "section": "Abstract",
      "topic": "Intracellular sodium and regeneration",
      "chunk_summary": "Methods and compositions are described for increasing intracellular sodium concentration to promote regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Humans have limited regenerative abilities compared to animals like newts and salamanders. Understanding the molecular mechanisms of regeneration in these species could lead to therapies for human tissue repair.  Research focuses on identifying stem cells and understanding the molecular pathways driving regeneration in animals like Xenopus laevis, which can fully regenerate appendages. The Xenopus tail is a complex, transparent organ suitable for studying regeneration.  Tail regeneration involves wound healing, regeneration bud formation from progenitor cells, and tissue outgrowth/patterning.  Each tissue is reconstituted from its own progenitor cells without metaplasia, making it a relevant model for human organ repair.  Molecular components like TGF-beta and signaling pathways like BMP, Notch, Wnt, and Fgf regulate tail regeneration, mirroring their roles in appendage development.",
      "section": "Introduction",
      "topic": "Xenopus tail regeneration as a model system",
      "chunk_summary": "Xenopus laevis, with its ability to fully regenerate its tail, serves as a valuable model for understanding tissue repair and developing human therapies, involving distinct steps and molecular pathways.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This invention focuses on bioelectrical signals in regeneration, modulating ion flows to enhance regenerative responses. It provides methods and compositions for promoting tissue regeneration by increasing intracellular sodium concentration, and for inhibiting hyper-proliferative cell growth by decreasing intracellular sodium.  One method involves contacting cell cultures with agents like sodium ionophores or insulin to increase intracellular sodium, promoting proliferation and differentiation.  The invention also covers the use of such agents for promoting tissue regeneration.  Monensin is a preferred sodium ionophore.  The methods can promote regeneration of appendages, organs, muscle, and neuronal tissue, particularly in progenitor cells like embryonic stem cells, neural progenitor cells, and mesenchymal stem cells.  The cell culture medium may have a higher sodium concentration than the cells.  The invention also includes using agents promoting sodium efflux to inhibit tumor growth and metastasis.",
      "section": "Summary",
      "topic": "Modulating intracellular sodium for regeneration and cancer therapy",
      "chunk_summary": "The invention uses agents like sodium ionophores or insulin to increase intracellular sodium, promoting tissue regeneration, and agents promoting sodium efflux to inhibit tumor growth.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "NaV1.2 is expressed in mesenchymal cells of the regeneration bud during tail regeneration in Xenopus laevis, distinguishing regeneration from wound healing, where NaV1.2 is absent.  Pharmacological inhibition of NaV1.2 with MS-222 and RNAi knockdown both inhibit tail regeneration without affecting overall development or primary tail formation.  NaV1.2 activity is required during the first 48 hours post-amputation, specifically during bud establishment and early outgrowth.  Inhibition of NaV1.2 abolishes sodium influx into the regeneration bud, visualized by CoroNa Green dye.  This sodium influx is necessary for the increased proliferation observed in the regeneration bud, as NaV1.2 inhibition reduces mitotic cells.  NaV1.2 is also required for proper axonal migration during regeneration; inhibition leads to reduced axon numbers and altered migration patterns.",
      "section": "Results",
      "topic": "Role of NaV1.2 in tail regeneration",
      "chunk_summary": "NaV1.2 activity, essential for sodium influx, is crucial for tail regeneration, specifically during the first 48 hours post-amputation, affecting proliferation and axonal migration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "NaV1.2 expression is regulated by V-ATPase activity and membrane potential, as shown by experiments using Concanamycin and palytoxin.  NaV1.2 acts upstream of genes involved in regenerative outgrowth, like Notch1 and Msx1, whose expression is reduced upon NaV1.2 inhibition.  NaV1.2 controls regeneration through modulation of intracellular Na+ levels, not membrane potential, as MS-222 treatment doesn't alter membrane voltage.  Salt-inducible kinase 1 (SIK1) is a potential effector of Na+ signaling, as its inhibition by Staurosporine also blocks regeneration.  Transient induction of Na+ current using monensin during the refractory period, when regeneration is normally suppressed, rescues regenerative ability.  This demonstrates that a brief increase in intracellular Na+ is sufficient to initiate the regenerative program, even after non-regenerative wound healing has begun.",
      "section": "Results",
      "topic": "Mechanism of NaV1.2 action and rescue of regeneration",
      "chunk_summary": "NaV1.2, regulated by V-ATPase and membrane potential, controls regeneration via intracellular Na+ levels, acting upstream of regenerative genes, and transient Na+ induction can rescue regeneration during the refractory period.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "This study reveals a novel role for intracellular sodium in controlling regeneration, specifically through the voltage-gated sodium channel NaV1.2 in Xenopus tail regeneration. While NaV1.2 endogenously mediates sodium influx, pharmacological methods like monensin can also modulate intracellular sodium and induce regeneration, even in non-regenerative states. This suggests that sodium influx is a high-level target for therapeutic modulation, capable of initiating complex morphogenetic programs without continuous external control.  The ability to rescue regeneration after non-regenerative wound healing suggests that scarring may be reversible.  This discovery has implications for developing therapies to promote regeneration in mammals, where regenerative capacity is limited, and for distinguishing true regeneration from wound healing using NaV1.2 as a marker.",
      "section": "Discussion",
      "topic": "Implications of sodium signaling for regenerative medicine",
      "chunk_summary": "The study's findings on sodium's role in regeneration, particularly the ability of transient sodium influx to induce regeneration even in non-regenerative states, have significant implications for regenerative medicine and wound healing.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Xenopus laevis larvae were used for tail regeneration assays. Tails were amputated at specific stages, and regeneration was assessed after 7 days in 0.1x MMR.  A Regeneration Index (RI) was calculated based on regeneration quality (Full, Good, Poor, None), ranging from 0 to 300.  RNA interference was performed using shRNA constructs targeting NaV1.2 or dsRED (control) cloned into a modified pcDNA3.1 vector with a GFP marker.  Sodium flux was visualized using CoroNa Green dye, and Na+ current was induced using monensin and high sodium medium.  Membrane potential was measured using DiBAC4(3).  In situ hybridization was performed using probes for NaV1.2, NaV1.5, Notch1, and Msx1.  Immunohistochemistry was performed using antibodies against NaV, acetylated α-tubulin, and phospho-H3.",
      "section": "Methods",
      "topic": "Experimental methods for studying tail regeneration",
      "chunk_summary": "Standard Xenopus laevis tail regeneration assays were used, along with RNAi, sodium flux imaging, membrane potential measurements, in situ hybridization, and immunohistochemistry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The intracellular sodium concentration can be influenced by various methods. Voltage-gated sodium channel openers can promote sodium influx.  Sodium ionophores like monensin and gramicidin A, or insulin, can increase intracellular sodium in a channel-independent manner.  The method may involve a medium with higher sodium concentration than the cells.  The cells can be progenitor cells in a non-regenerative state.  The methods can promote regeneration of tissues (muscle, neuronal), organs (kidney, pancreas), or structures (appendage, spinal cord).  NaV1.2 expression can be used as a marker to distinguish regeneration from wound healing, providing a diagnostic tool for selecting appropriate treatments.",
      "section": "Methods",
      "topic": "Methods for modulating intracellular sodium",
      "chunk_summary": "Various methods, including voltage-gated sodium channel openers, sodium ionophores, and insulin, can be used to modulate intracellular sodium concentration and promote regeneration, with NaV1.2 serving as a marker for regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The Xenopus tadpole refractory period, where regeneration is suppressed, is used to test treatments.  NaV1.2 is not expressed during this period, but a 1-hour treatment mimicking NaV-dependent sodium influx restores regeneration.  This suggests that sodium influx is a valuable therapeutic target, initiating coordinated morphogenetic programs without external micromanagement.  Restoring regeneration after the formation of a non-regenerative wound epithelium indicates that scarring may be reversible.  The invention provides methods for promoting tissue regeneration and cell proliferation/differentiation in non-regenerative states by increasing intracellular sodium concentration.",
      "section": "Methods",
      "topic": "Promoting regeneration in non-regenerative states",
      "chunk_summary": "Mimicking NaV-dependent sodium influx can restore regeneration during the Xenopus refractory period, suggesting therapeutic potential for overcoming non-regenerative states and scarring.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Inhibition of NaV1.2 abrogates regeneration-specific gene expression, such as MSX1 and Notch1, which are important for appendage regeneration in other systems.  This suggests that ion transporter signaling in regeneration may be conserved across species.  The invention provides methods for upregulating genes that promote tissue regeneration by increasing intracellular sodium concentration.",
      "section": "Methods",
      "topic": "Upregulating regeneration-promoting genes",
      "chunk_summary": "Increasing intracellular sodium concentration can upregulate genes like MSX1 and Notch1, which promote tissue regeneration, suggesting a conserved mechanism across species.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The methods and reagents described can increase intracellular sodium to promote proliferation and regeneration, useful for studying regeneration, understanding the distinction between regeneration and wound healing, and developing treatments for tissue loss.  Genetic knockdown or pharmacological inhibition of NaV1.2 abrogates regeneration without affecting overall development or primary tail formation.  NaV1.2 expression serves as a marker for true regeneration, providing a diagnostic tool.  The invention provides a method for determining regenerative state by detecting NaV1.2 expression.",
      "section": "Methods",
      "topic": "NaV1.2 as a regeneration marker",
      "chunk_summary": "NaV1.2 expression can be used as a marker to distinguish true regeneration from wound healing, offering a diagnostic tool for assessing regenerative potential and selecting appropriate treatments.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Compounds that modulate intracellular sodium concentration can treat injuries and degenerative diseases by promoting regeneration.  These compounds can be used alone or in combination with conventional treatments.  They can be applied to regenerate various tissues and organs, including the nervous system (traumatic injuries, neurodegenerative diseases), mesodermal/endodermal tissues (myocardial infarction, arthritis, diabetes, cancer), and blood vessels (angiogenesis).  Treatment regimens can combine these compounds with other therapies like physical therapy, medication, or surgery.",
      "section": "Methods",
      "topic": "Therapeutic applications of sodium modulation",
      "chunk_summary": "Compounds modulating intracellular sodium can be used alone or in combination with other therapies to treat various injuries and degenerative diseases by promoting regeneration in different tissues and organs.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The methods can be applied in vitro, in vivo, or ex vivo to cells, tissues, or organs from various organisms (flatworms, amphibians, fish, birds, mammals).  Cells can be primary cultures or cell lines, wild-type or mutant.  Model organisms like planaria, zebrafish, and Xenopus are suitable for studying regeneration.  The choice of model depends on the application and available resources.  Stem cells, including embryonic, adult, and tumor stem cells, can also be used.  Phenotypic changes can be monitored by visual inspection or using molecular/cellular/biophysical methods.",
      "section": "Methods",
      "topic": "Cells and animal models for regeneration studies",
      "chunk_summary": "Various cell and animal models, including planaria, zebrafish, Xenopus, and mammalian systems, can be used for in vitro, in vivo, or ex vivo studies of regeneration, with phenotypic changes monitored by various methods.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The described methods and reagents can inhibit hyper-proliferative cell growth and migration, applicable to various cancers (solid tumors, blood cancers, diffuse tumors).  They can be used alone or in combination with other cancer treatments (chemotherapy, immunotherapy, radiation, surgery).  In vitro studies using cell lines or patient tissue samples can evaluate the effects of decreasing intracellular sodium.  In vivo models, such as xenografts or specific cancer models, can assess treatment efficacy on tumor growth and migration.  Studies across different cancer types can inform treatment selection.",
      "section": "Methods",
      "topic": "Cancer models and treatment strategies",
      "chunk_summary": "The methods and reagents can be used in various in vitro and in vivo cancer models to evaluate the efficacy of decreasing intracellular sodium in inhibiting tumor growth and migration, informing treatment selection for different cancer types.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Compounds can be administered to cells, tissues, or organs in vitro, in vivo, or ex vivo using various methods.  Compounds that readily cross membranes can be added to culture media, food, or drinking water, or administered by injection.  Other compounds, like RNAi constructs, can be delivered via viral vectors or plasmids.  Compounds can be administered alone or as pharmaceutical formulations with pharmaceutically acceptable carriers.  Formulations can be adapted for various administration routes (oral, parenteral, topical, intravaginal, intrarectal, ophthalmic, spinal cord infusion, local injection/perfusion, or via a sleeve for severed digits/limbs).",
      "section": "Methods",
      "topic": "Compound administration and formulation",
      "chunk_summary": "Compounds can be administered via various routes and formulations, including direct addition to media, injection, viral vectors, and pharmaceutical preparations adapted for different administration routes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "NaV1.2 protein expression is upregulated in the regeneration bud of Xenopus laevis tails by 18 hours post-amputation (hpa), persisting until 2 days post-amputation (dpa), and is localized to mesenchymal cells.  NaV1.2 is not expressed in flank wounds, unlike V-ATPase, which is upregulated in both wounds and regeneration buds.  This makes NaV1.2 a specific marker for regeneration.  RNAi knockdown of NaV1.2 inhibits tail regeneration, confirming its requirement.  Pharmacological inhibition with MS-222 also inhibits regeneration in a dose-dependent manner, without affecting overall development or primary tail formation.  NaV1.2 function is specifically required during the first 48 hpa, primarily during bud establishment and early outgrowth.",
      "section": "Experimental",
      "topic": "NaV1.2 expression and functional requirement in regeneration",
      "chunk_summary": "NaV1.2 is specifically expressed in regenerating tail buds, and both RNAi and pharmacological inhibition demonstrate its essential role in tail regeneration during the first 48 hours post-amputation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Inhibition of NaV1.2 with MS-222 abolishes sodium influx into the regeneration bud, as shown by CoroNa Green dye.  This sodium influx is necessary for increased proliferation in the bud, as NaV1.2 inhibition reduces mitotic cells marked by phospho-Histone 3B (H3P).  NaV1.2 is also required for proper axonal migration; inhibition alters axon growth patterns and reduces axon numbers.  NaV1.2 expression is regulated by V-ATPase activity; inhibition of V-ATPase with Concanamycin abolishes NaV1.2 expression.  NaV1.2 is not expressed in non-regenerative refractory stage tails.  Depolarization of regeneration bud cells with palytoxin also abolishes NaV1.2 expression, suggesting regulation by membrane potential.",
      "section": "Experimental",
      "topic": "NaV1.2 regulation and downstream effects",
      "chunk_summary": "NaV1.2 regulates sodium influx, proliferation, and axonal migration, and its expression is controlled by V-ATPase activity and membrane potential.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Inhibition of NaV1.2 reduces the expression of Notch1, Msx1, BMP2, BMP4, and Delta, genes involved in regenerative outgrowth and patterning.  MS-222 treatment does not alter membrane voltage in regeneration buds, suggesting that NaV1.2 controls regeneration through intracellular Na+ levels, not membrane potential.  Inhibition of salt-inducible kinase 1 (SIK1) with Staurosporine inhibits regeneration, suggesting SIK1 as a potential effector of Na+ signaling.  Transient induction of Na+ current with monensin during the refractory period rescues regeneration, demonstrating that a brief increase in intracellular Na+ is sufficient to initiate regeneration, even after non-regenerative wound healing has occurred.",
      "section": "Experimental",
      "topic": "Na+ signaling and rescue of regeneration",
      "chunk_summary": "NaV1.2 controls regeneration via intracellular Na+ levels, acting upstream of regenerative genes, and transient Na+ induction can rescue regeneration during the refractory period.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_948569.pdf",
      "original_filename": "pdf_20250803_124125_948569_extracted_text.txt",
      "authors": "[\"US 20120232000A1\", \"(19) United States\", \"(43) Pub. Date: Sep. 13\", \"2012\", \"Related U.S. Application Data\", \"PROMOTING REGENERATION BY\", \"(60) Provisional application No. 61/273\", \"193\", \"filed on Jul.\", \"INCREASING INTRACELLULAR SODIUM\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:38:34.590949",
  "enriched_at": "2025-08-11T14:27:19.030080",
  "enrichment_methods": [
    "crossref_title"
  ]
}