{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_900733_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_900733.pdf",
    "file_size": 32366,
    "authors": [
      "Micah Z. Brodsky",
      "Michael Levin"
    ],
    "journal": "The 2018 Conference on Artificial Life",
    "doi": "10.1162/isal_a_00066",
    "year": "2015",
    "title": "From Physics to Pattern: Uncovering Pattern Formation in Tissue Electrophysiology",
    "confidence_score": null,
    "document_type": "proceedings-article",
    "publication_date": "2018",
    "page_range": "351-358",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Increasing evidence suggests that complex physical phenomena, such as mechanical forces and bioelectricity, play a role in driving patterning during development and regeneration. We developed a genetic algorithm-based approach to search biophysical simulations for pattern-forming processes and demonstrate that Turing-like patterns can arise purely bioelectrically, without requiring variations in gene expression. We also identify several bioelectric components that can reinforce and enhance such patterns manifested in cell transmembrane voltages.",
      "section": "Abstract",
      "topic": "Bioelectric pattern formation",
      "chunk_summary": "Bioelectric mechanisms, independent of gene expression, can generate Turing-like patterns in cell transmembrane voltages.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "While gene-centric developmental biology has made significant strides in understanding the chemical basis of morphogenesis, progress in understanding the physical basis has been slower.  Beyond chemical signaling and cell interactions, complex physics, including electrophysiology and mechanical forces, are increasingly recognized as crucial factors in development.  Evolution has harnessed these physical phenomena to coordinate cell activity for the creation and repair of complex anatomy.",
      "section": "Introduction",
      "topic": "Physical basis of morphogenesis",
      "chunk_summary": "Physical phenomena, including electrophysiology and mechanical forces, are essential drivers of development, complementing chemical signaling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "Developmental bioelectricity, involving communication and control of cell behavior through ion fluxes and voltage gradients, is a key player in regulating tissue structure and function.  Spatio-temporal patterns of membrane resting potential influence morphogenesis and are implicated in patterning disorders like birth defects and cancer. Understanding the origin and manipulation of these bioelectric patterns is crucial for therapeutic applications.",
      "section": "Introduction",
      "topic": "Developmental bioelectricity",
      "chunk_summary": "Bioelectric signaling, particularly spatio-temporal patterns of membrane potential, regulates tissue structure and function and is involved in various disorders.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "Modeling the complex interplay between bioelectric and biochemical signaling is challenging due to the numerous potential interactions between various components like ion channels, pumps, gap junctions, and chemical modulators.  To understand the capabilities of these components without relying on gene regulation or chemical morphogens, we need tools beyond analytical models, which can become unwieldy, and complex simulations, which have a vast parameter space.",
      "section": "Introduction",
      "topic": "Modeling bioelectric signaling",
      "chunk_summary": "Modeling the complex interplay of bioelectric components requires advanced tools beyond traditional analytical models and complex simulations.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "This work presents a new approach to investigate bioelectric patterning capabilities by combining a rich simulator (BETSE) with a genetic algorithm (GABEE). This approach allows us to screen bioelectric components for pattern-forming abilities and has led to the discovery of purely bioelectric Turing-like patterns.  This work aims to address the inverse problem of mapping desired phenotypes to specific circuit components and parameters, a crucial challenge in biomedicine and synthetic bioengineering.",
      "section": "Introduction",
      "topic": "Genetic algorithm approach",
      "chunk_summary": "A genetic algorithm combined with bioelectric simulation enables the discovery of pattern-forming components and addresses the inverse problem of phenotype-to-circuit mapping.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "All cells maintain a membrane voltage (Vmem) due to ion pumps and channels.  While excitable cells like neurons and muscle cells exhibit rapid voltage changes, all cells utilize bioelectric mechanisms, which predate multicellularity. Resting potential influences processes like calcium influx, MAPK signaling, and transport of charged substances. Gap junctions, regulated by voltage, chemical ligands, and other signals, connect cells and allow them to influence each other's resting potentials.",
      "section": "Background",
      "topic": "Cellular bioelectricity",
      "chunk_summary": "All cells utilize bioelectric mechanisms, with resting potential influencing various cellular processes, and gap junctions mediating intercellular communication.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "To understand the origin of membrane voltage pre-patterns in morphogenesis, we investigate whether they are solely downstream effects of chemical patterning or if bioelectricity can create these patterns independently. The BETSE simulator, modeling tissue bioelectricity, incorporates details like ion species, nonlinear transport, and voltage-gated modulation of gap junctions.  Hand-crafted BETSE configurations have demonstrated spontaneous axis induction and regeneration of severed gradients, suggesting the potential for bioelectric patterning.",
      "section": "Investigative approach",
      "topic": "Bioelectric patterning mechanisms",
      "chunk_summary": "The BETSE simulator is used to investigate whether bioelectric mechanisms can independently generate pre-patterns of membrane voltage crucial for morphogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "To explore the capabilities of bioelectric patterning, we developed GABEE, a genetic algorithm that searches for BETSE configurations yielding interesting patterns. Defining \"interesting\" is a key challenge.  Amplitude selection alone can lead to artifacts.  Instead, we use fitness functions incorporating amplitude selection, penalties for pathological behavior, and preferences for specific spatial or spatiotemporal structures like spots, stripes, or bistable memory.",
      "section": "Investigative approach",
      "topic": "Genetic algorithm for bioelectric exploration",
      "chunk_summary": "GABEE, a genetic algorithm, searches for bioelectric patterns using fitness functions that consider amplitude, stability, and specific spatial structures.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "The fitness functions penalize unstable simulations and voltages outside physiological ranges.  For spot and stripe assays, we select for patterns within a specific wavelength range, avoiding single-cell features or cluster-wide effects.  Total variation applied to a moving average filter selects for mid-range wavelengths.  Skewness distinguishes spots (skewed distribution) from stripes (symmetric distribution).  The spot assay is less stringent than the stripe assay, which requires mechanisms for lateral inhibition.",
      "section": "Investigative approach",
      "topic": "Fitness function design",
      "chunk_summary": "Fitness functions are designed to select for stable, physiologically realistic patterns with specific wavelengths, differentiating between spots and stripes using skewness.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "The simulation template includes passive Na+ and K+ leaks, voltage-gated channels (Nav1.6, Kv family), ligand-gated channels (HCN2, CNG), and adjustable parameters for chemical kinetics and gap junctions.  Simulations use a 200µm hexagonal cell lattice with noise injection.  Chemical timescales are accelerated, and simulations run for 2 seconds (equivalent to several hours of real time). The GA uses 3-tournament selection, asexual reproduction with high mutation rates, and long evolutionary trajectories (400 generations). \"Knockout\" templates disable specific components to assess their necessity for patterning.",
      "section": "Methodology details",
      "topic": "Simulation parameters and genetic algorithm settings",
      "chunk_summary": "The simulation includes various ion channels and adjustable parameters, uses a hexagonal cell lattice, accelerated chemical timescales, and a genetic algorithm with knockouts to assess component necessity.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "The genetic algorithm successfully evolves bioelectric patterns, demonstrating the ability of bioelectricity to form intricate, spontaneous patterns without gene regulatory networks.  Figure 1 shows examples of spot patterns, while Figure 2 shows patterns from all three assays (spots, stripes, and memory) under different templates.  The memory assay demonstrates the system's ability to retain externally imposed patterns.  The patterns exhibit sharp regionalization based on membrane voltage and ligand concentration, independent of transcriptional state.",
      "section": "Example runs",
      "topic": "Evolved bioelectric patterns",
      "chunk_summary": "The genetic algorithm successfully evolves various bioelectric patterns, including spots, stripes, and memory, demonstrating the capacity for spontaneous pattern formation and memory without gene regulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "The fitness trajectories show reasonable convergence, although some simulations experience numerical instability, particularly those involving NaV channels.  High failure rates, erratic fitness, and unusual voltages can indicate numerical artifacts, requiring cross-checking with altered time steps.  Figure 2 demonstrates the impact of knockout templates, showing that some knockouts eliminate patterning entirely, while others weaken it, resulting in altered patterns with lower fitness.  This suggests that different bioelectric components play distinct roles in pattern formation.",
      "section": "Example runs",
      "topic": "Fitness trajectories and knockout effects",
      "chunk_summary": "Fitness trajectories show convergence, but numerical instability can occur. Knockout experiments reveal the varying importance of different bioelectric components for pattern formation, with some being essential and others modulating pattern quality.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "Across approximately 150 GA runs, the results show a broad spread of fitness scores, with significant differences among knockouts. NaP channels are central to high-quality memory solutions and appear necessary and sufficient for this type of memory. CNG channels are critical for spots and stripes, with high-scoring results employing high CNG concentrations. The mechanism appears to be \"autoelectrophoresis,\" where a ligand gates a channel, making the potential more attractive to the ligand, leading to local accumulation and depletion elsewhere – a form of local activation, lateral inhibition.",
      "section": "Results",
      "topic": "Role of NaP and CNG channels",
      "chunk_summary": "NaP channels are crucial for memory, while CNG channels are essential for spots and stripes, likely through an \"autoelectrophoresis\" mechanism involving local activation and lateral inhibition.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "While HCN2, also gated by cAMP, is important in development, it doesn't appear to contribute to the patterns observed here and is often down-selected.  Other components, like NaP, KIR, Kv, and VGGJs, subtly influence spot and stripe patterns.  Simultaneous removal of these components significantly reduces fitness, producing weaker patterns.  These voltage-sensitive components enhance regionalization through different mechanisms, such as negative resistance (NaP and VGGJs) and potentially by providing high impedance for CNG channels (K+ channels).",
      "section": "Results",
      "topic": "Role of other bioelectric components",
      "chunk_summary": "While HCN2 doesn't appear to contribute to the observed patterns, other voltage-sensitive components like NaP, KIR, Kv, and VGGJs subtly enhance regionalization through mechanisms like negative resistance and impedance modulation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    },
    {
      "text": "This study demonstrates the use of a genetic algorithm to screen bioelectric simulations for pattern formation, providing a proof-of-principle for the inverse problem of mapping desired outcomes to bioelectric mechanisms. We discovered various patterns, including Turing-like bioelectric patterns, and identified CNG and NaP channels as key drivers.  We also showed that various voltage-gated components can enhance patterning, leading to stronger regionalization.  This approach offers a powerful tool for investigating and manipulating bioelectric systems for regenerative medicine and synthetic bioengineering.",
      "section": "Conclusion",
      "topic": "Summary of findings and future directions",
      "chunk_summary": "The study successfully used a genetic algorithm to identify key bioelectric components and mechanisms for pattern formation, offering a powerful tool for future research in regenerative medicine and synthetic bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_900733.pdf",
      "original_filename": "pdf_20250803_124126_900733_extracted_text.txt",
      "authors": "[\"Micah Z. Brodsky\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "http://direct.mit.edu/isal/proceedings-pdf/alife2018/30/351/1904880/isal_a_00066.pdf",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:16:27.498298",
  "enriched_at": "2025-08-11T14:33:55.761385",
  "enrichment_methods": [
    "crossref_title"
  ]
}