{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124126_038235_extracted_text.txt",
    "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124126_038235.pdf",
    "file_size": 36568,
    "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
    "journal": "Communicative & Integrative Biology",
    "doi": "10.1080/19420889.2015.1073424",
    "year": "2015",
    "title": "The stability of memories during brain remodeling: A perspective",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "One of the most important features of the nervous system is memory: the ability to represent and store experiences, in a manner that alters behavior and cognition at future times when the original stimulus is no longer present. However, the brain is not always an anatomically stable structure: many animal species regenerate all or part of the brain after severe injury, or remodel their CNS toward a new configuration as part of their life cycle. This raises a fascinating question: what are the dynamics of memories during brain regeneration? Can stable memories remain intact when cellular turnover and spatial rearrangement modify the biological hardware within which experiences are stored? What can we learn from model species that exhibit both regeneration and memory, with respect to robustness and stability requirements for long-term memories encoded in living tissues? In this Perspective, we discuss relevant data in regenerating planaria, metamorphosing insects, and hibernating ground squirrels. While much remains to be done to understand this remarkable process, molecular-level insight will have important implications for cognitive science, regenerative medicine of the brain, and the development of non-traditional computational media in synthetic bioengineering.",
      "section": "Abstract",
      "topic": "Memory and Brain Regeneration",
      "chunk_summary": "The persistence of memories during brain regeneration and remodeling in various animal species raises fundamental questions about memory encoding and has implications for cognitive science, regenerative medicine, and bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Biological structures can exhibit considerable morphological plasticity. Many animals can regenerate their original anatomical structure after severe injury, and reconfigure toward the correct morphology after various grafting operations. For example, salamanders can regenerate their limbs, eyes, jaws, hearts, and tails after amputation, and tails grafted to the flank become slowly turned into limbs. Some remodel their bodies toward a new configuration as a normal part of their life cycle. In some species, this drastic remodeling also involves the nervous system, regenerating or massively rewiring the brain. For example, planaria regenerate complete new heads after amputation, and salamanders also regenerate their brain after region-specific ablation. Insects tear down their existing CNS and produce one with a different architecture, in the journey from a caterpillar to a butterfly.",
      "section": "Introduction",
      "topic": "Morphological Plasticity and Regeneration",
      "chunk_summary": "Many animals exhibit remarkable morphological plasticity, including the ability to regenerate lost body parts and remodel their nervous systems, raising questions about the fate of memories during these processes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "However, a central feature of the nervous system is the ability to represent and store memories, allowing animals to adaptively alter behavior and cognition in light of past experience. The presence of memory and recall is revealed when experience alters behavior and cognition at future times when the original stimulus is no longer present. The brain, as the accepted seat of episodic memory, is often thought to be a stable, unchanging structure, which may seem to be a necessary property to ensure long-term stability of encoded information. Thus, animal model species that exhibit both brain regeneration and learning confront us with a fascinating set of questions. Could stable memories persist when cellular turnover and spatial rearrangement modify the hardware within which experiences are stored? What are the dynamics of memories when old cells apoptose, and new cells arise from progenitors? What are the mechanistic robustness and stability requirements for encoding of long-term memories in morphologically-dynamic living tissues? Answering these questions (at both the molecular and computational level) would have numerous profound implications.",
      "section": "Introduction",
      "topic": "Memory Persistence During Regeneration",
      "chunk_summary": "The ability of memories to persist during brain regeneration challenges the traditional view of the brain as a static structure and raises questions about the mechanisms of memory encoding and storage in dynamic tissues.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "First, these issues directly target the fundamental question of the engram: how is information encoded in living tissue and what is the relationship between memory and the spatial location of specific physical modifications in the brain? If specific memories remain stable as cells are replaced and moved, we can learn much about the physico-chemical representations of mental content. Importantly, this is still a major area of debate. Many in the field believe memories to be stored as changes in synaptic connectivity. Nevertheless, new data suggest that other cell properties (such as transcriptional or epigenetic alterations) may be a crucial significant component.",
      "section": "Introduction",
      "topic": "Engram and Memory Encoding",
      "chunk_summary": "The persistence of memories during brain regeneration raises questions about the nature of the engram and the role of synaptic plasticity versus other cellular mechanisms in memory storage.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Second, the future of regenerative therapies for brain injury and degeneration depends on our ability to modify brain structure without radically distorting the decades of memory content and personality of the patient. Given recent data implicating non-neuronal cell types in intelligence, a wide range of potential regenerative therapies may be expected to have effects on the rich memory set of adult human brains. It becomes imperative to understand how recall of established memories fares when novel cell types are introduced into the brain, altering network connectivity and perhaps replacing endogenous cell groups.",
      "section": "Introduction",
      "topic": "Regenerative Therapies and Memory",
      "chunk_summary": "Understanding how memories are affected by brain regeneration is crucial for developing regenerative therapies that preserve memory and personality.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Third, could we exploit such mechanisms of memory in our efforts to bioengineer artificial hybrid biobots, which would have not only desired structural and physiological properties, but also useful behaviors that are robust to cellular turnover? A related issue is that the discovery of such systems would significantly inform efforts to explore non-traditional computational architectures in information science and computer engineering, distinct from the current models of information inextricably dependent on a specific physical location within the digital memory.",
      "section": "Introduction",
      "topic": "Bioengineering and Computational Architectures",
      "chunk_summary": "Understanding memory mechanisms in regenerating organisms could inform the development of bioengineered systems with robust behaviors and non-traditional computational architectures.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Tantalizing findings have already shown that memories can indeed survive extensive remodeling of the brain, indicating transformative opportunities for both fundamental issues in cognitive science and biomedical engineering. In this Perspective, we discuss relevant data in regenerating planaria, metamorphosing insects, and hibernating ground squirrels (Fig. 1). While much remains to be done, this fascinating intersection of regenerative cell biology and cognitive neuroscience represents a fertile ground for future work of not only deep basic interest but numerous practical applications.",
      "section": "Introduction",
      "topic": "Memory Survival and Future Research",
      "chunk_summary": "The ability of memories to survive brain remodeling presents exciting opportunities for research in cognitive science and biomedical engineering, with potential applications in regenerative medicine and computational design.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Holometabolous insects (those which undergo complete metamorphosis) pose an interesting system in which to investigate memory storage and retrieval, as the CNS of these animals undergoes dramatic neurogenesis, pruning, and cell death during the transition from larvae to adulthood. Can memory survive pupation? What benefit would such a robust memory storage system provide the animal? These questions were first formalized nearly one hundred years ago by Andrew Delmar Hopkins, the father of forest entomology, who noted a polyphagous species of pine beetle preferentially infested one host even when multiple hosts were available. Hopkins postulated that female scolytid beetles chose to lay their eggs on the pine species they themselves consumed as larvae, a phenomenon which was later to become known as 'Hopkins' host-selection principle.\"",
      "section": "Memories survive CNS rearrangements and remodeling in insects",
      "topic": "Insect Metamorphosis and Memory",
      "chunk_summary": "Insects that undergo complete metamorphosis provide a model for studying memory persistence during CNS remodeling, raising questions about the survival of memories through pupation and its adaptive significance.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "This hypothesis, as well as that of cross-metamorphic memory in general, has generated large amounts of controversy with numerous reports claiming both support and opposition of the principle. In support, a variety of studies using lepidoptera have demonstrated a contribution of larval experience on adult behavior, with adult oviposition preference being shaped by pre-imaginal (i.e. larval) events. It is possible that adults retain some memory of their larval lives in these studies; however, critics have pointed to an alternate mechanism which could explain the results termed the 'chemical legacy hypothesis'. The chemical legacy model proposes that odor contamination on the pupal case or within the hemolymph could sensitize adults to these odors while emerging, affecting the behavior of the mature insect independent of larval experience. Indeed, numerous studies have directly tested and proven that a chemical legacy can have direct effects on adult behavior. *Drosophila* pupae intentionally contaminated with methanol change their response to methanol as adults, even in the absence of larval training. Similarly, parasitic wasps show an oviposition preference for the aphid host in which they themselves develop. This behavior was found to be the result of exposure to host cues during eclosion and not from a neutrally-derived larval memory as pupae removed from aphids during pupation fail to show any host preference after emerging as wasps.",
      "section": "Memories survive CNS rearrangements and remodeling in insects",
      "topic": "Chemical Legacy Hypothesis",
      "chunk_summary": "While some studies suggest that memories can survive metamorphosis in insects, the \"chemical legacy hypothesis\" proposes that adult behavior may be influenced by chemical cues rather than true memory retrieval.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "However, a number of carefully controlled studies demonstrate memory across metamorphosis while controlling for any chemical contamination. Both weevil and wasp species retain preferences for their larval environments, and contrary to other chemical legacy reports, do not show changes in adult behavior if their pupal cases are intentionally contaminated with odors. Perhaps most convincingly, aversive associative memory also appears to survive from larvae to adult; in studies pairing electric shock and ethyl acetate, both *drosophila* and *manduca* larvae learn to avoid the odor in choice assays and maintain this behavior after emerging as adults. Presentation of odor or shock alone during larval stages had no effect on adults of either species, ruling out any possibility of chemical sensitization/habituation.",
      "section": "Memories survive CNS rearrangements and remodeling in insects",
      "topic": "Evidence for Memory Persistence",
      "chunk_summary": "Controlled studies provide evidence for the persistence of memories across metamorphosis in insects, even when controlling for chemical contamination.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "How might this memory be stored during the transition for larvae to adult? Olfactory memory is known to reside in the mushroom bodies, paired lobes of the larval and adult insect brain which receive input from the antennal lobes. However, during pupation this structure undergoes extensive remodeling, with the γ neurons completely pruning to the main process and the α'/β' neurons demonstrating partial pruning before establishing adult specific projections. While it is possible a true synaptic memory may persist within a subset of mushroom body neurons, only indirect evidence exists to support this hypothesis and more research is necessary to conclusively confirm or reject the idea. Perhaps the best support to date comes from research using the *Tenebrio* genus of grain beetle, in which larvae trained to navigate mazes show more rapid learning rates as adults compared to untrained siblings. Analysis of total RNA concentration in the brain revealed an enrichment of RNA in the mushroom bodies in the larva which persisted into adulthood. However, this evidence is still indirect and alternative theories for the survival of memory through metamorphosis are myriad. Non-neural memory, chemoreceptor tuning, and gene silencing have all been suggested but never formally tested. For the few theories that have been tested, little follow-up work exists. The question of trans-metamorphic memory, postulated nearly a century ago, remains unsolved yet ripe for study given the development of molecular tools for model species such as *Tribolium*.",
      "section": "Memories survive CNS rearrangements and remodeling in insects",
      "topic": "Mechanisms of Memory Storage",
      "chunk_summary": "The mechanisms by which memories are stored during insect metamorphosis are still unclear, although the mushroom bodies and RNA are potential candidates for further investigation.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Planaria are bilaterian flatworms, possessing complex internal organs, behavioral repertoires, and remarkable powers of regeneration. They are a powerful and increasingly popular model for regenerative biology studies, both in terms of understanding stem cell decision-making and physiological controls of large-scale pattern formation. Special emphasis has been placed on understanding the mechanisms guiding CNS regeneration in this model system.  Neurons in the planarian brain more closely resemble those of vertebrates than those of advanced invertebrates, exhibiting typical vertebrate features of multipolar shape, dendritic spines with synaptic boutons, a single axon, expression of vertebrate-like neural proteins, and relatively slow spontaneously generated electrical activity. Therefore, the planarian is not only the first animal to possess a brain, but may be the ancestor of the vertebrate brain. Some of the most interesting and controversial data on the persistence of memories in regeneration thus came from studies of this model.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Planaria as a Model for Regeneration",
      "chunk_summary": "Planaria, with their complex nervous systems and remarkable regenerative abilities, serve as a valuable model for studying memory persistence during brain regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Influenced by the ideas of D. O. Hebb and J. Eccles, who postulated synaptic plasticity as the mechanism of memory encoding, James McConnell and Robert Thompson explored the implications of the theory *in vivo*. While basal, planarians possess a well-differentiated nervous system and CNS with chemical synapses, satisfying both requirements for synaptic plasticity according to Hebb's model. Having first established planaria as a suitable animal model for the studying of associative learning and memory, McConnell decided to explore what would happen if conditioned worms were cut in 2 and then tested following regenerating? Which half, if either, would retain the memory? McConnell and his students trained worms using a classical conditioning protocol (pairing light with an electric shock) and after the worms demonstrated learning, they cut the worms in half. After fully regenerating some weeks later, the team retrained the regenerated worms using the same protocol. The results showed that the head fragment retained the pre-cut training, but also surprisingly, worms that regenerated from the tails (which lost the original brain) required significantly fewer training trials to learn (\"saving\" paradigm) compared to untrained animals.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "McConnell's Planarian Experiments",
      "chunk_summary": "McConnell's experiments with planaria demonstrated that memories could persist even in tail fragments that regenerated a new brain, suggesting a mechanism beyond simple synaptic connections.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "The astonishing results motivated McConnell to examine another theory of memory - the existence of an \"engram,\" as a physical/chemical memory trace which could perhaps be transferred into an untrained animal. McConnell and colleagues conducted a series of experiments where they showed that naïve worms that were fed on trained worms revealed evidence of memory retrieval in a \"saving\" paradigm, where the fed worms learned more quickly than naïve animals. McConnell and his colleagues fractionated the planarian extracts in an effort to identify the particular molecule that actively allows memory transfer and based on their findings hypothesized that RNA was the active agent allowing memory transfer. Further, naïve worms injected with the RNA extract from trained worms demonstrated the \"saving\" effect, while RNAse treatment abolished it. This finding was extremely surprising since at the time it was not known that RNA has multiple regulatory functions. These effects were not limited to just one species. A Russian group conditioned another species of planarians' motor responses to shock paired with vibratory stimuli. When animals were transected, retention could be observed in both halves some 14 days after sectioning. These experiments pointed to the retention of experientially induced modifications in regenerating tissues. The posterior segments of the worms regenerated heads that retained the conditioned responses. Their results supported those of Corning and John's (1961) with RNase, suggesting the possibility that RNA inheritance could be involved.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Memory Transfer Experiments",
      "chunk_summary": "McConnell's further experiments suggested the possibility of memory transfer between planaria through RNA, a finding that was highly controversial at the time.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "McConnell and his colleagues performed a number of essential controls for learning specificity. For example, they tested for pseudoconditioning and sensitization effects due to non-training variables such as the dissection and regeneration processes, and demonstrated that the head is the organ which executes the particular learned behavior which was assayed (2-headed worms learn faster and tail fragments without a brain cannot be conditioned). Later, several labs replicated the results (transfer of memory through brain extracts) in rats, mice, and fish. Cowley and Griesel (1966) found that the male grand-offspring of female rats that were prenatally malnourished performed more poorly than controls on the Hebb-Williams maze, despite the fact that their mothers had been on a standard diet from conception through weaning. That is, the effects of a low protein diet lingered across subsequent, well-fed, generations. These findings shifted the field of memory transfer from planaria to rats as the primary model species. Following a string of studies with rats and mice, the field became mired in controversy and the entire line of research was abandoned and forgotten.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Controversy and Subsequent Research",
      "chunk_summary": "Despite initial replications in other species, McConnell's work on memory transfer became controversial and was largely abandoned, although recent research is revisiting these ideas in light of new understanding of epigenetic processes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Given the technical limitations of the time, the mechanisms underlying the results were never fully identified. However, labs are beginning to reinvestigate this fascinating work using modern molecular advances in the understanding of epigenetic processes that may allow the transfer of environmentally-imprinted information transgenerationally. In addition, discoveries of RNAi regulation and accumulating evidence that links inheritance via noncoding RNAs to memory formation and behavior support the feasibility of McConnell's findings. Yet it is unclear whether those epigenetic processes have pivotal roles in the acquisition of specific memories and behaviors or whether they function as general cofactors for learning and memory. Additional materials on this fascinating controversy are found in.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Modern Reinterpretations",
      "chunk_summary": "Modern research, with its advanced understanding of epigenetic processes and RNA regulation, is beginning to revisit McConnell's controversial findings on memory transfer.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "During the last decade, planaria have re-emerged as a leading model in the field of molecular biology. The genome of a freshwater planarian (*Schmidtea mediterranea*) has been fully sequenced and molecular techniques including gene-specific RNA interference and *in situ* hybridization are fully functional with the species. Today, planaria are perhaps the only molecularly-tractable system in which memory and complete brain regeneration can be studied in the same animal. To re-examine this issue, our lab developed an automated training and testing device designed to overcome some of the limitations of older work. Prior efforts performed manually suffered from 1) the time-consuming nature of the experiments which only allowed the experimenter to spend a short time each day training any one worm (thus lowering overall N and providing weak memories), 2) the difficulty of reproducing precisely the same protocol across labs (given the worms' sensitivity to even subtle environmental differences), and 3) the challenge of using human observation of behavior to support highly surprising findings (the need to avoid any chance of subjectivity during scoring and to provide a complete behavioral dataset that can be analyzed by others).",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Automated Training and Testing",
      "chunk_summary": "Modern molecular tools and automated training devices are enabling more rigorous investigation of memory persistence during brain regeneration in planaria.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Our device provides 24/7 environmental training to each individual animal in parallel, and uses objective criteria for scoring, while recording all the movements for future analysis. Using this platform, our initial study confirmed the ability of worms to recognize a surface etch pattern in a place learning task, and the persistence of this information across head regeneration. While numerous subsequent studies must be done to improve the protocol and ask questions about the mechanism and specificity of the memory, this early result establishes the planarian as a tractable model within which we can next ask questions like: where is the information encoding learned behavior stored? How many and what kind of cells are needed in order to keep the memory? How is it imprinted on the developing new brain? How does encoding and decoding by naïve tissues work? What is the memory capacity of this system? The plethora of molecular tools, cellular-level analytic methods, and automated behavior analyses enables a rich program of investigation using the basic amputation assay to identify the location and main properties of information storage during brain regeneration. One possible locus for the cellular basis of memory are the planarian neoblasts (stem cells), which could be modified through epigenetic changes induced by learning. When the new brain develops, neoblasts could potentially imprint the CNS through self-organization mechanisms. A second possibility is that non-coding RNAs implement inheritance. Regardless of the molecular mechanisms required for this process, a complete answer to this question will also require an understanding of the mapping of cognitive content to specific molecular states (encoding and decoding of learned information within RNA, protein, cell networks, or some other mechanism). It is clear that modern techniques and recent findings show great potential for the planarian as an animal model in learning and memory research. Investigating this unique animal, which displays complex behavior and can regenerate its entire brain in only a few days, may provide answers to the enigma of acquisition, storage, and retrieval of memories.",
      "section": "Memories persist during brain regeneration in planaria",
      "topic": "Future Research Directions",
      "chunk_summary": "Future research using planaria will focus on identifying the cellular and molecular mechanisms of memory storage and retrieval during brain regeneration, including the role of neoblasts, epigenetic changes, and non-coding RNAs.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "What happens to memories in mammals whose brains incorporate progeny of (perhaps naïve) stem cells? These are crucial issues because transplants of stem cells into brains is a major medical strategy for stroke and degenerative disease. The answer to this kind of clinical scenario is unknown. Indeed, even the amount of brain tissue needed for specific cognitive functions is not well-understood, given the (rare) cases of hydrocephaly and greatly reduced brain size with normal cognition. One model system that provides an entry point into addressing the biomedical aspects of this question is what occurs during hibernation.",
      "section": "Memory and brain repair in mammals",
      "topic": "Stem Cells and Memory",
      "chunk_summary": "The impact of stem cell transplants on memory in mammals, particularly in the context of brain repair, is a crucial question with clinical implications.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "While there are various examples of neural reorganization in vertebrates, perhaps none are as remarkable as that of the European and arctic ground squirrel family. During the winter months these animals go into a state of torpor, where their metabolism and brain activity slows considerably. Direct measurements during this period reveal body temperatures hovering around 0 degrees Celsius and Na⁺ K⁺-ATPase muscle activity decreases up to 60 percent. Under these conditions, massive changes occur within the central nervous system of the animals, with extensive pruning of the dendritic trees within the brain, including areas necessary for long-term memory such as the hippocampus. Neurons of this region demonstrate multiple changes including spine morphology/number, reduced branching as well as shorter dendritic length, and changes in microtubule assembly/disassembly protein abundance. In addition to the extensive pruning during torpor, perhaps equally impressive is the fact the brain completely reverses this loss during the first few hours of arousal restoring the original branching density present prior to hibernation.",
      "section": "Memory and brain repair in mammals",
      "topic": "Hibernation and Brain Remodeling",
      "chunk_summary": "Hibernating ground squirrels undergo dramatic brain remodeling, including dendritic pruning and regrowth, providing a model for studying memory persistence during neural reorganization.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Given this reorganization it has long been questioned whether memory can survive the severe changes in both temperature and dendritic morphology associated with torpor. Early research into this question examined whether hibernating ground squirrels could identify kin and familiar individuals following 9 months of separation. Interestingly, animals appeared to remember kin but demonstrated no recognition of previously familiar non-kin individuals, suggesting that only memories of siblings persist through hibernation (perhaps serving to avoid possible inbreeding the following season). However, further work determined this recognition was not due to true memory, but was in fact a result of self-reference, or similarity of kin to the subject animals' own odor. While these results did not provide evidence of long-term memory surviving torpor, a similar study proved more promising. Groups of ground squirrels were tested in one of 3 tasks: maze navigation, an operant feeding machine, and the ability to discriminate housemates from strangers. While recall performance was weak on both of the associative learning assays, the animals were successfully able to discriminate familiar from unfamiliar individuals. It is unclear why the animals could demonstrate memory in one assay but not others, though the authors speculate it could be the result of the complexity of the task or the brain region responsible for the memories. Perhaps most convincingly, in more recent work a number of animals were trained in 2 operant conditioning tasks, jumping between a pair of boxes or crossing through a tube, and found that performance in these tasks was unimpaired following 6 months of hibernation. This result was the clearest to date, and provided strong evidence that some memories could survive the dendritic pruning associated with torpor.",
      "section": "Memory and brain repair in mammals",
      "topic": "Memory Persistence During Hibernation",
      "chunk_summary": "Studies on hibernating ground squirrels have yielded mixed results regarding memory persistence, with some evidence suggesting that certain types of memories can survive torpor-induced brain remodeling.",
      "position_in_section": "Middle",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "What mechanism may be responsible for memory persistence? While such studies present many challenges (not the least of which is the 6–12 month time periods needed for hibernation and arousal) a number of interesting observations have been reported. Prior to torpor, adipose tissue of the ground squirrels shows a significant increase in antioxidant levels which are predicted to reduce reactive oxygen damage during the severe shift in metabolic activity associated with arousal. While these levels were measured in the liver and plasma, it is possible that the same mechanism could protect persistent neurons in the brain from reactive oxygen damage following hibernation. In addition, a number of mitotically active immature neurons have been identified within the hippocampus of ground squirrels. The purpose of these cells is not currently known, but they may act as a renewable source of new neurons during the rearrangements associated with hibernation (although it is not clear how this cell population may or may not relate to memory). Perhaps most compelling is recent work which identified changes in the phosphorylation of tau across torpor, a microtubule-associated protein known to play a role in neural plasticity. Phosphorylation of tau increased during the onset of torpor and decreased with arousal, suggesting a possible mechanism for stabilizing neural connections required for long-term memory. What makes this finding particularly provocative is the fact that tau protein shows high phosphorylation in patients suffering from Alzheimer's disease, perhaps positioning the ground squirrel as a model to examine the tau signaling pathways with the hope of identifying new targets for therapeutics.",
      "section": "Memory and brain repair in mammals",
      "topic": "Potential Mechanisms of Memory Persistence",
      "chunk_summary": "Several potential mechanisms for memory persistence during hibernation have been proposed, including increased antioxidant levels, immature neurons in the hippocampus, and changes in tau phosphorylation.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "The question of memory persistence though brain remodeling is an extreme version of a more basic puzzle: how are memories encoded so that they can be reliably decoded within the lifetime of even an unaltered brain? The current paradigm holds that memories are encoded and stored through modification of synaptic connections and the resulting patterns of activation within neuronal networks. This conception is termed \"The Synaptic Plasticity Hypothesis.\" The hypothesis was supported by discoveries of activity-dependent plasticity mechanisms such as long-term potentiation (LTP), long-term depression (LTD), and spike-timing-dependent plasticity (STDP), which are all mechanisms that clearly correlate to learning and memory behaviors. However, the synaptic plasticity hypothesis alone has difficulties in explaining the long-life persistency of memories, since the above-mentioned mechanisms are inherently unstable. In addition, the discovery of the memory reconsolidation process and the possible requirement for constant activation of protein PKMζ for memory maintenance argue against the concept of memory storage as a hard-wired neural network.",
      "section": "What mechanisms underlie memory?",
      "topic": "Synaptic Plasticity Hypothesis",
      "chunk_summary": "While synaptic plasticity is a key mechanism in memory formation, it alone cannot fully explain the long-term persistence of memories, particularly in the face of brain remodeling.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Memories can chemically unwire, and are highly dynamic and sensitive to disruption, even long after consolidation. How can memories survive for a lifetime in a dynamic neural-network? It is also hard to explain how memory transfers offline, from the acquisition organ to the storage regions in the brain (in mammals: from the hippocampus to the neocortex), long after the remembered episode occurred (see for a detailed discussion). A similar process of memory transfer in the brain has been found in octopus, indicating that this is a fundamental biological mechanism. Finally, recent work showed that memory traces exist even without the complex activation thought to be determined by the specific synaptic weight and even after erasing the synaptic connectivity related to specific memory.",
      "section": "What mechanisms underlie memory?",
      "topic": "Challenges to Synaptic Plasticity",
      "chunk_summary": "The dynamic nature of memories and the existence of memory transfer processes challenge the traditional view of memory as a static entity stored solely in synaptic connections.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "These recent findings are challenging the conservative point of view and require new ideas. It is likely that although memory is encoded through synaptic plasticity and recalled by activation of the neural network, there is a \"blueprint\" of the memories that may be kept safely in place by a mechanism other than the synaptic connections themselves. Thus, future studies of the models of survival of memory traces through brain regeneration have the potential to reveal the mechanism of long-term memory maintenance.",
      "section": "What mechanisms underlie memory?",
      "topic": "Alternative Memory Mechanisms",
      "chunk_summary": "Emerging evidence suggests that there may be a \"blueprint\" of memories stored through mechanisms beyond synaptic connections, which could explain their persistence during brain regeneration.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "It is possible that encoding in the CNS is such that it is robust to massive rearrangements of the underlying substrate. On the other hand, it is possible that additional mechanisms can support robust memory by providing a \"backup\" storage medium during brain rearrangement. For example, in planaria, it is possible that memory can be stored outside the brain and imprinted on the nascent brain during regeneration. Feedback between behavioral (brain-mediated) and other cellular memory mechanisms has been demonstrated in a number of interesting contexts. For example, injecting frog eggs with various substances (orange or citral) results in animals that prefer to feed on material containing those substances. Similarly, exposing eggs to a novel odor together with an endogenous alarm chemical results in larvae that produce escape behavior when presented to the odor alone. In both of those cases, a novel and as yet unknown mechanism must be at play since the original \"learning\" takes place in very early embryonic stages, long before a CNS exists. For example, from the Hepper and Waldman study, we must conclude that the intracellular milieu of the frog egg has mechanisms for recognizing various molecules and transmitting this information as a stable memory to the nervous system when it is subsequently formed. This kind of functional coupling between intracellular signaling mechanisms and neural network-mediated behavior suggests that much remains to be discovered about the information sources available to the brain during repair and perhaps even in normal cognition. A more detailed treatment of the parallels between information-processing mechanisms in the CNS and morphogenetic signaling is given in.",
      "section": "Memory in aneural systems",
      "topic": "Non-Neural Memory",
      "chunk_summary": "Evidence from aneural systems, such as frog eggs, suggests that memory-like phenomena can occur even in the absence of a nervous system, raising the possibility of non-neural memory mechanisms that could contribute to memory persistence during brain regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "Interestingly, neural-like computation, decision-making, and memory have been reported well beyond the traditional CNS, including sperm, amoebae, yeast, and plants. These appear to be mediated by well-conserved, ubiquitous mechanisms that appear to be also involved in neural information processing, such as cytoskeleton and electrical networks. Single somatic cells perform subtraction, addition, low- and band-pass filtering, normalization, gain control, saturation, amplification, multiplication, and thresholding. It is becoming clear that neural networks have no monopoly on such functions, and indeed fascinating examples of memory and neural-like dynamics have been found in the immune system, bone, heart, and physiological disorders such as diabetes.",
      "section": "Memory in aneural systems",
      "topic": "Cellular Computation",
      "chunk_summary": "Neural-like computation and memory-like phenomena have been observed in a variety of non-neural systems, suggesting that these functions are not exclusive to the nervous system and may involve conserved cellular mechanisms.",
      "position_in_section": "End",
      "certainty_level": "Medium",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    },
    {
      "text": "\"Why is the mind in the head? Because there, and only there, are hosts of possible connections to be performed as time and circumstance demand it\" If indeed memory and information processing rely on labile connections within a rich network of signaling activity, it becomes immediately clear (counter McCulloch) than the CNS is not the only game in town. Mechanisms that are responsible for cellular computations necessary to rearrange the body plan during remodeling, regeneration, and metamorphosis include the cytoskeleton, metabolic signaling circuits, and the gene regulatory networks. All of these exhibit (physiological) experience-dependent rewiring and rich feedback loops that can store state information. Indeed, all of the major mechanisms by which nerves function - ion channels, neurotransmitters, and electrical synapses - not only exist throughout the body but are now known to be functional drivers of many patterning events during regenerative and developmental pattern regulation. It is possible that functional linkage between the memory-keeping mechanisms in the CNS and the encoding of target morphologies during pattern regulation is at least in part mediated by the same bioelectric mechanisms. Because the molecular components of non-neural bioelectric signaling are increasingly well-characterized, it is now possible to specifically test the hypothesis that the somatic and cognitive memory systems are coupled during the above-described examples in which memories survive drastic cellular turnover and rearrangement.",
      "section": "Why the Mind is in the Brain (or is it?)",
      "topic": "Bioelectric Signaling and Memory",
      "chunk_summary": "Bioelectric signaling, a key mechanism in developmental and regenerative processes, may also play a role in linking somatic and cognitive memory systems, potentially explaining memory persistence during brain remodeling.",
      "position_in_section": "Beginning",
      "certainty_level": "Medium",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124126_038235.pdf",
      "original_filename": "pdf_20250803_124126_038235_extracted_text.txt",
      "authors": "[\"Douglas J Blackiston\", \"Tal Shomrat\", \"Michael Levin\"]",
      "year": "2015",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.1080/19420889.2015.1073424"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:42:41.297817",
  "enriched_at": "2025-08-11T14:38:00.845270",
  "enrichment_methods": [
    "crossref"
  ]
}