{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124127_022345_extracted_text.txt",
    "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124127_022345.pdf",
    "file_size": 40537,
    "authors": [
      "Cindy D. Jones",
      "D. Ray Reutzel"
    ],
    "journal": "Reading &amp; Writing Quarterly",
    "doi": "10.1080/10573569.2013.850461",
    "year": null,
    "title": "Write to Read: Investigating the Reading-Writing Relationship of Code-Level Early Literacy Skills",
    "confidence_score": null,
    "document_type": "journal-article",
    "publication_date": "2015",
    "page_range": "297-315",
    "volume": "31",
    "issue": "4",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "Our ultimate goal is top-down control of complex biological shape. The initial focus is on leveraging developmental bioelectricity to understand how cell networks compute and coordinate activity towards robust anatomical target states. This mastery is crucial for advancements in birth defects, regenerative medicine, cancer, and synthetic bioengineering.",
      "section": "Abstract",
      "topic": "Bioelectric control of morphogenesis",
      "chunk_summary": "The center aims to control biological shape by understanding bioelectric computations in cell networks, crucial for regenerative medicine and synthetic bioengineering.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Current technology operates at the level of biological \"machine code\" (proteins, genes, cells), lacking parameters for large-scale shape manipulation. This creates complexity barriers in rational morphology control. While systems biology studies form emergence from molecular mechanisms, there's a disconnect between data and control. We address this by building tools to exploit bioelectric pathways for pattern homeostasis, potentiating bottom-up approaches and enabling new capabilities in regenerative medicine.",
      "section": "Abstract",
      "topic": "Limitations of current approaches",
      "chunk_summary": "Current biological technology focuses on low-level details, hindering large-scale shape control; the center aims to bridge this gap using bioelectricity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "We focus on the morphogenetic code: how cell networks represent target morphology and compute activities to achieve it. We use standard biology tools but also computational modeling from statistical mechanics and AI. This effort uniquely takes an informational approach to morphogenesis, understanding algorithms and computations in anatomical growth and form. We will develop techniques for reading, writing, and rewriting bioelectrical software mediating between genome and morphology, establishing foundational technology and concepts for future applications in regenerative medicine, cancer biology, and bioengineering.",
      "section": "Abstract",
      "topic": "Morphogenetic code",
      "chunk_summary": "The center investigates the \"morphogenetic code\" - how cells represent and compute target morphology - using an informational approach and computational modeling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Controlling large-scale anatomy and its regulation is a central unsolved problem. It involves understanding how biological systems acquire specific 3D shapes and maintain pattern homeostasis. Beyond initial development, dynamic morphological homeostasis allows systems to repair and remodel themselves, as seen in embryo twinning, regeneration, and remodeling. This closed-loop morphogenesis involves detecting deviations from target morphology, computing restorative steps, and deciding when to stop growing.",
      "section": "Introduction",
      "topic": "Morphological homeostasis",
      "chunk_summary": "A key challenge is understanding dynamic morphological homeostasis, the ability of biological systems to repair and remodel complex shapes after unpredictable damage.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Molecular biology has identified components necessary for morphogenesis, but gaps remain in understanding the dynamics sufficient for shape homeostasis.  Predicting 3D shape from gene-regulatory networks is impossible.  For example, trophic memory in antler regeneration demonstrates large-scale pattern control not readily reducible to cell-level pathways. Rewriting this internal pattern memory, if possible, offers a more tractable approach to modifying outcomes.",
      "section": "Introduction",
      "topic": "Limitations of molecular biology",
      "chunk_summary": "While molecular biology has identified key components, it lacks the understanding of dynamics necessary for predicting and controlling shape, as exemplified by antler regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The mainstream bottom-up paradigm hopes systems biology will explain morphogenesis through mechanistic details. While successful in some aspects, this approach faces limitations in complexity.  An alternative view sees morphogenesis as an information-processing system that measures deviation from a target pattern and issues commands to cells for restoration. This center hypothesizes that merging information-level descriptions with molecular mechanisms is crucial.  A second hypothesis is that manipulating systems at the level of large-scale pattern regulatory modules will provide essential control over shape.",
      "section": "Introduction",
      "topic": "Information processing in morphogenesis",
      "chunk_summary": "The center proposes an information-processing view of morphogenesis, hypothesizing that manipulating large-scale pattern regulatory modules will provide crucial control over shape.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Regenerative medicine needs to control shape and function of organs, not just genes or proteins.  Our center aims to understand the meaning of molecular events, developing a \"compiler\" to translate anatomical instructions into gene/protein language.  Information technology's progress stemmed from integrating high-level descriptors with underlying physical details, enabling modular control.  Similarly, a systems-control description of pattern regulation is crucial for biology.",
      "section": "Introduction",
      "topic": "Systems-level control",
      "chunk_summary": "The center aims to develop a \"compiler\" to translate high-level anatomical instructions into molecular terms, enabling systems-level control of morphogenesis for regenerative medicine.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Current frameworks lack tools to quantify and manipulate what patterning systems measure, store, and compute during remodeling. This is analogous to studying behavior without considering higher-level descriptors like memory or doing physics without thermodynamics.  Linking high-level pattern control descriptors with underlying molecular pathways is needed.  We seek to understand how biophysical and genetic processes integrate into systems making decisions about organ identity, size, and placement.",
      "section": "Introduction",
      "topic": "Bridging molecular and anatomical levels",
      "chunk_summary": "The center aims to bridge the gap between molecular details and anatomical-level descriptions of pattern control, focusing on how cells make decisions about organ-level properties.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Evolutionary theory and synthetic biology face the challenge of connecting molecular detail with system control parameters. Bottom-up strategies struggle with the \"inverse problem\" of determining low-level interventions for specific emergent outcomes. Our hypothesis is that evolution utilizes modularity and feedback loops representing pattern goal states, minimizing information load and facilitating control.  Understanding how cells process information about shape is crucial for transitioning from cell-level synthetic biology to morphogenetic engineering.",
      "section": "Introduction",
      "topic": "Evolutionary perspective and synthetic biology",
      "chunk_summary": "The center hypothesizes that evolution uses modularity and feedback loops for pattern control, and aims to understand cellular information processing for advancing morphogenetic engineering.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Our top-down approach complements systems biology, learning from the modularity and information processing of complex bodies for rational design.  We aim to understand and control events at the level of large-scale control circuits. The existence and transition rules of a morphogenetic code, functioning alongside genes and molecular pathways, represent a crucial area of investigation.",
      "section": "Introduction",
      "topic": "Top-down approach and morphogenetic code",
      "chunk_summary": "The center's top-down approach aims to understand and control large-scale control circuits and the \"morphogenetic code\" operating alongside genes and molecular pathways.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Top-down approaches haven't been attempted because current molecular biology paradigms don't readily reveal how cells implement information-processing functionality for large-scale properties. However, computational neuroscience demonstrates that cell networks can implement memory, representation, and goal-directed activity.  These mechanisms, including ion channels and electrical synapses, didn't originate in the brain but evolved from primitive cell communication.  All cells, not just neurons, express these components.",
      "section": "Introduction",
      "topic": "Bioelectricity and information processing",
      "chunk_summary": "While top-down approaches are lacking in molecular biology, neuroscience demonstrates cell networks' capacity for information processing, with mechanisms like ion channels present in all cells.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric signaling is hypothesized as a modality for mediating modular computation and top-down pattern control. The Levin lab pioneered molecular approaches to monitor, model, and modify electrical potential distributions in vivo. This work revealed a bioelectric code – a distribution of electrical properties in cell networks – mediating large-scale information processing in pattern homeostasis. Bioelectricity is a layer of the morphogenetic field, interacting with chemical gradients and physical forces, offering a tractable entry point for understanding and controlling information processing for large-scale order.",
      "section": "Results",
      "topic": "Bioelectric code",
      "chunk_summary": "Research has revealed a \"bioelectric code\" of electrical properties in cell networks that mediates large-scale information processing in pattern homeostasis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Bioelectric circuits, formed by ion channels, pumps, and electrical synapses, exhibit complex dynamics and form a control layer distinct from transcriptional networks. Modulating this layer enables coherent large-scale patterning changes. Bioelectric signaling operates on multiple scales, defining properties at cell, organ, and organism levels. It provides a tractable method for overriding genome-default outcomes, such as inducing eye formation, remodeling heads, and rescuing brain patterning.",
      "section": "Results",
      "topic": "Bioelectric circuits and their properties",
      "chunk_summary": "Bioelectric circuits, distinct from transcriptional networks, control large-scale patterning, operating at multiple scales and overriding genome-default outcomes.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Altering bioelectric connectivity can permanently rewrite target morphology.  Genomically-normal worms can be changed to a two-headed form that regenerates with two heads perpetually, demonstrating stable rewiring of bioelectric circuits with permanent anatomical changes. This identifies new control points for reprogramming beyond genome editing: stable physiological circuits storing information. The \"bioelectric code\" maps real-time electric circuit dynamics to pattern-regulatory functions. Bioelectrical signaling controls large-scale morphogenetic properties, exploits native modularity, transduces into downstream chemical signals and gene transcription changes, and forms feedback loops with genetic pathways, often overriding other signals.",
      "section": "Results",
      "topic": "Rewriting bioelectric circuits",
      "chunk_summary": "Manipulating bioelectric connectivity can permanently reprogram morphology, highlighting stable physiological circuits as information storage and control points beyond genome editing.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Fundamental gaps in knowledge include how the bioelectric code is defined, interpreted, and changes during development and aging.  Key questions are: How do bioelectric prepatterns arise? What are the transition rules between bioelectric states? What's the best framework for computing interventions to rewrite pattern memories and control morphogenesis top-down? What are the limits of this control?  This center aims to answer these questions and develop mechanisms for reading and writing the bioelectric code for pattern control, combining theoretical understanding with practical manipulation.",
      "section": "Discussion",
      "topic": "Open questions and research directions",
      "chunk_summary": "The center aims to address fundamental questions about the bioelectric code, including its definition, interpretation, dynamics, and limits of control, combining theory and practical manipulation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The project's sub-goals are to read, interpret, and write the bioelectric code in vivo.  Efforts range from molecular networks and bioelectric circuits to large-scale gradients and symbolic/algorithmic descriptions of growth. The goal is to control high-level properties like organ placement and size by manipulating networks encoding these features. Each subproject contributes to a multi-scale integration of low-level components with high-level features for predictive control.  Current subprojects include understanding voltage interactions with small RNA/chromatin pathways, modeling bioelectric patterns, identifying technologies for modifying bioelectric gradients, and characterizing bioelectrically-mediated decision-making.",
      "section": "Methods",
      "topic": "Project overview and sub-goals",
      "chunk_summary": "The project aims to read, interpret, and write the bioelectric code, integrating molecular details with high-level features for predictive control of organ-level properties.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "The overarching approach is to develop tools and models for controlling large-scale pattern in vivo and understand patterning systems computationally. The project involves external faculty and internal personnel, with a fluid participant list over the 8-year timeframe.  Initial efforts will identify promising inroads, guiding future expertise inclusion. The plan involves immediate instrumentation construction, transgenic model production, and investigation of bioelectric code control by small RNAs and chromatin remodeling. This links bioelectrics with existing mechanistic work and expands understanding of physiological state transitions regulating other signaling modalities. Epigenetic information, including small RNAs and chromatin states, allows stable and dynamic control over gene expression, and bioelectric gradients can amplify cell-level memory into body-wide pattern storage.",
      "section": "Methods",
      "topic": "Research plan and methodology",
      "chunk_summary": "The project will develop tools and models for in vivo pattern control, focusing initially on instrumentation, transgenic models, and the interplay between bioelectricity, small RNAs, and chromatin remodeling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "By year 2, quantitative models of the bioelectric code will be constructed, and proof-of-principle applications will be developed to test and refine these models. Model systems include regenerative non-mammalian models and mammalian tissue culture applications, maintaining relevance to biomedical endpoints. The project's \"compass-driven\" nature necessitates exploring several directions initially, narrowing down based on promising data. The plan has two global components: answering fundamental questions and enabling new pattern control capabilities. The process involves iterative feedback between theory, instrumentation, and results. Year 1 focuses on mechanistic investigations and platform development, while year 2 begins model testing and pattern control experiments. Deliverables will be widely enabling technologies. The second goal is to generate basic knowledge that alters paradigms in the field. The second phase will continue developing knowledge and transition it into applications for regenerative medicine and engineering.",
      "section": "Methods",
      "topic": "Timeline and deliverables",
      "chunk_summary": "The project will develop quantitative models and test them in various model systems, with a focus on iterative feedback between theory, experimentation, and application development.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Our work addresses bioelectric signaling, how cell networks use resting potential gradients to regulate morphogenesis.  Modulating bioelectric gradients induces rational, coordinated changes in large-scale anatomy, efficiently exerting top-down control and exploiting developmental modularity.  The unknown is how cellular networks represent target morphologies and enable iterative computations for determining missing parts and coordinating cell instructions towards large-scale goals.  Elucidating the bioelectric representation of somatic pattern is a key challenge.  While integrating bioelectrical signaling with biochemical gradients, gene-regulatory networks, and physical forces is necessary, bioelectric signaling is essential for cracking the puzzle due to its role in the morphogenetic code and control over coherent modules.",
      "section": "Discussion",
      "topic": "Bioelectric signaling and morphogenesis",
      "chunk_summary": "The research focuses on bioelectric signaling's role in morphogenesis, particularly how cell networks represent target morphologies and compute necessary changes for achieving them.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    },
    {
      "text": "Cells communicate using various modalities, but bioelectricity is unique for its suitability for computation and long-range signaling, crucial for coordinating cell behaviors across the organism. Gap junctions, regulating current flow based on local voltage, are key elements in developmental bioelectricity, providing an entry point into how cell networks represent patterning information. The current view of DNA as software and cells as hardware needs revision. DNA determines the hardware (ion channel proteins), while bioelectric circuits regulate gene expression, affecting channel type and number. The morphogenetic outcome is largely the result of bioelectric software – circuit dynamics – running on cellular ion channel hardware. Manipulating this bioelectric software is key to top-down programming of morphogenesis.",
      "section": "Discussion",
      "topic": "Bioelectricity as a computational medium",
      "chunk_summary": "Bioelectricity, particularly gap junction-based networks, is uniquely suited for computation and long-range signaling in morphogenesis, with bioelectric circuit dynamics acting as \"software\" running on cellular \"hardware.\"",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124127_022345.pdf",
      "original_filename": "pdf_20250803_124127_022345_extracted_text.txt",
      "authors": "[\"Dr. Michael Levin\"]",
      "year": null,
      "journal": "Unknown",
      "doi": null
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:08:03.633115",
  "enriched_at": "2025-08-11T14:37:53.947760",
  "enrichment_methods": [
    "crossref_title"
  ]
}