{
  "file_metadata": {
    "text_file": "data/extracted_text/pdf_20250803_124125_338833_extracted_text.txt",
    "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
    "pdf_filename": "pdf_20250803_124125_338833.pdf",
    "file_size": 48291,
    "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
    "journal": "Communicative & Integrative Biology",
    "doi": "10.4161/cib.27155",
    "year": "2013",
    "title": "It's never too early to get it Right\nA conserved role for the cytoskeleton in left-right asymmetry",
    "confidence_score": null,
    "document_type": "research_paper",
    "crossref_data": true,
    "enrichment_method": "crossref_api"
  },
  "chunks": [
    {
      "text": "With a few notable exceptions, vertebrates (and many invertebrates) have bilaterally symmetric external bodyplans. Yet these same animals exhibit consistent asymmetries in the position or anatomy of internal organs such as the heart, viscera, and brain. Asymmetry of the left-right (LR) axis is a fascinating area of research, and the existence of this asymmetry raises many fundamental questions for biologists: What are the implications of asymmetry for the function and physiology of the internal organs? Why are all normal individuals not only asymmetric, but all asymmetric in the same direction (rather than a 50:50 mix)? At what developmental stage is asymmetry initiated? How conserved are the mechanisms that produce asymmetry across species? And how is consistent asymmetry generated in a world where no macroscopic feature of chemistry or physics distinguishes left from right?",
      "section": "Introduction",
      "topic": "Left-Right Asymmetry",
      "chunk_summary": "The consistent asymmetry of internal organs in vertebrates despite external bilateral symmetry raises fundamental questions about its developmental origins, functional implications, and evolutionary conservation.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Asymmetry extends beyond the internal bodyplan and is therefore relevant to other fields of science. A number of syndromes and drug effects exhibit sidedness of presentation in human patients. In the field of oncology, LR biases have recently been uncovered for health endpoints including the site and the prognosis and likelihood of metastasis for several types of cancer. In the fields of behavioral science and neurology, strong LR biases have been noted in behavioral features such as hand dominance, and altered neurological asymmetries have been linked to diseases and disabilities such as dyslexia and schizophrenia. There also appear to be biological associations between handedness and other disease outcomes including susceptibility to intestinal parasites, asthma, and autoimmune diseases, suggesting brain-body links that should continue to be explored in the context of laterality.",
      "section": "Introduction",
      "topic": "Asymmetry in Health and Disease",
      "chunk_summary": "Left-right asymmetry is relevant to various fields, including medicine, oncology, and neurology, with implications for disease presentation, prognosis, and behavioral traits.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Finally, LR asymmetry is an important topic for embryologists, neonatologists, and pediatricians. Although defects in LR asymmetry are not terribly common compared with other birth defects (affecting 1:6000 live births), there are severe medical consequences for individuals with some of these conditions including heterotaxia (the lack of concordance between internal organs, allowing each organ to individually \\\"decide\\\" on its placement on the left or right side of the body), single organ inversions such as dextrocardia (the reversal in position and morphology of the heart), and isomerisms (symmetry of the LR axis, leading to either duplication or complete loss of single organs such as the spleen). Patients with complete reversal of asymmetry (situs inversus) have fewer health consequences than these other conditions because conditions such as heterotaxia and isomerisms often involve inappropriate connections between the heart, lungs, and other visceral organs.",
      "section": "Introduction",
      "topic": "LR Asymmetry in Development and Birth Defects",
      "chunk_summary": "Defects in LR asymmetry, such as heterotaxia, dextrocardia, and isomerisms, can have severe medical consequences for affected individuals.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "It is widely acknowledged that the generation of asymmetry in embryos requires 3 separate steps: 1) the breaking of symmetry, allowing the LR axis to be consistently oriented relative to the dorsal-ventral and anterior-posterior axes, 2) the translation of these initial asymmetries to produce asymmetric gene expression on the left and right sides of the body, and 3) the translation of asymmetric gene expression into asymmetric position and morphology of the internal organs. In contrast to these last 2 steps, which have been well characterized in a number of model species, there remains significant debate over the mechanisms that operate in the first step, i.e., the origin of symmetry breaking.",
      "section": "Introduction",
      "topic": "Three Steps of Asymmetry Generation",
      "chunk_summary": "Embryonic asymmetry generation involves three steps: symmetry breaking, asymmetric gene expression, and asymmetric organ morphology, with the first step's mechanisms remaining debated.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "One model for symmetry breaking proposes that ciliary motion within a small pocket of tissue in the neurulating embryo produces LR asymmetries. In this ciliary model of LR asymmetry, the movement of cilia produces a directional fluid flow within this fluid-filled space, termed the node (mouse), the gastrocoel roof plate (GRP, Xenopus), or Kupffer's Vesicle (KV, zebrafish). Because of their consistent structural chirality and tilt, cilia can produce a right-to-left current that asymmetrically distributes particles and can trigger mechanosensory cilia on one side of the embryo. The ciliary model is appealing because it derives laterality from a biochemical structure, and there is a strong correlation between ciliopathies and LR patterning defects in human patients. However, a number of inconsistencies have arisen between this model and experimental data, including the identification of numerous species (such as pig and chick) that orient their LR axis without cilia or prior to the appearance of motile cilia, the existence of genetic mutants with defects in ciliary function but normal LR asymmetry, and the appearance of consistent asymmetries long before ciliary flow, among others.",
      "section": "Models for LR Asymmetry",
      "topic": "Ciliary Model of LR Asymmetry",
      "chunk_summary": "The ciliary model proposes that ciliary motion creates directional fluid flow, establishing LR asymmetry, but inconsistencies exist, including species with asymmetry without cilia and mutants with normal asymmetry despite ciliary defects.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "The existence of consistently asymmetric animals without cilia at the node commits the cilia model to requiring a highly divergent origin of asymmetry among species—an evolutionarily unlikely scenario. For all of the above reasons, alternative models have been proposed that focus on highly conserved intracellular/cytoplasmic pathways. The general class of intracellular models postulates that asymmetry originates during very early developmental stages due to the chiral nature of the cytoskeleton. In contrast to the ciliary model's focus on relatively late extracellular fluid flows, the intracellular model postulates that asymmetry is generated from within early embryonic cells where an oriented chiral cytoskeleton is amplified to tissue-level asymmetries. One hypothesis is that a chiral cytoskeleton directs the distribution of chromatids during the first cleavage stage, and that these chromatids are differentially imprinted, allowing for the distinction of the left and right sides. Another hypothesis postulates that the chiral cytoskeleton actively directs the asymmetric distribution of proteins including K+ channels and H⁺ pumps by intracellular motors, which produce consistent biases in the pH and transmembrane voltage on the left and right sides of the embryo. These biases establish bioelectrical gradients that drive the asymmetric distribution of small charged molecules such as serotonin through gap junctions from left to right in the early embryo. Serotonin, which accumulates on the right side of the embryo, can epigenetically repress the expression of asymmetric genes such as Xnr-1, the Xenopus homolog of the highly conserved left-side marker Nodal.",
      "section": "Models for LR Asymmetry",
      "topic": "Intracellular Models of LR Asymmetry",
      "chunk_summary": "Intracellular models propose that asymmetry originates from the chiral cytoskeleton in early development, potentially through chromatid distribution or asymmetric protein distribution by motor proteins, leading to bioelectrical gradients and serotonin signaling.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Experimental evidence supports both of these intracellular models, and they are mutually compatible. Furthermore, we have recently proposed 2 novel possibilities. One is a unified model of asymmetry, whereby LR asymmetry is initiated during the early cleavage stages of development via inherent chirality of the cytoskeleton, and asymmetric information is amplified during subsequent developmental stages via the asymmetric intracellular distribution of serotonin and the asymmetric motion of cilia to distribute extracellular morphogens and ions. According to this unified model, LR asymmetry is best established when all mechanisms are working properly, but the LR axis can still be oriented in species lacking one or more parts of these pathways (for example, in species that lack cilia). The other recently proposed model is the stochastic model of asymmetry, which proposes that embryos of one species can stochastically choose among one of several pathways to pattern their LR axis: within any clutch of embryos, some use one pathway to initiate asymmetry, and others “choose” another pathway. This maximizes the chance that at least some individuals in a population will be unaffected by environmental factors that affect one of the LR pathways, and explains why most perturbations of a LR pathway component affect some but not all embryos in any experimental population. Importantly, all of these models, including the ciliary model, point to aspects of the cytoskeleton as a central feature of asymmetry. This addendum will focus on recent studies examining the role of the cytoskeleton in the establishment of LR asymmetry, emphasizing conservation of mechanisms across species and even kingdoms. There is now strong evidence that asymmetry is an ancient, highly conserved feature of single cells and higher organisms.",
      "section": "Models for LR Asymmetry",
      "topic": "Unified and Stochastic Models of LR Asymmetry",
      "chunk_summary": "Unified and stochastic models propose that cytoskeletal chirality initiates asymmetry, amplified by serotonin and cilia, with species potentially using different pathways stochastically.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "The centrosome is comprised of 2 centrioles and a matrix of proteins including γ-tubulin that forms the microtubule organizing center (MTOC). The centrosome has functional and structural asymmetries that are considered essential to maintain cell polarity and asymmetry, and indeed for linking the microtubule cytoskeleton to large-scale axes of the organism. For example, the pair of centrioles that comprise the centrosome are asymmetric in size and only the maternal centriole can become a basal body and nucleate the formation of cilia. Centriole asymmetry is also important for the biased segregation of mRNAs and transcription factors. The mother centriole is responsible for cell geometry and relative positioning of other organelles within the cell. The basal body itself has inherent asymmetries: when some protists undergo the G₁ to S transition and extend a new cilium, the newly formed basal body completes a highly conserved leftward rotation around the old cilium.",
      "section": "The cytoskeleton: A central actor in models of LR asymmetry",
      "topic": "Centrosome and Centriole Asymmetry",
      "chunk_summary": "The centrosome, comprised of asymmetric centrioles, plays a crucial role in cell polarity, cilia formation, and mRNA segregation, with the basal body exhibiting inherent asymmetries during ciliogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "All of the models of LR asymmetry described above are intimately linked by their reliance on the cytoskeleton to initiate LR asymmetry. In the 2 variants of the intracellular model of LR asymmetry, the implicated cytoskeleton is solely localized within the cell, without any external features (i.e., projections such as cilia). In the model implicating ion flux, the chirality of the microtubule and actin filaments controls the directionality of cytoplasmic tracks for motor proteins such as kinesin and dynein, thus regulating asymmetric movement of intracellular cargo. Specifically, it postulates that the MTOC sets up a cytoskeleton that is oriented with respect to the other 2 axes of the prospective embryo, and is subtly biased to the right, to allow some maternal proteins to be preferentially enriched on the right side during early cleavage stages. For the mechanism involving asymmetric chromatid segregation, the cytoskeletal component is also intracellular, involving the machinery that controls chromatid movements during cell divisions. In the ciliary model of LR asymmetry, the cytoskeleton is implicated both within the cilia itself and in the basal body, the anchor for the cilia in the cell. Other aspects of the cytoskeleton generate various kinds of polarity. For example, in cultured monolayers undergoing a scratch-wound assay, individual cells at the \\\"wound\\\" edge repolarize so that the centrosome, golgi apparatus, and lamellipodia are on the side of the cell facing the wound, whereas the nucleus, stress fibers, and mature focal adhesions form on the side furthest from the wound edge. This reorganization is dependent on CDC42, a protein involved in apical-basal polarity that has been implicated in LR patterning in Xenopus and the asymmetric cell protrusions needed to establish the LR axis in C. elegans. Together, these data suggest that there are highly conserved aspects of asymmetry that operate in single cells, invertebrates, and vertebrates, and the cytoskeleton has a central role in the major models of LR asymmetry. As will be discussed below, it appears that a number of the pathways involved in cell polarity decisions are intimately linked with LR asymmetry.",
      "section": "The cytoskeleton: A central actor in models of LR asymmetry",
      "topic": "Cytoskeleton's Role in LR Asymmetry Models",
      "chunk_summary": "The cytoskeleton is central to all LR asymmetry models, controlling intracellular cargo movement, chromatid segregation, and ciliary function, with its role in cell polarity being highly conserved across species.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "The majority of plants display radial or bilateral symmetry in their flowers and leaves, yet some species demonstrate asymmetries that manifest in specific organs. For example, asymmetry is often observed in the handedness of coiling as stems grow around other objects and can be seen in the twisting of axial organs. The leaves, flowers, roots, and stems of Arabidopsis are normally organized in radially symmetrical patterns. However, fascinating molecular genetic studies have revealed a role for tubulins in maintaining this apparent symmetry (similar to the way in which retinoic acid signaling symmetrizes inherently-asymmetric somite patterning). α-tubulin is a protein that dimerizes with β-tubulin to make microtubules. Mutations in α-tubulin at the intradimer interface produce Arabidopsis plants with left-handed chiral roots and stems and clockwise-bending leaves and flowers. Similarly, mutations in a core subunit of γ-tubulin-containing complexes also produce plants with these morphological asymmetries. Collectively, these studies indicate that alterations in the architecture of microtubules regulate large-scale symmetry properties of this plant.",
      "section": "From plants to frogs: A clear role for the cytoskeleton",
      "topic": "Tubulins and Asymmetry in Plants",
      "chunk_summary": "Studies in Arabidopsis show that mutations in α-tubulin and γ-tubulin-containing complexes affect microtubule architecture and lead to morphological asymmetries in roots, stems, leaves, and flowers.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "In contrast to the cilia model, which must postulate divergent origins of asymmetry in animals such as mouse, pig, chick, frog, and invertebrates, the intracellular model is compatible with an ancient, highly conserved role for the symmetry-breaking mechanism. To directly test this key distinction between the 2 paradigms, a recent study assessed the widest-possible conservation of asymmetry mechanisms. First, mRNA encoding tubulins bearing mutations homologous to those that induce asymmetry in Arabidopsis were introduced into Xenopus embryos. Expression of mRNA encoding mutant α-tubulin or a mutated form of the γ-tubulin associated protein tubgcp2 induced heterotaxia, even when targeted to cells that do not contribute to the ciliated organ (GRP), but only when these mRNAs were injected at the 1-cell stage. When injections occurred at the 2-cell stage or later, normal LR patterning occurred, even when mRNAs were targeted to the ciliated cells of the GRP. Injections with mutant tubgcp2 mRNA also disrupted asymmetry and directionality of microtubule-dependent motor protein transport—important aspects of the intracellular model of LR asymmetry. Finally, expression of either mutant tubgcp2 or mutant α-tubulin altered LR biases in the expression of cofilin-1a, a polarity protein that mediates actin-tubulin interactions that was found to be enriched on the right half of the wild-type 4-cell Xenopus embryo. Indeed, an unbiased proteomic analysis of the 4-cell frog embryo revealed a number of maternal products that were differentially localized between the left and right sides; expression of mutant cytoskeletal components abolished or reversed LR biases in a number of such proteins, including ion transporters, other cytoskeletal components, and proteins involved in other cellular processes. Taken together, the data clearly indicate that in the frog embryo, consistent LR asymmetry already exists by the second cell division, and involves some aspect of tubulin-mediated intracellular activity (such as transport of cargo).",
      "section": "From plants to frogs: A clear role for the cytoskeleton",
      "topic": "Tubulin Mutations and Heterotaxia in Xenopus",
      "chunk_summary": "Introducing mutant tubulin mRNAs into Xenopus embryos at the 1-cell stage induced heterotaxia, demonstrating a conserved role for tubulin in LR asymmetry and highlighting the importance of early intracellular activity.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Continuing the strategy of testing the same mechanism in highly diverse phyla with very different bodyplans, the same tubulin mutations were tested in the nematode model. In C. elegans, there are 2 AWC olfactory neurons that are morphologically symmetrical but display LR biases in expression of chemosensory receptors; the mechanisms responsible for producing these asymmetries involve gap junctions and ion flows—2 components of LR patterning in several vertebrate species. Previous studies have demonstrated that these neural asymmetries can be disrupted by treating C. elegans embryos with pharmaceuticals that disrupt microtubule polymerization. Expression of mutant α-tubulin prevented chemosensory receptor asymmetry (based on the expression of a reporter gene str-2p) in 58% of the embryos, a very significant change from wild type C. elegans where asymmetric expression of str-2p was observed in all worms.",
      "section": "From plants to frogs: A clear role for the cytoskeleton",
      "topic": "Tubulin Mutations and Neural Asymmetry in C. elegans",
      "chunk_summary": "Mutant α-tubulin disrupted chemosensory receptor asymmetry in C. elegans, further supporting the conserved role of tubulin in LR patterning across diverse phyla.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Importantly, consistent asymmetry does not require a multicellular structure (such as a node or embryonic blastoderm) at all: a number of single cells exhibit consistent chirality in their movements and behaviors. To test the same cytoskeletal component in human cells and probe the relevance of this component to cellular asymmetry in the absence of any coordinated fluid flows, the effects of mutant α-tubulin were investigated in the human neutrophil-like cell line HL-60. In wild-type cultured HL-60 cells, one “dorso-ventral” axis is defined by the interaction of the cells with the culture plate (vs. interaction of the cell's top surface with the culture media); a second axis (“anterior-posterior,” perpendicular to the first) can be identified by drawing a line from the nucleus to the centrosome, thus a pseudo-LR axis can be defined based on these other 2 axes. Wild-type HL-60 cells typically extend a pseudopod to the left of the nucleus-centrosome axis following exposure to fMLP, a chemoattractant. This leftward bias can be abolished by pharmaceuticals that disrupt microtubule polymerization. Transfected HL-60 cells expressing mutant α-tubulin no longer displayed leftward biases in response to fMLP—the mutant proteins abolished this form of LR asymmetry in cultured human cells as they did in vivo. The role for tubulins in LR patterning in Arabidopsis, Xenopus, C. elegans, and cultured human neutrophils reveals a remarkable degree of conservation of this molecular mechanism. Collectively, these studies implicate the microtubule cytoskeleton in a number of types of asymmetries operating across multiple levels of biological organization, and suggest different amplification mechanisms within the very different bodyplans.",
      "section": "From plants to frogs: A clear role for the cytoskeleton",
      "topic": "Tubulin Mutations and Cellular Asymmetry in Human Cells",
      "chunk_summary": "Mutant α-tubulin abolished LR asymmetry in human neutrophil-like cells, demonstrating the conserved role of tubulin in cellular asymmetry even in the absence of multicellular structures or fluid flows.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Mutant tubulin mRNAs disrupted LR patterning in Xenopus tadpoles, but only if present right after fertilization—injection at the 2-cell stage was already too late to affect asymmetry. Because mRNAs begin to be translated within a short time of their introduction to the Xenopus embryo (i.e., Lobikin et al. demonstrate strong expression at the 2-cell stage when injected prior to the first cleavage), the results constrain the role of tubulin to events that occur within the first hour or two of fertilization, at the 1 or 2-cell stage. This timing is consistent with both the model of asymmetrically segregating maternal ion translocator proteins and the chromatid segregation model. Similar results have been obtained for a limited number of other reagents, mostly limited to manipulations that target the cytoskeleton (although ion flows exhibit similar timing requirements). In one example, treatment of embryos with 2,3-butanedione monoxime (BDM), a myosin inhibitor, randomizes the LR axis, but only when administered prior to the first cell cleavage. In fact, studies focused on identifying the critical period for this compound reveal a very short period during the 1-cell stage where embryos are most sensitive, whereas BDM treatments even during the late 1-cell stage have no effect on LR patterning. In another example, low frequency vibrations were shown to disrupt LR patterning in Xenopus and zebrafish embryos; mechanistic studies in Xenopus revealed that these vibrations affect the early cytoskeleton and the integrity of tight junctions in the early cleavage stage embryo.",
      "section": "How early are the earliest steps of asymmetry?",
      "topic": "Early Timing of Asymmetry Establishment",
      "chunk_summary": "Experiments with mutant tubulin mRNAs, myosin inhibitors, and vibrations demonstrate that disruptions to the cytoskeleton affect LR patterning only during the very early stages of development, suggesting asymmetry establishment occurs before or during the first cleavage.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Interestingly, the molecular motors that control cytoskeletal movement have been modeled as ratchets. The stepwise motion of the motor along the polymer is powered by the thermal energy (Brownian motion) of the fibril. The motor uses ATP hydrolysis to resist the movement in a particular direction; myosin V is a left-handed spiral motor moving toward the plus end of actin, while myosin II is right-handed spiral motor. It may thus be speculated that molecular vibrations affect the structure of the cytoskeleton as a component of symmetry breaking, and could impact the delivery of molecular cargo by increasing the thermal energy of the cytoskeletal components. Consistent with an early role for endogenous molecular motion in the earliest steps of laterality establishment, sinusoidal vibrations applied to frog embryos that started at the 1-cell stage were able to disrupt LR patterning; they were significantly more effective than vibrations that commenced at the 2-cell stage (31% vs. 19%) and more than twice as effective as vibrations that began after 6 rounds of cell division (12%).",
      "section": "How early are the earliest steps of asymmetry?",
      "topic": "Molecular Motors and Vibrations",
      "chunk_summary": "Molecular motors, modeled as ratchets, utilize thermal energy for movement, and vibrations can disrupt cytoskeletal structure and cargo delivery, impacting LR patterning, especially during the 1-cell stage.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "A final example used classical developmental biology techniques to probe the timing of initiation of LR asymmetry. Xenopus embryos were UV-irradiated at the 1-cell stage to prevent cortical rotation, thus effectively removing all axial patterning information. When patterning information was restored at the 1-cell stage via mechanical tipping, a method that uses gravity to physically induce cortical rotation, normal LR patterning resulted. However, if axial patterning was induced slightly later (either via injection of lithium chloride at the 32-cell stage, which begins inducing dorsal determinants immediately, or via injection of XSiamois, a molecular component of Spemann's organizer, which induces zygotic transcription at midblastula transition), LR patterning defects were observed. This experiment confirmed that initiation of LR asymmetry occurs prior to the 32-cell stage. These timing experiments need to be considered in the context of the numerous additional experiments that have revealed consistent biases in mRNA localization, protein expression, and physiological endpoints during early cleavage stages. Furthermore, many of these early cleavage stage asymmetries have been shown to be disrupted by treatment with reagents that target microtubules and/or actin filaments. Collectively, these results suggest that the earliest steps in the LR asymmetry pathway are occurring very early—within the first cleavage stages, and likely prior to the first cell cleavage. It should be noted that while none of these have been tested in mammalian embryos yet, even mouse embryo cells are known to not be LR-equivalent by the 8-cell stage, consistent with early models.",
      "section": "How early are the earliest steps of asymmetry?",
      "topic": "Cortical Rotation and Asymmetry Timing",
      "chunk_summary": "Experiments manipulating cortical rotation and axial patterning in Xenopus embryos confirm that LR asymmetry initiation occurs before the 32-cell stage, likely within the first cleavage stages, supported by evidence of early molecular and physiological asymmetries.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "In many species, the sperm contributes a centrosome to the resulting embryo at the time of fertilization as well as other essential components of the MTOC that attract proteins to this complex from the egg's stores. Experiments involving the fertilization of an egg with multiple sperm (i.e., polyspermy) have revealed the consequences of having multiple centrosomes in an early embryo; these embryos typically develop multiple cleavage furrows, distribute their chromosomes unevenly between blastomeres, and fail to develop beyond the early cleavage stages. Additional studies have shown that the centrosome itself is sufficient to induce cleavage of an unfertilized egg, indicating that this structure plays a central role in the presence and localization of the first cleavage plane. Centrosome location has been linked to symmetry breaking in a number of organisms, perhaps most clearly understood in C. elegans and neuronal polarity. Moreover, it is now known that asymmetry of the centriole plays a critical determining role in shaping the internal organization of cells through the attachment of microtubule rootlets to specific sets of microtubule triplets on the centriole. Finally, data on the role of the MTOC in guiding cell migration at wound edges reveal the central role of the cytoskeletal organizing center in orienting cellular axes with respect to large-scale external signals.",
      "section": "Starting with the cytoskeleton: a model for how the LR axis stays on track",
      "topic": "Centrosome and Cleavage Plane",
      "chunk_summary": "The sperm-contributed centrosome is crucial for cleavage plane establishment, and its location is linked to symmetry breaking, with centriole asymmetry influencing internal cell organization and MTOC guiding cell migration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "We propose that asymmetry is an ancient aspect of life and that the mechanism for its orientation is very deeply conserved. Our model postulates that the cytoskeleton is the origin of asymmetry in all of these species, and that the orientation of the MTOC with the 2 major embryonic axes at fertilization is sufficient to generate asymmetry in individual cells as well as the early embryo. The MTOC thus plays the role of the F-molecule that was theorized by Brown and Wolpert: a structure that allows the LR axis to be oriented consistently with respect to the dorsal-ventral and anterior-posterior axes. Because the centrosome is asymmetric, the MTOC itself has inherent asymmetries that can be amplified to cell-level asymmetries. It also is known to serve as an intracellular anchor, allowing for the assembly of chiral cytoskeletal tracks that can be used for directed and biased intracellular transport, and has been linked to laterality disturbances in nematodes, zebrafish, and humans. We postulate that the orientation of this chiral cytoskeleton relative to the other axes can be established based on the sperm entry point. The unfertilized egg has radial symmetry, but like other single cells, it has a chiral actin cytoskeleton; only after fertilization is the radial symmetry broken, because the point of sperm entry offers a distinct point on the circumference at which the counterclockwise direction of the actin uniquely orients a linear LR axis. Such an intracellular LR axis is then used to redistribute maternal components to the right side, as has been shown to occur by the 4-cell stage. The earliest events establishing concordant linkage between the 3 major axes thus involve not only tubulin, as shown by Lobikin et al. and previous work implicating microtubules in asymmetry of a range of model species, but also actin; indeed, a number of actin-regulating proteins such as inversin and myosin are functionally implicated in laterality. Consistent with this, the Lobikin 2012 study showed asymmetric localization of cofilin, a protein that mediates interaction between actin and tubulin and regulates cell polarization. With the MTOC and the cytoskeleton establishing LR asymmetry shortly after fertilization, a number of additional steps are required to amplify and enhance these very early asymmetries. These include the asymmetric localization of ion channels and transporters, and the subsequent asymmetric distribution of intracellular signaling molecules including serotonin. Later-functioning mechanisms such as asymmetric cell migration, asymmetric deposition of extracellular matrix components, and asymmetric fluid flow may also serve as mechanisms to amplify the earliest asymmetries. Finally, a large body of knowledge about planar cell polarity indicates that small asymmetries can be amplified over whole tissues via a conserved set of intracellular proteins, and global PCP orientation is now known to be set by microtubules; recent evidence suggests that planar cell polarity proteins can alter the biased position of cilia at the node, but can also affect LR patterning via cilia-independent mechanisms.",
      "section": "Starting with the cytoskeleton: a model for how the LR axis stays on track",
      "topic": "MTOC and Cytoskeleton as Asymmetry Origin",
      "chunk_summary": "The authors propose that the cytoskeleton, oriented by the MTOC and sperm entry point, is the origin of asymmetry, with the chiral cytoskeleton redistributing maternal components and subsequent steps amplifying these early asymmetries through ion channels, serotonin signaling, and other mechanisms.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Indeed, the picture painted of such early LR asymmetry mechanisms looks strikingly isomorphic to the current understanding of other examples of axial patterning throughout the animal kingdom. For example: \\\"Single-cell patterning begins with an asymmetric cue that orients the axis of polarity. Despite great diversity in the types of cues, common mechanisms appear to mediate the polarizing response. Rho-family GTPases initially process and reinforce polarity cues by remodeling cortical actin, and these local asymmetries are subsequently propagated to the microtubules, membrane and secretory pathway to generate the final pattern\\\". Consistent with this, recent data implicated Rab GTPases in early asymmetry in Xenopus. Interestingly, elegant molecular biomechanics work now shows that single cell chirality can drive the asymmetry of individual organs, such as the fruit fly hindgut, as well as that of the whole bodyplan. The study discussed in detail above implicates α-tubulin in a number of highly diverse organisms, and previous studies have implicated aspects of the intracellular cytoskeleton in LR patterning of ciliates, Arabidopsis, C. elegans, Drosophila, snails, and Xenopus. Experimental evidence indicates that a number of downstream mechanisms may also be conserved between some plants, invertebrates, and vertebrates, but additional experiments using a variety of model species are needed to dissect these factors in a greater number of species. Below, we outline some strategies for the study of LR patterning in a uniquely tractable model system – the Xenopus laevis embryo, which facilitates experiments both on the earliest steps of asymmetry and on later components such as planar polarity and ciliary flows.",
      "section": "Starting with the cytoskeleton: a model for how the LR axis stays on track",
      "topic": "Conservation of Asymmetry Mechanisms",
      "chunk_summary": "Early LR asymmetry mechanisms resemble axial patterning throughout the animal kingdom, with conserved roles for Rho-family GTPases and single-cell chirality driving organ and bodyplan asymmetry, highlighting the need for further research across diverse species.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "As discussed elsewhere, a few key strategies must be kept in mind when probing functions of new pathways in asymmetry, as many studies do not assess whether LR-relevant targets may have early roles (i.e., prior to stages where cilia are present). Moreover, most experimental designs used to provide data on putative LR functions of proteins at the nodal cilia in fact cannot rule out other intracellular roles. Strategy 1: Comparison of mRNA injections during the early 1-cell stage with injections at the 2-cell, 4-cell, or later stages. A number of studies have shown that molecular constructs are effective at disrupting the LR axis only when they are introduced during the earliest stages of development, but are less effective – or ineffective – at later stages, even when targeted to cells that contribute to flow at the node. Similarly, experiments can compare the effects of injections of mRNA (translated within a short period of injection) with the effects of injections of DNA (which will not be translated until after midblastula transition – several hours after fertilization, when thousands of cells are present). In addition to these early vs. late injections, additional tools are available for use in other developmental models including the use of inducible promoters in mice (which could be used to drive expression of key proteins at cleavage stages vs at primitive streak stages), and drug exposures beginning at various time-points in Xenopus and zebrafish. Collectively, these tools can distinguish between proteins with early and late roles.",
      "section": "Recommendations for design of studies of LR asymmetry",
      "topic": "Experimental Strategies for LR Asymmetry Studies",
      "chunk_summary": "The authors recommend comparing mRNA injections at different developmental stages, comparing mRNA and DNA injections, and using inducible promoters and timed drug exposures to distinguish between early and late roles of proteins in LR asymmetry.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    },
    {
      "text": "Strategy 2: Targeting mRNAs to specific regions of the embryo. A good fate map has been produced for Xenopus, and subsequent experiments have revealed that only dorsal blastomeres, and more specifically the regions corresponding to the dorsal marginal zone, contribute to the GRP. Further analyses indicate that only the cilia on the left side of the midline are required for flow at the GRP; thus, only injections targeted to the left dorsal blastomere should influence LR patterning via alterations in ciliary flow. Conversely, injections in the right ventral blastomere should not influence ciliary flow, and thus any effects observed from injections at this site support cilia-independent effects. In zebrafish, injections can be targeted to the KV or to the entire embryo; while no available technique targets expression to all regions of the embryo with the exception of the KV, a comparison of the effects of ubiquitous expression to the effects of KV-restricted expression can be made. In mice, recent studies showed that node-only rescues of deleted genes do not fully restore normal asymmetry, but no studies yet examine what happens when some of the gene products are present only at early stages, or everywhere but the node.",
      "section": "Recommendations for design of studies of LR asymmetry",
      "topic": "Targeted mRNA Injections",
      "chunk_summary": "Targeting mRNA injections to specific regions of the embryo, such as the left dorsal blastomere in Xenopus or the KV in zebrafish, can help determine whether observed effects are cilia-dependent or cilia-independent.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250803_124125_338833.pdf",
      "original_filename": "pdf_20250803_124125_338833_extracted_text.txt",
      "authors": "[\"Laura N Vandenberg\", \"Joan M Lemire\", \"Michael Levin\"]",
      "year": "2013",
      "journal": "Communicative & Integrative Biology",
      "doi": "10.4161/cib.27155"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-06T12:03:40.264139",
  "enriched_at": "2025-08-11T14:36:34.409429",
  "enrichment_methods": [
    "crossref"
  ]
}