{
  "chunk_id": "xNgq3zqYsoA_chunk_024",
  "text": "So here's a human oncogene injected into this tadpole It will make a tumor The tumor has this really weird electrical state where you can see the cells are actually disconnecting from their neighbors But if you prevent them from doing that, even though that oncoprotein is blazingly expressed, it's the same animal So there's tons of that nasty oncogene There's no tumor, because what you've done is kept the cells connected to the neighbors, so they're part of this mind meld of building nice skin, nice muscle, and so on So the cancer cells aren't more selfish They have smaller selves The border between self and world has shrunk and we've reinflated again",
  "token_count": 114,
  "sentence_count": 9,
  "start_sentence": 24,
  "end_sentence": 32,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Oncogenes",
    "Bioelectricity",
    "Cellular Connectivity",
    "Tumor Development",
    "Cellular Identity"
  ],
  "secondary_topics": [
    "Cancer Cells",
    "Cellular Communication",
    "Tadpole Experimentation",
    "Protein Expression",
    "Cellular State",
    "Tissue Development",
    "Cellular Selfishness",
    "Boundary Definition"
  ],
  "key_terms": [
    "Oncogene",
    "Tumor",
    "Bioelectric State",
    "Oncoprotein",
    "Cellular Connectivity",
    "Cellular Identity",
    "Tissue Development"
  ],
  "content_summary": "The transcript discusses an experiment where a human oncogene is injected into a tadpole, leading to tumor development due to changes in the bioelectric state of cells. The presenter suggests that preventing cells from disconnecting from their neighbors, even in the presence of the oncogene, can prevent tumor formation. This is because the cells remain part of the collective effort to build healthy tissue, suggesting that the 'self' of cancer cells is not larger, but smaller.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}