{
  "chunk_id": "xNgq3zqYsoA_chunk_024",
  "text": "So that's one thing you can do through this interface, is you can sort of play with the border between self and world, of course we can communicate certain goals. Now that we understand a little bit about how they think we can communicate certain goals, here's one thing we can do, is to tell a frog. Frogs don't regenerate their legs. Unlike that salamander that I showed you, we can, we can tell these cells here to go down the leg building path instead of the scarring path. And so by 45 days, then you already have some toe, some toes you've got, a toenail, you've got, and eventually a very respectable looking functional leg. We did that by providing specific ion channel drugs at this interface to put the cells in an electrical state where they remember that they need to build a limb as opposed to scarring and stopping. We are currently doing this. And so I have to do a disclosure because this is a company that was spun out of our lab with David Kaplan. To do this in mammals and hopefully someday humans.",
  "token_count": 189,
  "sentence_count": 9,
  "start_sentence": 24,
  "end_sentence": 32,
  "start_time_ms": 1301160,
  "end_time_ms": 1355200,
  "start_time_seconds": 1301.16,
  "end_time_seconds": 1355.2,
  "primary_topics": [
    "Bioelectricity",
    "Cellular Regeneration",
    "Ion Channel Drugs"
  ],
  "secondary_topics": [
    "Frog Leg Regeneration",
    "Cellular Communication",
    "Regenerative Pathways",
    "Scarring Pathway",
    "Cellular Memory",
    "Biological Interface",
    "Biotechnology Companies"
  ],
  "key_terms": [
    "Bioelectricity",
    "Regeneration",
    "Ion Channel Drugs",
    "Cellular Communication",
    "Scarring",
    "Cellular Memory",
    "Interface",
    "Biotechnology"
  ],
  "content_summary": "The speaker discusses the use of bioelectricity and ion channel drugs to stimulate cellular regeneration in frogs, specifically leg regeneration. They mention the development of a biotechnology company to apply these findings to mammals and potentially humans.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}