{
  "chunk_id": "xNgq3zqYsoA_chunk_014",
  "text": "This is what we're made of. You can already see that it has some ability to manage its business at this lower scale. In fact, even below that level, the molecular networks inside of that little creature, in fact, inside of all of us, are molecular networks that are capable of six different kinds of learning different kinds of memory, including Pavlovian conditioning. The material that you're made of, all the way down to the molecular level has, and probably below that we could talk about, that has certain behavioral properties that you would easily recognize as aspects of cognition. And we're taking advantage of that for all kinds of biomedical purposes in our lab to try to train these electrical networks, these biochemical networks for drug conditioning and things like that. Life exerts intelligence in lots of spaces, not just the three dimensional space where it's easy for us to recognize, things like these crows that have learned to exchange cigarette butts for treats.",
  "token_count": 165,
  "sentence_count": 8,
  "start_sentence": 14,
  "end_sentence": 21,
  "start_time_ms": 781900,
  "end_time_ms": 838070,
  "start_time_seconds": 781.9,
  "end_time_seconds": 838.07,
  "primary_topics": [
    "Molecular Networks",
    "Bioelectricity",
    "Cognition",
    "Learning and Memory"
  ],
  "secondary_topics": [
    "Pavlovian Conditioning",
    "Biomedical Applications",
    "Drug Conditioning",
    "Behavioral Properties",
    "Intelligence in Life Forms",
    "Three Dimensional Space"
  ],
  "key_terms": [
    "Molecular Networks",
    "Bioelectricity",
    "Cognition",
    "Learning",
    "Memory",
    "Pavlovian Conditioning",
    "Biomedical",
    "Drug Conditioning",
    "Behavioral Properties",
    "Intelligence",
    "Three Dimensional Space"
  ],
  "content_summary": "The speaker, Michael Levin, discusses the inherent cognitive abilities found in molecular networks, extending even to the concept of learning and memory. He mentions the application of these concepts in biomedical research, specifically in training electrical and biochemical networks for drug conditioning.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}