{
  "chunk_id": "xNgq3zqYsoA_chunk_017",
  "text": "So here's the mouth, the nostrils, the brain, the spinal cord here. What we've done is prevent the primary eyes from forming. But we did put an eye on its tail and we found that these animals can see quite well. How do we know? We built a device that trains them in visual behavioral tasks and they can see. Now, this is kind of shocking. Why don't these animals, where the eye does not connect to the brain, so here the eye makes an optic nerve. That optic nerve might synapse onto the spinal cord. It might Go to the gut, it might go nowhere at all. Why does this work out of the box? How come you don't need rounds of evolutionary mutation, selection, adaptation, all that stuff to accommodate this completely novel sensorimotor architecture? And so, and it's because of that plasticity that I told you a minute ago, because evolution does not make fixed solutions to fixed environments. It makes problem solving agents that, you know, these cells never assumed the tadpole was going to be the same all the time anyway. It's going to. They figure out a way to make it work. And one way they do that. And so you understand, I'm using. I'm using this example of cells navigating anatomical space as a case study or a, a model of an unconventional intelligence. We don't have any aliens, but we do have intelligences that live in very different problem spaces. And we can use that as a way to start understanding how do we communicate, how do we detect intelligence? And so I showed you some ways of doing that. You sort of make perturbations and you notice they can get to the same goal by different means.",
  "token_count": 296,
  "sentence_count": 22,
  "start_sentence": 17,
  "end_sentence": 38,
  "start_time_ms": 998020,
  "end_time_ms": 1089040,
  "start_time_seconds": 998.02,
  "end_time_seconds": 1089.04,
  "primary_topics": [
    "Bioelectricity",
    "Developmental Biology",
    "Neurobiology",
    "Sensory Systems",
    "Biological Adaptation"
  ],
  "secondary_topics": [
    "Evolutionary Biology",
    "Cellular Plasticity",
    "Sensorimotor Architecture",
    "Unconventional Intelligence",
    "Anatomical Space Navigation",
    "Visual Behavioral Tasks",
    "Problem Solving Agents"
  ],
  "key_terms": [
    "Optic Nerve",
    "Spinal Cord",
    "Synapse",
    "Mutation",
    "Selection",
    "Adaptation",
    "Perturbations"
  ],
  "content_summary": "The speaker discusses an experiment where an eye was placed on a tadpole's tail, which surprisingly allowed the tadpole to see. This is attributed to cellular plasticity and the ability of biological systems to adapt to new sensorimotor architectures without the need for evolutionary mutation and selection. The speaker uses this as a model of unconventional intelligence.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Neurobiology",
  "enhanced": true
}