{
  "chunk_id": "xNgq3zqYsoA_chunk_020",
  "text": "So what we've developed are tools that let us see the electrical signals moving between all of the components of this collective intelligence So this is just like neuroscientists do in the brain, except we can now do this anywhere in the body So the colors indicate voltage levels Here's a bunch of cells in the dish This is an early frog embryo And now what we can do is we can read the mind of the body by reading these electrical signals We can try to interpret them and then try to understand what is it that what are the memories, the preferences, the goals and so on of this new collective intelligence We now have a way to also write information We don't use electric fields or waves or frequencies or anything like that We manipulate the interface that the cells are normally using to control each other",
  "token_count": 150,
  "sentence_count": 10,
  "start_sentence": 20,
  "end_sentence": 29,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Bioelectricity",
    "Cellular Communication",
    "Collective Intelligence"
  ],
  "secondary_topics": [
    "Neuroscience",
    "Electrical Signals",
    "Embryonic Development",
    "Cellular Interface Manipulation",
    "Voltage Levels",
    "Information Writing in Cells"
  ],
  "key_terms": [
    "Electrical Signals",
    "Voltage Levels",
    "Collective Intelligence",
    "Cellular Interface",
    "Frog Embryo",
    "Electric Fields",
    "Waves",
    "Frequencies"
  ],
  "content_summary": "The presentation discusses the development of tools that allow the visualization and interpretation of electrical signals between cells, akin to what neuroscientists do in the brain. This process aids in understanding the collective intelligence of cells, their communication, and manipulation of their interface for information writing.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}