{
  "chunk_id": "xNgq3zqYsoA_chunk_031",
  "text": "So the final thing I want to show you in the last couple of minutes is this If you look at this little creature So now let's go even beyond So I've shown you how to communicate with the intelligence of the body for repair Then the idea that you can use that to make radical changes in the structure You can make other kinds of, different kinds of embodiments And now I want to go even further than that and really talk about the plasticity and the capabilities of the material of life What else can it really do So if you look at something like this, this looks like some kind of primitive creature I got off the bottom of a pond somewhere It actually, it turns out if you were to sequence the genome, it's 100% Homo sapiens We call these anthrobots These are made of adult human cells",
  "token_count": 152,
  "sentence_count": 12,
  "start_sentence": 31,
  "end_sentence": 42,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Bioelectricity",
    "Developmental Biology",
    "Cellular Plasticity",
    "Genome Sequencing",
    "Anthrobots"
  ],
  "secondary_topics": [
    "Body Repair",
    "Structural Changes in Organisms",
    "Cellular Embodiments",
    "Material of Life",
    "Capabilities of Life Material",
    "Adult Human Cells",
    "Primitive Creatures",
    "Homo Sapiens"
  ],
  "key_terms": [
    "Intelligence of the body",
    "Radical changes",
    "Embodiments",
    "Plasticity",
    "Genome",
    "Anthrobots",
    "Adult human cells"
  ],
  "content_summary": "The speaker discusses the potential of bioelectricity and developmental biology in making radical changes to the body's structure for repair and creating different embodiments. They introduce the concept of 'anthrobots', organisms that appear primitive but are made of 100% Homo sapiens cells, demonstrating the plasticity and capabilities of the material of life.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}