{
  "chunk_id": "xNgq3zqYsoA_chunk_025",
  "text": "This is one of those biomedical applications. So that first application I just showed you was about cancer. So the idea was to normalize the cells, reconnect them to the body, not kill them with toxic chemotherapy, not try to fix the genetics, but to normalize them by reconnecting them to the memories of the body. This is now a second application around limb and organ regeneration. So using electrical cues to tell cells to rebuild the things they already know how to rebuild. It's not just about rebuilding the exact thing in the right place. You can also do interesting things like this. We can tell a bunch of cells that would have been gut, we can say no. Instead you should make an eye. And the way we do that is we inject some ion channel RNA that establishes a bioelectrical signal and that tells the cells to build an eye. And they build an eye. And that eye has all the same. Lens, retina, optic nerve, all the stuff it's supposed to have. And it has some other interesting properties that I don't have time to talk about.",
  "token_count": 191,
  "sentence_count": 15,
  "start_sentence": 25,
  "end_sentence": 39,
  "start_time_ms": 1355200,
  "end_time_ms": 1410400,
  "start_time_seconds": 1355.2,
  "end_time_seconds": 1410.4,
  "primary_topics": [
    "Biomedical Applications",
    "Cancer Treatment",
    "Limb and Organ Regeneration",
    "Bioelectricity",
    "Cell Normalization"
  ],
  "secondary_topics": [
    "Chemotherapy",
    "Genetic Modification",
    "Bioelectrical Signals",
    "Ion Channel RNA",
    "Cellular Memory",
    "Eye Development",
    "Tissue Engineering",
    "Cellular Rebuilding"
  ],
  "key_terms": [
    "Bioelectrical signal",
    "Ion channel RNA",
    "Cell normalization",
    "Regeneration",
    "Retina",
    "Optic nerve",
    "Lens"
  ],
  "content_summary": "The speaker discusses two biomedical applications: a non-toxic, non-genetic approach to cancer treatment that involves normalizing cells by reconnecting them to the body's 'memories', and a method of limb and organ regeneration that uses electrical cues to instruct cells to rebuild structures. An example is given where cells destined to become gut tissue are instructed to form an eye instead, using ion channel RNA to establish a bioelectrical signal.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}