{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
    "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
    "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
    "file_size": 11496,
    "authors": "Sonia Hernández-Díaz, Michael Levin",
    "journal": "Reproductive Toxicology",
    "doi": "Unknown",
    "year": "2014",
    "title": "Alteration of bioelectrically-controlled processes in the embryo: a teratogenic mechanism for anticonvulsants",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "Maternal use of anticonvulsants during the first trimester of pregnancy has been associated with an elevated risk of major congenital malformations in the offspring. Whether the increased risk is caused by the specific pharmacological mechanisms of certain anticonvulsants, the underlying epilepsy, or common genetic or environmental risk factors shared by epilepsy and malformations has been controversial. We hypothesize that anticonvulsant therapies during pregnancy that attain more successful inhibition of neurotransmission might lead to both better seizure control in the mother and stronger alteration of bioelectrically-controlled processes in the embryo that result in structural malformations. We propose that development of pharmaceuticals that do not alter cell resting transmembrane voltage levels could result in safer drugs.",
      "section": "Abstract",
      "topic": "Anticonvulsants and birth defects",
      "chunk_summary": "Maternal anticonvulsant use during pregnancy is linked to birth defects, potentially due to disruption of bioelectrically-controlled embryonic processes, suggesting that drugs not altering cell voltage could be safer.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "The aim of anticonvulsants is to suppress the excessive firing of neurons that start a seizure to prevent the spread of the seizure within the brain. Drugs exert their anticonvulsant action through enhancement of inhibitory neurotransmission or/and reduction of excitatory neurotransmission. The mechanism of anticonvulsant drug action is complex and remains uncertain. The main proposed mechanisms of action include: (1) Block of voltage-sensitive sodium (Na+) channels, which inhibits firing of action potentials by axons (e.g., phenytoin, carbamazepine, lamotrigine, valproate, topiramate, zonisamide). (2) Enhance the inhibitory neurotransmitter gamma-aminobutyric acid (GABA; e.g., benzodiazepines, gabapentin, valproate, phenobarbital). (3) Block the excitatory neurotransmitter glutamate (e.g. lamotrigine). (4) Blockage of the T type calcium channels (e.g. ethosuximide, pregabalin).",
      "section": "Mechanism of pharmacologic action of anticonvulsants",
      "topic": "Anticonvulsant mechanisms",
      "chunk_summary": "Anticonvulsants primarily work by enhancing inhibitory neurotransmission or reducing excitatory neurotransmission through various mechanisms like blocking sodium channels, enhancing GABA, blocking glutamate, or blocking calcium channels.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "Prenatal exposure to antiepileptic drugs (AEDs) has been associated with an increased risk of congenital malformations. However, the magnitude of the risks and the specific abnormalities vary for each drug [1-3]. In the North American AED Pregnancy Registry, the estimated risk of major malformations overall associated with first trimester exposure ranged from 9.3% for valproate to 2.0% for lamotrigine [4]. The risk of oral clefts was over 10 per 1000 for infants exposed to phenobarbital, valproate or topiramate monotherapies, which is higher than expected based on any reference population (around 1 per 1000) [5,6]. The teratogenicity of valproic acid has been established for three decades [7-9]. It is widely accepted that first trimester exposure to valproic acid increases the risk of neural tube defects from around 1 to 10 per 1000 births [7,8,10-12]. Some studies have also suggested an association with hypospadias [8-12], oral clefts [8,10,12], cardiac septal defects [9-12], and limb defects [11,12]. Other traditional AEDs may increase the risk of malformations two to three times: primidone and its metabolite phenobarbital have been associated with oral clefts, cardiovascular and urogenital defects [13]. Although less common, oral clefts, cardiovascular defects and urogenital defects have also been reported after phenytoin therapy [14,15]. In utero exposure to carbamazepine has been associated with cleft palate [16], neural tube defects [14,16,17] hypospadias and cardiovascular defects [16]. The use of newer AEDs such as lamotrigine, topiramate and levetiracetam has increased in recent years. Studies consistently show a lower risk of malformations overall for lamotrigine than for the traditional AEDs [8,18-20]. However, the risk of oral clefts reported for lamotrigine has ranged from 1.0 to 4.5 per 1000 [4,8,20,21], and whether lamotrigine increases the risk of oral clefts is still under discussion. For topiramate, at least four studies have already suggested an increased risk of oral clefts [22-24]. There is a limited amount of information available for levetiracetam and other new generation AEDs. In summary, most traditional and some new AEDs have been associated with relatively specific defects (i.e. oral clefts, neural tube defects, cardiac defects, and urogenital defects) to different degrees.",
      "section": "Anticonvulsants and major malformations in humans",
      "topic": "AEDs and birth defects",
      "chunk_summary": "Prenatal AED exposure is linked to increased risk of congenital malformations, with varying risks for different drugs; traditional AEDs like valproate are associated with higher risks of neural tube defects and other malformations, while newer AEDs like lamotrigine show lower overall risk but potential for oral clefts.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "Evaluation of the teratogenic effects of AEDs is complicated by the fact that epilepsy itself could potentially increase the risk of birth defects [25,26]. However, the risk of malformations is higher in the offspring of women on AEDs than in those with untreated epilepsy during pregnancy [1,27,28], and women with a history of epilepsy but taking no AED do not have an increased risk of having children with major malformations [29,30]. Although these observations might reflect an effect of disease severity, since epilepsy can seldom remain untreated and untreated women might not be comparable to women on AEDs, they are also compatible with AEDs effects. Moreover, the type of epilepsy and the number of seizures during pregnancy do not affect the risk of malformations [19,27,28,31,32]. In addition, in recent years, several anticonvulsants have been increasingly used as mood stabilizers. Studies that looked at the prevalence of congenital anomalies according to indication (psychiatric vs. neurologic) suggest that the teratogenic effect is probably a drug effect rather than the epilepsy [29,30].",
      "section": "Role of epilepsy",
      "topic": "Epilepsy and birth defects",
      "chunk_summary": "While epilepsy itself might contribute to birth defect risk, studies suggest that AED use, rather than the epilepsy itself, is the primary driver of increased malformation risk in offspring.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "The mechanisms of teratogenicity of AEDs are largely unknown and may be different for different AEDs. One potential mechanism concerns folate. While it is widely accepted that several AEDs produce low folate levels [33,34], and that both low folate levels and AED use correlate with adverse pregnancy outcomes, it is unclear whether AED-induced low folate levels in the mother are themselves responsible for the higher risk of malformations [35]. Several alternative teratogenic mechanisms have been proposed [36], including a direct effect on DNA synthesis of developing cells [27,37], valproate inhibition of cell differentiation and induction of apoptosis through oxidative stress caused by the formation of reactive oxygen species [38], and valproate modification of gene expression through histone deacetylase inhibition [39]. Such a global effect on cell division would explain a broad spectrum of defects associated with prenatal AED exposure. However, AEDs have been associated with relatively specific defects (i.e. oral clefts, NTDs, cardiac defects, and urogenital defects). Intriguingly, all these malformations might be due to alterations in the fusion process of embryonic folds. One likely mechanism mediating these effects concerns interference with the endogenous bioelectric mechanisms guiding embryonic development [40-42]. In addition to action potentials in neurons, slowly changing gradients of resting transmembrane voltage levels are present in all cells. It is now known that these voltage gradients function as instructive cues guiding cell division [43], programmed cell death [44], cell positioning and orientation [45,46], and differentiation [47-49]. More broadly, such bioelectric cues are an important mechanism for orchestrating individual cell behaviors into large-scale patterning programs, and have been implicated in craniofacial development [50,51], left-right patterning of the heart and viscera [52-54], neoplastic transformation [55-58], eye development [59], neuronal patterning [60,61], and other aspects of the control of biological growth and form [62,63]. Any perturbation of ion channel function by pharmacological compounds is likely to disrupt the fine balance of resting potentials that provides positional information and other growth guidance to cells and tissues during embryogenesis [64,65], being especially relevant for actively growing tissues and stem cells [66-68]. Moreover, it has been shown that several neurotransmitters function as regulators of these gradients [69-72], as well as downstream players that transduce voltage changes into regulation of gene expression [73-75]. Thus, drugs that modulate serotonergic and GABA/glycine receptors or transporters may also impact on the developmental outcomes required for normal embryogenesis.",
      "section": "Teratogenic mechanism",
      "topic": "Bioelectric signaling disruption",
      "chunk_summary": "AED teratogenicity may involve disruption of bioelectric signaling, which guides embryonic development through voltage gradients that control cell behavior and patterning; AEDs, by affecting ion channels and neurotransmitters, can disrupt these gradients and lead to malformations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "In a recent study, AED groups associated with the lowest frequency of seizures in the mother, like valproate or phenobarbital, also carried the greatest risk of major malformations in the fetus [4]. Newer drugs, like lamotrigine, seem safer for the fetus but may be less effective to control seizures during pregnancy [76]. The differences in effectiveness observed among the drugs in these non-randomized studies may be due to lack of comparability of treatment groups regarding the underlying indication. Clinicians might keep women of childbearing age on valproate or phenobarbital when they are well controlled and are reluctant to switch and risk seizure recurrence, while newer AEDs could have been prescribed to patients not responding to traditional drugs. In addition, reduced effectiveness in seizure control during pregnancy might be the result of increased clearance or other pharmacokinetic changes associated with gestation, which may be particularly pronounced for specific AEDs. Whatever the explanation might be, it is intriguing that less effective seizure control during pregnancy seemed safer for fetal development.",
      "section": "Effectiveness of specific anticonvulsants preventing seizures during pregnancy",
      "topic": "AED effectiveness and fetal safety",
      "chunk_summary": "AEDs most effective in controlling maternal seizures, like valproate, are associated with higher fetal malformation risks, while less effective drugs appear safer, possibly due to differences in prescribing practices or pharmacokinetic changes during pregnancy.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "Based on these observations, we hypothesize that more successful inhibition of neurotransmission might lead to both better seizure control in the mother and stronger alteration of bioelectrically controlled processes in the embryo that result in structural malformations. This hypothesis is supported on the following premises: (1) through different mechanisms, all AEDs affect neuronal transmission and voltage gradients in non-neuronal cells. (2) Bioelectrical gradients, as well as associated upstream and downstream neurotransmitter-regulated mechanisms, are crucial regulators of patterning in numerous developmental systems, controlling somatic and stem cell behavior, and thus regulating morphogenesis at the tissue and organ levels. (3) Thus, substances that affect neurotransmitters and ion channels could not only reduce neuronal transmission and prevent seizures but also impair developmental events such as axial patterning, visceral organ positioning, neural and vascular network specification, craniofacial morphogenesis, and limb and neural tube patterning.",
      "section": "Hypothesis",
      "topic": "Neurotransmission inhibition and malformations",
      "chunk_summary": "The authors hypothesize that successful neurotransmission inhibition by AEDs, while controlling seizures, may disrupt bioelectric gradients crucial for embryonic development, leading to structural malformations.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "The authors declare that there are no conflicts of interest.",
      "section": "Conflict of interest",
      "topic": "Conflict of Interest",
      "chunk_summary": "The authors declare no conflicts of interest.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "The Transparency document associated with this article can be found in the online version.",
      "section": "Transparency document",
      "topic": "Transparency Document",
      "chunk_summary": "A transparency document is available online.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    },
    {
      "text": "ML gratefully acknowledges support of the NIH (Grants EY018168, AR061988, AR055993, and GM077425), American Heart Association (Established Investigator Grant 0740088N), and the G. Harold and Leila Y. Mathers Charitable Foundation. SHD gratefully acknowledges support of the Agency for Healthcare Research and Quality (AHRQ) (Grant RO1HS018533).",
      "section": "Acknowledgements",
      "topic": "Funding Acknowledgements",
      "chunk_summary": "The authors acknowledge funding support from NIH, American Heart Association, and the Agency for Healthcare Research and Quality.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647.pdf",
      "original_filename": "1-s2.0-S0890623814000653-main_20250812_154805_355391_20250812_204902_386014_d528e385_20250812_213409_172065_d528e385_20250812_220607_538647_extracted_text.txt",
      "authors": "Sonia Hernández-Díaz, Michael Levin",
      "year": "2014",
      "journal": "Reproductive Toxicology",
      "doi": "Unknown"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T22:13:46.693928"
}