{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
    "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
    "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
    "file_size": 25304,
    "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
    "journal": "Journal of Theoretical Biology",
    "doi": "10.1016/j.jtbi.2022.111356",
    "year": "2023",
    "title": "Transplantation of fragments from different planaria: A bioelectrical model for head regeneration",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "Head-tail planaria morphologies are influenced by electric potential differences across the animal's primary axis, as shown by voltage-sensitive dyes and experiments creating 2-headed but genetically wild-type animals. Bioelectrical and biochemical models predicting outcomes in spatial chimeras made by tissue transplantation from different planaria (different species and head shapes) are lacking. This study uses a bioelectrical model to qualitatively describe transplantation effects on regenerated head shape. The model assumes cells may have distinct ion channels and ascribes system outcomes to axial distributions of average cell potentials over morphologically relevant regions. The rationale is that signaling ion and molecule distributions are spatially coupled with multicellular electric potentials, triggering downstream transcriptional events. The study shows that small differences in cell ion channel characteristics can cause noticeable changes in electric potential profiles and morphological deviations, suggesting that small but timely bioelectrical actions may have significant morphological effects. The approach is based on observed relationships between bioelectrical regionalization and biochemical gradients in body-plan studies. Such models are relevant to regenerative, developmental, and cancer biology where cells with distinct properties and morphogenetic target states interact.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in regeneration",
      "chunk_summary": "A bioelectrical model is used to predict head shape regeneration in planaria tissue transplantation, based on the idea that cell potentials influence morphogenesis.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Planarian flatworms regenerate complete worms from fragments, with the mechanisms still under investigation. The number, location, and shape of heads have been studied experimentally and theoretically. Distinct head-tail, no-head, and double-head morphologies are observed by controlling electric potential differences across the anterior-posterior axis, as shown by voltage-sensitive dyes. The functional importance of this bioelectrical prepattern was demonstrated by modulating head number in regenerating fragments through altering ion channel function or gap junctional connectivity.  Different morphologies of planarian heads, brain shapes, and stem cell distributions are obtained after gap junction blocking. Wild-type planaria heads can be remodeled to resemble those of different species by temporarily disturbing intercellular connectivity during regeneration.",
      "section": "Introduction",
      "topic": "Planarian regeneration and bioelectricity",
      "chunk_summary": "Bioelectric signals play a key role in planarian regeneration, influencing head number, shape, and stem cell distribution.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Bioelectric gradients, acting earlier than gene expression and morphogen distribution changes, are proposed as drivers of morphogenetic cues for fragment regeneration. The induced 2-head state is permanent, with fragments continuing to generate 2-headed worms.  Understanding target morphologies produced by independent cell activities requires understanding collective decision-making. Chimerism is a useful strategy for gaining insight into how growth and form depend on cell properties. While molecular steps guiding stem cell differentiation are known, models predicting shapes in chimeric scenarios are lacking. Bioelectrical networks can provide qualitative ideas about system morphology under different constraints. This study uses model simulations to address what happens when mixing cells from different planaria species and head shapes. The aim is to qualitatively describe transplantation effects on regenerated head shape using a bioelectrical perspective, complementary to biochemical and biomechanical descriptions.",
      "section": "Introduction",
      "topic": "Chimerism and bioelectrical modeling",
      "chunk_summary": "Chimerism experiments, combined with bioelectrical modeling, can provide insights into how cell properties influence morphogenesis and regeneration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "The model focuses on cell bioelectrical characteristics of two decapitated flatworm species with distinct head shapes, assuming different gene expressions specific to their morphologies. The cells may have different sets of ion channels and gap junctions. The study analyzes the resulting shape from a heterogeneous mixture by focusing on the bioelectrical software, implemented by multicellular electrical signals controlling large-scale outcomes. The morphological system outcome after transplantation is ascribed to the axial distribution of cell potentials. Steady-state electrical potential profiles are obtained for two decapitated planarians and compared with a chimera where planarian 2's cells are transplanted onto decapitated planaria 1. The deviation of the chimera's bioelectrical profile from planaria 1 is used to predict the transplanted planaria outcome, based on the spatial coupling between signaling ion/molecule distributions and multicellular electric potentials.",
      "section": "Introduction",
      "topic": "Bioelectrical model and transplantation",
      "chunk_summary": "The model predicts the outcome of planaria transplantation by comparing the bioelectrical profiles of the chimera and the original planarian.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "The model assumes head regeneration after transplantation and predicts the final head shape based on deviation criteria for steady-state potential distributions before and after transplantation. This is a simplifying assumption, but numerous mechanisms link bioelectrical cell states to downstream biochemical processes.  Bioelectric state regulates downstream implementation machinery, including biochemical, transcriptional, and biomechanical pathways. The rationale is that multicellular electrical potentials are morphologically instructive and short-term bioelectrical information modulates long-term transcriptional responses due to coupling between electric potential and signaling ion/molecule distributions. While head morphology isn't solely dependent on electric potential, cell potentials significantly influence downstream biochemical and genetic responses in planaria. The model emphasizes bioelectrical pattern dynamics rather than downstream biochemical processes.",
      "section": "Introduction",
      "topic": "Bioelectric signaling and downstream processes",
      "chunk_summary": "The model focuses on bioelectrical signals as drivers of morphogenesis, acknowledging their influence on downstream biochemical and genetic processes.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "The complexity of feedback between transcriptional, mechanical, and electrical processes makes complete biological description difficult. This study focuses on electrical polarity, establishing a minimal bioelectric framework to analyze the chimeric scenario, assuming different head morphologies arise from bioelectrical signals and downstream biochemical processes. In this short-term approach, cell number after transplantation is fixed, and subsequent long-time transcriptional and regeneration processes are ignored.  The experimental outcomes depend on the relative contributions of individual ion channel conductances and intercellular gap junction conductance. From a bioelectrical perspective, multicellular electric patterns control system morphology through interplay between individual cell ion channels (establishing membrane potential difference) and intercellular gap junctions (propagating single-cell states).",
      "section": "Biophysical model",
      "topic": "Model assumptions and framework",
      "chunk_summary": "The model simplifies the complex biological processes by focusing on bioelectrical aspects, assuming fixed cell numbers and ignoring long-term regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "The model includes a multicellular aggregate characterized by single-cell potentials. The electric potential pattern can be visualized using voltage-sensitive dyes. Cell potentials depend on the dynamic current balance modulated by depolarizing and polarizing channels and intercellular currents through gap junctions. The polarizing channel represents all hyperpolarizing channels establishing an effective equilibrium potential, while the depolarizing channel represents all depolarizing channels establishing a different equilibrium potential. These potentials, characterizing polarized and depolarized cell bioelectrical states, depend on external and intracellular ionic concentrations (assumed constant). The model cell capacitance parametrizes cell sensitivity to bioelectrical signals. Simulation conditions are briefly described in the Methods section.",
      "section": "Biophysical model",
      "topic": "Model components and parameters",
      "chunk_summary": "The model incorporates cell potentials, ion channels, gap junctions, and capacitance to simulate bioelectrical signaling in a multicellular aggregate.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Figure 3 shows cell potential distributions for planarias 1 and 2 before and after transplantation. Different axial distributions are assumed for the depolarizing channel conductance of the two planaria types.  Since the cell types have different gene expressions specific to their morphologies, they may have distinct sets of ion channels.  Differences in cell channel characteristics could be qualitative (different genes and protein ion channels) or quantitative (genes with different expression levels). Experimentally, the interplay between two voltage-gated depolarizing channels with different axial localizations influences planarian polarity due to calcium-controlled local gene expression. Deviation criteria are needed to extract morphological consequences from simulations. In biochemical models, instructive information comes from concentration profiles of signaling molecules over morphologically significant regions.  Analogously, the electric potential over the left fragment of the transplanted system is assumed crucial for head development.",
      "section": "Results and discussion",
      "topic": "Cell potential distributions and deviation criteria",
      "chunk_summary": "The model shows different cell potential distributions for the two planaria types and uses the electric potential over the left fragment to predict head development.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Figure 4 shows axial potential profiles and average potentials over the left fragment for different transplantation percentages (relative size of transplanted trunk). The numbers in the panels quantify the deviation between the transplanted planaria and decapitated planaria 1. The deviation index could represent the most probable head outcome or intermediate outcomes. Experimental variability in cutting and transplantation necessitates stochastic characteristics in the mixing zone. The zone characteristics should be approximately specified for comparison between simulations. Different cell concentration distributions in the cross-section are considered, following a linear probability distribution along the mixing zone axis. This stochastic characteristic is shown by different results for four distinct mixing zones at a fixed transplantation percentage. Relative axial potential differences tend to decrease with transplanted percentage due to the increasing number of planaria 2 cells contributing to the potential.",
      "section": "Results and discussion",
      "topic": "Transplantation percentages and stochasticity",
      "chunk_summary": "The model incorporates stochasticity in the mixing zone to account for experimental variability and shows how transplantation percentage influences potential differences.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Figure 5 summarizes Figure 4, estimating deviations between transplanted and planaria 1 heads for different transplanted percentages and intercellular connectivity degrees. Deviations are estimated from the deviation index based on averaged axial potentials over the left region. Deviations increase with transplanted percentage and decrease with aggregate connectivity due to the bioelectrical buffer effect of planaria 1 counteracting the perturbation. The wide range of intermediate percentage deviations in the expected transplanted head suggests probabilities of obtaining planaria 2 morphology or intermediate morphologies. Network effects from gap junction conductance changes can significantly influence system dynamics and morphology outcomes.  Connectivity provided by intercellular junctions can influence planaria head morphology, as shown experimentally and theoretically in junction blocking studies.",
      "section": "Results and discussion",
      "topic": "Deviation estimations and network effects",
      "chunk_summary": "The model predicts a range of possible head morphologies after transplantation, influenced by transplantation percentage and intercellular connectivity.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Planarian head-tail morphologies are influenced by the electric potential difference between axial extremes, as shown by voltage-sensitive dyes and applied field effects. This study used a biophysical approach to describe transplantation effects on head regeneration with different planaria cell types. Focusing on bioelectrical characteristics and assuming distinct ion channel sets in different cells, the study ascribes system outcomes to axial distributions of average cell potentials over morphologically relevant regions. The rationale is that signaling ion/molecule distributions are spatially coupled with multicellular electric potentials, triggering downstream transcriptional events.  Small differences in ion channel characteristics between cells can cause noticeable changes in electric potential profiles and morphological deviations. Local bioelectrical perturbations are the initial step for establishing system outcomes downstream, triggering subsequent biochemical processes leading to the final morphology.",
      "section": "Conclusions",
      "topic": "Bioelectric signaling and morphology",
      "chunk_summary": "Bioelectrical signals, even small differences, play a crucial role in determining planarian head-tail morphology by influencing downstream biochemical processes.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "Even a single ion channel mRNA can induce significant morphogenetic changes like ectopic eye induction or brain defect repair, suggesting small but timely bioelectrical actions can have significant effects. Spatial correlations between neighboring cells are crucial for establishing patterns at both local and system levels. These experimental facts demonstrate the capacity of multicellular systems to transit different configuration spaces and suggest bioelectricity contributes to the combination of plasticity and robustness in morphology. The model simulations have limitations, such as using a small number of cells and not considering the time-dependent regeneration process. Other relevant polarity effects like flow driven by multiciliated epithelium and the nervous system's role are ignored. Despite limitations, this theoretical approach offers testable predictions about morphological outcomes and can be further developed by considering distinct gap junction sets and integrating initial bioelectrical regionalization with subsequent biochemical gradients in body-plan studies.",
      "section": "Conclusions",
      "topic": "Model limitations and future directions",
      "chunk_summary": "While the model has limitations, it provides a framework for understanding morphogenesis and can be further developed by incorporating more complex factors.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Drawing conclusions",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "The simulation used a Voronoi diagram in 2D to construct the cell ensemble, with a 25% randomness in the position of the seed points forming a square grid.  The Voronoi diagram defines cell regions, vertices, and edges, with neighboring cells sharing an edge. The final ensemble is cut from the diagram. Each cell is assigned bioelectrical parameters corresponding to its central position. Initially, the steady-state potential of the isolated single cell is used, selecting the depolarized value in bi-stable regions. Cells are then connected, and the system evolves for 100 times the characteristic bioelectric time (10 s for typical values). Evolution is calculated using a finite-difference scheme with a maximum potential variation and minimum/maximum time steps. Time variation of each cell potential is calculated, and the time step is determined based on the minimum potential variation rate, within defined limits. Time and cell potentials are updated until the desired time is reached.",
      "section": "Methods",
      "topic": "Simulation setup and cell ensemble construction",
      "chunk_summary": "The simulation uses a Voronoi diagram to create a cell ensemble and assigns bioelectrical parameters to each cell, then simulates the system's evolution over time.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    },
    {
      "text": "After reaching the desired time, the head cells (leftmost 20%) are removed, and the system evolves for another 100 characteristic times. Transplantation involves selecting the transplanted zone by the trunk cut-off position. The zone is divided into two sections based on the average cell axial position. Cells from the donor replace receiver cells if their axial position is less than 5% of the ensemble length before the cut-off. In the mixing zone (5% before and after the cut-off), transplantation occurs probabilistically based on a random number and the cell's axial position. After transplantation, ensemble 1 evolves for another 100 characteristic times. Each transplantation is unique due to random number generation. The average potential profile is calculated by dividing the decapitated ensemble length into 100 sections and averaging cell potentials within each section. The mean value for the deviation index is obtained by averaging potentials of cells within the initial 10% of the decapitated ensemble.",
      "section": "Methods",
      "topic": "Transplantation procedure and potential profile calculation",
      "chunk_summary": "The methods section details the transplantation procedure, including the mixing zone and probabilistic cell replacement, and how the average potential profile is calculated.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493.pdf",
      "original_filename": "1-s2.0-S0022519322003472-main_1122940d_20250812_222107_629493_extracted_text.txt",
      "authors": "Javier Cervera, José A. Manzanares, Michael Levin, Salvador Mafe",
      "year": "2023",
      "journal": "Journal of Theoretical Biology",
      "doi": "10.1016/j.jtbi.2022.111356"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T22:33:50.898283"
}