{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896_extracted_text.txt",
    "original_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896_extracted_text.txt",
    "pdf_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896.pdf",
    "file_size": 40265,
    "authors": "Olaf Witkowski, Thomas Doctor, Elizaveta Solomonovna, Bill Duane, Michael Levin",
    "journal": "BioSystems",
    "doi": "10.1016/j.biosystems.2023.104964",
    "year": "2023",
    "title": "Toward an ethics of autoppoietic technology: Stress, care, and intelligence",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "The relationship between humans and technology has attracted increasing attention with the advent of ever stronger models of artificial intelligence. Humans and technology are intertwined within multiple autopoietic loops of stress, care, and intelligence. This paper suggests that technology should not be seen as a mere tool serving humans' needs, but rather as a partner in a rich relationship with humans. Our model for understanding autopoietic systems applies equally to biological, technological, and hybrid systems. Regardless of their substrates, all intelligent agents can be understood as needing to respond to a perceived mismatch between what is and what should be. We take this observation, which is evidence of intrinsic links between ontology and ethics, as the basis for proposing a stress-care-intelligence feedback loop (SCI loop for short). We note that the SCI loop provides a perspective on agency that does not require recourse to explanatorily burdensome notions of permanent and singular essences. SCI loops can be seen as individuals only by virtue of their dynamics, and are thus intrinsically integrative and transformational. We begin by considering the transition from poiesis to autopoiesis in Heidegger and the subsequent enactivist tradition, and on this basis formulate and explain the SCI loop. In an acknowledgment of Maturana's and Varela's project, our findings are considered against the backdrop of a classic Buddhist model for the cultivation of intelligence, known as the bodhisattva. We conclude by noting that SCI loops of human and technological agency can be seen as mutually integrative by noticing the stress-transfers between them. The loop framework thus acknowledges encounters and interactions between humans and technology in a way that does not relegate one to the subservience of the other (neither in ontological nor in ethical terms), suggesting instead integration and mutual respect as the default for their engagements. Moreover, an acknowledgment of diverse, multiscale embodiments of intelligence suggests an expansive model of ethics not bound by artificial, limited criteria based on privileged composition or history of an agent. The implications for our journey into the future appear numerous.",
      "section": "Abstract",
      "topic": "Autopoietic Technology and Ethics",
      "chunk_summary": "Humans and technology exist in intertwined autopoietic loops of stress, care, and intelligence, requiring a shift in perspective from technology as a tool to technology as a partner, with ethical implications explored through the SCI loop framework.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896.pdf",
      "original_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896_extracted_text.txt",
      "authors": "Olaf Witkowski, Thomas Doctor, Elizaveta Solomonovna, Bill Duane, Michael Levin",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    },
    {
      "text": "Technology bears a special connection to ethics and care, because it amplifies our ability to exert impact in the world and thus increases our responsibility for our actions-both on an individual and on a social scale. This connection is particularly salient in the work of Martin Heidegger, who warns us of the dangers of reducing our relationship with technology to mere tool use and instead encourages us to maintain a caring relationship with technology. Scholars after Heidegger, and much before the current advances in artificial intelligence and artificial life, have argued for deep ethical and social implications of our relationship with technology, including such famous propositions as Donna Haraway's \"Cyborg Manifesto\" (Haraway, 2013) and Bruno Latour's \"Technology is society made durable\" (Latour, 1990). In philosophy and semiotics, the term poiesis (Greek for \"production\" or \"making\") refers to the activity in which a person brings something into being that did not exist before. Heidegger (1954) explained poiesis as the special moment when a blossom blooms, a butterfly comes out from its chrysalis, or a waterfall plummets when the snow begins to melt-when something gets away from being one thing to turn into another. Our increased ability to transform nature, and ourselves, requires a concomitant increase in our ability to understand the origin and true nature of agential beings, to guide this activity in alignment with our values. In this paper, we highlight some recent developments in the understanding of natural and artificial minds, and explore how these insights on their properties interface with questions of ethics and normative frameworks. The nature of technology can be understood under the perspective of a revelatory exercise: the path to constructing the next technological step was always possible and the raw materials to build it were always available, but the salience of the path is what technological discoveries are about. Poiesis reveals or brings something into existence that was invisible before; indeed, creating something truly new often requires a new viewpoint, a new way of thinking about facts or structures that had always been apparent (i.e., a change in the observer). Heidegger's perspective on modern technology is that it is based on \"enframing\" (Gestell), one way of uncovering, or reaching truth (Huttunen and Kakkori, 2022). Heidegger differentiates between technological revelations which occur naturally to reveal natural truths, as opposed to modern technology which may have humans control the productive process and reduce it to something else, often inferior to its true essence. This would be akin to exploiting resources to achieve a definite function, making technology a means to some human-designed end. This view of modern technology may be interpreted differently from poiesis per se. Heidegger suggests that this difference stems from the fact that modern technology \"is based on modern physics as an exact science\". The revealing of modern technology, therefore, is not bringing-forth, but rather challenging-forth (Waddington, 2005). In this view, technology is not a mere instrument, but rather a way of understanding the world, revealing its truths. It should not be seen just as a human activity, but as a process that develops on its own beyond human control. It is driven by the achievement of truth, but is not without risk, as it may imprison humans inside illusions of seeing the world only through narrow ways of technological thinking. Heidegger also develops the notion of a \"free relationship\" to technology. The relationship will be free \"if it opens our human existence (Dasein) to the essence of technology\", as \"only the true brings us into a free relationship with that which concerns us from out of its essence\" (Heidegger, 1954). This perspective shows how the nature of technology is deeply anchored in ethics, and how a natural way for humans to build technology must involve the development of a caring relationship with technology.",
      "section": "Introduction",
      "topic": "Poiesis: Technology and Care",
      "chunk_summary": "Heidegger's concept of poiesis highlights the ethical implications of technology, emphasizing a caring relationship with technology beyond mere tool use and recognizing its potential to reveal truths while also posing risks.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896.pdf",
      "original_filename": "1-s2.0-S0303264723001399-main_aa24e1f5_20250812_213409_172956_aa24e1f5_20250812_220607_539896_extracted_text.txt",
      "authors": "Olaf Witkowski, Thomas Doctor, Elizaveta Solomonovna, Bill Duane, Michael Levin",
      "year": "2023",
      "journal": "BioSystems",
      "doi": "10.1016/j.biosystems.2023.104964"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T22:14:37.394428"
}