{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
    "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
    "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
    "file_size": 30747,
    "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
    "journal": "Information Sciences",
    "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017",
    "year": "2017",
    "title": "Modeling regenerative processes with membrane computing",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "Understanding the remarkable ability of some organisms to restore their anatomical shape following the amputation of large parts of their bodies is currently a major unsolved question in regenerative biology and biomedicine. Despite rapid advances in the molecular processes required for regeneration, a systems level, algorithmic understanding of this process has remained elusive. For this reason, the field needs new computational paradigms to help model the flow of information during regeneration. Membrane computing is a branch of natural computing that studies the properties and applications of theoretical computing devices known as P systems. These systems are an abstraction of the structure and functioning of a living cell, as well as its organization in tissues. Here, we propose a model of regenerative processes in planarian worms based on P systems, which recapitulates several aspects of regenerative pattern regulation. Our results demonstrate that it is possible to apply a novel computational framework to help understand pattern regulation in regenerative biology.",
      "section": "Abstract",
      "topic": "Regenerative P systems",
      "chunk_summary": "A novel computational model based on P systems is proposed to understand regenerative pattern regulation in planarian worms.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "Membrane computing is a branch of natural computing introduced by Păun in 1998. This discipline studies the properties and applications of theoretical computing devices known as P systems, which are an abstraction of the structure and functioning of a living cell, as well as its organization in tissues and other higher-order structures. A P system defines a structure consisting of a graph of interconnected compartments, which are symbolic entities that could represent biological cells or groups of cells in an organism. Each compartment contains a multiset of objects, which may be molecules with potentially different electrical charges. There are rules that dictate how objects are created, removed, or migrate across compartments and during a computation, objects are processed by means of rewriting rules. P system rules are abstractions of the biochemical and electrical reactions that occur inside living cells. Objects can move between two compartments if there exists an edge or link that connects the two compartments. This represents the biological signaling that occurs between two cellular entities. Spurred by the success of membrane computing as a modeling framework, we propose herein a new class of P systems called regenerative P systems. This computational framework provides a mathematical formalism to model regenerative processes in biological organisms.",
      "section": "Introduction",
      "topic": "Membrane Computing and P Systems",
      "chunk_summary": "P systems, inspired by the structure and function of living cells, offer a computational framework for modeling biological processes, including regeneration.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "One of the major unsolved questions facing basic biology and biomedicine today is understanding the remarkable ability of some organisms to restore their anatomical shape following amputation of large portions of their bodies. For example, salamanders can regenerate their limbs, eyes, jaws, hearts, and portions of the brain. Understanding shape homeostasis and restoration is critical, not only for advances in regenerative medicine, but also for fundamental issues in developmental biology and evolution. While much progress has been recently made in identifying the molecular signaling required for regeneration, we are still very far from understanding the control of shape. The molecular details are becoming clearer, but the information flow, computation, and control policies for organizing cell behaviors towards large-scale anatomical outcomes are largely unknown.",
      "section": "Introduction",
      "topic": "Regeneration and Shape Control",
      "chunk_summary": "Understanding the control of shape during regeneration remains a major challenge, despite advances in identifying molecular signaling pathways.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "Planaria are a powerful model system in this field, because they can regenerate every part of their bodies. We need to develop computational models that can explain how regeneration creates exactly what is missing, in the right location, and stops when the target morphology has been achieved. Several types of models have been proposed, yet constructive models are important to explore. These models show the sufficient steps to restore pattern, not only pathways of events necessary for regeneration. This is largely an unexplored field, and we are still groping for the correct formalism and appropriate data representation for such models and the algorithms they implement.",
      "section": "Introduction",
      "topic": "Planarian Regeneration and Computational Models",
      "chunk_summary": "Planarians, capable of regenerating any body part, require constructive computational models to understand the control mechanisms of pattern restoration.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "To enrich the field of possibilities, and introduce biologists to another way to think about the controls of pattern regulation, we present here a model of planarian regeneration based on P systems. A number of modeling formalisms have been attempted in planaria; however, P systems have not been investigated in this context. We decided to select membrane computing as our modeling framework for regenerative processes because of its biologically-relevant properties. The explicit spatial structure of compartments in P systems facilitates the abstraction of morphological regions in regenerative biological organisms. Furthermore, the intercellular communication and signaling through proteins, small molecules, or biophysical phenomena essential to regeneration can be mathematically modeled with signals and objects between the compartments.",
      "section": "Introduction",
      "topic": "P Systems for Planarian Regeneration",
      "chunk_summary": "P systems are proposed as a suitable framework for modeling planarian regeneration due to their ability to represent spatial structure and intercellular signaling.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "Our model of regeneration can be easily extended by quantizing these signals in packages. This permits us to model the magnitude of these cellular signals as the difference in the number of objects of a given class. In addition, the modular property of P systems permits us to bundle any specific aspect of regenerative processes into a subset of rules. These rules can then be modified without affecting the overall dynamics of the model. For example, the specific signaling mechanisms for regenerating the brain and eyes can be modeled with an isolated set of rules without interferences with other aspects of the model. In our proposed model, the flatworm morphology is represented as a rectangular compartment grid. Each compartment represents a morphological region, and each region belongs to one of the following parts in the morphology: head, trunk or tail. Signals can be sent between two compartments as long as there exists a link between them. We use objects to express the membership of a compartment to a worm region and to represent organs inside these regions. We also use links to denote communication between compartments. Our model aims to reproduce molecular and electrical signals sent between cells at a local level, which eventually configure emergent morphologies. This modeling approach bears some resemblance to peer-to-peer networks. In both frameworks, a consensus system behavior emerges from the pairwise communication between nodes. In fact, fault diagnosis of electrical and computer networks has been successfully modeled using P systems. We have tested our modeling framework with a set of planarian in silico experiments that recapitulate the resultant phenotypes observed in vivo.",
      "section": "Introduction",
      "topic": "Model Design and Features",
      "chunk_summary": "The proposed model uses a rectangular grid of compartments to represent flatworm morphology, with objects representing signals and organs, and links representing communication between compartments.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "Section 2 introduces regenerative P systems as a new class of membrane computing devices. In Section 3, the model is described and its behavior is explained. Section 4 simulates the model for several scenarios, encompassing interesting case studies. Section 5 compares the model predictions in these scenarios with experimental results. Finally, our conclusions are reported in Section 6.",
      "section": "Introduction",
      "topic": "Paper Organization",
      "chunk_summary": "The paper outlines the introduction of regenerative P systems, model description, simulations, comparison with experimental results, and conclusions.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    },
    {
      "text": "In this section, we propose a novel framework named regenerative P systems to model biological regeneration processes. This framework is mainly inspired by kernel P systems, a previous approach in membrane computing. Prior to defining the framework, we describe some preliminary concepts as defined in [18]: An alphabet Γ is a non-empty set whose elements are called symbols. Likewise, a multiset w over an alphabet Γ is a pair w = (Γ, f) where f: Γ→ ℕ is a mapping. For each x ∈ Γ we say that f(x) is the multiplicity of the symbol x in w. If w = (Γ, f) is a multiset, then its support is defined as supp(w) = {x ∈ Γ | f(x) > 0}. A multiset is finite if its support is a finite set. A set is a multiset such that the multiplicity of each element of its support is greater or equal to 1, that is, the multiset can contain more than one object of the same class.",
      "section": "Regenerative P systems",
      "topic": "Preliminary Concepts",
      "chunk_summary": "This section introduces the concept of regenerative P systems for modeling biological regeneration, drawing inspiration from kernel P systems and defining preliminary concepts like alphabets and multisets.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003.pdf",
      "original_filename": "1-s2.0-S0020025516318187-main_7938abb5_20250812_222107_617003_extracted_text.txt",
      "authors": "Manuel Garcia-Quismondo, Michael Levin, Daniel Lobo",
      "year": "2017",
      "journal": "Information Sciences",
      "doi": "http://dx.doi.org/10.1016/j.insci.2016.11.017"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T22:31:13.571154"
}