{
  "file_metadata": {
    "text_file": "data/transformed_data/text_extraction/pdf_20250812_171154_530835_extracted_text.txt",
    "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
    "pdf_filename": "pdf_20250812_171154_530835.pdf",
    "file_size": 30866,
    "authors": "Maria Lobikin, Michael Levin",
    "journal": "Unknown",
    "doi": "Unknown",
    "year": "2015",
    "title": "Endogenous bioelectric cues as morphogenetic signals in vivo",
    "confidence_score": 0.5,
    "document_type": "scientific_paper"
  },
  "chunks": [
    {
      "text": "Complex pattern formation requires mechanisms to coordinate individual cell behavior towards the anatomical needs of the host organism. Alongside the well-studied biochemical and genetic signals functions an important and powerful system of bioelectrical communication. All cells, not just excitable nerve and muscle, utilize ion channels and pumps to drive standing gradients of ion content and transmembrane resting potential. In this chapter, we discuss the data that show that these bioelectrical properties are key determinants of cell migration, differentiation, and proliferation. We also highlight the evidence for spatio-temporal gradients of transmembrane voltage potential as an instructive cue that encodes positional information and organ identity, and thus regulates the creation and maintenance of large-scale shape. In a variety of model systems, it is now clear that bioelectric prepatterns function during embryonic development, organ regeneration, and cancer suppression. Moreover, genetic and pharmacological modulation of the prepatterns resident in physiological networks is a powerful modality for controlling growth and form. Recent data have revealed the mechanisms by which voltage gradients are transduced into downstream transcriptional cascades. Thus, mastery of the endogenous bioelectrical signaling pathways will have transformative implications for developmental biology, regenerative medicine, and synthetic bioengineering.",
      "section": "Abstract",
      "topic": "Bioelectric signaling in morphogenesis",
      "chunk_summary": "Bioelectric signaling, involving ion channels, pumps, and transmembrane voltage gradients, plays a crucial role in cell behavior, pattern formation, and organ identity during development, regeneration, and cancer suppression.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Understanding the mechanisms by which cell-to-cell communication and large-scale pattern formation are coordinated in the developing embryo is of high priority to developmental biology, regenerative medicine, and oncology. Alongside well-characterized biochemical modes of cellular communication that regulate cellular behavior during pattern formation there exists an important and powerful signaling system that is only now beginning to be understood and integrated with canonical biochemical and genetic pathways (Adams & Levin, 2013). This system of information exchange functions through bioelectrical mechanisms.",
      "section": "Introduction",
      "topic": "Bioelectricity in development",
      "chunk_summary": "Bioelectrical signaling is a crucial but understudied mechanism for cell communication and pattern formation in development, regeneration, and cancer.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Bioelectricity, in general, refers to signals carried by voltage gradients, ion flows and electric fields that all cells receive and generate. Bioelectricity is most well known in the context of neuronal excitation in which rapid changes in transmembrane potential (Vmem) give rise to rapid action potentials. However, long-term, steady state ion fluxes, electric fields, and pH gradients are present in all cells and across epithelial sheets. At the cellular level, transmembrane potentials result from the presence of ion channels and pumps within cell membranes that function to segregate ions in differing concentrations internally and externally. This segregation of charges gives rise to transmembrane voltage potentials, usually on the order of -50 mV. It is becoming increasingly clear that these bioelectric parameters serve functional roles in signaling pathways that control cell proliferation, differentiation and migration. Thusly, understanding how these mechanisms function is of high priority to developmental biology, regenerative medicine and cancer research. In complement to other work on electromagnetic radiation and other biophysical properties of cells, this chapter focuses on the endogenous patterning roles and signaling mechanisms of spatially-distributed and slowly-varying (resting) transmembrane potentials in living tissues.",
      "section": "Introduction",
      "topic": "What is bioelectricity?",
      "chunk_summary": "Bioelectricity encompasses voltage gradients, ion flows, and electric fields generated by all cells, playing a crucial role in cell behavior and pattern formation.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "None",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The study of bioelectricity began long ago. Original experiments date back to the 17th century to experiments done by the Dutch biologist and microscopist Jan Swammerdan who believed that muscle contraction was caused by the flow of ‘animal spirits' (Cobb, 2002). Swammerdan placed frog muscle into glass vessels and observed that physically irritating nerves with scissors or another instrument caused the muscles to contract. However, it wasn't until the 18th century that evidence of 'animal electricity' was procured by the Italian physicist and physician, Luigi Galvani (McCaig et al, 2005). In his famous experiments in the late 1700's, Galvani observed that extracted frog muscles would twitch when exposed to currents produced during lightning storms. Galvani believed that the activation of these muscle movements was generated by electrical fluid carried to the muscles by nerves. This phenomenon was termed ‘Galvanism', and is credited with being the underpinnings to the modern study of electrophysiology (Bresadola, 1998). Galvani fought most of his life to persuade skeptical colleagues that 'animal electricity' was a reality and it wasn't until some 75 years later that modern experimental electrophysiology was launched by Emil du Bois-Reymond's Researches on Animal Electricity (Abbott, 2008).",
      "section": "Introduction",
      "topic": "History of bioelectricity",
      "chunk_summary": "Early studies of bioelectricity, from Swammerdan's \"animal spirits\" to Galvani's \"animal electricity,\" laid the foundation for modern electrophysiology.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Further experimentation conducted in the 19th century implicated electrical potentials in the process of wound healing. In 1831, Matteucci demonstrated the existence of action potentials in nerve and muscle cells for the first time by measuring injury potentials at cut ends using a galvanometer (McCaig et al, 2005). Injury potentials are now known to be a steady state, long-lasting direct current (DC) voltage gradient induced within the extracellular and intracellular spaces by current flowing into and around an injured nerve. Emil du-Bois Reymond built upon the initial observations of Matteucci by measuring current flowing out of a cut on his finger. This flow of current is due to the short-circuiting of the transepithelial potential (TEP) difference that occurs at a skin lesion (the TEP drives charged ions through the wound because the gap in the epithelium forms a low-resistance path for current flow). Human skin, as well as that of guinea pigs and amphibians, maintains a TEP across epithelial layers. When the skin is cut, a large, steady electric field (EF) arises immediately and persists for hours at the wound edge, as current pours out the lesion from underneath the wounded epithelium. This injury current is known to be essential for the regeneration of new limbs, where currents between 10 and 100 µA/cm² create a steady voltage drop of roughly 60 mV/mm within the first 125 µm of extracellular space (McCaig et al, 2005; McCaig et al, 2009). Transcellular currents are also known to drive development and morphology. Elmer Lund carried out extensive research on electrical potentials between in the 1920s and 30s, arguing that electrical patterns are intimately related to the morphogenetic processes and vector properties of cell and tissue functions (Harold, 1982; Lund, 1947). The modern reformulation of these ideas is largely due to the work of Lionel Jaffe and his colleagues (done some 30 years later), demonstrating that electrical properties of individual cells, epithelial sheets, neural structures and limbs were necessary for growth and proper pattern and polarity establishment (Jaffe, 1981; Jaffe & Nuccitelli, 1977).",
      "section": "Introduction",
      "topic": "Bioelectricity in wound healing",
      "chunk_summary": "19th-century research revealed the role of electrical potentials, particularly injury currents and transepithelial potentials, in wound healing and regeneration.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Several key aspects demarcate modern studies of bioelectricity from its foundations. First is an increased appreciation of spatial distribution of resting potentials. While classical works focused on electric fields and ion fluxes (mostly due to epithelia) (Borgens, 1982; Borgens, 1983; Nuccitelli, 1987; Nuccitelli et al, 1986; Robinson & Messerli, 1996; Shi & Borgens, 1995a), we now know that the spatial organization of plasma membrane voltage levels across tissues and organs carries vital patterning information that drives anatomy (Levin, 2012a). Secondly, techniques are now available for the molecular characterization of the mechanisms that both produce and respond to these gradients (Zhao et al, 2006). Together with traditional techniques such as physiological measurements and applied fields, endogenous gradients can now be manipulated with tight spatio-temporal specificity at the molecular level, via the genetic modulation of well-characterized channels and pump proteins (Adams & Levin, 2012). Thus, in addition to functional data on the electric properties themselves, the source and downstream effectors of changes in Vmem can now be dissected in great detail; for the first time, the patterning information encoded within dynamic bioelectrical networks are being integrated with well-known biochemical cascades and gene-regulatory networks. The results of these efforts reveal that embryonic patterning, regenerative repair and the suppression of cancerous disorganization all require continuous signal exchange between cells, tissues and organ systems (Adams, 2008; Levin, 2009).",
      "section": "Introduction",
      "topic": "Modern bioelectricity research",
      "chunk_summary": "Modern bioelectricity research focuses on the spatial distribution of resting potentials and their molecular mechanisms, integrating bioelectrical networks with biochemical and genetic pathways.",
      "position_in_section": "End",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "The sources of endogenous bioelectric signals are shown in Fig. 1. Modern experimental techniques to probe animal electricity have come a long way since Galvani first made dead frog muscle twitch by applying an electric current to a nerve. Using standard techniques of molecular genetics, we can now target the expression patterns of ion channels and transporters for rational modulation. The use of knockout, RNAi, or morpholinos (antisense oligonucleotides to target specific mRNA sequences) allows gene-specific loss-of-function experiments. Pharmacological blockade, while not as specific as molecular approaches, offers the benefits of temporal control of inhibition, as well as the ability to target whole groups of ion channels or pumps at once - an important feature given that multiple ion translocators of the same family are often co-expressed and can compensate for each other, thus masking important phenotypes in gene-targeting experiments (Blackiston et al, 2009).",
      "section": "Methods",
      "topic": "Experimental techniques",
      "chunk_summary": "Modern techniques, including molecular genetics and pharmacology, enable precise manipulation of ion channels and transporters to study bioelectric signals.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "In the past decade, much work has begun to identify the endogenous ion conductances that are responsible for important patterning events, and the mechanisms by which cells can translate these signals into known gene regulatory networks (Levin, 2009). Conversely, exogenous ion channels or pumps can be introduced into cells and thus allow predictable changes in transmembrane potential to reveal gain-of-function phenotypes. These techniques have now been used in numerous model species to show that endogenous bioelectric gradients are among the most important sources of morphogenetic information *in vivo* (Adams & Levin, 2012a; Levin, 2012a; Levin & Stevenson, 2012; McCaig et al, 2009; Pai et al, 2012).",
      "section": "Methods",
      "topic": "Manipulating bioelectric gradients",
      "chunk_summary": "Manipulating endogenous and exogenous ion channels and pumps allows researchers to study the role of bioelectric gradients in morphogenesis.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Describing prior work",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "Morphogenesis broadly defined is the dynamic process by which the geometry and topology of complex biological structures is established. This occurs during embryogenesis, but is also important during remodeling and regeneration during adulthood. The establishment and maintenance of shape on many scales (cells, tissues, organs, and entire bodyplans) is regulated by a number of epigenetic factors controlling gene expression. Cells with different membrane and cytoplasm properties, but with identical DNA complements must consistently form and maintain various embryonic and adult structures. It has long been known that voltage gradients can mediate some of the necessary long-range communication through endogenous electric fields (Jaffe, 1981; Jaffe & Nuccitelli, 1977; Nuccitelli, 1988). More recent work has shown that targeted perturbation of transmembrane voltage results in specific, coherent changes of large-scale patterning. Remarkably, modulation of resting potential does not in itself impair embryonic viability, and it is often possible to dissociate subtle patterning functions of bioelectric states from basic housekeeping physiology of cells. Thus, Vmem levels in key groups of cells have been implicated in controlling the head-to-tail (Beane et al, 2011) and left-right (Aw et al, 2010) body axis polarity, the patterning of craniofacial structures (Vandenberg et al., 2011), the induction of eye development (Pai et al, 2012), and the initiation of *Xenopus* tail regeneration (Adams et al, 2007; Tseng et al., 2011).",
      "section": "Results",
      "topic": "Vmem and morphogenesis",
      "chunk_summary": "Transmembrane voltage (Vmem) plays a crucial role in morphogenesis, regulating large-scale patterning and specific cell behaviors without necessarily affecting basic cell physiology.",
      "position_in_section": "Beginning",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    },
    {
      "text": "One example of how Vmem values regulate the behavior of key cell populations *in vivo* is demonstrated by the discovery of a set of cells in the frog embryo that can confer a neoplastic-like phenotype upon stem cell derivatives, resulting in an embryo-wide ‘hyperpigmentation' phenotype (Blackiston et al., 2011). The expression of the glycine-gated chloride channel (GlyCl) demarcates a widely, yet sparsely distributed cell population that can be specifically targeted by exposing embryos to the potent GlyCl channel agonist, ivermectin (Ottesen & Campbell, 1994). Then, controlling the extracellular concentrations of chloride in accordance to the Goldman equation, the membrane potential of GlyCl-expressing cells can be specifically modulated to known levels (and monitored with voltage-reporting fluorescent dyes). When depolarized, these GlyCl-expressing cells instruct, over a significant distance (mediated by regulation of serotonin signaling), the neural crest cell-derived melanocytes to undergo a neoplastic-like conversion acquiring three major properties commonly associated with metastasis: they hyperproliferate, become highly invasive, and undergo a change in shape, as well as up-regulating genes associated with neoplasia - SLUG and Sox10 (Morokuma et al, 2008). Crucially, this metastasis-like phenotype can be reproduced by misexpressing mRNAs encoding sodium, potassium, or proton transporters, and can be rescued by the simple manipulation of extracellular ion content or through misexpression of opposing (hyperpolarizing) channels that drive the bioelectric state of the instructing cells back to normal. Together these data demonstrate that the control of instructor cell-derived signaling is driven by voltage *per se*, not necessary any one specific channel protein or type of ion.",
      "section": "Results",
      "topic": "Vmem and hyperpigmentation",
      "chunk_summary": "Depolarization of specific GlyCl-expressing cells in frog embryos induces a neoplastic-like phenotype in melanocytes, demonstrating Vmem's role in regulating cell behavior.",
      "position_in_section": "Middle",
      "certainty_level": "High",
      "citation_context": "Presenting new results",
      "page_number": null,
      "pdf_filename": "pdf_20250812_171154_530835.pdf",
      "original_filename": "pdf_20250812_171154_530835_extracted_text.txt",
      "authors": "Maria Lobikin, Michael Levin",
      "year": "2015",
      "journal": "Unknown",
      "doi": "Unknown"
    }
  ],
  "gemini_response": "",
  "processed_at": "2025-08-12T17:16:16.651165"
}