{
  "chunk_id": "FzFFeRVEdUM_chunk_022",
  "text": "This is completely novel. They have novel capabilities. Half of their genome is expressed differently. So each one of these red dots is a gene that it expresses differently than it would have if it had stayed in your airway, okay? So about half the genome, 9,000 genes, are completely altered because the genetics doesn't drive what you are. The genetics is a resource book that active systems dip into as affordances. And one of the cool things they can do is if you, if you played a bunch of human neurons and you put a big scar, a big wound through them here, right? This, this big wound, the bots will gather together into what we call a super bot cluster. And what they do is start knitting the two sides together. And here you can see when you take it off, you can see what happened. Who would have thought that your tracheal cells that sit there quietly for long periods of time, just dealing with mucus and whatnot, have the ability to self assemble into a novel proto organism with its own life, with its own gene expression, with its own set of behaviors and these kind of capabilities that we're only now beginning to scratch the surface of, because this is going to be personalized in the body therapeutics, right? These biobots made of your own cells don't need immune Suppression, you can put them back in the body and. And we're now working up the full list of what they can actually repair.",
  "token_count": 258,
  "sentence_count": 15,
  "start_sentence": 22,
  "end_sentence": 36,
  "start_time_ms": 1255820,
  "end_time_ms": 1328380,
  "start_time_seconds": 1255.82,
  "end_time_seconds": 1328.38,
  "primary_topics": [
    "Biobots",
    "Gene Expression",
    "Cellular Self-Assembly",
    "Genome Alteration",
    "Therapeutic Applications"
  ],
  "secondary_topics": [
    "Personalized Therapeutics",
    "Immune Suppression",
    "Active Systems",
    "Tracheal Cells",
    "Neurons",
    "Wound Healing",
    "Proto Organism",
    "Cellular Behavior"
  ],
  "key_terms": [
    "Genome",
    "Affordances",
    "Super bot cluster",
    "Proto organism",
    "Biobots",
    "Gene expression",
    "Immune Suppression"
  ],
  "content_summary": "The presentation discusses the development and capabilities of biobots, which are self-assembled from tracheal cells and express half of their genome differently. These biobots have the potential to repair wounds, such as in neurons, without the need for immune suppression, indicating potential for personalized therapeutics.",
  "scientific_domain": "Developmental Biology, Bioelectricity",
  "enhanced": true
}