{
  "chunk_id": "FzFFeRVEdUM_chunk_011",
  "text": "So when you look at this kind of dissociation, there are many things that we learned here about split brain patients, dissociative identity disorders and so on. And what's actually happening in this process that's really interesting is the scaling of goals. So I coined this thing called a cognitive light cone, which is basically meant to be the boundary of the self. It's meant to be the thing that distinguishes a self from the outside world. And what it is is the scale of the largest goal you can pursue. So again, not the range of your senses, not the reach of your effectors, but the size of the largest goal state you can remember and you can pursue. In single cells, they have tiny little goals, they have short memories, short anticipatory power in the future. And their goals are things like this, like ph. They're scalars, they're single numbers about things like ph within the cell.",
  "token_count": 159,
  "sentence_count": 9,
  "start_sentence": 11,
  "end_sentence": 19,
  "start_time_ms": 695300,
  "end_time_ms": 742760,
  "start_time_seconds": 695.3,
  "end_time_seconds": 742.76,
  "primary_topics": [
    "Dissociation in biological systems",
    "Concept of self in biological entities",
    "Scaling of goals in biological systems",
    "Cognitive light cone"
  ],
  "secondary_topics": [
    "Split brain patients",
    "Dissociative identity disorders",
    "Cellular goals",
    "Cellular memory",
    "Anticipatory power in cells",
    "Scalar goals in cells",
    "Cellular pH"
  ],
  "key_terms": [
    "Dissociation",
    "Split brain",
    "Dissociative identity disorders",
    "Cognitive light cone",
    "Scaling of goals",
    "Cellular memory",
    "Anticipatory power",
    "Scalar goals",
    "Cellular pH"
  ],
  "content_summary": "The presentation discusses the concept of dissociation in biological systems, introducing the idea of a 'cognitive light cone' as the boundary of self. It explores the scaling of goals in biological entities, from split-brain patients to single cells, emphasizing that the size of the largest goal state one can remember and pursue defines the self.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Cognitive Biology",
  "enhanced": true
}