{
  "chunk_id": "FzFFeRVEdUM_chunk_011",
  "text": "So when you look at this kind of dissociation, there are many things that we learned here about split brain patients, dissociative identity disorders and so on And what's actually happening in this process that's really interesting is the scaling of goals So I coined this thing called a cognitive light cone, which is basically meant to be the boundary of the self It's meant to be the thing that distinguishes a self from the outside world And what it is is the scale of the largest goal you can pursue So again, not the range of your senses, not the reach of your effectors, but the size of the largest goal state you can remember and you can pursue In single cells, they have tiny little goals, they have short memories, short anticipatory power in the future And their goals are things like this, like ph They're scalars, they're single numbers about things like ph within the cell",
  "token_count": 159,
  "sentence_count": 9,
  "start_sentence": 11,
  "end_sentence": 19,
  "start_time_ms": null,
  "end_time_ms": null,
  "start_time_seconds": null,
  "end_time_seconds": null,
  "primary_topics": [
    "Dissociation",
    "Split Brain Patients",
    "Dissociative Identity Disorders",
    "Cognitive Light Cone",
    "Scaling of Goals"
  ],
  "secondary_topics": [
    "Boundary of the Self",
    "Goal State Memory",
    "Single Cell Goals",
    "Cellular Memory",
    "Cellular Anticipatory Power",
    "Scalar Goals",
    "Cellular pH"
  ],
  "key_terms": [
    "Dissociation",
    "Split Brain",
    "Dissociative Identity Disorders",
    "Cognitive Light Cone",
    "Scaling",
    "Self",
    "Goal State",
    "Single Cells",
    "Memory",
    "Anticipatory Power",
    "Scalars",
    "pH"
  ],
  "content_summary": "The presentation discusses the concept of dissociation, particularly in split brain patients and those with dissociative identity disorders. A key concept introduced is the 'Cognitive Light Cone', which represents the boundary of the self and is determined by the scale of the largest goal one can pursue. The speaker also discusses the goals and anticipatory power of single cells, using cellular pH as an example of a scalar goal.",
  "scientific_domain": "Developmental Biology, Bioelectricity, Cognitive Science",
  "enhanced": true
}